      * COPYMEMBER: LIBUP/UP01ACJ
      *****************************************************************
      *             ASCII COLLECTOR JOURNAL HISTORY FILE
      *  TAB DELMITED
      *
      *****************************************************************
       78  ACJ-SIZE                      VALUE 149.
       01  ACJ-REC.
           03  ACJ-BRNO                  PIC 9(4).
           03  FILLER                    PIC X.
           03  ACJ-COLLID                PIC XXX.
           03  FILLER                    PIC X.
           03  ACJ-DATE                  PIC 9(8).
           03  FILLER                    PIC X.
           03  ACJ-START-TIME            PIC 9(4).
           03  FILLER                    PIC X.
           03  ACJ-SEQNO                 PIC 99.
           03  FILLER                    PIC X.
           03  ACJ-LTOUCH-DATE           PIC 9(8).
           03  FILLER                    PIC X.
           03  ACJ-ACCTNO                PIC 9(8).
           03  FILLER                    PIC X.
           03  ACJ-END-TIME              PIC 9(4).
           03  FILLER                    PIC X.
           03  ACJ-ACTIVITY-CD           PIC X(3).
           03  FILLER                    PIC X.
           03  ACJ-RESULT-CD             PIC X(3).
           03  FILLER                    PIC X.
           03  ACJ-ACTION-CD             PIC X(4).
           03  FILLER                    PIC X.
           03  ACJ-NEW-COLLID            PIC X(3).
           03  FILLER                    PIC X.
           03  ACJ-CON-STAT              PIC X(3).
           03  FILLER                    PIC X.
           03  ACJ-REC-STAT              PIC X(3).
           03  FILLER                    PIC X.
           03  ACJ-FORM-NO               PIC 9(4).
           03  FILLER                    PIC X.
           03  ACJ-PROMISE-DATE1         PIC 9(8).
           03  FILLER                    PIC X.
           03  ACJ-PROMISE-AMT           PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ACJ-BEG-LM-SEQ            PIC 9(3).
           03  FILLER                    PIC X.
           03  ACJ-END-LM-SEQ            PIC 9(3).
           03  FILLER                    PIC X.
           03  ACJ-PROMISE-DATE2         PIC 9(8).
           03  FILLER                    PIC X.
           03  ACJ-CUR-BAL               PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ACJ-PAST-DUE              PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ACJ-POSTING-BR            PIC 9(4).
           03  FILLER                    PIC X.
           03  ACJ-QUEUE                 PIC X(3).
           03  FILLER                    PIC X.

           03  ACJ-CR                    PIC X.
           03  ACJ-LF                    PIC X.
