      ******************************************************************
      *  ASCII  LOAN BANKRUPTCY TRAILER FILE 
      *  TAB DELMITED
      ******************************************************************
       78  ALTB-SIZE                      VALUE 646.
       01  ALTB-REC.
           03  ALTB-BRNO                 PIC 9(4).
           03  FILLER                    PIC X.
           03  ALTB-ACCTNO               PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-SEQNO                PIC 999.
           03  FILLER                    PIC X.
           03  ALTB-LTOUCH-DATE          PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-FILEDATE             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-CASE-NO              PIC X(9).
           03  FILLER                    PIC X.
           03  ALTB-CHAPTER              PIC 99.
           03  FILLER                    PIC X.
           03  ALTB-MISC1                PIC X(30).
           03  FILLER                    PIC X.
           03  ALTB-MISC2                PIC X(30).
           03  FILLER                    PIC X.
           03  ALTB-MISC3                PIC X(30).
           03  FILLER                    PIC X.
           03  ALTB-BDDATE               PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-WHO-FILED            PIC X.
           03  FILLER                    PIC X.
           03  ALTB-ENDORSER-FILED       PIC X.
           03  FILLER                    PIC X.
           03  ALTB-CLAIM-AMT            PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALTB-ACTIVE-INACTIVE      PIC X.
           03  FILLER                    PIC X.
           03  ALTB-INT-LC-DUE           PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALTB-OTH-DUE              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALTB-TDUEAMT              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALTB-BANKRUPT-TABLE     OCCURS 3.
               05  ALTB-NAME             PIC X(24).
               05  FILLER                PIC X.
               05  ALTB-ADR1             PIC X(24).
               05  FILLER                PIC X.
               05  ALTB-ADR2             PIC X(24).
               05  FILLER                PIC X.
               05  ALTB-CITY             PIC X(15).
               05  FILLER                PIC X.
               05  ALTB-STATE            PIC XX.
               05  FILLER                PIC X.
               05  ALTB-ZIP              PIC X(10).
               05  FILLER                PIC X.
               05  ALTB-PHONE            PIC 9(10).
               05  FILLER                PIC X.
           03  ALTB-REAFF-DATE           PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-REAFF-SYSDATE        PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-REAFF-BALANCE        PIC 9(6).99.
           03  FILLER                    PIC X.
           03  ALTB-REAFF-PAYAMT         PIC 9(6).99.       
           03  FILLER                    PIC X.
           03  ALTB-REAFF-NO-PAYS        PIC 9(3).
           03  FILLER                    PIC X.
           03  ALTB-INTRATE              PIC 9(3).9(3).
           03  FILLER                    PIC X.
           03  ALTB-RESCIND-DATE         PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-PARTIAL-FULL         PIC X.
           03  FILLER                    PIC X.
           03  ALTB-DISCHARGE-DATE       PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-DISCHARGE-SYSDATE    PIC 9(8).
           03  FILLER                    PIC X.
           03  ALTB-GROSS-BAL            PIC +9(7).99.       
           03  FILLER                    PIC X.

           03  ALTB-CR                   PIC X.
           03  ALTB-LF                   PIC X.
