      * COPYMEMBER: LIBUP/UP01ATRX.CPY
      ******************************************************************
      *
      * DESCRIPTION:  ASCII DAILY TRANSACTION FILE [CLASS TRANSFERS]
      *
      ******************************************************************
       78  ATRX-SIZE                    VALUE 888.
       01  ATRX-REC.
           03  ATX-BRNO                PIC 9(4).
           03  FILLER                  PIC X.
           03  ATX-DATE                PIC 9(8).
           03  FILLER                  PIC X.
           03  ATX-CLASS               PIC 9(3).
           03  FILLER                  PIC X.
           03  ATX-ACCTNO              PIC 9(8).
           03  FILLER                  PIC X.
           03  ATX-LAWCODE             PIC 99.
           03  FILLER                  PIC X.
           03  ATX-LINE                PIC 9(3).
           03  FILLER                  PIC X.
           03  ATX-LTOUCH-DATE         PIC 9(8).
           03  FILLER                  PIC X.
           03  ATX-BORRTBL        OCCURS 4.
               05  ATX-SSNO            PIC 9(9).
               05  FILLER              PIC X.
               05  ATX-MAKERCD         PIC X.
               05  FILLER              PIC X.
           03  ATX-PURCD               PIC XXX.
           03  FILLER                  PIC X.
           03  ATX-SRCD                PIC XX.
           03  FILLER                  PIC X.
           03  ATX-COLLCD              PIC XX.
           03  FILLER                  PIC X.
           03  ATX-SERVACCT            PIC X.
           03  FILLER                  PIC X.
           03  ATX-LOANTYPE            PIC X.
           03  FILLER                  PIC X.
           03  ATX-SUBCLASS            PIC 99.
           03  FILLER                  PIC X.
           03  ATX-LOANDATE            PIC 9(8).
           03  FILLER                  PIC X.
           03  ATX-PROCEEDS            PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-LNAMT               PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-FINCHG              PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-INTCHG              PIC 9(7).99.
           03  FILLER                  PIC X.
           03  ATX-SERCHG              PIC 9(5).99.
           03  FILLER                  PIC X.
           03  ATX-EXTCHG              PIC 9(5).99.
           03  FILLER                  PIC X.
           03  ATX-MAINTFEE            PIC 9(5).99.
           03  FILLER                  PIC X.
           03  ATX-ORGTERM             PIC 9(3).
           03  FILLER                  PIC X.
           03  ATX-INSURED             PIC X.
           03  FILLER                  PIC X.
           03  ATX-INSANTICERN-TABLE  OCCURS 10.
               05  ATX-INSANTICERN     PIC +9(7).99.
               05  FILLER              PIC X.
           03  ATX-INSEARNINGS-TABLE  OCCURS 10.
               05  ATX-INSEARNINGS     PIC +9(7).99.
               05  FILLER              PIC X.
           03  ATX-DLNO                PIC 9(4).99.
           03  FILLER                  PIC X.
           03  ATX-DLRECOURSE          PIC X.
           03  FILLER                  PIC X.
           03  ATX-DLPARTRCAMT         PIC 9(7).99.
           03  FILLER                  PIC X.
           03  ATX-PURBAL              PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-DLRVPRIN-TABLE     OCCURS 3.
               05  ATX-DLRVPRIN        PIC +9(7).99.
               05  FILLER              PIC X.
           03  ATX-DLRVCHGS-TABLE     OCCURS 3.
               05  ATX-DLRVCHGS        PIC +9(7).99.
               05  FILLER              PIC X.
           03  ATX-DLPARVHELD          PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-DLPARVPAID          PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-DLDISC              PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-ANTICTERM           PIC 9(3).
           03  FILLER                  PIC X.
           03  ATX-ANTICERN-TABLE     OCCURS 10.
               05  ATX-ANTICERN        PIC +9(7).99.
               05  FILLER              PIC X.
           03  ATX-EARNINGS-TABLE     OCCURS 10.
               05  ATX-EARNINGS        PIC +9(7).99.
               05  FILLER              PIC X.
           03  ATX-PRLNNO              PIC 9(8).
           03  FILLER                  PIC X.
           03  ATX-PRBAL               PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-TFRBAL              PIC +9(7).99.
           03  FILLER                  PIC X.
           03  ATX-SPRCLASS            PIC 999.
           03  FILLER                  PIC X.
           03  ATX-USERID              PIC X(10).
           03  FILLER                  PIC X.
           03  ATX-POSTDATE            PIC 9(8).
           03  FILLER                  PIC X.
           03  ATX-POSTTIME            PIC 9(6).
           03  FILLER                  PIC X.
           03  ATX-CR                PIC X.
           03  ATX-LF                PIC X.

