      ******************************************************************
      *    ASCII AUTO INSURANCE TRAILER FILE 
      *  TAB DELMITED
      ******************************************************************
       78  ALTA-SIZE                      VALUE 414.
       01  ALTA-REC.
           03  ALTA-BRNO                PIC 9(4).
           03  FILLER                   PIC X.
           03  ALTA-ACCTNO              PIC 9(8).
           03  FILLER                   PIC X.
           03  ALTA-SEQNO               PIC 999.
           03  FILLER                   PIC X.
           03  ALTA-LTOUCH-DATE         PIC 9(8).
           03  FILLER                   PIC X.
           03  ALTA-DLR-REQ             PIC X.
           03  FILLER                   PIC X.
           03  ALTA-INS-TYPE            PIC X.
           03  FILLER                   PIC X.
           03  ALTA-INS-CO              PIC X(25).
           03  FILLER                   PIC X.
           03  ALTA-POLICY-NO           PIC X(25).
           03  FILLER                   PIC X.
           03  ALTA-AGENCY              PIC X(25).
           03  FILLER                   PIC X.
           03  ALTA-AGENT               PIC X(25).
           03  FILLER                   PIC X.
           03  ALTA-ADR1                PIC X(25).
           03  FILLER                   PIC X.
           03  ALTA-ADR2                PIC X(25).
           03  FILLER                   PIC X.
           03  ALTA-CITY                PIC X(15).
           03  FILLER                   PIC X.
           03  ALTA-STATE               PIC XX.
           03  FILLER                   PIC X.
           03  ALTA-ZIP                 PIC X(10).
           03  FILLER                   PIC X.
           03  ALTA-PHONE               PIC 9(10).
           03  FILLER                   PIC X.
           03  ALTA-EFF-DATE            PIC 9(8).
           03  FILLER                   PIC X.
           03  ALTA-EXP-DATE            PIC 9(8).
           03  FILLER                   PIC X.
           03  ALTA-CAN-DATE            PIC 9(8).
           03  FILLER                   PIC X.
           03  ALTA-CONF-DATE           PIC 9(8).
           03  FILLER                   PIC X.
           03  ALTA-LAST-FORM           PIC 9(4).
           03  FILLER                   PIC X.
           03  ALTA-COV-TYPE            PIC X.
           03  FILLER                   PIC X.
           03  ALTA-BIL-COV             PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ALTA-PDL-COV             PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ALTA-PIP-COV             PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ALTA-UMB-COV             PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ALTA-COL-COV             PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ALTA-LOSS-PAYEE          PIC X(25).
           03  FILLER                   PIC X.
           03  ALTA-COM-COV             PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ALTA-TRACK-ONLY          PIC X.
           03  FILLER                   PIC X.
           03  ALTA-INSURANCE           PIC X.
           03  FILLER                   PIC X.
           03  ALTA-TRACK-MONTHS        PIC X(12).
           03  FILLER                   PIC X.
           03  ALTA-INS-MONTHS          PIC X(12).
           03  FILLER                   PIC X.
           03  ALTA-CPP-MONTHS          PIC X(12).
           03  FILLER                   PIC X.
           03  ALTA-CR                  PIC X.
           03  ALTA-LF                  PIC X.
