      * COPYMEMBER: LIBLP/LP01AML
      *********************************************************************
      *            ( ASCII MAIL LIST FILE )
      *
      *  TAB DELMITED
      *********************************************************************
       78  AML-SIZE                     VALUE 198.
       01  AML-REC.
           03  AML-OWNBR                PIC 9(4).
           03  FILLER                   PIC X.
           03  AML-SSNO                 PIC 9(9).
           03  FILLER                   PIC X.
           03  AML-LNAME                PIC X(30).
           03  FILLER                   PIC X.
           03  AML-FNAME                PIC X(30).
           03  FILLER                   PIC X.
           03  AML-ADR1                 PIC X(24).
           03  FILLER                   PIC X.
           03  AML-ADR2                 PIC X(24).
           03  FILLER                   PIC X.
           03  AML-CITY                 PIC X(15).
           03  FILLER                   PIC X.
           03  AML-STATE                PIC X(2).
           03  FILLER                   PIC X.
           03  AML-ZIP                  PIC X(10).
           03  FILLER                   PIC X.
           03  AML-REFDATE              PIC 9(8).
           03  FILLER                   PIC X.
           03  AML-SRCD                 PIC X(2).
           03  FILLER                   PIC X.
           03  AML-SOLICIT              PIC X.
           03  FILLER                   PIC X.
           03  AML-CONFIDENTIAL         PIC X.
           03  FILLER                   PIC X.
           03  AML-LAST-FORM-NO         PIC 9(4).
           03  FILLER                   PIC X.
           03  AML-LAST-FORM-DATE       PIC 9(8).
           03  FILLER                   PIC X.
           03  AML-LTOUCH-DATE          PIC 9(8).
           03  FILLER                   PIC X.
           03  AML-CR                   PIC X.
           03  AML-LF                   PIC X.
