      ***********************************************************
      *  ASCII LOAN FILE
      *
      *  TAB DELMITED
      *
      ***********************************************************
       78  ALN-SIZE                     VALUE 4246.
       01  ALN-REC.
           03  ALN-OWNBR                 PIC 9(4).
           03  FILLER                    PIC X.
           03  ALN-ACCTNO                PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-CLASS                 PIC 9(3).
           03  FILLER                    PIC X.
           03  ALN-SUBCLASS              PIC 99.
           03  FILLER                    PIC X.
           03  ALN-LAWCODE               PIC 99.
           03  FILLER                    PIC X.
           03  ALN-SSNO1                 PIC 9(9).
           03  FILLER                    PIC X.
           03  ALN-MAKERCD1              PIC X.
           03  FILLER                    PIC X.
           03  ALN-SSNO2                 PIC 9(9).
           03  FILLER                    PIC X.
           03  ALN-MAKERCD2              PIC X.
           03  FILLER                    PIC X.
           03  ALN-SSNO3                 PIC 9(9).
           03  FILLER                    PIC X.
           03  ALN-MAKERCD3              PIC X.
           03  FILLER                    PIC X.
           03  ALN-SSNO4                 PIC 9(9).
           03  FILLER                    PIC X.
           03  ALN-MAKERCD4              PIC X.
           03  FILLER                    PIC X.
           03  ALN-ORGST                 PIC XX.
           03  FILLER                    PIC X.
           03  ALN-ORGBR                 PIC 9(4).
           03  FILLER                    PIC X.
           03  ALN-OWNST                 PIC XX.
           03  FILLER                    PIC X.
           03  ALN-SPRCLASS              PIC 9(3).
           03  FILLER                    PIC X.
           03  ALN-CONVERCD              PIC X.
           03  FILLER                    PIC X.
           03  ALN-MIDSTREAM             PIC X.
           03  FILLER                    PIC X.
           03  ALN-PURCD                 PIC XXX.
           03  FILLER                    PIC X.
           03  ALN-SRCD                  PIC XX.
           03  FILLER                    PIC X.
           03  ALN-COLLCD                PIC X(2).
           03  FILLER                    PIC X.
           03  ALN-COLLID                PIC X(20).
           03  FILLER                    PIC X.
           03  ALN-POCD                  PIC XX.
           03  FILLER                    PIC X.
           03  ALN-PLCD                  PIC X.
           03  FILLER                    PIC X.
           03  ALN-PLTYPE                PIC X.
           03  FILLER                    PIC X.
           03  ALN-CONFIDENTCD           PIC X.
           03  FILLER                    PIC X.
           03  ALN-ALLOTCD               PIC X.
           03  FILLER                    PIC X.
           03  ALN-RECASTCD              PIC X.
           03  FILLER                    PIC X.
           03  ALN-SKIP-TRW              PIC X.
           03  FILLER                    PIC X.
           03  ALN-STATUSFG              PIC X.
           03  FILLER                    PIC X.
           03  ALN-SMALLOAN              PIC X.
           03  FILLER                    PIC X.
           03  ALN-SALEFIN               PIC X.
           03  FILLER                    PIC X.
           03  ALN-SERVACCT              PIC X.
           03  FILLER                    PIC X.
           03  ALN-LOANTYPE              PIC X.
           03  FILLER                    PIC X.
           03  ALN-ADDON-FG              PIC X.
           03  FILLER                    PIC X.
           03  ALN-PAY-SCHLD-FG          PIC X.
           03  FILLER                    PIC X.
           03  ALN-LC-CODE               PIC 99.
           03  FILLER                    PIC X.
           03  ALN-CAN-LOAN-NO           PIC XX.
           03  FILLER                    PIC X.
           03  ALN-STATFLAGS             PIC X(20).
           03  FILLER                    PIC X.
           03  ALN-ENTDATE               PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-LOANDATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PURDATE               PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-INTDATE               PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-CASHDATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-FILEDATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-RESCISSION-DATE       PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PART-RECOURSE-DATE    PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-ORIG-1STPYDATE        PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-1STPYDATE             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-JDDATE                PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PLDATE                PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PL-TRDATE             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-ACCELDATE             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-REDUDATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-POFFDATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PO-TRDATE             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-LEGALDATE             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-BNKRPTDATE            PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-BNKRPT-DISMISS-DATE   PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-BNKRPT-DISCHARGE-DATE PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-BNKRPT-REAFFIRM-DATE  PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-DEBTAIDATE            PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-REPODATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-REDEEMDATE            PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-SOLDDATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-INS-CONFIRM-DATE      PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PRIOR-RN-FOR10-DATE   PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-LAST-RN-FOR10-DATE    PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-TRW-DOFD-DATE         PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-LAST-PYPA-DATE        PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-BT-TRDATE             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-METRO2-LAST-PMT-DATE  PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-FOLLOWUP-DATE         PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-LAST-ACCRUAL-DATE     PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-APRATE                PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-EFFRATE               PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-SMPRATE               PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-YLDRATE               PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-OVRDRATE              PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-ENDORATE              PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-JDRATE                PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-ACCRATE               PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-REDURATE              PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-CONRATE               PIC 999.999.
           03  FILLER                    PIC X.
           03  ALN-SERVPER               PIC 999.99.
           03  FILLER                    PIC X.
           03  ALN-SELLPR                PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-DOWNPY                PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TRADEIN               PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LNAMT                 PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-FINCHG                PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-INTCHG                PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-SERCHG                PIC 9(5).99.
           03  FILLER                    PIC X.
           03  ALN-EXTCHG                PIC 9(5).99.
           03  FILLER                    PIC X.
           03  ALN-MAINTFEE              PIC 9(5).99.
           03  FILLER                    PIC X.
           03  ALN-POINTS                PIC 99.99.
           03  FILLER                    PIC X.
           03  ALN-PROCEEDS              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-ORGTERM               PIC 9(3).
           03  FILLER                    PIC X.
           03  ALN-1STPYAMT              PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-NOREGPY               PIC 9(3).
           03  FILLER                    PIC X.
           03  ALN-REGPYAMT              PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LASTPYAMT             PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PROCASH               PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TILLNO                PIC 9(2).
           03  FILLER                    PIC X.
           03  ALN-STATE-FLAG            PIC X.
           03  FILLER                    PIC X.
           03  ALN-STATE-WORKER          PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-STATE-WORKER2         PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-FEETBL              OCCURS 20.
               05  ALN-FEECODE           PIC XX.
               05  FILLER                PIC X.
               05  ALN-FEEAMT            PIC 9(5).99.
               05  FILLER                PIC X.
               05  ALN-FEEOURS           PIC X.
               05  FILLER                PIC X.
               05  ALN-FEEFINCHG         PIC X.
               05  FILLER                PIC X.
           03  ALN-INSURED               PIC X.
           03  FILLER                    PIC X.
           03  ALN-INSTYPES              PIC X.
           03  FILLER                    PIC X.
           03  ALN-INSELIGIBLE           PIC X.
           03  FILLER                    PIC X.
           03  ALN-INSTBL              OCCURS 10.
               05  ALN-INSCOMP           PIC 99.
               05  FILLER                PIC X.
               05  ALN-INSOURS           PIC X.
               05  FILLER                PIC X.
               05  ALN-INSEFF-DATE       PIC 9(8).
               05  FILLER                PIC X.
               05  ALN-INSEXP-DATE       PIC 9(8).
               05  FILLER                PIC X.
               05  ALN-INSPREM           PIC 9(5).99.
               05  FILLER                PIC X.
               05  ALN-INSCOVR           PIC 9(7).99.
               05  FILLER                PIC X.
               05  ALN-INSCOMM           PIC 9(5).99.
               05  FILLER                PIC X.
               05  ALN-INSANTICERN       PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-INSANTICADJ       PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-INSUFERN          PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-INSACCERN         PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-INSEARN-ORDER     PIC 99.
               05  FILLER                PIC X.
               05  ALN-INSFINCHG         PIC X.
               05  FILLER                PIC X.

           03  ALN-PY-YYYYMM-RECDEL      PIC 9(6).
           03  FILLER                    PIC X.
           03  ALN-MTD-PAYS-RECDEL       PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-GARNISH-EXTR          PIC X.
           03  FILLER                    PIC X.
           03  ALN-SHIP-SAME-FG          PIC X.
           03  FILLER                    PIC X.
           03  ALN-AD-D-INS-COVR         PIC 9(7).
           03  FILLER                    PIC X.
           03  ALN-TOT-PARTIAL-CHGOFF    PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LPO                   PIC X(4).
           03  FILLER                    PIC X.
           03  ALN-REP-CD                PIC X(8).
           03  FILLER                    PIC X.
           03  ALN-EMP-ID                PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PROCESS-CD            PIC X.
           03  FILLER                    PIC X.
           03  ALN-WCBC-CREDITLIM        PIC +9(5).
           03  FILLER                    PIC X.
           03  ALN-FOLLOWUP-CD           PIC X(4).
           03  FILLER                    PIC X.
           03  ALN-MIP-FG                PIC X.
           03  FILLER                    PIC X.
           03  ALN-MIP-MTD-CLAHPAID      PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-MIP-CLPDTH-DATE       PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-MIP-TOT-CLPAID        PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-MIP-AHPDTH-DATE       PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-MIP-TOT-AHPAID        PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-IL-GROSS-INCOME       PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-IL-GROSS-INCOME2      PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-RESCISSION            PIC X.
           03  FILLER                    PIC X.
           03  ALN-INTERIM-TRW           PIC X.
           03  FILLER                    PIC X.
           03  ALN-DLNO                  PIC 9(4).99.
           03  FILLER                    PIC X.
           03  ALN-DLPOOL                PIC 9(5).
           03  FILLER                    PIC X.
           03  ALN-DLRECOURSE            PIC X.
           03  FILLER                    PIC X.
           03  ALN-DLPARTRCAMT           PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-ORIGPURAMT            PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PURBAL                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-DLRVPRIN-TBL        OCCURS 3.
               05  ALN-DLRVPRIN          PIC 9(7).99.
               05  FILLER                PIC X.
           03  ALN-DLRVCHGS-TBL        OCCURS 3.
               05  ALN-DLRVCHGS          PIC 9(7).99.
               05  FILLER                PIC X.
           03  ALN-DLPARVHELD            PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-DLPARVPAID            PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-DLDISC                PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LCPDTH-DATE           PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-INTPDTH-DATE          PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-CURBAL                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-INTBAL                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LCBAL                 PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-OTHBAL                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-OT2BAL                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LCPAID                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LCPARTIALS            PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-STMT-COUNTER          PIC 9(5).
           03  FILLER                    PIC X.
           03  ALN-PRIOR-STMT-COUNTER    PIC 9(5).
           03  FILLER                    PIC X.
           03  ALN-FROZEN-REASON         PIC X(2).
           03  FILLER                    PIC X.
           03  ALN-COUPON-STATEMENT      PIC X.
           03  FILLER                    PIC X.
           03  ALN-MONTHEND-BAL          PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-ANTICTERM             PIC 9(3).
           03  FILLER                    PIC X.
           03  ALN-ANTICTBL            OCCURS 10.
               05  ALN-ANTICERN          PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-ANTICADJ          PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-UFERN             PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-ACCERN            PIC +9(7).99.
               05  FILLER                PIC X.
               05  ALN-EARN-ORDER        PIC 99.
               05  FILLER                PIC X.
           03  ALN-LMO-PRIOR-INTEREST    PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRIOR-UNEARNED        PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-ERNDELQ-STOP          PIC X.
           03  FILLER                    PIC X.
           03  ALN-NONACRERN             PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRIOR-NONACRERN       PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-ERN-IB-PDTH-DATE      PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-ERN-IB-PRINBAL        PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-ERN-IB-INTOWE         PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTERN                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTOTH                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTINT                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTLCHG               PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTDEF                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTSERACCT            PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LCWAIVERS             PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-INTWAIVERS            PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-TOTPAYMNTD            PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTEXCPAYMNTD         PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTNODEF              PIC +99.
           03  FILLER                    PIC X.
           03  ALN-YTDNODEF              PIC +99.
           03  FILLER                    PIC X.
           03  ALN-TOTNODEFACT           PIC +99.
           03  FILLER                    PIC X.
           03  ALN-YTDNODEFACT           PIC +99.
           03  FILLER                    PIC X.
           03  ALN-TOTNOALDEL            PIC +99.
           03  FILLER                    PIC X.
           03  ALN-YTDNOALDEL            PIC +99.
           03  FILLER                    PIC X.
           03  ALN-YTDINTPD              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LYRINTPD              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-TOTINTPD              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-RECASTINT             PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-RECASTPRIN            PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-CL-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-AH-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-PP-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-INT-REBATE            PIC X.
           03  FILLER                    PIC X.
           03  ALN-SC-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-MF-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-DF-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-EX-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O1-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O2-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O3-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O4-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O5-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O6-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O7-REBATE             PIC X.
           03  FILLER                    PIC X.
           03  ALN-UN-O7-REB             PIC X.
           03  FILLER                    PIC X.
           03  ALN-UN-O8-REB             PIC X.
           03  FILLER                    PIC X.
           03  ALN-UN-O9-REB             PIC X.
           03  FILLER                    PIC X.
           03  ALN-UN-O10-REB            PIC X.
           03  FILLER                    PIC X.
           03  ALN-PLREASON              PIC XX.
           03  FILLER                    PIC X.
           03  ALN-COLLECTOR             PIC X(3).
           03  FILLER                    PIC X.
           03  ALN-ACTIONCD              PIC X(4).
           03  FILLER                    PIC X.
           03  ALN-ACTIONCD2             PIC X(4).
           03  FILLER                    PIC X.
           03  ALN-ATCODE                PIC X(3).
           03  FILLER                    PIC X.
           03  ALN-RECODE                PIC X(3).
           03  FILLER                    PIC X.
           03  ALN-ESCROW-FG             PIC X.
           03  FILLER                    PIC X.
           03  ALN-PROMDAYS-PASTDUE      PIC +9(3).
           03  FILLER                    PIC X.
           03  ALN-PROMID                PIC X(3).
           03  FILLER                    PIC X.
           03  ALN-PROMDATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PROMAMT               PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PROMDATE2             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-DATE-PAID-LAST        PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-AMT-PAID-LAST         PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-LASTCFORMNO           PIC 9(5).
           03  FILLER                    PIC X.
           03  ALN-LASTCFORMDATE         PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-DELCNT                PIC 99.
           03  FILLER                    PIC X.
           03  ALN-DELCNT2               PIC 99.
           03  FILLER                    PIC X.
           03  ALN-CREDITLIM             PIC 9(7).
           03  FILLER                    PIC X.
           03  ALN-CRSCORE               PIC +9(3).
           03  FILLER                    PIC X.
           03  ALN-LASTSFORMNO           PIC 9(5).
           03  FILLER                    PIC X.
           03  ALN-LASTSFORMDATE         PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-SOLCNT                PIC 99.
           03  FILLER                    PIC X.
           03  ALN-MESSAGE               PIC X(30).
           03  FILLER                    PIC X.
           03  ALN-OLDACCTNO             PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PRLNNO                PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PRBAL                 PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRINTDUE              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRFINCHGRB            PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRINSRB               PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRPOCD                PIC XX.
           03  FILLER                    PIC X.
           03  ALN-PRPODATE              PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-PRDELINQAMT           PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRLNAMT               PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRPDUE-DAYS           PIC +9(5).
           03  FILLER                    PIC X.
           03  ALN-PRDLDISC-UNEARN       PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-PRCONPROFILE          PIC 9(12).
           03  FILLER                    PIC X.
           03  ALN-SUM-ORIGPURAMT        PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-SUM-LNAMT             PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-SUM-FINCHG            PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-SUM-INTCHG            PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-SUM-ORGTERM           PIC 9(3).
           03  FILLER                    PIC X.
           03  ALN-SUM-REGPYAMT          PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-SUM-EXTCHG            PIC 9(5).99.
           03  FILLER                    PIC X.
           03  ALN-SUM-SERCHG            PIC 9(5).99.
           03  FILLER                    PIC X.
           03  ALN-SUM-MAINTFEE          PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-UNITPER-CD            PIC X.
           03  FILLER                    PIC X.
           03  ALN-UNITPER-FREQ          PIC 999.
           03  FILLER                    PIC X.
           03  ALN-DAYS-IN-UNITPER       PIC 999.
           03  FILLER                    PIC X.
           03  ALN-UNITPER-PER-YEAR      PIC 9(3).9(12).
           03  FILLER                    PIC X.
           03  ALN-REPOCD                PIC X.
           03  FILLER                    PIC X.
           03  ALN-BR-TFR-FG             PIC X.
           03  FILLER                    PIC X.
           03  ALN-O3INS-DLPROC          PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-INSPREM-DLADJ         PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-PLAMT                 PIC 9(7).99.
           03  FILLER                    PIC X.
           03  ALN-MTD-PRIN              PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-MTD-LC                PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-MTD-INT               PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-MTD-OT                PIC +9(5).99.
           03  FILLER                    PIC X.
           03  ALN-MTD-EX                PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-BNKRPT-CHAPTER        PIC 9(2).
           03  FILLER                    PIC X.
           03  ALN-BMO-CON-STATUS        PIC X.
           03  FILLER                    PIC X.
           03  ALN-BMO-REC-STATUS        PIC X.
           03  FILLER                    PIC X.
           03  ALN-APP-NUMBER            PIC 9(09).
           03  FILLER                    PIC X.
           03  ALN-GIFTNET               PIC X.
           03  FILLER                    PIC X.
           03  ALN-GIFTNET-OUR-PO        PIC 9(7).
           03  FILLER                    PIC X.
           03  ALN-PROC-DISBURSED        PIC X.
           03  FILLER                    PIC X.
           03  ALN-NOODDPY               PIC X.
           03  FILLER                    PIC X.
           03  ALN-CONPROFILE-TAB      OCCURS 5.
               05  ALN-CONPROFILE        PIC 9(12).
               05  FILLER                PIC X.
           03  ALN-RECPROFILE-TAB      OCCURS 5.
               05  ALN-RECPROFILE        PIC 9(12).
               05  FILLER                PIC X.
           03  ALN-TRW-STATUS            PIC XX.
           03  FILLER                    PIC X.
           03  ALN-ORIGIN                PIC X(4).
           03  FILLER                    PIC X.
           03  ALN-PO-TRCD               PIC XX.
           03  FILLER                    PIC X.
           03  ALN-NEXIS-CRSCORE         PIC 9(3).
           03  FILLER                    PIC X.
           03  ALN-TRW-B-CONSUMER-IND    PIC X(2).
           03  FILLER                    PIC X.
           03  ALN-PARVHELD-PAID-FG      PIC X.
           03  FILLER                    PIC X.
           03  ALN-ACCT-FROZEN           PIC X.
           03  FILLER                    PIC X.
           03  ALN-TRW-SPECIAL-CODE      PIC X(2).
           03  FILLER                    PIC X.
           03  ALN-CREATION-STATUS       PIC X(1).
           03  FILLER                    PIC X.
           03  ALN-TOTNOLCHG             PIC +9(3).
           03  FILLER                    PIC X.
           03  ALN-LBOX                  PIC X(1).
           03  FILLER                    PIC X.
           03  ALN-EXTRA-PRIN-LFP        PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-REMAIN-INT-SINCE-LFP  PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-REMAIN-PRIN-SINCE-LFP PIC +9(7).99.
           03  FILLER                    PIC X.
           03  ALN-INTERIM-COUPON        PIC X.
           03  FILLER                    PIC X.
           03  ALN-DLCOMM-O3-CMSI        PIC 9(5).99.
           03  FILLER                    PIC X.
           03  ALN-DLCOMM-PP-CMSI        PIC 9(5).99.
           03  FILLER                    PIC X.
           03  ALN-TRW-J-CONSUMER-IND    PIC X(2).
           03  FILLER                    PIC X.
           03  ALN-ACH                   PIC X.
           03  FILLER                    PIC X.
           03  ALN-1099-C-FG             PIC X.
           03  FILLER                    PIC X.
           03  ALN-TRW-COMPLIANCE-CODE   PIC XX.
           03  FILLER                    PIC X.
           03  ALN-UNWIND-REASON-CODE    PIC X(2).
           03  FILLER                    PIC X.
           03  ALN-PBI-PBD-FG            PIC X.
           03  FILLER                    PIC X.
           03  ALN-OLD-ACCT-FORMAT-FG    PIC X.
           03  FILLER                    PIC X.
           03  ALN-APPROVED-BY-USER      PIC X(10).
           03  FILLER                    PIC X.
           03  ALN-APPROVED-BY-CODE      PIC X(3).
           03  FILLER                    PIC X.
           03  ALN-APPROVED-BY-DATE      PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-APPROVED-BY-TIME      PIC 9(6).
           03  FILLER                    PIC X.
           03  ALN-LTOUCH-DATE           PIC 9(8).
           03  FILLER                    PIC X.
           03  ALN-LTOUCH-TIME           PIC 9(6).
           03  FILLER                    PIC X.
           03  ALN-LOS-APP-ID            PIC 9(18).
           03  FILLER                    PIC X.
           03  ALN-CR                    PIC X.
           03  ALN-LF                    PIC X.
