      ***********************************************************
      *        BORROWER MASTER ASCII
      *
      * ASCII FILE EXTRACTION UPGRADE 15 TO 34 FOR SQL LOAD
      *
      *      TAB DELIMITED
      *
      * 2024.1204 BAH ADDED ABW-CEASE-DESIST-DATE AND ABW-CEASE-DESIST-TYPE
      *                  #1686 S35Q-145
      * 2024.1206 BAH ADDED ABW-UMC-EXPIRE-DATE AND ABW-UMC-PR-EXPIRE-DATE
      *                  #1687 S35Q-146
      ***********************************************************
       78  ABW-SIZE                     VALUE 1897.
       01  ABW-REC.
           03  ABW-OWNBR                PIC 9(4).
           03  FILLER                   PIC X.
           03  ABW-SSNO                 PIC 9(9).
           03  FILLER                   PIC X.
           03  ABW-LNAME                PIC X(35).
           03  FILLER                   PIC X.
           03  ABW-FNAME                PIC X(35).
           03  FILLER                   PIC X.
           03  ABW-MNAME                PIC X(35).
           03  FILLER                   PIC X.
           03  ABW-NICKNAME             PIC X(35).
           03  FILLER                   PIC X.
           03  ABW-GENERATION           PIC X(7).
           03  FILLER                   PIC X.
           03  ABW-ADR1                 PIC X(30).
           03  FILLER                   PIC X.
           03  ABW-ADR2                 PIC X(30).
           03  FILLER                   PIC X.
           03  ABW-CITY                 PIC X(30).
           03  FILLER                   PIC X.
           03  ABW-STATE                PIC XX.
           03  FILLER                   PIC X.
           03  ABW-ZIP                  PIC X(10).
           03  FILLER                   PIC X.
           03  ABW-LTOUCH-DATE          PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-REFDATE              PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-BDATE                PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-PHONE                PIC 9(10).
           03  FILLER                   PIC X.
           03  ABW-CELL-PHONE           PIC 9(10).
           03  FILLER                   PIC X.
           03  ABW-NATIONALITY          PIC X(8).
           03  FILLER                   PIC X.
           03  ABW-GENDER               PIC X.
           03  FILLER                   PIC X.
           03  ABW-DEPEND               PIC 99.
           03  FILLER                   PIC X.
           03  ABW-RENTCD               PIC X(4).
           03  FILLER                   PIC X.
           03  ABW-TIMEADDR             PIC X(4).
           03  FILLER                   PIC X.
           03  ABW-CREDITCD             PIC X(4).
           03  FILLER                   PIC X.
           03  ABW-STRTGCD              PIC X(6).
           03  FILLER                   PIC X.
           03  ABW-DWELLCD              PIC XX.
           03  FILLER                   PIC X.
           03  ABW-COUNTY               PIC X(4).
           03  FILLER                   PIC X.
           03  ABW-ORIGIN               PIC X(4).
           03  FILLER                   PIC X.
           03  ABW-CENSUSCD             PIC X(10).
           03  FILLER                   PIC X.
           03  ABW-ORGSLSMN             PIC 9(4).
           03  FILLER                   PIC X.
           03  ABW-REPCODE              PIC X(4).
           03  FILLER                   PIC X.
           03  ABW-SPSSNO               PIC 9(9).
           03  FILLER                   PIC X.
           03  ABW-SPLNAME              PIC X(35).
           03  FILLER                   PIC X.
           03  ABW-SPFNAME              PIC X(35).
           03  FILLER                   PIC X.
           03  ABW-SP-BDATE             PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-EMPLOYER             PIC X(35).
           03  FILLER                   PIC X.
           03  ABW-EMPLPOS              PIC X(24).
           03  FILLER                   PIC X.
           03  ABW-EMPPHONE             PIC 9(10).
           03  FILLER                   PIC X.
           03  ABW-EMPEXT               PIC 9(4).
           03  FILLER                   PIC X.
           03  ABW-EMPYEARS             PIC 99.
           03  FILLER                   PIC X.
           03  ABW-EMPPAY               PIC 9(7).99.
           03  FILLER                   PIC X.
           03  ABW-EMPPAYOT             PIC 9(7).99.
           03  FILLER                   PIC X.
           03  ABW-EMPPAYSR             PIC X(8).
           03  FILLER                   PIC X.
           03  ABW-EMPADDR1             PIC X(30).
           03  FILLER                   PIC X.
           03  ABW-EMPADDR2             PIC X(30).
           03  FILLER                   PIC X.
           03  ABW-EMPCITY              PIC X(30).
           03  FILLER                   PIC X.
           03  ABW-EMPSTATE             PIC XX.
           03  FILLER                   PIC X.
           03  ABW-EMPZIP               PIC X(10).
           03  FILLER                   PIC X.
           03  ABW-WORKHRS              PIC X(9).
           03  FILLER                   PIC X.
           03  ABW-LOANS                PIC 99.
           03  FILLER                   PIC X.
           03  ABW-INTYTD               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ABW-INTLYR               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ABW-LIASMLN              PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ABW-LIAOTH               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ABW-LASTPODATE           PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-PRLOANS              PIC 9(3).
           03  FILLER                   PIC X.
           03  ABW-RE-INTYTD            PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ABW-RE-INTLYR            PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ABW-CREDIT-LIMIT         PIC 9(7).99.
           03  FILLER                   PIC X.
           03  ABW-CREDIT-SCORE         PIC 9(4).
           03  FILLER                   PIC X.

           03  ABW-CRED-SCORE-TABLE OCCURS 4.
               05  ABW-CRED-SCORE   PIC 9(4).
               05  FILLER           PIC X.
           03  ABW-BNKRPT-SCORE-TABLE OCCURS 4.
               05  ABW-BNKRPT-SCORE PIC 9(4).
               05  FILLER           PIC X.

           03  ABW-LAST-FORM-NO         PIC 9(4).
           03  FILLER                   PIC X.
           03  ABW-LAST-FORM-DATE       PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-PRIOR-RN-FOR10-DATE  PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-LAST-RN-FOR10-DATE   PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-ADR-PHONE-CHG-DATE   PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-BAD-ADR-FG           PIC X(1).
           03  FILLER                   PIC X.
           03  ABW-BAD-PHONE-FG         PIC X(1).
           03  FILLER                   PIC X.
           03  ABW-BAD-EMPPHONE-FG      PIC X(1).
           03  FILLER                   PIC X.
           03  ABW-BAD-MISC-PHONE1-FG   PIC X(1).
           03  FILLER                   PIC X.
           03  ABW-BAD-MISC-PHONE2-FG   PIC X(1).
           03  FILLER                   PIC X.
           03  ABW-BAD-CELL-FG          PIC X(1).
           03  FILLER                   PIC X.

           03  ABW-MISC-PHONES          OCCURS 6.
               05  ABW-MISC-PHONE     PIC 9(10).
               05  FILLER             PIC X.
               05  ABW-MISC-EXT       PIC 9(4).
               05  FILLER             PIC X.
               05  ABW-MISC-PHONE-CD  PIC XX.
               05  FILLER             PIC X.

           03  ABW-CONTACT-INFO-TABLE OCCURS 10.
               05  ABW-CONTACT-DESC      PIC X(46).
               05  FILLER                PIC X.
               05  ABW-CONTACT-PHONE     PIC 9(10).
               05  FILLER                PIC X.
               05  ABW-CONTACT-EXT       PIC 9(4).
               05  FILLER                PIC X.
               05  ABW-CONTACT-RELATION  PIC X(12).
               05  FILLER                PIC X.

           03  ABW-SRCD                 PIC XX.
           03  FILLER                   PIC X.
           03  ABW-CALL-ON-SUNDAY       PIC X.
           03  FILLER                   PIC X.
           03  ABW-SOLICIT              PIC X.
           03  FILLER                   PIC X.
           03  ABW-CONFIDENTIAL         PIC X.
           03  FILLER                   PIC X.
           03  ABW-PRIVACY-OPT-OUT      PIC X.
           03  FILLER                   PIC X.
           03  ABW-OPT-IN-EMAIL         PIC X.
           03  FILLER                   PIC X.
           03  ABW-OPT-IN-TEXT          PIC X.
           03  FILLER                   PIC X.
           03  ABW-CITY-TAX-CD          PIC X(3).
           03  FILLER                   PIC X.
           03  ABW-DEALTRACK-CHG-DATE   PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-DECEASED             PIC X.
           03  FILLER                   PIC X.
           03  ABW-DECEASED-DATE        PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-EMAIL                PIC X(40).
           03  FILLER                   PIC X.
           03  ABW-IDENT-NO             PIC X(18).
           03  FILLER                   PIC X.
           03  ABW-IDENT-TYPE           PIC XX.
           03  FILLER                   PIC X.
           03  ABW-IDENT-STATE          PIC XX.
           03  FILLER                   PIC X.
           03  ABW-MILITARY-FLAG        PIC X.
           03  FILLER                   PIC X.
           03  ABW-ORGBR                PIC 9(4).
           03  FILLER                   PIC X.
           03  ABW-CEASE-DESIST-DATE    PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-CEASE-DESIST-TYPE    PIC X.
           03  FILLER                   PIC X.
           03  ABW-UMC-EXPIRE-DATE      PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-UMC-PR-EXPIRE-DATE   PIC 9(8).
           03  FILLER                   PIC X.
           03  ABW-CR                 PIC X.
           03  ABW-LF                 PIC X.
