      * COPYMEMBER: LIBUP/UP01ABX
      **************************************************************************
      *            ( ASCII BORROWER TRAILER FILE )
      *
      *  TAB DELMITED
      *
      **************************************************************************
       78  ABX-SIZE                     VALUE  379.
       01  ABX-REC.
           03  ABX-BRNO             PIC 9(4). 
           03  FILLER               PIC X.
           03  ABX-SSNO             PIC 9(9).
           03  FILLER               PIC X.
           03  ABX-LTOUCH-DATE      PIC 9(8).
           03  FILLER               PIC X.
           03  ABX-ALT-ADR1         PIC X(30).
           03  FILLER               PIC X.
           03  ABX-ALT-ADR2         PIC X(30).
           03  FILLER               PIC X.
           03  ABX-ALT-CITY         PIC X(30).
           03  FILLER               PIC X.
           03  ABX-ALT-STATE        PIC X(2).
           03  FILLER               PIC X.
           03  ABX-ALT-ZIP          PIC X(10).
           03  FILLER               PIC X.
           03  ABX-PREV-ADR1        PIC X(30).
           03  FILLER               PIC X.
           03  ABX-PREV-ADR2        PIC X(30).
           03  FILLER               PIC X.
           03  ABX-PREV-CITY        PIC X(30).
           03  FILLER               PIC X.
           03  ABX-PREV-STATE       PIC X(2).
           03  FILLER               PIC X.
           03  ABX-PREV-ZIP         PIC X(10).
           03  FILLER               PIC X.
           03  ABX-KYC-ADR1         PIC X(24).
           03  FILLER               PIC X.
           03  ABX-KYC-ADR2         PIC X(24).
           03  FILLER               PIC X.
           03  ABX-KYC-CITY         PIC X(15).
           03  FILLER               PIC X.
           03  ABX-KYC-STATE        PIC X(2).
           03  FILLER               PIC X.
           03  ABX-KYC-ZIP          PIC X(10).
           03  FILLER               PIC X.
           03  ABX-KYC-IDTYPE       PIC X(2).
           03  FILLER               PIC X.
           03  ABX-KYC-ISSAUTH      PIC X(2).
           03  FILLER               PIC X.
           03  ABX-KYC-NUMBER       PIC X(25).
           03  FILLER               PIC X.
           03  ABX-KYC-ISSDATE      PIC 9(8).
           03  FILLER               PIC X.
           03  ABX-KYC-EXPDATE      PIC 9(8).
           03  FILLER               PIC X.
           03  ABX-KYC-LAST-VERDATE PIC 9(8).
           03  FILLER               PIC X.
           03  ABX-CR                 PIC X.     
           03  ABX-LF                 PIC X.     
