      * COPYMEMBER: LIBUP/UPFDATRP.CPY
      ******************************************************************
      *
      * DESCRIPTION:  ASCII TRANSACTION FILE [PAYMENTS] "P"
      *
      * 20220524 BAH ADDED ATP-ACTIONCD2
      * 20240305 BAH ADDED ATP-REPAY-TRANS-ID #1641
      ******************************************************************
       78  ATRP-SIZE                    VALUE 1331.
       01  ATRP-REC.
           03  ATP-BRNO                 PIC 9(4).
           03  FILLER                   PIC X.
           03  ATP-DATE                 PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-CLASS                PIC 999.
           03  FILLER                   PIC X.
           03  ATP-ACCTNO               PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-LINE                 PIC 999.   
           03  FILLER                   PIC X.
           03  ATP-LTOUCH-DATE          PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-LAWCODE              PIC 99.
           03  FILLER                   PIC X.
           03  ATP-JDCD                 PIC X.
           03  FILLER                   PIC X.
           03  ATP-PLCD                 PIC X.
           03  FILLER                   PIC X.
           03  ATP-SSNO                 PIC 9(10).
           03  FILLER                   PIC X.
           03  ATP-MAKER                PIC X.
           03  FILLER                   PIC X.
           03  ATP-IBPC                 PIC X.
           03  FILLER                   PIC X.
           03  ATP-TRCD                 PIC XX.
           03  FILLER                   PIC X.
           03  ATP-REFNO                PIC X(5).
           03  FILLER                   PIC X.
           03  ATP-PAYDATE              PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-DUEDATE              PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-TRAMT                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-INTDUE               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-APOTH                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-APOT2                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-APINT                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-APLC                 PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-APCUR                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-GLTABLE            OCCURS 3.
               05  ATP-GLNO             PIC 9(11).
               05  FILLER               PIC X.
               05  ATP-GLAMT            PIC +9(7).99.
               05  FILLER               PIC X.
           03  ATP-EARNINGS-TABLE     OCCURS 10.
               05  ATP-EARNINGS         PIC +9(7).99.
               05  FILLER               PIC X.
           03  ATP-WORKAMT-TABLE      OCCURS 10.
               05  ATP-WORKAMT          PIC +9(7).99.
               05  FILLER               PIC X.
           03  ATP-OTHBAL               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-OT2BAL               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-INTBAL               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-LCBAL                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-CURBAL               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-PDTH-DATE            PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-DLNO                 PIC 9(4).99.
           03  FILLER                   PIC X.
           03  ATP-DLPROC               PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-SERVACCT             PIC X.
           03  FILLER                   PIC X.
           03  ATP-SALEFIN              PIC X.
           03  FILLER                   PIC X.
           03  ATP-INSURED              PIC X.
           03  FILLER                   PIC X.
           03  ATP-INSOURS              PIC X.
           03  FILLER                   PIC X.
           03  ATP-LOANTYPE             PIC X.
           03  FILLER                   PIC X.
           03  ATP-TILLNO               PIC 9(2).
           03  FILLER                   PIC X.
           03  ATP-LCPDTH-DATE          PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-POSTING-BR           PIC 9(4).
           03  FILLER                   PIC X.
           03  ATP-OTHBR-FG             PIC X.
           03  FILLER                   PIC X.
           03  ATP-REV                  PIC X.
           03  FILLER                   PIC X.
           03  ATP-REVTRCD              PIC XX.
           03  FILLER                   PIC X.
           03  ATP-REVSEQNO             PIC 9(5).
           03  FILLER                   PIC X.
           03  ATP-STATUSFG             PIC X.
           03  FILLER                   PIC X.
           03  ATP-KEEPAPINT            PIC X.
           03  FILLER                   PIC X.
           03  ATP-INTPAID              PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-PRIOR-POOLID         PIC 9(5).
           03  FILLER                   PIC X.
           03  ATP-INSTYPES             PIC X.
           03  FILLER                   PIC X.
           03  ATP-INSEARN-TABLE      OCCURS 10.
               05  ATP-INSEARN          PIC +9(7).99.
               05  FILLER               PIC X.
           03  ATP-INSWORKAMT-TAB     OCCURS 10.
               05  ATP-INSWORKAMT       PIC +9(7).99.
               05  FILLER               PIC X.
           03  ATP-DLRVCHGS-ADJ-TAB   OCCURS 3.
               05  ATP-DLRVCHGS-ADJ     PIC +9(7).99.
               05  FILLER               PIC X.
           03  ATP-DLPARVHELD-ADJ       PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-DLPARVPAID-ADJ       PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-NEWSTAT-RATE         PIC 999.999.
           03  FILLER                   PIC X.
           03  ATP-POCD                 PIC XX.
           03  FILLER                   PIC X.
           03  ATP-PODATE               PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-DL-RVCHGS-CODE-TAB OCCURS 3.
               05  ATP-DL-RVCHGS-CODE   PIC X.
               05  FILLER               PIC X.
           03  ATP-DL-PARVHELD-CODE     PIC X.
           03  FILLER                   PIC X.
           03  ATP-DL-PARVPAID-CODE     PIC X.
           03  FILLER                   PIC X.
           03  ATP-TOTNODEF             PIC +999.
           03  FILLER                   PIC X.
           03  ATP-LNAMT                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-ORIG-1STPYDATE       PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-OLD1ST-PYDATE        PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-1STPYDATE            PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-ORGTERM              PIC 9(3).
           03  FILLER                   PIC X.
           03  ATP-INSCOMM              PIC +9(5).99.
           03  FILLER                   PIC X.
           03  ATP-MANUAL-RB            PIC X.
           03  FILLER                   PIC X.
           03  ATP-USERID               PIC X(10).
           03  FILLER                   PIC X.
           03  ATP-POSTTIME             PIC 9(6).
           03  FILLER                   PIC X.
           03  ATP-PLTYPE               PIC X.
           03  FILLER                   PIC X.
           03  ATP-PL-OTH-AR            PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-LP-DLNO              PIC 9(4).99.
           03  FILLER                   PIC X.
           03  ATP-REPOCD               PIC X.
           03  FILLER                   PIC X.
           03  ATP-SPRCLASS             PIC 999.
           03  FILLER                   PIC X.
           03  ATP-MAX-DEFER-FG         PIC X.
           03  FILLER                   PIC X.
           03  ATP-POSTDATE             PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-UNITPER-CD           PIC X.
           03  FILLER                   PIC X.
           03  ATP-UNITPER-FREQ         PIC 9(3).
           03  FILLER                   PIC X.
           03  ATP-SP-DEFFRMLA          PIC 99.                
           03  FILLER                   PIC X.
           03  ATP-COLLECTOR            PIC X(3).
           03  FILLER                   PIC X.
           03  ATP-PENALTY-INT          PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-INSCOMP              PIC 99.
           03  FILLER                   PIC X.
           03  ATP-PROMDATE             PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-PROMAMT              PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-PROMID               PIC X(3).
           03  FILLER                   PIC X.
           03  ATP-INS-TAX-RB           PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-PROMDAYS-PASTDUE     PIC +9(3).
           03  FILLER                   PIC X.
           03  ATP-MIP-FG               PIC X.
           03  FILLER                   PIC X.
           03  ATP-MIP-CLPAID           PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-MIP-CLCOMM           PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-MIP-AHPAID           PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-MIP-AHCOMM           PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-MIP-CLPDTH-DATE      PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-MIP-AHPDTH-DATE      PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-INS-TAX-COUNTY-CD    PIC X(3).
           03  FILLER                   PIC X.
           03  ATP-INS-TAX-CITY-CD      PIC X(3).
           03  FILLER                   PIC X.
           03  ATP-APPLIED-TO-ESCROW    PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-ESCROW-AMT           PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-ESCROW-PREPAID       PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-ESCROW-DISBURSED     PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-LP-SEQNO             PIC 9(5).
           03  FILLER                   PIC X.
           03  ATP-PRIOR-DF-CODE        PIC X(2).
           03  FILLER                   PIC X.
           03  ATP-PRIOR-DF-POSTDATE    PIC 9(8).
           03  FILLER                   PIC X.
           03  ATP-CANCEL-REASON        PIC X(3).
           03  FILLER                   PIC X.
           03  ATP-FROMCL               PIC 9(3).
           03  FILLER                   PIC X.
           03  ATP-TOCL                 PIC 9(3).
           03  FILLER                   PIC X.
           03  ATP-ADDON-TXT            PIC X(3).
           03  FILLER                   PIC X.
           03  ATP-ADDON-TYP            PIC X(2).
           03  FILLER                   PIC X.
           03  ATP-DLRVNUM              PIC 9.
           03  FILLER                   PIC X.
           03  ATP-P4P5-TRANCD          PIC XX.
           03  FILLER                   PIC X.
           03  ATP-P4P5-DLRVNUM         PIC 9.
           03  FILLER                   PIC X.
           03  ATP-POOLID               PIC 9(5).
           03  FILLER                   PIC X.
           03  ATP-ACTIONCD2            PIC X(4).
           03  FILLER                   PIC X.
           03  ATP-LCDUE                PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-REPAY-TRANS-ID       PIC 9(10).
           03  FILLER                   PIC X.
           03  ATP-CLOSFEE-REB-AMT      PIC +9(7).99.
           03  FILLER                   PIC X.
           03  ATP-CR                PIC X.
           03  ATP-LF                PIC X.
