      * COPYMEMBER: LIBUP/LP01BYB
      ******************************************************************
      *
      * DESCRIPTION: BRANCH STATISTICS FILE - B (SECONDARY)
      *
      * FILE PATH  : /USR/DATA/R#/LP/BYBFILE
      *
      ******************************************************************
       78  ABYB-SIZE                    VALUE 6664.
       01  ABYB-REC.
           03  ABYB-DATE-CCYYMM     PIC 9(6).
           03  FILLER               PIC X.
           03  ABYB-BRNO            PIC 9(4).
           03  FILLER               PIC X.
           03  ABYB-CLASS           PIC 9(3).
           03  FILLER               PIC X.

           03  ABYB-MTD-YTD               OCCURS 2.
               05  ABYB-PL-RECOVERED      OCCURS 5.
                   07  ABYB-PL-PRINCOL      PIC +9(9).99.
                   07  FILLER               PIC X.
                   07  ABYB-PL-INTCOL       PIC +9(9).99.
                   07  FILLER               PIC X.
                   07  ABYB-PL-LATECOL      PIC +9(9).99.
                   07  FILLER               PIC X.
                   07  ABYB-PL-O2COL        PIC +9(9).99.
                   07  FILLER               PIC X.

               05  ABYB-AMT-SOLD            PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-AMT-TRANS           PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-AMT-PURCH           PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-NO-SOLD             PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-NO-TRANS            PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-NO-PURCH            PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-OTHCOL              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-OT2COL              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-INTCOL              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-LATECOL             PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-PRINCOL             PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-DEFCOL              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-RNPRIN              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-INTREB              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-CLREB1              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-CLREB2              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-CLREB3              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-CLREB4              PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-AHREB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-PPREB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-O1REB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-O2REB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-O3REB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-O4REB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-O5REB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-O6REB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-O7REB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-SCREB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-MFREB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-DFREB               PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-UN7-REB             PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-UN8-REB             PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-UN9-REB             PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-UN10-REB            PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-PART-CHGOFF         PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-ALLOTMENTS          PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-INS-TYPE            OCCURS 10.
                   07  ABYB-INS-NO-ELIG     PIC +9(7).
                   07  FILLER               PIC X.
                   07  ABYB-INS-NO-WROTE    PIC +9(7).
                   07  FILLER               PIC X.
                   07  ABYB-INS-NO-NOTWROTE PIC +9(7).
                   07  FILLER               PIC X.
                   07  ABYB-INS-AMT-WROTE   PIC +9(9).99.
                   07  FILLER               PIC X.
               05  ABYB-FEE-TYPE            OCCURS 3.
                   07  ABYB-FEE-NO-ELIG     PIC +9(7).
                   07  FILLER               PIC X.
                   07  ABYB-FEE-NO-WROTE    PIC +9(7).
                   07  FILLER               PIC X.
                   07  ABYB-FEE-NO-NOTWROTE PIC +9(7).
                   07  FILLER               PIC X.
                   07  ABYB-FEE-AMT-WROTE   PIC +9(9).99.
                   07  FILLER               PIC X.
               05  ABYB-OTH-NO-COL          PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-OT2-NO-COL          PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-INT-NO-COL          PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-LATE-NO-COL         PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-OTH-NO-WAIVED       PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-OT2-NO-WAIVED       PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-INT-NO-WAIVED       PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-LATE-NO-WAIVED      PIC +9(7).
               05  FILLER                   PIC X.
               05  ABYB-OTH-AMT-WAIVED      PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-OT2-AMT-WAIVED      PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-INT-AMT-WAIVED      PIC +9(9).99.
               05  FILLER                   PIC X.
               05  ABYB-LATE-AMT-WAIVED     PIC +9(9).99.
               05  FILLER                   PIC X.
           03  ABYB-NOW-BMO-LME          OCCURS 3.
               05  ABYB-REC-CON          OCCURS 2.
                   07  ABYB-DEL-BUCKET   OCCURS 10.
                       09  ABYB-UNITS    PIC +9(7).
                       09  FILLER        PIC X.
                       09  ABYB-OUTBAL   PIC +9(9).99.
                       09  FILLER        PIC X.
           03  ABYB-NOW-BMO-LME-BNKRPT          OCCURS 3.
               05  ABYB-REC-CON-BNKRPT          OCCURS 2.
                   07  ABYB-DEL-BUCKET-BNKRPT   OCCURS 10.
                       09  ABYB-UNITS-BNKRPT    PIC +9(7).
                       09  FILLER               PIC X.
                       09  ABYB-OUTBAL-BNKRPT   PIC +9(9).99.
                       09  FILLER               PIC X.

           03  ABYB-SUMWGTTM                PIC +9(8).
           03  FILLER                       PIC X.
           03  ABYB-SUMWGTAV                PIC +9(9).99.
           03  FILLER                       PIC X.
           03  ABYB-SUMWGTTA                PIC +9(11).99.
           03  FILLER                       PIC X.
           03  ABYB-IB-ACCRUED              PIC +9(7).99.
           03  FILLER                       PIC X.

           03  ABYB-DLDISC-VOL-TBL              OCCURS 3.
               05 ABYB-DLDISC                   PIC +9(9).99.
               05  FILLER                       PIC X.

           03  ABYB-STD-POS                 PIC +9(7).
           03  FILLER                       PIC X.
           03  ABYB-30-DAY-MOVED            PIC +9(7).
           03  FILLER                       PIC X.
           03  ABYB-PROJ-INCREASE           PIC +9(7).
           03  FILLER                       PIC X.
           03  ABYB-PROJ-PROFIT             PIC +9(7).
           03  FILLER                       PIC X.

           03  ABYB-PROCEEDS-TBL      OCCURS 2.
               05  ABYB-PROCEEDS        PIC +9(9).99.
               05  FILLER               PIC X.
           03  ABYB-LOCKBOX-TBL       OCCURS 2.
               05  ABYB-LOCKBOX         PIC +9(9).99.
               05  FILLER               PIC X.

           03  ABYB-UNEARNED-PERIOD             OCCURS 3.
               05  ABYB-UNEARNED-ACTIVITY       OCCURS 2.
                   07  ABYB-UNEARNED-TYPE       OCCURS 10.
                       09  ABYB-UNEARNED-AMT    PIC +9(9).99.
                       09  FILLER               PIC X.

           03  ABYB-CR                   PIC X.
           03  ABYB-LF                   PIC X.
