      ******************************************************************
      *  ASCII  COLLATERAL TRAILER FILE 
      *  TAB DELMITED
      *
      ******************************************************************
       78  ALTC-SIZE                      VALUE 779.
       01  ALTC-REC.
           03  ALTC-BRNO                   PIC 9(4).
           03  FILLER                      PIC X.
           03  ALTC-ACCTNO                 PIC 9(8).
           03  FILLER                      PIC X.
           03  ALTC-SEQNO                  PIC 999.
           03  FILLER                      PIC X.
           03  ALTC-LTOUCH-DATE            PIC 9(8).
           03  FILLER                      PIC X.
           03  ALTC-DESC-1                 PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-MAKE-1                 PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-MODEL-1                PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-YEAR-1                 PIC X(4).
           03  FILLER                      PIC X.
           03  ALTC-STYLE-1                PIC X(8).
           03  FILLER                      PIC X.
           03  ALTC-CLASS-1                PIC X(8).
           03  FILLER                      PIC X.
           03  ALTC-VIN-1                  PIC X(20).
           03  FILLER                      PIC X.
           03  ALTC-TITLE-NO-1             PIC X(20).
           03  FILLER                      PIC X.
           03  ALTC-MILEAGE-1              PIC +9(7).
           03  FILLER                      PIC X.
           03  ALTC-VALUE-1                PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-SELLPR-1               PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-MISC-AMT-1             PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-SENT-FLAG-1            PIC X.
           03  FILLER                      PIC X.
           03  ALTC-VIN-CHG-DATE-1         PIC 9(8).
           03  FILLER                      PIC X.

           03  ALTC-DESC-2                 PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-MAKE-2                 PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-MODEL-2                PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-YEAR-2                 PIC X(4).
           03  FILLER                      PIC X.
           03  ALTC-STYLE-2                PIC X(8).
           03  FILLER                      PIC X.
           03  ALTC-CLASS-2                PIC X(8).
           03  FILLER                      PIC X.
           03  ALTC-VIN-2                  PIC X(20).
           03  FILLER                      PIC X.
           03  ALTC-TITLE-NO-2             PIC X(20).
           03  FILLER                      PIC X.
           03  ALTC-MILEAGE-2              PIC +9(7).
           03  FILLER                      PIC X.
           03  ALTC-VALUE-2                PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-SELLPR-2               PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-MISC-AMT-2             PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-SENT-FLAG-2            PIC X.
           03  FILLER                      PIC X.
           03  ALTC-VIN-CHG-DATE-2         PIC 9(8).
           03  FILLER                      PIC X.

           03  ALTC-DESC-3                 PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-MAKE-3                 PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-MODEL-3                PIC X(15).
           03  FILLER                      PIC X.
           03  ALTC-YEAR-3                 PIC X(4).
           03  FILLER                      PIC X.
           03  ALTC-STYLE-3                PIC X(8).
           03  FILLER                      PIC X.
           03  ALTC-CLASS-3                PIC X(8).
           03  FILLER                      PIC X.
           03  ALTC-VIN-3                  PIC X(20).
           03  FILLER                      PIC X.
           03  ALTC-TITLE-NO-3             PIC X(20).
           03  FILLER                      PIC X.
           03  ALTC-MILEAGE-3              PIC +9(7).
           03  FILLER                      PIC X.
           03  ALTC-VALUE-3                PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-SELLPR-3               PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-MISC-AMT-3             PIC +9(7).99.
           03  FILLER                      PIC X.
           03  ALTC-SENT-FLAG-3            PIC X.
           03  FILLER                      PIC X.
           03  ALTC-VIN-CHG-DATE-3         PIC 9(8).
           03  FILLER                      PIC X.
           03  ALTC-HHGS-GROUP OCCURS 3.
               05  ALTC-HHGS               PIC X(80).
               05  FILLER                  PIC X.

           03  ALTC-CR                   PIC X.
           03  ALTC-LF                   PIC X.

