      * COPYMEMBER: LIBUP/UPFDTRJ.CPY
      ******************************************************************
      *
      * DESCRIPTION:  ASCII DAILY TRANS FILE [CLASS TRANSFERS IN BRANCH]
      *
      * FILE INFO  :  CLASS TRANSFER WITHIN A BRANCH
      ******************************************************************
       78  ATRJ-SIZE                    VALUE 671.
       01  ATRJ-REC.
           03  ATJ-BRNO             PIC 9(4).
           03  FILLER               PIC X.
           03  ATJ-DATE             PIC 9(8).
           03  FILLER               PIC X.
           03  ATJ-CLASS            PIC 9(3).
           03  FILLER               PIC X.
           03  ATJ-ACCTNO           PIC 9(8).
           03  FILLER               PIC X.
           03  ATJ-LAWCODE          PIC 99.
           03  FILLER               PIC X.
           03  ATJ-LINE             PIC 9(3).
           03  FILLER               PIC X.
           03  ATJ-LTOUCH-DATE      PIC 9(8).
           03  FILLER               PIC X.
           03  ATJ-BORRTBL        OCCURS 4.
               05  ATJ-SSNO         PIC 9(9).
               05  FILLER           PIC X.
               05  ATJ-MAKERCD      PIC X.
               05  FILLER           PIC X.
           03  ATJ-REFNO.                            
               05  ATJ-REF-FRLC     PIC 99.
               05  ATJ-REF-X        PIC X.
               05  ATJ-REF-TOLC     PIC 99.
           03  FILLER               PIC X.
           03  ATJ-FRLC             PIC 9(3).
           03  FILLER               PIC X.
           03  ATJ-TOLC             PIC 9(3).
           03  FILLER               PIC X.
           03  ATJ-PURCD            PIC XXX.
           03  FILLER               PIC X.
           03  ATJ-SRCD             PIC XX.
           03  FILLER               PIC X.
           03  ATJ-COLLCD           PIC XX.
           03  FILLER               PIC X.
           03  ATJ-SERVACCT         PIC X.
           03  FILLER               PIC X.
           03  ATJ-LOANTYPE         PIC X.
           03  FILLER               PIC X.
           03  ATJ-SUBCLASS         PIC 99.
           03  FILLER               PIC X.
           03  ATJ-LOANDATE         PIC 9(8).
           03  FILLER               PIC X.
           03  ATJ-PROCEEDS         PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-LNAMT            PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-FINCHG           PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-INTCHG           PIC 9(7).99.
           03  FILLER               PIC X.
           03  ATJ-SERCHG           PIC 9(5).99.
           03  FILLER               PIC X.
           03  ATJ-EXTCHG           PIC 9(5).99.
           03  FILLER               PIC X.
           03  ATJ-MAINTFEE         PIC 9(5).99.
           03  FILLER               PIC X.
           03  ATJ-ORGTERM          PIC 9(3).
           03  FILLER               PIC X.
           03  ATJ-INSURED          PIC X.
           03  FILLER               PIC X.
           03  ATJ-INSUNEARN-TABLE OCCURS 10.
               05  ATJ-INSUNEARN    PIC +9(7).99.
               05  FILLER           PIC X.
           03  ATJ-DLNO             PIC 9(4).99.
           03  FILLER               PIC X.
           03  ATJ-DLRV             PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-DLSPRV           PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-DLDISC           PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-DLPARV           PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-DLRECOURSE       PIC X.
           03  FILLER               PIC X.
           03  ATJ-DLPARTRCAMT      PIC 9(6).99.
           03  FILLER               PIC X.
           03  ATJ-PURBAL           PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-UNEARN-TABLE    OCCURS 10.
               05  ATJ-UNEARN       PIC +9(7).99.
               05  FILLER           PIC X.
           03  ATJ-PRLNNO           PIC 9(8).
           03  FILLER               PIC X.
           03  ATJ-DLRVPRIN-TABLE  OCCURS 3.
               05  ATJ-DLRVPRIN     PIC +9(7).99.
               05  FILLER           PIC X.
           03  ATJ-DLRVCHGS-TABLE  OCCURS 3.
               05  ATJ-DLRVCHGS     PIC +9(7).99.
               05  FILLER           PIC X.
           03  ATJ-DLPARVPAID       PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-DLPARVHELD       PIC +9(7).99.
           03  FILLER               PIC X.
           03  ATJ-USERID           PIC X(10).
           03  FILLER               PIC X.
           03  ATJ-POSTDATE         PIC 9(8).
           03  FILLER               PIC X.
           03  ATJ-POSTTIME         PIC 9(6).
           03  FILLER               PIC X.
           03  ATJ-PLCD             PIC X.
           03  FILLER               PIC X.
           03  ATJ-PLTYPE           PIC X.
           03  FILLER               PIC X.
           03  ATJ-REPOCD           PIC X.
           03  FILLER               PIC X.
           03  ATJ-CR               PIC X.
           03  ATJ-LF               PIC X.
