      * COPYMEMBER: LIBUP/UG1534_FD.CPY
      ******************************************************************
      *
      * IDENTIFICATION: LIBUP/UG1534_FD.CPY
      *
      * DESCRIPTION   : FD FOR SOURCE (A15) & TARGET (A34) GLOBAL FILES
      *
      * 2025.0311 ADDED OTRW-INFO-INNOVIS-ID #1702 S35Q-169
      ******************************************************************

      *=================================================================
      * GLOBALS:
      *=================================================================
      *COPY "LIBGL/GLFDAL.CPY".
      *COPY "LIBLP/LPFDBY.CPY".
      *COPY "LIBLP/LPFDCD.CPY".
      *COPY "LIBLP/LPFDCDB.CPY".
      *COPY "LIBLP/LPFDCL.CPY".
      *COPY "LIBSP/SPFDCP.CPY".
      *COPY "LIBLP/LPFDEA.CPY".
      *COPY "LIBSP/SPFDEP.CPY".
      *COPY "LIBSP/SPFDEW.CPY".
      *COPY "LIBLP/LPFDFD.CPY".
      *COPY "LIBLP/LPFDFDB.CPY".
      *COPY "LIBGL/GLFDFS.CPY".
      *COPY "LIBGL/GLFDGI.CPY".
      *COPY "LIBGL/GLFDGL.CPY".
      *COPY "LIBGL/GLFDGT.CPY".
      *COPY "LIBSP/SPFDII.CPY".
      *COPY "LIBLP/LPFDIR.CPY".
      *COPY "LIBGL/GLFDJD.CPY".
      *COPY "LIBLP/LPFDLC.CPY".
      *COPY "LIBGB/GBFDPE.CPY".
      *COPY "LIBGB/GBFDPW.CPY".
      *COPY "LIBLP/LPFDRB.CPY".
      *COPY "LIBGB/GBFDRC.CPY".
      *COPY "LIBGB/GBFDSE.CPY".
      *COPY "LIBLP/LPFDSM.CPY".
      *COPY "LIBGB/GBFDSN.CPY".
      *COPY "LIBLP/LPFDSP.CPY".
      *COPY "LIBLP/LPFDSS.CPY".
      *COPY "LIBLP/LPFDST.CPY".
      *COPY "LIBSP/SPFDTRWINFO.CPY".
      *COPY "LIBLP/LPFDTZ.CPY".
      *COPY "LIBSP/SPFDWR.CPY".

      *=================================================================
      * LOCALS:
      *=================================================================
      *COPY "LIBLP/LPFDBM.CPY".
      *COPY "LIBLP/LPFDBW.CPY".
      *COPY "LIBLP/LPFDBX.CPY".
      *COPY "LIBLP/LPFDCA.CPY".
      *COPY "LIBLP/LPFDCI.CPY".
      *COPY "LIBSP/SPFDCJ.CPY".
      *COPY "LIBLP/LPFDCK.CPY".
      *COPY "LIBLP/LPFDCX.CPY".
      *COPY "LIBLP/LPFDDL.CPY".
      *COPY "LIBLP/LPFDDM.CPY".
      *COPY "LIBLP/LPFDDT.CPY".
      *COPY "LIBLP/LPFDES.CPY".
      *COPY "LIBGB/GBFDGB.CPY".
      *COPY "LIBLP/LPFDIC.CPY".
      *COPY "LIBLP/LPFDIX.CPY".
      *COPY "LIBLP/LPFDLE.CPY".
      *COPY "LIBLP/LPFDLH.CPY".
      *COPY "LIBLP/LPFDLM.CPY".
      *COPY "LIBLP/LPFDLN.CPY".
      *COPY "LIBLP/LPFDLP.CPY".
      *COPY "LIBLP/LPFDLSD.CPY".
      *COPY "LIBLP/LPFDLSF.CPY".
      *COPY "LIBLP/LPFDLSG.CPY".
      *COPY "LIBLP/LPFDLSJ.CPY".
      *COPY "LIBLP/LPFDLSL.CPY".
      *COPY "LIBLP/LPFDLSM.CPY".
      *COPY "LIBLP/LPFDLSP.CPY".
      *COPY "LIBLP/LPFDLSR.CPY".
      *COPY "LIBLP/LPFDLSX.CPY".
      *COPY "LIBLP/LPFDLTA.CPY".
      *COPY "LIBLP/LPFDLTB.CPY".
      *COPY "LIBLP/LPFDLTC.CPY".
      *COPY "LIBLP/LPFDLTD.CPY".
      *COPY "LIBLP/LPFDLTF.CPY".
      *COPY "LIBLP/LPFDLTI.CPY".
      *COPY "LIBLP/LPFDLTL.CPY".
      *COPY "LIBLP/LPFDLTP.CPY".
      *COPY "LIBLP/LPFDLX.CPY".
      *COPY "LIBLP/LPFDLXE.CPY".
      *COPY "LIBLP/LPFDLXG.CPY".
      *COPY "LIBLP/LPFDML.CPY".
      *COPY "LIBLP/LPFDMP.CPY".
      *COPY "LIBLP/LPFDPA.CPY".
      *COPY "LIBLP/LPFDPC.CPY".
      *COPY "LIBLP/LPFDPD.CPY".
      *COPY "LIBLP/LPFDRX.CPY".
      *COPY "LIBLP/LPFDTY.CPY".

      ******************************************************************
      *
      *    S O U R C E - F I L E S - A 1 5
      *
      ******************************************************************

      *=================================================================
      * GLOBAL
      *=================================================================

      * COPYMEMBER: LIBGL/GLFDAL
       FD  OAL-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GL01AL.CPY" REPLACING LEADING "AL" BY "OAL".

      * COPYMEMBER: LIBLP/LPFDBY
       FD  OBY-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01BY.CPY" REPLACING LEADING "BY" BY "OBY".

      * COPYMEMBER: LIBLP/LPFDCD
       FD  OCD-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01CD.CPY" REPLACING LEADING "CD" BY "OCD".

      * COPYMEMBER: LIBLP/LPFDCL
       FD  OCL-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01CL.CPY" REPLACING LEADING "CL" BY "OCL".

      * COPYMEMBER: LIBLP/LPFDEA
       FD  OEA-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01EA.CPY" REPLACING LEADING "EA" BY "OEA".

      * COPYMEMBER: LIBLP/LPFDFD
      *FD  OFD-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01FD.CPY" REPLACING LEADING "FD" BY "OFD".

      * COPYMEMBER: LIBLP/LPFDFT
      *FD  OFT-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01FT.CPY" REPLACING LEADING "FT" BY "OFT".

      * COPYMEMBER: LIBGL/GLFDFS
      *FD  OFS-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/GL01FS.CPY" REPLACING LEADING "FS" BY "OFS".

      * COPYMEMBER: LIBGL/GLFDGI
       FD  OGI-FILE
           LABEL RECORD IS STANDARD.
       COPY "LIBUP/A15SRC/GL01GI.CPY" REPLACING LEADING "GI" BY "OGI".

      * COPYMEMBER: LIBGL/GLFDGL
       FD  OGL-FILE
           LABEL RECORD STANDARD.
       COPY "LIBUP/A15SRC/GL01GL.CPY" REPLACING LEADING "GL" BY "OGL".

      * COPYMEMBER: LIBGL/GLFDGT
       FD  OGT-FILE
           BLOCK CONTAINS 1024 TO 1024 CHARACTERS
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GL01GT.CPY" REPLACING LEADING "GT" BY "OGT".

      * COPYMEMBER: LIBGL/GLFDJD
      *FD  OJD-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/GL01JD.CPY" REPLACING LEADING "JD" BY "OJD".


      * COPYMEMBER: LIBGB/GBFDPE
       FD  OPE-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GB01PE.CPY" REPLACING LEADING "PE" BY "OPE".

      * COPYMEMBER: LIBGB/GBFDPW
       FD  OPW-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GB01PW.CPY" REPLACING LEADING "PW" BY "OPW".

      * COPYMEMBER: LIBGB/GBFDRC
       FD  ORC-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GB01RC.CPY" REPLACING LEADING "RC" BY "ORC".

      * COPYMEMBER: LIBGB/GBFDSE
       FD  OSE-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GB01SE.CPY" REPLACING LEADING "SE" BY "OSE".

      * COPYMEMBER: LIBGB/GBFDSN
       FD  OSN-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GB01SN.CPY" REPLACING LEADING "SN" BY "OSN".

      * COPYMEMBER: LIBLP/LPFDLC
       FD  OLC-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LC.CPY" REPLACING LEADING "LC" BY "OLC".

      * COPYMEMBER: LIBLP/LPFDSM
       FD  OSM-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01SM.CPY" REPLACING LEADING "SM" BY "OSM".

      * COPYMEMBER: LIBLP/LPFDSP
       FD  OSP-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01SP.CPY" REPLACING
                                          LEADING "SP"   BY "OSP"
                                          LEADING "EXPR" BY "OEXPR"
                                          LEADING "ASTP" BY "OASTP"
                                          LEADING "CTBL" BY "OCTBL"
                                          LEADING "CSTP" BY "OCSTP"
                                          LEADING "ETBL" BY "OETBL"
                                          LEADING "ESTP" BY "OESTP"
                                          LEADING "ILEV" BY "OILEV"
                                          LEADING "ISTP" BY "OISTP"
                                          LEADING "IVER" BY "OIVER"
                                          LEADING "APODIX" BY "OAPODIX".

      * COPYMEMBER: LIBLP/LPFDSS
       FD  OSS-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01SS.CPY" REPLACING LEADING "SS" BY "OSS".

      * COPYMEMBER: LIBLP/LPFDST
       FD  OST-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01ST.CPY" REPLACING LEADING "ST" BY "OST".

      * COPYMEMBER: LIBLP/LPFDSU
       FD  OSU-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01SU.CPY" REPLACING LEADING "SU" BY "OSU".

       FD  OTRW-INFO-FILE
           LABEL RECORDS ARE STANDARD.
       01  OTRW-INFO-REC.
           03  OTRW-INFO-KEY.
               05  OTRW-INFO-ID             PIC 9(4).
           03  OTRW-INFO-EQUIFAX-ID         PIC X(10).
           03  OTRW-INFO-EXPERIAN-ID        PIC X(5).
           03  OTRW-INFO-TUC-ID             PIC X(10).
           03  OTRW-INFO-REPORTER-NAME      PIC X(40).
           03  OTRW-INFO-REPORTER-ADDRESS.
               05  OTRW-INFO-REPORTER-ADR1  PIC X(32).
               05  OTRW-INFO-REPORTER-ADR2  PIC X(32).
               05  OTRW-INFO-REPORTER-CSZ   PIC X(32).
           03  OTRW-INFO-REPORTER-PHONE     PIC 9(10)    COMP-3.
           03  OTRW-INFO-GRANTOR-CODE       PIC X(20).
           03  OTRW-INFO-METRO2-PURCHASED   PIC X.
           03  OTRW-INFO-CR-LF              PIC X.
           03  OTRW-INFO-BRNO-ACCTNO        PIC X.
           03  OTRW-INFO-IDENT-BRNO         PIC X.
           03  OTRW-YEARS-STOP-REPORTING    PIC 99.
           03  OTRW-INVALID-SSNO            PIC X.
           03  OTRW-INFO-SCHED-PAY          PIC X.
           03  OTRW-INFO-INNOVIS-ID         PIC X(10).

           03  FILLER                      PIC X(262).


      * COPYMEMBER: LIBLP/LPFDTZ
       FD  OTZ-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01TZ.CPY" REPLACING LEADING "TZ" BY "OTZ".

      * COPYMEMBER: LIBSP/SPFDCP
       FD  OCP-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/SP01CP.CPY" REPLACING LEADING "CP" BY "OCP".

      * COPYMEMBER: LIBSP/SPFDEP
      *FD  OEP-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/SP01EP.CPY" REPLACING LEADING "EP" BY "OEP".

      * COPYMEMBER: LIBSP/SPFDEW
      *FD  OEW-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/SP01EW.CPY" REPLACING LEADING "EW" BY "OEW".

      * COPYMEMBER: LIBSP/SPFDWR
       FD  OWR-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/SP01WR.CPY" REPLACING LEADING "WR" BY "OWR".

      * COPYMEMBER: LIBGB/GBFDAU
       FD  OAU-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GB01AU.CPY" REPLACING LEADING "AU" BY "OAU".

      * COPYMEMBER: LIBSP/SPFDII
       FD  OII-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/SP01II.CPY" REPLACING LEADING "II" BY "OII".

      * COPYMEMBER: LIBLP/SPFDIR
       FD  OIR-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01IR.CPY" REPLACING LEADING "IR" BY "OIR".

      * COPYMEMBER: LIBLP/SPFDRB
      *FD  ORB-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01RB.CPY" REPLACING LEADING "RB" BY "ORB".

      *=================================================================
      * LOCALS:
      *=================================================================

      * COPYMEMBER: LIBLP/LPFDBM
       FD  OBM-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01BM.CPY" REPLACING LEADING "BM" BY "OBM".

      * COPYMEMBER: LIBLP/LPFDBW
       FD  OBW-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01BW.CPY" REPLACING LEADING "BW" BY "OBW".

      * COPYMEMBER: LIBLP/LPFDBX
       FD  OBX-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01BX.CPY" REPLACING LEADING "BX" BY "OBX".

      * COPYMEMBER: LIBLP/LPFDCA
       FD  OCA-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01CA.CPY" REPLACING LEADING "CA" BY "OCA".

      * COPYMEMBER: LIBLP/LPFDCI
       FD  OCI-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01CI.CPY" REPLACING LEADING "CI" BY "OCI".

      * COPYMEMBER: LIBSP/SPFDCJ
       FD  OCJ-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/SP01CJ.CPY" REPLACING LEADING "CJ" BY "OCJ".

      * COPYMEMBER: LIBLP/LPFDCK
       FD  OCK-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01CK.CPY" REPLACING LEADING "CK" BY "OCK".

      * COPYMEMBER: LIBLP/LPFDCX
       FD  OCX-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01CX.CPY" REPLACING LEADING "CX" BY "OCX".

      * COPYMEMBER: LIBLP/LPFDDL
       FD  ODL-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01DL.CPY" REPLACING LEADING "DL" BY "ODL".

      * COPYMEMBER: LIBLP/LPFDDM
      *FD  ODM-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01DM.CPY" REPLACING LEADING "DM" BY "ODM".

      * COPYMEMBER: LIBLP/LPFDDT
       FD  ODT-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01DT.CPY" REPLACING LEADING "DT" BY "ODT".

      * COPYMEMBER: LIBLP/LPFDES
      *FD  OES-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01ES.CPY" REPLACING LEADING "ES" BY "OES".

      * COPYMEMBER: LIBGB/GBFDGB
       FD  OGB-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/GB01GB.CPY" REPLACING LEADING "GB" BY "OGB".

      * COPYMEMBER: LIBLP/LPFDIC
       FD  OIC-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01IC.CPY" REPLACING LEADING "IC" BY "OIC".

      * COPYMEMBER: LIBLP/LPFDIX
       FD  OIX-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01IX.CPY" REPLACING LEADING "IX" BY "OIX".

      * COPYMEMBER: LIBLP/LPFDLE
       FD  OLE-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LE.CPY" REPLACING LEADING "LE" BY "OLE".

      * COPYMEMBER: LIBLP/LPFDLH
       FD  OLH-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LH.CPY" REPLACING LEADING "LH" BY "OLH".

      * COPYMEMBER: LIBLP/LPFDLM
       FD  OLM-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LM.CPY" REPLACING LEADING "LM" BY "OLM".

      * COPYMEMBER: LIBLP/LPFDLN
       FD  OLN-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LN.CPY" REPLACING LEADING "LN" BY "OLN".

      * COPYMEMBER: LIBLP/LPFDLP
       FD  OLP-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LP.CPY" REPLACING LEADING "LP" BY "OLP".

      * COPYMEMBER: LIBLP/LPFDLS
       FD  OLS-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LS.CPY" REPLACING LEADING "LS" BY "OLS".

      * COPYMEMBER: LIBLP/LPFDLT
       FD  OLT-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LT.CPY" REPLACING LEADING "LT" BY "OLT".

      * COPYMEMBER: LIBLP/LPFDLX
       FD  OLX-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01LX.CPY" REPLACING LEADING "LX" BY "OLX".

      * COPYMEMBER: LIBLP/LPFDML
      *FD  OML-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01ML.CPY" REPLACING LEADING "ML" BY "OML".

      * COPYMEMBER: LIBLP/LPFDMP
      *FD  OMP-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01MP.CPY" REPLACING LEADING "MP" BY "OMP".

      * COPYMEMBER: LIBLP/LPFDPA
      *FD  OPA-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01PA.CPY" REPLACING LEADING "PA" BY "OPA".

      * COPYMEMBER: LIBLP/LPFDRX
       FD  ORX-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01RX.CPY" REPLACING LEADING "RX" BY "ORX".

      * COPYMEMBER: LIBLP/LPFDPC
      *FD  OPC-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01PC.CPY" REPLACING LEADING "PC" BY "OPC".

      * COPYMEMBER: LIBLP/LPFDPD
      *FD  OPD-FILE
      *    LABEL RECORDS ARE STANDARD.
      *COPY "LIBUP/A15SRC/LP01PD.CPY" REPLACING LEADING "PD" BY "OPD".

      * COPYMEMBER: LIBLP/LPFDTY
       FD  OTY-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/A15SRC/LP01TY.CPY" REPLACING LEADING "TY" BY "OTY".
