       CLEAR-ALTI-FILE SECTION.

           MOVE ALL X"09" TO ALTI-REC.

           MOVE 0 TO ALTI-LTOUCH-DATE.

           PERFORM VARYING LTISUB FROM 1 BY 1 UNTIL LTISUB > 3
              MOVE 0 TO ALTI-ANTICERN(LTISUB)
                        ALTI-ANTICADJ(LTISUB)
                        ALTI-UFERN(LTISUB)
                        ALTI-ACCERN(LTISUB).

           MOVE 0 TO ALTI-INS-TYPE ALTI-ORIG-1STPYDATE ALTI-PRIOR-NODEF
                     ALTI-INSFEE(1) ALTI-INSFEE(2)
                     ALTI-INSCOMP ALTI-INSEFF-DATE ALTI-INSEXP-DATE
                     ALTI-INSPREM ALTI-INSCOVR ALTI-INSCOMM
                     ALTI-ANTICTERM ALTI-INS-PAYMNT-INCR
                     ALTI-INS-TOT-ADDON ALTI-INT-LAST-EARNED
                     ALTI-RB-WORKER ALTI-ANTIC-START-DATE.

           MOVE SPACES TO ALTI-INSFEECD(1) ALTI-INSFEECD(2)
                          ALTI-TRCD ALTI-INSOURS ALTI-INT-REBATE
                          ALTI-INS-REBATE ALTI-CANCEL-REASON-CD.
