      * COPYMEMBER: LIBUP/UPALNCL
      **************************************************************************
      *    LOAN ASCII FILE CLEAR ROUTINE
      *
      ******************************************************************
       CLEAR-ALN-FILE SECTION.
           MOVE ALL X"09" TO ALN-REC.

           MOVE 0 TO ALN-OWNBR ALN-CLASS ALN-ACCTNO ALN-LAWCODE.
           MOVE 0 TO ALN-SSNO1
           MOVE 0 TO ALN-SSNO2
           MOVE 0 TO ALN-SSNO3
           MOVE 0 TO ALN-SSNO4.
           MOVE 0 TO ALN-ORGBR ALN-SUBCLASS ALN-SPRCLASS ALN-LC-CODE.
           MOVE 0 TO ALN-ENTDATE ALN-LOANDATE ALN-PURDATE
                     ALN-INTDATE ALN-CASHDATE ALN-FILEDATE 
                     ALN-RESCISSION-DATE ALN-PART-RECOURSE-DATE 
                     ALN-ORIG-1STPYDATE ALN-1STPYDATE ALN-JDDATE 
                     ALN-PLDATE ALN-PL-TRDATE ALN-ACCELDATE 
                     ALN-REDUDATE ALN-POFFDATE ALN-PO-TRDATE
                     ALN-LEGALDATE
                     ALN-BNKRPTDATE ALN-BNKRPT-DISMISS-DATE
                     ALN-BNKRPT-DISCHARGE-DATE ALN-BNKRPT-REAFFIRM-DATE
                     ALN-DEBTAIDATE ALN-REPODATE
                     ALN-REDEEMDATE ALN-SOLDDATE ALN-INS-CONFIRM-DATE
                     ALN-PRIOR-RN-FOR10-DATE ALN-LAST-RN-FOR10-DATE
                     ALN-TRW-DOFD-DATE ALN-LAST-PYPA-DATE ALN-BT-TRDATE 
                     ALN-METRO2-LAST-PMT-DATE ALN-FOLLOWUP-DATE
                     ALN-LAST-ACCRUAL-DATE.
           MOVE 0 TO ALN-APRATE ALN-EFFRATE ALN-SMPRATE ALN-YLDRATE
                     ALN-OVRDRATE ALN-ENDORATE ALN-JDRATE ALN-ACCRATE
                     ALN-REDURATE ALN-CONRATE ALN-SERVPER.
           MOVE 0 TO ALN-SELLPR ALN-DOWNPY ALN-TRADEIN ALN-LNAMT
                     ALN-FINCHG ALN-INTCHG ALN-SERCHG ALN-EXTCHG
                     ALN-MAINTFEE ALN-POINTS ALN-PROCEEDS ALN-ORGTERM
                     ALN-1STPYAMT ALN-NOREGPY ALN-REGPYAMT
                     ALN-LASTPYAMT ALN-PROCASH ALN-TILLNO
                     ALN-STATE-WORKER ALN-STATE-WORKER2.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 20
              MOVE 0 TO ALN-FEEAMT(SUB)
           END-PERFORM.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 10
              MOVE 0 TO ALN-INSCOMP(SUB) ALN-INSEFF-DATE(SUB)
                        ALN-INSEXP-DATE(SUB)
                        ALN-INSPREM(SUB) ALN-INSCOVR(SUB)
                        ALN-INSCOMM(SUB)
                        ALN-INSANTICERN(SUB) ALN-INSANTICADJ(SUB)
                        ALN-INSUFERN(SUB) ALN-INSACCERN(SUB)
                        ALN-INSEARN-ORDER(SUB)
           END-PERFORM.
           MOVE 0 TO ALN-PY-YYYYMM-RECDEL ALN-MTD-PAYS-RECDEL
                     ALN-AD-D-INS-COVR ALN-TOT-PARTIAL-CHGOFF
                     ALN-EMP-ID
                     ALN-TOTNOLCHG ALN-WCBC-CREDITLIM
                     ALN-MIP-MTD-CLAHPAID ALN-MIP-TOT-CLPAID
                     ALN-MIP-TOT-AHPAID
                     ALN-MIP-CLPDTH-DATE ALN-MIP-AHPDTH-DATE
                     ALN-IL-GROSS-INCOME ALN-IL-GROSS-INCOME2.

           MOVE "N" TO ALN-RESCISSION.

           MOVE 0 TO ALN-DLNO ALN-DLPOOL
                     ALN-DLPARTRCAMT ALN-ORIGPURAMT ALN-PURBAL
                     ALN-DLRVPRIN(1) ALN-DLRVPRIN(2) ALN-DLRVPRIN(3)
                     ALN-DLRVCHGS(1) ALN-DLRVCHGS(2) ALN-DLRVCHGS(3)
                     ALN-DLPARVHELD ALN-DLPARVPAID ALN-DLDISC.
           MOVE 0 TO ALN-LCPDTH-DATE ALN-INTPDTH-DATE ALN-CURBAL
                     ALN-INTBAL ALN-LCBAL ALN-OTHBAL ALN-OT2BAL
                     ALN-LCPAID ALN-LCPARTIALS ALN-STMT-COUNTER
                     ALN-PRIOR-STMT-COUNTER ALN-MONTHEND-BAL.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 10
              MOVE 0 TO ALN-ANTICERN(SUB) ALN-ANTICADJ(SUB)
                        ALN-UFERN(SUB) ALN-ACCERN(SUB)
                        ALN-EARN-ORDER(SUB)
           END-PERFORM.
           MOVE 0 TO ALN-ANTICTERM ALN-LMO-PRIOR-INTEREST
                     ALN-PRIOR-UNEARNED ALN-NONACRERN
                     ALN-PRIOR-NONACRERN
                     ALN-ERN-IB-PDTH-DATE ALN-ERN-IB-PRINBAL
                     ALN-ERN-IB-INTOWE ALN-TOTERN ALN-TOTOTH ALN-TOTINT
                     ALN-TOTLCHG ALN-TOTDEF ALN-TOTSERACCT ALN-LCWAIVERS
                     ALN-INTWAIVERS ALN-TOTPAYMNTD ALN-TOTEXCPAYMNTD
                     ALN-TOTNODEF ALN-YTDNODEF 
                     ALN-TOTNODEFACT ALN-YTDNODEFACT
                     ALN-TOTNOALDEL ALN-YTDNOALDEL 
                     ALN-YTDINTPD ALN-LYRINTPD ALN-TOTINTPD
                     ALN-RECASTINT ALN-RECASTPRIN.
           MOVE 0 TO ALN-PROMDAYS-PASTDUE ALN-PROMDATE ALN-PROMAMT
                     ALN-PROMDATE2 ALN-DATE-PAID-LAST
                     ALN-AMT-PAID-LAST
                     ALN-LASTCFORMNO ALN-LASTCFORMDATE ALN-DELCNT
                     ALN-DELCNT2 ALN-CREDITLIM ALN-CRSCORE
                     ALN-LASTSFORMNO ALN-LASTSFORMDATE ALN-SOLCNT.
           MOVE 0 TO ALN-OLDACCTNO ALN-PRLNNO ALN-PRBAL ALN-PRINTDUE
                     ALN-PRFINCHGRB ALN-PRINSRB ALN-PRPODATE
                     ALN-PRDELINQAMT ALN-PRLNAMT ALN-PRPDUE-DAYS
                     ALN-PRDLDISC-UNEARN.
           MOVE 999999999999 TO ALN-PRCONPROFILE.
           MOVE 0 TO ALN-SUM-ORIGPURAMT ALN-SUM-LNAMT ALN-SUM-FINCHG
                     ALN-SUM-INTCHG ALN-SUM-ORGTERM ALN-SUM-REGPYAMT
                     ALN-SUM-EXTCHG ALN-SUM-SERCHG ALN-SUM-MAINTFEE.

           MOVE "M" TO ALN-UNITPER-CD.
           MOVE 1 TO ALN-UNITPER-FREQ.
           MOVE 30 TO ALN-DAYS-IN-UNITPER.
           MOVE 12 TO ALN-UNITPER-PER-YEAR.

           MOVE 0 TO ALN-O3INS-DLPROC ALN-INSPREM-DLADJ
                     ALN-PLAMT ALN-MTD-PRIN ALN-MTD-LC ALN-MTD-INT
                     ALN-MTD-OT ALN-MTD-EX ALN-BNKRPT-CHAPTER.

           MOVE "9" TO ALN-BMO-CON-STATUS ALN-BMO-REC-STATUS.
           MOVE 0 TO ALN-APP-NUMBER ALN-GIFTNET-OUR-PO.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 5
              MOVE 999999999999 TO ALN-CONPROFILE(SUB)
                                   ALN-RECPROFILE(SUB)
           END-PERFORM.

           MOVE 0 TO  ALN-NEXIS-CRSCORE.
           MOVE "I" TO ALN-CREATION-STATUS.
           MOVE 0 TO ALN-EXTRA-PRIN-LFP ALN-REMAIN-INT-SINCE-LFP
                                       ALN-REMAIN-PRIN-SINCE-LFP.
           MOVE 0 TO ALN-DLCOMM-O3-CMSI ALN-DLCOMM-PP-CMSI
                     ALN-APPROVED-BY-DATE ALN-APPROVED-BY-TIME.

           MOVE 0 TO ALN-LTOUCH-DATE   ALN-LTOUCH-TIME.

           MOVE SPACES TO ALN-MAKERCD1 ALN-MAKERCD2 ALN-MAKERCD3
                          ALN-MAKERCD4.
           MOVE SPACES TO ALN-ORGST ALN-OWNST ALN-CONVERCD     
                          ALN-MIDSTREAM ALN-PURCD ALN-SRCD ALN-COLLCD       
                          ALN-COLLID ALN-POCD ALN-PLCD ALN-PLTYPE       
                          ALN-CONFIDENTCD ALN-ALLOTCD ALN-RECASTCD     
                          ALN-SKIP-TRW ALN-STATUSFG ALN-SMALLOAN     
                          ALN-SALEFIN ALN-SERVACCT ALN-LOANTYPE     
                          ALN-ADDON-FG ALN-PAY-SCHLD-FG ALN-CAN-LOAN-NO 
                          ALN-STATFLAGS ALN-STATE-FLAG.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 20
              MOVE SPACES TO ALN-FEECODE(SUB)
                             ALN-FEEOURS(SUB)
                             ALN-FEEFINCHG(SUB)
           END-PERFORM.


           MOVE SPACES TO ALN-INSURED ALN-INSTYPES ALN-INSELIGIBLE.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 10
              MOVE SPACES TO ALN-INSOURS(SUB) ALN-INSFINCHG(SUB)
           END-PERFORM.


           MOVE SPACES TO ALN-GARNISH-EXTR ALN-SHIP-SAME-FG ALN-LPO           
                          ALN-REP-CD ALN-PROCESS-CD ALN-FOLLOWUP-CD   
                          ALN-MIP-FG ALN-RESCISSION ALN-INTERIM-TRW   
                          ALN-DLRECOURSE ALN-FROZEN-REASON
                          ALN-COUPON-STATEMENT ALN-ERNDELQ-STOP.

           MOVE SPACES TO ALN-CL-REBATE  ALN-AH-REBATE  ALN-PP-REBATE  
                          ALN-INT-REBATE ALN-SC-REBATE  ALN-MF-REBATE  
                          ALN-DF-REBATE  ALN-EX-REBATE  ALN-O1-REBATE  
                          ALN-O2-REBATE  ALN-O3-REBATE  ALN-O4-REBATE  
                          ALN-O5-REBATE  ALN-O6-REBATE  ALN-O7-REBATE  
                          ALN-UN-O7-REB  ALN-UN-O8-REB  ALN-UN-O9-REB  
                          ALN-UN-O10-REB.

           MOVE SPACES TO ALN-PLREASON ALN-COLLECTOR ALN-ACTIONCD    
                          ALN-ACTIONCD2 ALN-ATCODE ALN-RECODE      
                          ALN-ESCROW-FG ALN-PROMID ALN-MESSAGE      
                          ALN-PRPOCD ALN-REPOCD
                          ALN-BR-TFR-FG ALN-GIFTNET        
                          ALN-PROC-DISBURSED ALN-NOODDPY ALN-TRW-STATUS      
                          ALN-ORIGIN ALN-PO-TRCD ALN-TRW-B-CONSUMER-IND
                          ALN-PARVHELD-PAID-FG ALN-ACCT-FROZEN     
                          ALN-TRW-SPECIAL-CODE 
                          ALN-LBOX ALN-INTERIM-COUPON       
                          ALN-TRW-J-CONSUMER-IND ALN-ACH ALN-1099-C-FG
                          ALN-TRW-COMPLIANCE-CODE ALN-UNWIND-REASON-CODE   
                          ALN-PBI-PBD-FG ALN-OLD-ACCT-FORMAT-FG   
                          ALN-APPROVED-BY-USER ALN-APPROVED-BY-CODE.


