       CLEAR-ALTF-FILE SECTION.
           MOVE ALL X"09" TO ALTF-REC.

           MOVE 0 TO ALTF-LTOUCH-DATE.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 10
              MOVE 0 TO ALTF-FEECODE-PAYABLE(SUB)
              MOVE SPACES TO ALTF-FEECODE(SUB)
           END-PERFORM.
