      * COPYMEMBER: LIBUP/UPFDAIX
      ********************************************************************
      *   ASCII ALTERNATE INDEX FILE (COLLATERAL VIN)
      ********************************************************************
      $XFD  FILE=AIXFILE
       FD  AIX-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01AIX.CPY".

       FD  AIX-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  AIX-DONE-REC   PIC X.

