      * COPYMEMBER: LIBUP/UPFDALTP
      ********************************************************************
      *   ASCII LOAN TRAILER FILE
      ********************************************************************
      $XFD  FILE=ALTPFILE
       FD  ALTP-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01ALTP.CPY".

       FD  ALTP-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  ALTP-DONE-REC   PIC X.
