      * COPYMEMBER: LIBUP/UPFDACJ
      ********************************************************************
      *   COLLECTOR JOURNAL ASCII FILE
      ********************************************************************
      $XFD  FILE=ACJFILE
       FD  ACJ-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01ACJ.CPY".

       FD  ACJ-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  ACJ-DONE-REC   PIC X.

