      * COPYMEMBER: LIBUP/UPFDALTL
      ********************************************************************
      *   ASCII LOAN TRAILER FILE
      ********************************************************************
      $XFD  FILE=ALTLFILE
       FD  ALTL-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01ALTL.CPY".

       FD  ALTL-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  ALTL-DONE-REC   PIC X.
