      * COPYMEMBER: LIBUP/UPFDALTB
      ********************************************************************
      *   ASCII LOAN TRAILER FILE
      ********************************************************************
      $XFD  FILE=ALTBFILE
       FD  ALTB-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01ALTB.CPY".

       FD  ALTB-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  ALTB-DONE-REC   PIC X.
