      * COPYMEMBER: LIBUP/UPFDALTD
      ********************************************************************
      *   ASCII LOAN TRAILER FILE
      ********************************************************************
      $XFD  FILE=ALTDFILE
       FD  ALTD-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01ALTD.CPY".

       FD  ALTD-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  ALTD-DONE-REC   PIC X.
