      * COPYMEMBER: LIBUP/UPFDAWR
      ********************************************************************
      *   ASCII WORLD RATING SHEET
      ********************************************************************
      $XFD  FILE=AWRFILE
       FD  AWR-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01AWR.CPY".

       FD  AWR-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  AWR-DONE-REC   PIC X.

