      * COPYMEMBER: LIBUP/UPFDALTC
      ********************************************************************
      *   ASCII LOAN TRAILER FILE
      ********************************************************************
      $XFD  FILE=ALTCFILE
       FD  ALTC-FILE
           LABEL RECORDS ARE STANDARD.
       COPY "LIBUP/UP01ALTC.CPY".

       FD  ALTC-DONE-FILE
           LABEL RECORDS ARE STANDARD.
       01  ALTC-DONE-REC   PIC X.
