      * COPYMEMBER: LIBUP/UPFSATRC
           SELECT ATRC-FILE ASSIGN TO ATRC-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ATRC-KEY
                  FILE STATUS FILE-STAT.
           SELECT ATRC-DONE-FILE ASSIGN ATRC-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
