      * COPYMEMBER: LIBUP/UPFSATRD
           SELECT ATRD-FILE ASSIGN TO ATRD-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ATRD-KEY
                  FILE STATUS FILE-STAT.
           SELECT ATRD-DONE-FILE ASSIGN ATRD-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
~
