      * COPYMEMBER: LIBUP/UPFSALTC
           SELECT ALTC-FILE ASSIGN TO ALTC-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ALTC-KEY
                  FILE STATUS FILE-STAT.
           SELECT ALTC-DONE-FILE ASSIGN ALTC-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
~
~
