      * COPYMEMBER: LIBUP/UPFSARC
           SELECT ARC-FILE ASSIGN TO ARC-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ARC-KEY
                  FILE STATUS FILE-STAT.
           SELECT ARC-DONE-FILE ASSIGN ARC-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
