      * COPYMEMBER: LIBUP/UPFSATRX
           SELECT ATRX-FILE ASSIGN TO ATRX-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ATRX-KEY
                  FILE STATUS FILE-STAT.
           SELECT ATRX-DONE-FILE ASSIGN ATRX-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
