      * COPYMEMBER: LIBUP/UPFSAIX
           SELECT AIX-FILE ASSIGN TO AIX-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY AIX-KEY
                  FILE STATUS FILE-STAT.
           SELECT AIX-DONE-FILE ASSIGN AIX-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
