      * COPYMEMBER: LIBUP/UPFSALXE
           SELECT ALXE-FILE ASSIGN TO ALXE-PATH          
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ALXE-KEY
                  FILE STATUS FILE-STAT.
           SELECT ALXE-DONE-FILE ASSIGN ALXE-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
