      * COPYMEMBER: LIBUP/UPFSACH
           SELECT ACH-FILE ASSIGN TO ACH-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ACH-KEY
                  FILE STATUS FILE-STAT.
           SELECT ACH-DONE-FILE ASSIGN ACH-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
