      * COPYMEMBER: LIBUP/UPFSATRS
           SELECT ATRS-FILE ASSIGN TO ATRS-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ATRS-KEY
                  FILE STATUS FILE-STAT.
           SELECT ATRS-DONE-FILE ASSIGN ATRS-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
