      * COPYMEMBER: LIBUP/UPFSABX
           SELECT ABX-FILE ASSIGN TO ABX-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ABX-KEY
                  FILE STATUS FILE-STAT.
~
           SELECT ABX-DONE-FILE ASSIGN ABX-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
