      * COPYMEMBER: LIBUP/UPFSACK
           SELECT ACK-FILE ASSIGN TO ACK-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ACK-KEY
                  FILE STATUS FILE-STAT.
           SELECT ACK-DONE-FILE ASSIGN ACK-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
