      * COPYMEMBER: LIBUP/UPFSATRP
           SELECT ATRP-FILE ASSIGN TO ATRP-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ATRP-KEY
                  FILE STATUS FILE-STAT.
           SELECT ATRP-DONE-FILE ASSIGN ATRP-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
