      * COPYMEMBER: LIBLP/LPFSBY
           SELECT ABYA-FILE ASSIGN TO ABYA-PATH         
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ABYA-KEY
                  FILE STATUS FILE-STAT.

           SELECT ABYB-FILE ASSIGN TO ABYB-PATH          
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ABYB-KEY
                  FILE STATUS FILE-STAT.

           SELECT ABYA-DONE-FILE ASSIGN ABYA-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
           SELECT ABYB-DONE-FILE ASSIGN ABYB-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
