      * COPYMEMBER: LIBUP/UPFSATRK
           SELECT ATRK-FILE ASSIGN TO ATRK-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ATRK-KEY
                  FILE STATUS FILE-STAT.
           SELECT ATRK-DONE-FILE ASSIGN ATRK-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
