      * COPYMEMBER: LIBUP/UPFSALTA
           SELECT ALTA-FILE ASSIGN TO ALTA-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY ALTA-KEY
                  FILE STATUS FILE-STAT.
           SELECT ALTA-DONE-FILE ASSIGN ALTA-DONE-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
~
