      * COPYMEMBER: LIBAP/APFSAP
      *    INCLUDE IN AUTOCR
           SELECT AP-FILE ASSIGN AP-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY AP1-KEY
                  ALTERNATE RECORD KEY AP2-KEY WITH DUPLICATES
                  ALTERNATE RECORD KEY AP3-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
