      * COPYMEMBER: LIBAP/APFSVN
      *    INCLUDE IN AUTOCR
           SELECT VN-FILE ASSIGN VN-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY VN1-KEY
                  ALTERNATE RECORD KEY VN2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
