           SELECT BR-FILE ASSIGN TO BR-PATH
                  ORGANIZATION INDEXED
                  ACCESS MODE DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY BR-KEY
                  FILE STATUS FILE-STAT.
