      * COPYMEMBER: LIBGL/GLFSGL
           SELECT GL-FILE ASSIGN TO GL-PATH
                  ORGANIZATION INDEXED
                  ACCESS MODE DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY GL1-KEY
                  ALTERNATE RECORD KEY GL2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
