      * COPYMEMBER: LIBLP/LPFSLTC COLLATERAL TRAILER
           SELECT LTC-FILE ASSIGN TO LTC-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY LTC1-KEY
                  ALTERNATE RECORD KEY LTC2-KEY WITH DUPLICATES
                  ALTERNATE RECORD KEY LTC2-KEY WITH DUPLICATES
                  ALTERNATE RECORD KEY LTC4-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
