      * COPYMEMBER: LIBLP/LPFSML
           SELECT ML-FILE ASSIGN TO ML-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY ML1-KEY
                  ALTERNATE RECORD KEY ML2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
