      * COPYMEMBER: LIBLP/LPFSLTB BANKRUPTCY TRAILER
           SELECT LTB-FILE ASSIGN TO LTB-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY LTB1-KEY
                  FILE STATUS FILE-STAT.
