      * COPYMEMBER: LIBLP/LPFSLTD DEBIT CARD TRAILER
           SELECT LTD-FILE ASSIGN TO LTD-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY LTD1-KEY
                  FILE STATUS FILE-STAT.
