      * COPYMEMBER: LIBLP/LPFSBX
           SELECT BX-FILE ASSIGN TO BX-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY BX1-KEY
                  FILE STATUS FILE-STAT.
