      * COPYMEMBER: LIBLP/LPFSLTP LOAN PAYMENT SCHEDULE
           SELECT LTP-FILE ASSIGN TO LTP-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY LTP1-KEY
                  FILE STATUS FILE-STAT.
