      * COPYMEMBER: LIBLP/LPFSLTF FEE CODE PAYABLE TRAILER
           SELECT LTF-FILE ASSIGN TO LTF-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY LTF1-KEY
                  FILE STATUS FILE-STAT.
