      * COPYMEMBER: LIBLP/LPFSIX
           SELECT IX-FILE ASSIGN TO IX-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY IX1-KEY
                  ALTERNATE RECORD KEY IX2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
