      * COPYMEMBER: LIBLP/LPFSIR
           SELECT IR-FILE ASSIGN TO IR-PATH
                  ORGANIZATION INDEXED
                  ACCESS MODE DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY IR-KEY
                  FILE STATUS FILE-STAT.
