      * COPYMEMBER: LIBLP/LPFSDL
           SELECT DL-FILE ASSIGN TO DL-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY DL1-KEY
                  ALTERNATE RECORD KEY DL2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
