      * COPYMEMBER: LIBLP/LPFSCI
           SELECT CI-FILE ASSIGN TO CI-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY CI1-KEY
                  ALTERNATE RECORD KEY CI2-KEY WITH DUPLICATES
                  ALTERNATE RECORD KEY CI3-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
