      * COPYMEMBER: LIBSP/SPFSEW
           SELECT EW-FILE ASSIGN TO EW-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY EW1-KEY
                  ALTERNATE RECORD KEY EW2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
