      * COPYMEMBER: LIBSP/SPFSEP
           SELECT EP-FILE ASSIGN TO EP-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY EP1-KEY
                  FILE STATUS FILE-STAT.
