      * COPYMEMBER: LIBSP/SPFSAQ
           SELECT AQ-FILE ASSIGN TO AQ-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY AQ1-KEY
                  ALTERNATE RECORD KEY AQ2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
