      * COPYMEMBER: LIBCL/ORIGRBW
      ******************************************************
      *   ORIGRBW
      *                 (CL)
      *   DESCRIPTION:  WORLD CONVERTED ACCOUNTS
      *                 ENTRY OF ORIGINAL INTEREST REBATE
      *                 FOR PAID OUT ACCOUNTS
      *
      *  REV:
      ******************************************************
       01  ORIGRB-BUF.
           03  ORIGRB-INTCHG        PIC 9(7)V99.
           03  ORIGRB-OWNBR         PIC 9(4).
           03  ORIGRB-ACCTNO        PIC 9(8).
           03  ORIGRB-INT-REBATE    PIC 9(7)V99.
