      * COPYMEMBER: LIBCL/SFDLO3W
       01  SFDLO3-WORKERS.
           03  SFDLO3-PREM         PIC S9(6)V99.
           03  SFDLO3-COMM         PIC S9(6)V99.
           03  SFDLO3-DLPROC       PIC S9(6)V99.
           03  SFDLO3-ORGST        PIC XX.
