      *-----------------------------------------------------------------
       CLOSE-GB-FILE.

           PERFORM CLOSE-IT.
           IF ( GB-CURSOR-STAT-GOOD )
              EXEC SQL
                   CLOSE GB_CURSOR
              END-EXEC
              MOVE STAT---BAD TO GB-CURSOR-STAT.

      *================================================================*
      * END COPYBOOK: LIBGB\GBGBRN.CPY                                *
      *================================================================*
      *================================================================*
      * EMBEDDED COPYBOOK: LIBLP\LPEDPATHIO.CPY                           *
      *================================================================*
      * COPYMEMBER: LIBLP/LPEDPATHIO
      *-----------------------------------------------------------------
