      *-----------------------------------------------------------------
       CLOSE-SPC1-FILE.
           PERFORM CLOSE-IT.

      *================================================================*
      * END COPYBOOK: LIBLP\LPSP1RN.CPY                                *
      *================================================================*
      *================================================================*
      * EMBEDDED COPYBOOK: LIBLP\LPBW1RN.CPY                           *
      *================================================================*
      * COPYMEMBER: LIBLP/LPBW1RN
