       DEFPOL-MINIMUM-MONTHS-NEXT.
           PERFORM READ-LP1-FILE-PREVIOUS.
           IF IO-FG NOT = 0
              GO TO DEFPOL-MINIMUM-MONTHS-BETWEEN-EXIT.

           IF (LP-BRNO NOT = LN-OWNBR) OR (LP-ACCTNO NOT = LN-ACCTNO)
              GO TO DEFPOL-MINIMUM-MONTHS-BETWEEN-EXIT.

           IF LP-TRCD = "RV" OR LP-REV = "Y"
              GO TO DEFPOL-MINIMUM-MONTHS-NEXT.
           IF NOT (LP-TRCD = "DF" OR "D2" OR "D3" OR "D4" OR "D5" OR
                        "D6" OR "D7" OR "D8" OR "D9")
              GO TO DEFPOL-MINIMUM-MONTHS-NEXT.

      * FOUND LAST DEFERMENT, CHECK IF WITHIN MINIMUM MONTHS
           MOVE LP-TRDATE TO NUM-DATE.
      * DEFPOL-DATE = TRANS-DATE
           MOVE DEFPOL-DATE TO SYS-DATE.
           PERFORM TIM360.

           IF ELAPSED-MONTHS < BR-MIN-MONTHS-DEF
              MOVE "D" TO DEFPOL-MAXIMUM
              GO TO DEFPOL-MINIMUM-MONTHS-BETWEEN-EXIT.

