      *-----------------------------------------------------------------
      *    LOAD SPC-REC FROM QSPC-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-SPC-FIELDS.
           MOVE QSPC-ORGST TO SPC-ORGST.
           MOVE QSPC-SPRCLASS TO SPC-SPRCLASS.
           MOVE QSPC-SUBCLASS TO SPC-SUBCLASS.
           MOVE QSPC-LAWCODE TO SPC-LAWCODE.
           MOVE QSPC-INSEARN-ORDER-1 TO SPC-INSEARN-ORDER(1).
           MOVE QSPC-INSEARN-ORDER-2 TO SPC-INSEARN-ORDER(2).
           MOVE QSPC-INSEARN-ORDER-3 TO SPC-INSEARN-ORDER(3).
           MOVE QSPC-INSEARN-ORDER-4 TO SPC-INSEARN-ORDER(4).
           MOVE QSPC-INSEARN-ORDER-5 TO SPC-INSEARN-ORDER(5).
           MOVE QSPC-INSEARN-ORDER-6 TO SPC-INSEARN-ORDER(6).
           MOVE QSPC-INSEARN-ORDER-7 TO SPC-INSEARN-ORDER(7).
           MOVE QSPC-INSEARN-ORDER-8 TO SPC-INSEARN-ORDER(8).
           MOVE QSPC-INSEARN-ORDER-9 TO SPC-INSEARN-ORDER(9).
           MOVE QSPC-INSEARN-ORDER-10 TO SPC-INSEARN-ORDER(10).
           MOVE QSPC-INSEARN-ORDER-11 TO SPC-INSEARN-ORDER(11).
           MOVE QSPC-INSEARN-ORDER-12 TO SPC-INSEARN-ORDER(12).
           MOVE QSPC-INSAH-JOINT-FG TO SPC-INSAH-JOINT-FG.
           MOVE QSPC-INS-O1-EDIT TO SPC-INS-O1-EDIT.
           MOVE QSPC-INS-O2-EDIT TO SPC-INS-O2-EDIT.
           MOVE QSPC-RBFRMLA-1 TO SPC-RBFRMLA(1).
           MOVE QSPC-RBDTE-1-1 TO SPC-RBDTE(1 1).
           MOVE QSPC-RBDAYS-1-1 TO SPC-RBDAYS(1 1).
           MOVE QSPC-RBYRTYPE-1-1 TO SPC-RBYRTYPE(1 1).
           MOVE QSPC-RBDTE-1-2 TO SPC-RBDTE(1 2).
           MOVE QSPC-RBDAYS-1-2 TO SPC-RBDAYS(1 2).
           MOVE QSPC-RBYRTYPE-1-2 TO SPC-RBYRTYPE(1 2).
           MOVE QSPC-RBMINRET-1 TO SPC-RBMINRET(1).
           MOVE QSPC-RBNOMON-1 TO SPC-RBNOMON(1).
           MOVE QSPC-RBDEDCHG-1 TO SPC-RBDEDCHG(1).
           MOVE QSPC-RBRECAST-1 TO SPC-RBRECAST(1).
           MOVE QSPC-RBEARLY-1 TO SPC-RBEARLY(1).
           MOVE QSPC-RBDEFER-1 TO SPC-RBDEFER(1).
           MOVE QSPC-RBPCT-1 TO SPC-RBPCT(1).
           MOVE QSPC-RBREDUC-1 TO SPC-RBREDUC(1).
           MOVE QSPC-RBMIN-1 TO SPC-RBMIN(1).
           MOVE QSPC-RBSPOPT1-1 TO SPC-RBSPOPT1(1).
           MOVE QSPC-RBSPOPT2-1 TO SPC-RBSPOPT2(1).
           MOVE QSPC-RBMANAGER-1 TO SPC-RBMANAGER(1).
           MOVE QSPC-RBUNITPER-CD-1 TO SPC-RBUNITPER-CD(1).
           MOVE QSPC-RBFRMLA2-1 TO SPC-RBFRMLA2(1).
           MOVE QSPC-RBFRMLA-2 TO SPC-RBFRMLA(2).
           MOVE QSPC-RBDTE-2-1 TO SPC-RBDTE(2 1).
           MOVE QSPC-RBDAYS-2-1 TO SPC-RBDAYS(2 1).
           MOVE QSPC-RBYRTYPE-2-1 TO SPC-RBYRTYPE(2 1).
           MOVE QSPC-RBDTE-2-2 TO SPC-RBDTE(2 2).
           MOVE QSPC-RBDAYS-2-2 TO SPC-RBDAYS(2 2).
           MOVE QSPC-RBYRTYPE-2-2 TO SPC-RBYRTYPE(2 2).
           MOVE QSPC-RBMINRET-2 TO SPC-RBMINRET(2).
           MOVE QSPC-RBNOMON-2 TO SPC-RBNOMON(2).
           MOVE QSPC-RBDEDCHG-2 TO SPC-RBDEDCHG(2).
           MOVE QSPC-RBRECAST-2 TO SPC-RBRECAST(2).
           MOVE QSPC-RBEARLY-2 TO SPC-RBEARLY(2).
           MOVE QSPC-RBDEFER-2 TO SPC-RBDEFER(2).
           MOVE QSPC-RBPCT-2 TO SPC-RBPCT(2).
           MOVE QSPC-RBREDUC-2 TO SPC-RBREDUC(2).
           MOVE QSPC-RBMIN-2 TO SPC-RBMIN(2).
           MOVE QSPC-RBSPOPT1-2 TO SPC-RBSPOPT1(2).
           MOVE QSPC-RBSPOPT2-2 TO SPC-RBSPOPT2(2).
           MOVE QSPC-RBMANAGER-2 TO SPC-RBMANAGER(2).
           MOVE QSPC-RBUNITPER-CD-2 TO SPC-RBUNITPER-CD(2).
           MOVE QSPC-RBFRMLA2-2 TO SPC-RBFRMLA2(2).
           MOVE QSPC-RBFRMLA-3 TO SPC-RBFRMLA(3).
           MOVE QSPC-RBDTE-3-1 TO SPC-RBDTE(3 1).
           MOVE QSPC-RBDAYS-3-1 TO SPC-RBDAYS(3 1).
           MOVE QSPC-RBYRTYPE-3-1 TO SPC-RBYRTYPE(3 1).
           MOVE QSPC-RBDTE-3-2 TO SPC-RBDTE(3 2).
           MOVE QSPC-RBDAYS-3-2 TO SPC-RBDAYS(3 2).
           MOVE QSPC-RBYRTYPE-3-2 TO SPC-RBYRTYPE(3 2).
           MOVE QSPC-RBMINRET-3 TO SPC-RBMINRET(3).
           MOVE QSPC-RBNOMON-3 TO SPC-RBNOMON(3).
           MOVE QSPC-RBDEDCHG-3 TO SPC-RBDEDCHG(3).
           MOVE QSPC-RBRECAST-3 TO SPC-RBRECAST(3).
           MOVE QSPC-RBEARLY-3 TO SPC-RBEARLY(3).
           MOVE QSPC-RBDEFER-3 TO SPC-RBDEFER(3).
           MOVE QSPC-RBPCT-3 TO SPC-RBPCT(3).
           MOVE QSPC-RBREDUC-3 TO SPC-RBREDUC(3).
           MOVE QSPC-RBMIN-3 TO SPC-RBMIN(3).
           MOVE QSPC-RBSPOPT1-3 TO SPC-RBSPOPT1(3).
           MOVE QSPC-RBSPOPT2-3 TO SPC-RBSPOPT2(3).
           MOVE QSPC-RBMANAGER-3 TO SPC-RBMANAGER(3).
           MOVE QSPC-RBUNITPER-CD-3 TO SPC-RBUNITPER-CD(3).
           MOVE QSPC-RBFRMLA2-3 TO SPC-RBFRMLA2(3).
           MOVE QSPC-RBFRMLA-4 TO SPC-RBFRMLA(4).
           MOVE QSPC-RBDTE-4-1 TO SPC-RBDTE(4 1).
           MOVE QSPC-RBDAYS-4-1 TO SPC-RBDAYS(4 1).
           MOVE QSPC-RBYRTYPE-4-1 TO SPC-RBYRTYPE(4 1).
           MOVE QSPC-RBDTE-4-2 TO SPC-RBDTE(4 2).
           MOVE QSPC-RBDAYS-4-2 TO SPC-RBDAYS(4 2).
           MOVE QSPC-RBYRTYPE-4-2 TO SPC-RBYRTYPE(4 2).
           MOVE QSPC-RBMINRET-4 TO SPC-RBMINRET(4).
           MOVE QSPC-RBNOMON-4 TO SPC-RBNOMON(4).
           MOVE QSPC-RBDEDCHG-4 TO SPC-RBDEDCHG(4).
           MOVE QSPC-RBRECAST-4 TO SPC-RBRECAST(4).
           MOVE QSPC-RBEARLY-4 TO SPC-RBEARLY(4).
           MOVE QSPC-RBDEFER-4 TO SPC-RBDEFER(4).
           MOVE QSPC-RBPCT-4 TO SPC-RBPCT(4).
           MOVE QSPC-RBREDUC-4 TO SPC-RBREDUC(4).
           MOVE QSPC-RBMIN-4 TO SPC-RBMIN(4).
           MOVE QSPC-RBSPOPT1-4 TO SPC-RBSPOPT1(4).
           MOVE QSPC-RBSPOPT2-4 TO SPC-RBSPOPT2(4).
           MOVE QSPC-RBMANAGER-4 TO SPC-RBMANAGER(4).
           MOVE QSPC-RBUNITPER-CD-4 TO SPC-RBUNITPER-CD(4).
           MOVE QSPC-RBFRMLA2-4 TO SPC-RBFRMLA2(4).
           MOVE QSPC-RBFRMLA-5 TO SPC-RBFRMLA(5).
           MOVE QSPC-RBDTE-5-1 TO SPC-RBDTE(5 1).
           MOVE QSPC-RBDAYS-5-1 TO SPC-RBDAYS(5 1).
           MOVE QSPC-RBYRTYPE-5-1 TO SPC-RBYRTYPE(5 1).
           MOVE QSPC-RBDTE-5-2 TO SPC-RBDTE(5 2).
           MOVE QSPC-RBDAYS-5-2 TO SPC-RBDAYS(5 2).
           MOVE QSPC-RBYRTYPE-5-2 TO SPC-RBYRTYPE(5 2).
           MOVE QSPC-RBMINRET-5 TO SPC-RBMINRET(5).
           MOVE QSPC-RBNOMON-5 TO SPC-RBNOMON(5).
           MOVE QSPC-RBDEDCHG-5 TO SPC-RBDEDCHG(5).
           MOVE QSPC-RBRECAST-5 TO SPC-RBRECAST(5).
           MOVE QSPC-RBEARLY-5 TO SPC-RBEARLY(5).
           MOVE QSPC-RBDEFER-5 TO SPC-RBDEFER(5).
           MOVE QSPC-RBPCT-5 TO SPC-RBPCT(5).
           MOVE QSPC-RBREDUC-5 TO SPC-RBREDUC(5).
           MOVE QSPC-RBMIN-5 TO SPC-RBMIN(5).
           MOVE QSPC-RBSPOPT1-5 TO SPC-RBSPOPT1(5).
           MOVE QSPC-RBSPOPT2-5 TO SPC-RBSPOPT2(5).
           MOVE QSPC-RBMANAGER-5 TO SPC-RBMANAGER(5).
           MOVE QSPC-RBUNITPER-CD-5 TO SPC-RBUNITPER-CD(5).
           MOVE QSPC-RBFRMLA2-5 TO SPC-RBFRMLA2(5).
           MOVE QSPC-RBFRMLA-6 TO SPC-RBFRMLA(6).
           MOVE QSPC-RBDTE-6-1 TO SPC-RBDTE(6 1).
           MOVE QSPC-RBDAYS-6-1 TO SPC-RBDAYS(6 1).
           MOVE QSPC-RBYRTYPE-6-1 TO SPC-RBYRTYPE(6 1).
           MOVE QSPC-RBDTE-6-2 TO SPC-RBDTE(6 2).
           MOVE QSPC-RBDAYS-6-2 TO SPC-RBDAYS(6 2).
           MOVE QSPC-RBYRTYPE-6-2 TO SPC-RBYRTYPE(6 2).
           MOVE QSPC-RBMINRET-6 TO SPC-RBMINRET(6).
           MOVE QSPC-RBNOMON-6 TO SPC-RBNOMON(6).
           MOVE QSPC-RBDEDCHG-6 TO SPC-RBDEDCHG(6).
           MOVE QSPC-RBRECAST-6 TO SPC-RBRECAST(6).
           MOVE QSPC-RBEARLY-6 TO SPC-RBEARLY(6).
           MOVE QSPC-RBDEFER-6 TO SPC-RBDEFER(6).
           MOVE QSPC-RBPCT-6 TO SPC-RBPCT(6).
           MOVE QSPC-RBREDUC-6 TO SPC-RBREDUC(6).
           MOVE QSPC-RBMIN-6 TO SPC-RBMIN(6).
           MOVE QSPC-RBSPOPT1-6 TO SPC-RBSPOPT1(6).
           MOVE QSPC-RBSPOPT2-6 TO SPC-RBSPOPT2(6).
           MOVE QSPC-RBMANAGER-6 TO SPC-RBMANAGER(6).
           MOVE QSPC-RBUNITPER-CD-6 TO SPC-RBUNITPER-CD(6).
           MOVE QSPC-RBFRMLA2-6 TO SPC-RBFRMLA2(6).
           MOVE QSPC-RBFRMLA-7 TO SPC-RBFRMLA(7).
           MOVE QSPC-RBDTE-7-1 TO SPC-RBDTE(7 1).
           MOVE QSPC-RBDAYS-7-1 TO SPC-RBDAYS(7 1).
           MOVE QSPC-RBYRTYPE-7-1 TO SPC-RBYRTYPE(7 1).
           MOVE QSPC-RBDTE-7-2 TO SPC-RBDTE(7 2).
           MOVE QSPC-RBDAYS-7-2 TO SPC-RBDAYS(7 2).
           MOVE QSPC-RBYRTYPE-7-2 TO SPC-RBYRTYPE(7 2).
           MOVE QSPC-RBMINRET-7 TO SPC-RBMINRET(7).
           MOVE QSPC-RBNOMON-7 TO SPC-RBNOMON(7).
           MOVE QSPC-RBDEDCHG-7 TO SPC-RBDEDCHG(7).
           MOVE QSPC-RBRECAST-7 TO SPC-RBRECAST(7).
           MOVE QSPC-RBEARLY-7 TO SPC-RBEARLY(7).
           MOVE QSPC-RBDEFER-7 TO SPC-RBDEFER(7).
           MOVE QSPC-RBPCT-7 TO SPC-RBPCT(7).
           MOVE QSPC-RBREDUC-7 TO SPC-RBREDUC(7).
           MOVE QSPC-RBMIN-7 TO SPC-RBMIN(7).
           MOVE QSPC-RBSPOPT1-7 TO SPC-RBSPOPT1(7).
           MOVE QSPC-RBSPOPT2-7 TO SPC-RBSPOPT2(7).
           MOVE QSPC-RBMANAGER-7 TO SPC-RBMANAGER(7).
           MOVE QSPC-RBUNITPER-CD-7 TO SPC-RBUNITPER-CD(7).
           MOVE QSPC-RBFRMLA2-7 TO SPC-RBFRMLA2(7).
           MOVE QSPC-RBFRMLA-8 TO SPC-RBFRMLA(8).
           MOVE QSPC-RBDTE-8-1 TO SPC-RBDTE(8 1).
           MOVE QSPC-RBDAYS-8-1 TO SPC-RBDAYS(8 1).
           MOVE QSPC-RBYRTYPE-8-1 TO SPC-RBYRTYPE(8 1).
           MOVE QSPC-RBDTE-8-2 TO SPC-RBDTE(8 2).
           MOVE QSPC-RBDAYS-8-2 TO SPC-RBDAYS(8 2).
           MOVE QSPC-RBYRTYPE-8-2 TO SPC-RBYRTYPE(8 2).
           MOVE QSPC-RBMINRET-8 TO SPC-RBMINRET(8).
           MOVE QSPC-RBNOMON-8 TO SPC-RBNOMON(8).
           MOVE QSPC-RBDEDCHG-8 TO SPC-RBDEDCHG(8).
           MOVE QSPC-RBRECAST-8 TO SPC-RBRECAST(8).
           MOVE QSPC-RBEARLY-8 TO SPC-RBEARLY(8).
           MOVE QSPC-RBDEFER-8 TO SPC-RBDEFER(8).
           MOVE QSPC-RBPCT-8 TO SPC-RBPCT(8).
           MOVE QSPC-RBREDUC-8 TO SPC-RBREDUC(8).
           MOVE QSPC-RBMIN-8 TO SPC-RBMIN(8).
           MOVE QSPC-RBSPOPT1-8 TO SPC-RBSPOPT1(8).
           MOVE QSPC-RBSPOPT2-8 TO SPC-RBSPOPT2(8).
           MOVE QSPC-RBMANAGER-8 TO SPC-RBMANAGER(8).
           MOVE QSPC-RBUNITPER-CD-8 TO SPC-RBUNITPER-CD(8).
           MOVE QSPC-RBFRMLA2-8 TO SPC-RBFRMLA2(8).
           MOVE QSPC-RBFRMLA-9 TO SPC-RBFRMLA(9).
           MOVE QSPC-RBDTE-9-1 TO SPC-RBDTE(9 1).
           MOVE QSPC-RBDAYS-9-1 TO SPC-RBDAYS(9 1).
           MOVE QSPC-RBYRTYPE-9-1 TO SPC-RBYRTYPE(9 1).
           MOVE QSPC-RBDTE-9-2 TO SPC-RBDTE(9 2).
           MOVE QSPC-RBDAYS-9-2 TO SPC-RBDAYS(9 2).
           MOVE QSPC-RBYRTYPE-9-2 TO SPC-RBYRTYPE(9 2).
           MOVE QSPC-RBMINRET-9 TO SPC-RBMINRET(9).
           MOVE QSPC-RBNOMON-9 TO SPC-RBNOMON(9).
           MOVE QSPC-RBDEDCHG-9 TO SPC-RBDEDCHG(9).
           MOVE QSPC-RBRECAST-9 TO SPC-RBRECAST(9).
           MOVE QSPC-RBEARLY-9 TO SPC-RBEARLY(9).
           MOVE QSPC-RBDEFER-9 TO SPC-RBDEFER(9).
           MOVE QSPC-RBPCT-9 TO SPC-RBPCT(9).
           MOVE QSPC-RBREDUC-9 TO SPC-RBREDUC(9).
           MOVE QSPC-RBMIN-9 TO SPC-RBMIN(9).
           MOVE QSPC-RBSPOPT1-9 TO SPC-RBSPOPT1(9).
           MOVE QSPC-RBSPOPT2-9 TO SPC-RBSPOPT2(9).
           MOVE QSPC-RBMANAGER-9 TO SPC-RBMANAGER(9).
           MOVE QSPC-RBUNITPER-CD-9 TO SPC-RBUNITPER-CD(9).
           MOVE QSPC-RBFRMLA2-9 TO SPC-RBFRMLA2(9).
           MOVE QSPC-RBFRMLA-10 TO SPC-RBFRMLA(10).
           MOVE QSPC-RBDTE-10-1 TO SPC-RBDTE(10 1).
           MOVE QSPC-RBDAYS-10-1 TO SPC-RBDAYS(10 1).
           MOVE QSPC-RBYRTYPE-10-1 TO SPC-RBYRTYPE(10 1).
           MOVE QSPC-RBDTE-10-2 TO SPC-RBDTE(10 2).
           MOVE QSPC-RBDAYS-10-2 TO SPC-RBDAYS(10 2).
           MOVE QSPC-RBYRTYPE-10-2 TO SPC-RBYRTYPE(10 2).
           MOVE QSPC-RBMINRET-10 TO SPC-RBMINRET(10).
           MOVE QSPC-RBNOMON-10 TO SPC-RBNOMON(10).
           MOVE QSPC-RBDEDCHG-10 TO SPC-RBDEDCHG(10).
           MOVE QSPC-RBRECAST-10 TO SPC-RBRECAST(10).
           MOVE QSPC-RBEARLY-10 TO SPC-RBEARLY(10).
           MOVE QSPC-RBDEFER-10 TO SPC-RBDEFER(10).
           MOVE QSPC-RBPCT-10 TO SPC-RBPCT(10).
           MOVE QSPC-RBREDUC-10 TO SPC-RBREDUC(10).
           MOVE QSPC-RBMIN-10 TO SPC-RBMIN(10).
           MOVE QSPC-RBSPOPT1-10 TO SPC-RBSPOPT1(10).
           MOVE QSPC-RBSPOPT2-10 TO SPC-RBSPOPT2(10).
           MOVE QSPC-RBMANAGER-10 TO SPC-RBMANAGER(10).
           MOVE QSPC-RBUNITPER-CD-10 TO SPC-RBUNITPER-CD(10).
           MOVE QSPC-RBFRMLA2-10 TO SPC-RBFRMLA2(10).
           MOVE QSPC-RBFRMLA-11 TO SPC-RBFRMLA(11).
           MOVE QSPC-RBDTE-11-1 TO SPC-RBDTE(11 1).
           MOVE QSPC-RBDAYS-11-1 TO SPC-RBDAYS(11 1).
           MOVE QSPC-RBYRTYPE-11-1 TO SPC-RBYRTYPE(11 1).
           MOVE QSPC-RBDTE-11-2 TO SPC-RBDTE(11 2).
           MOVE QSPC-RBDAYS-11-2 TO SPC-RBDAYS(11 2).
           MOVE QSPC-RBYRTYPE-11-2 TO SPC-RBYRTYPE(11 2).
           MOVE QSPC-RBMINRET-11 TO SPC-RBMINRET(11).
           MOVE QSPC-RBNOMON-11 TO SPC-RBNOMON(11).
           MOVE QSPC-RBDEDCHG-11 TO SPC-RBDEDCHG(11).
           MOVE QSPC-RBRECAST-11 TO SPC-RBRECAST(11).
           MOVE QSPC-RBEARLY-11 TO SPC-RBEARLY(11).
           MOVE QSPC-RBDEFER-11 TO SPC-RBDEFER(11).
           MOVE QSPC-RBPCT-11 TO SPC-RBPCT(11).
           MOVE QSPC-RBREDUC-11 TO SPC-RBREDUC(11).
           MOVE QSPC-RBMIN-11 TO SPC-RBMIN(11).
           MOVE QSPC-RBSPOPT1-11 TO SPC-RBSPOPT1(11).
           MOVE QSPC-RBSPOPT2-11 TO SPC-RBSPOPT2(11).
           MOVE QSPC-RBMANAGER-11 TO SPC-RBMANAGER(11).
           MOVE QSPC-RBUNITPER-CD-11 TO SPC-RBUNITPER-CD(11).
           MOVE QSPC-RBFRMLA2-11 TO SPC-RBFRMLA2(11).
           MOVE QSPC-RBFRMLA-12 TO SPC-RBFRMLA(12).
           MOVE QSPC-RBDTE-12-1 TO SPC-RBDTE(12 1).
           MOVE QSPC-RBDAYS-12-1 TO SPC-RBDAYS(12 1).
           MOVE QSPC-RBYRTYPE-12-1 TO SPC-RBYRTYPE(12 1).
           MOVE QSPC-RBDTE-12-2 TO SPC-RBDTE(12 2).
           MOVE QSPC-RBDAYS-12-2 TO SPC-RBDAYS(12 2).
           MOVE QSPC-RBYRTYPE-12-2 TO SPC-RBYRTYPE(12 2).
           MOVE QSPC-RBMINRET-12 TO SPC-RBMINRET(12).
           MOVE QSPC-RBNOMON-12 TO SPC-RBNOMON(12).
           MOVE QSPC-RBDEDCHG-12 TO SPC-RBDEDCHG(12).
           MOVE QSPC-RBRECAST-12 TO SPC-RBRECAST(12).
           MOVE QSPC-RBEARLY-12 TO SPC-RBEARLY(12).
           MOVE QSPC-RBDEFER-12 TO SPC-RBDEFER(12).
           MOVE QSPC-RBPCT-12 TO SPC-RBPCT(12).
           MOVE QSPC-RBREDUC-12 TO SPC-RBREDUC(12).
           MOVE QSPC-RBMIN-12 TO SPC-RBMIN(12).
           MOVE QSPC-RBSPOPT1-12 TO SPC-RBSPOPT1(12).
           MOVE QSPC-RBSPOPT2-12 TO SPC-RBSPOPT2(12).
           MOVE QSPC-RBMANAGER-12 TO SPC-RBMANAGER(12).
           MOVE QSPC-RBUNITPER-CD-12 TO SPC-RBUNITPER-CD(12).
           MOVE QSPC-RBFRMLA2-12 TO SPC-RBFRMLA2(12).
           MOVE QSPC-RBFRMLA-13 TO SPC-RBFRMLA(13).
           MOVE QSPC-RBDTE-13-1 TO SPC-RBDTE(13 1).
           MOVE QSPC-RBDAYS-13-1 TO SPC-RBDAYS(13 1).
           MOVE QSPC-RBYRTYPE-13-1 TO SPC-RBYRTYPE(13 1).
           MOVE QSPC-RBDTE-13-2 TO SPC-RBDTE(13 2).
           MOVE QSPC-RBDAYS-13-2 TO SPC-RBDAYS(13 2).
           MOVE QSPC-RBYRTYPE-13-2 TO SPC-RBYRTYPE(13 2).
           MOVE QSPC-RBMINRET-13 TO SPC-RBMINRET(13).
           MOVE QSPC-RBNOMON-13 TO SPC-RBNOMON(13).
           MOVE QSPC-RBDEDCHG-13 TO SPC-RBDEDCHG(13).
           MOVE QSPC-RBRECAST-13 TO SPC-RBRECAST(13).
           MOVE QSPC-RBEARLY-13 TO SPC-RBEARLY(13).
           MOVE QSPC-RBDEFER-13 TO SPC-RBDEFER(13).
           MOVE QSPC-RBPCT-13 TO SPC-RBPCT(13).
           MOVE QSPC-RBREDUC-13 TO SPC-RBREDUC(13).
           MOVE QSPC-RBMIN-13 TO SPC-RBMIN(13).
           MOVE QSPC-RBSPOPT1-13 TO SPC-RBSPOPT1(13).
           MOVE QSPC-RBSPOPT2-13 TO SPC-RBSPOPT2(13).
           MOVE QSPC-RBMANAGER-13 TO SPC-RBMANAGER(13).
           MOVE QSPC-RBUNITPER-CD-13 TO SPC-RBUNITPER-CD(13).
           MOVE QSPC-RBFRMLA2-13 TO SPC-RBFRMLA2(13).
           MOVE QSPC-RBFRMLA-14 TO SPC-RBFRMLA(14).
           MOVE QSPC-RBDTE-14-1 TO SPC-RBDTE(14 1).
           MOVE QSPC-RBDAYS-14-1 TO SPC-RBDAYS(14 1).
           MOVE QSPC-RBYRTYPE-14-1 TO SPC-RBYRTYPE(14 1).
           MOVE QSPC-RBDTE-14-2 TO SPC-RBDTE(14 2).
           MOVE QSPC-RBDAYS-14-2 TO SPC-RBDAYS(14 2).
           MOVE QSPC-RBYRTYPE-14-2 TO SPC-RBYRTYPE(14 2).
           MOVE QSPC-RBMINRET-14 TO SPC-RBMINRET(14).
           MOVE QSPC-RBNOMON-14 TO SPC-RBNOMON(14).
           MOVE QSPC-RBDEDCHG-14 TO SPC-RBDEDCHG(14).
           MOVE QSPC-RBRECAST-14 TO SPC-RBRECAST(14).
           MOVE QSPC-RBEARLY-14 TO SPC-RBEARLY(14).
           MOVE QSPC-RBDEFER-14 TO SPC-RBDEFER(14).
           MOVE QSPC-RBPCT-14 TO SPC-RBPCT(14).
           MOVE QSPC-RBREDUC-14 TO SPC-RBREDUC(14).
           MOVE QSPC-RBMIN-14 TO SPC-RBMIN(14).
           MOVE QSPC-RBSPOPT1-14 TO SPC-RBSPOPT1(14).
           MOVE QSPC-RBSPOPT2-14 TO SPC-RBSPOPT2(14).
           MOVE QSPC-RBMANAGER-14 TO SPC-RBMANAGER(14).
           MOVE QSPC-RBUNITPER-CD-14 TO SPC-RBUNITPER-CD(14).
           MOVE QSPC-RBFRMLA2-14 TO SPC-RBFRMLA2(14).
           MOVE QSPC-RBFRMLA-15 TO SPC-RBFRMLA(15).
           MOVE QSPC-RBDTE-15-1 TO SPC-RBDTE(15 1).
           MOVE QSPC-RBDAYS-15-1 TO SPC-RBDAYS(15 1).
           MOVE QSPC-RBYRTYPE-15-1 TO SPC-RBYRTYPE(15 1).
           MOVE QSPC-RBDTE-15-2 TO SPC-RBDTE(15 2).
           MOVE QSPC-RBDAYS-15-2 TO SPC-RBDAYS(15 2).
           MOVE QSPC-RBYRTYPE-15-2 TO SPC-RBYRTYPE(15 2).
           MOVE QSPC-RBMINRET-15 TO SPC-RBMINRET(15).
           MOVE QSPC-RBNOMON-15 TO SPC-RBNOMON(15).
           MOVE QSPC-RBDEDCHG-15 TO SPC-RBDEDCHG(15).
           MOVE QSPC-RBRECAST-15 TO SPC-RBRECAST(15).
           MOVE QSPC-RBEARLY-15 TO SPC-RBEARLY(15).
           MOVE QSPC-RBDEFER-15 TO SPC-RBDEFER(15).
           MOVE QSPC-RBPCT-15 TO SPC-RBPCT(15).
           MOVE QSPC-RBREDUC-15 TO SPC-RBREDUC(15).
           MOVE QSPC-RBMIN-15 TO SPC-RBMIN(15).
           MOVE QSPC-RBSPOPT1-15 TO SPC-RBSPOPT1(15).
           MOVE QSPC-RBSPOPT2-15 TO SPC-RBSPOPT2(15).
           MOVE QSPC-RBMANAGER-15 TO SPC-RBMANAGER(15).
           MOVE QSPC-RBUNITPER-CD-15 TO SPC-RBUNITPER-CD(15).
           MOVE QSPC-RBFRMLA2-15 TO SPC-RBFRMLA2(15).
           MOVE QSPC-RBFRMLA-16 TO SPC-RBFRMLA(16).
           MOVE QSPC-RBDTE-16-1 TO SPC-RBDTE(16 1).
           MOVE QSPC-RBDAYS-16-1 TO SPC-RBDAYS(16 1).
           MOVE QSPC-RBYRTYPE-16-1 TO SPC-RBYRTYPE(16 1).
           MOVE QSPC-RBDTE-16-2 TO SPC-RBDTE(16 2).
           MOVE QSPC-RBDAYS-16-2 TO SPC-RBDAYS(16 2).
           MOVE QSPC-RBYRTYPE-16-2 TO SPC-RBYRTYPE(16 2).
           MOVE QSPC-RBMINRET-16 TO SPC-RBMINRET(16).
           MOVE QSPC-RBNOMON-16 TO SPC-RBNOMON(16).
           MOVE QSPC-RBDEDCHG-16 TO SPC-RBDEDCHG(16).
           MOVE QSPC-RBRECAST-16 TO SPC-RBRECAST(16).
           MOVE QSPC-RBEARLY-16 TO SPC-RBEARLY(16).
           MOVE QSPC-RBDEFER-16 TO SPC-RBDEFER(16).
           MOVE QSPC-RBPCT-16 TO SPC-RBPCT(16).
           MOVE QSPC-RBREDUC-16 TO SPC-RBREDUC(16).
           MOVE QSPC-RBMIN-16 TO SPC-RBMIN(16).
           MOVE QSPC-RBSPOPT1-16 TO SPC-RBSPOPT1(16).
           MOVE QSPC-RBSPOPT2-16 TO SPC-RBSPOPT2(16).
           MOVE QSPC-RBMANAGER-16 TO SPC-RBMANAGER(16).
           MOVE QSPC-RBUNITPER-CD-16 TO SPC-RBUNITPER-CD(16).
           MOVE QSPC-RBFRMLA2-16 TO SPC-RBFRMLA2(16).
           MOVE QSPC-RBFRMLA-17 TO SPC-RBFRMLA(17).
           MOVE QSPC-RBDTE-17-1 TO SPC-RBDTE(17 1).
           MOVE QSPC-RBDAYS-17-1 TO SPC-RBDAYS(17 1).
           MOVE QSPC-RBYRTYPE-17-1 TO SPC-RBYRTYPE(17 1).
           MOVE QSPC-RBDTE-17-2 TO SPC-RBDTE(17 2).
           MOVE QSPC-RBDAYS-17-2 TO SPC-RBDAYS(17 2).
           MOVE QSPC-RBYRTYPE-17-2 TO SPC-RBYRTYPE(17 2).
           MOVE QSPC-RBMINRET-17 TO SPC-RBMINRET(17).
           MOVE QSPC-RBNOMON-17 TO SPC-RBNOMON(17).
           MOVE QSPC-RBDEDCHG-17 TO SPC-RBDEDCHG(17).
           MOVE QSPC-RBRECAST-17 TO SPC-RBRECAST(17).
           MOVE QSPC-RBEARLY-17 TO SPC-RBEARLY(17).
           MOVE QSPC-RBDEFER-17 TO SPC-RBDEFER(17).
           MOVE QSPC-RBPCT-17 TO SPC-RBPCT(17).
           MOVE QSPC-RBREDUC-17 TO SPC-RBREDUC(17).
           MOVE QSPC-RBMIN-17 TO SPC-RBMIN(17).
           MOVE QSPC-RBSPOPT1-17 TO SPC-RBSPOPT1(17).
           MOVE QSPC-RBSPOPT2-17 TO SPC-RBSPOPT2(17).
           MOVE QSPC-RBMANAGER-17 TO SPC-RBMANAGER(17).
           MOVE QSPC-RBUNITPER-CD-17 TO SPC-RBUNITPER-CD(17).
           MOVE QSPC-RBFRMLA2-17 TO SPC-RBFRMLA2(17).
           MOVE QSPC-RBFRMLA-18 TO SPC-RBFRMLA(18).
           MOVE QSPC-RBDTE-18-1 TO SPC-RBDTE(18 1).
           MOVE QSPC-RBDAYS-18-1 TO SPC-RBDAYS(18 1).
           MOVE QSPC-RBYRTYPE-18-1 TO SPC-RBYRTYPE(18 1).
           MOVE QSPC-RBDTE-18-2 TO SPC-RBDTE(18 2).
           MOVE QSPC-RBDAYS-18-2 TO SPC-RBDAYS(18 2).
           MOVE QSPC-RBYRTYPE-18-2 TO SPC-RBYRTYPE(18 2).
           MOVE QSPC-RBMINRET-18 TO SPC-RBMINRET(18).
           MOVE QSPC-RBNOMON-18 TO SPC-RBNOMON(18).
           MOVE QSPC-RBDEDCHG-18 TO SPC-RBDEDCHG(18).
           MOVE QSPC-RBRECAST-18 TO SPC-RBRECAST(18).
           MOVE QSPC-RBEARLY-18 TO SPC-RBEARLY(18).
           MOVE QSPC-RBDEFER-18 TO SPC-RBDEFER(18).
           MOVE QSPC-RBPCT-18 TO SPC-RBPCT(18).
           MOVE QSPC-RBREDUC-18 TO SPC-RBREDUC(18).
           MOVE QSPC-RBMIN-18 TO SPC-RBMIN(18).
           MOVE QSPC-RBSPOPT1-18 TO SPC-RBSPOPT1(18).
           MOVE QSPC-RBSPOPT2-18 TO SPC-RBSPOPT2(18).
           MOVE QSPC-RBMANAGER-18 TO SPC-RBMANAGER(18).
           MOVE QSPC-RBUNITPER-CD-18 TO SPC-RBUNITPER-CD(18).
           MOVE QSPC-RBFRMLA2-18 TO SPC-RBFRMLA2(18).
           MOVE QSPC-RBFRMLA-19 TO SPC-RBFRMLA(19).
           MOVE QSPC-RBDTE-19-1 TO SPC-RBDTE(19 1).
           MOVE QSPC-RBDAYS-19-1 TO SPC-RBDAYS(19 1).
           MOVE QSPC-RBYRTYPE-19-1 TO SPC-RBYRTYPE(19 1).
           MOVE QSPC-RBDTE-19-2 TO SPC-RBDTE(19 2).
           MOVE QSPC-RBDAYS-19-2 TO SPC-RBDAYS(19 2).
           MOVE QSPC-RBYRTYPE-19-2 TO SPC-RBYRTYPE(19 2).
           MOVE QSPC-RBMINRET-19 TO SPC-RBMINRET(19).
           MOVE QSPC-RBNOMON-19 TO SPC-RBNOMON(19).
           MOVE QSPC-RBDEDCHG-19 TO SPC-RBDEDCHG(19).
           MOVE QSPC-RBRECAST-19 TO SPC-RBRECAST(19).
           MOVE QSPC-RBEARLY-19 TO SPC-RBEARLY(19).
           MOVE QSPC-RBDEFER-19 TO SPC-RBDEFER(19).
           MOVE QSPC-RBPCT-19 TO SPC-RBPCT(19).
           MOVE QSPC-RBREDUC-19 TO SPC-RBREDUC(19).
           MOVE QSPC-RBMIN-19 TO SPC-RBMIN(19).
           MOVE QSPC-RBSPOPT1-19 TO SPC-RBSPOPT1(19).
           MOVE QSPC-RBSPOPT2-19 TO SPC-RBSPOPT2(19).
           MOVE QSPC-RBMANAGER-19 TO SPC-RBMANAGER(19).
           MOVE QSPC-RBUNITPER-CD-19 TO SPC-RBUNITPER-CD(19).
           MOVE QSPC-RBFRMLA2-19 TO SPC-RBFRMLA2(19).
           MOVE QSPC-RBFRMLA-20 TO SPC-RBFRMLA(20).
           MOVE QSPC-RBDTE-20-1 TO SPC-RBDTE(20 1).
           MOVE QSPC-RBDAYS-20-1 TO SPC-RBDAYS(20 1).
           MOVE QSPC-RBYRTYPE-20-1 TO SPC-RBYRTYPE(20 1).
           MOVE QSPC-RBDTE-20-2 TO SPC-RBDTE(20 2).
           MOVE QSPC-RBDAYS-20-2 TO SPC-RBDAYS(20 2).
           MOVE QSPC-RBYRTYPE-20-2 TO SPC-RBYRTYPE(20 2).
           MOVE QSPC-RBMINRET-20 TO SPC-RBMINRET(20).
           MOVE QSPC-RBNOMON-20 TO SPC-RBNOMON(20).
           MOVE QSPC-RBDEDCHG-20 TO SPC-RBDEDCHG(20).
           MOVE QSPC-RBRECAST-20 TO SPC-RBRECAST(20).
           MOVE QSPC-RBEARLY-20 TO SPC-RBEARLY(20).
           MOVE QSPC-RBDEFER-20 TO SPC-RBDEFER(20).
           MOVE QSPC-RBPCT-20 TO SPC-RBPCT(20).
           MOVE QSPC-RBREDUC-20 TO SPC-RBREDUC(20).
           MOVE QSPC-RBMIN-20 TO SPC-RBMIN(20).
           MOVE QSPC-RBSPOPT1-20 TO SPC-RBSPOPT1(20).
           MOVE QSPC-RBSPOPT2-20 TO SPC-RBSPOPT2(20).
           MOVE QSPC-RBMANAGER-20 TO SPC-RBMANAGER(20).
           MOVE QSPC-RBUNITPER-CD-20 TO SPC-RBUNITPER-CD(20).
           MOVE QSPC-RBFRMLA2-20 TO SPC-RBFRMLA2(20).
           MOVE QSPC-RBFRMLA-21 TO SPC-RBFRMLA(21).
           MOVE QSPC-RBDTE-21-1 TO SPC-RBDTE(21 1).
           MOVE QSPC-RBDAYS-21-1 TO SPC-RBDAYS(21 1).
           MOVE QSPC-RBYRTYPE-21-1 TO SPC-RBYRTYPE(21 1).
           MOVE QSPC-RBDTE-21-2 TO SPC-RBDTE(21 2).
           MOVE QSPC-RBDAYS-21-2 TO SPC-RBDAYS(21 2).
           MOVE QSPC-RBYRTYPE-21-2 TO SPC-RBYRTYPE(21 2).
           MOVE QSPC-RBMINRET-21 TO SPC-RBMINRET(21).
           MOVE QSPC-RBNOMON-21 TO SPC-RBNOMON(21).
           MOVE QSPC-RBDEDCHG-21 TO SPC-RBDEDCHG(21).
           MOVE QSPC-RBRECAST-21 TO SPC-RBRECAST(21).
           MOVE QSPC-RBEARLY-21 TO SPC-RBEARLY(21).
           MOVE QSPC-RBDEFER-21 TO SPC-RBDEFER(21).
           MOVE QSPC-RBPCT-21 TO SPC-RBPCT(21).
           MOVE QSPC-RBREDUC-21 TO SPC-RBREDUC(21).
           MOVE QSPC-RBMIN-21 TO SPC-RBMIN(21).
           MOVE QSPC-RBSPOPT1-21 TO SPC-RBSPOPT1(21).
           MOVE QSPC-RBSPOPT2-21 TO SPC-RBSPOPT2(21).
           MOVE QSPC-RBMANAGER-21 TO SPC-RBMANAGER(21).
           MOVE QSPC-RBUNITPER-CD-21 TO SPC-RBUNITPER-CD(21).
           MOVE QSPC-RBFRMLA2-21 TO SPC-RBFRMLA2(21).
           MOVE QSPC-RBFRMLA-22 TO SPC-RBFRMLA(22).
           MOVE QSPC-RBDTE-22-1 TO SPC-RBDTE(22 1).
           MOVE QSPC-RBDAYS-22-1 TO SPC-RBDAYS(22 1).
           MOVE QSPC-RBYRTYPE-22-1 TO SPC-RBYRTYPE(22 1).
           MOVE QSPC-RBDTE-22-2 TO SPC-RBDTE(22 2).
           MOVE QSPC-RBDAYS-22-2 TO SPC-RBDAYS(22 2).
           MOVE QSPC-RBYRTYPE-22-2 TO SPC-RBYRTYPE(22 2).
           MOVE QSPC-RBMINRET-22 TO SPC-RBMINRET(22).
           MOVE QSPC-RBNOMON-22 TO SPC-RBNOMON(22).
           MOVE QSPC-RBDEDCHG-22 TO SPC-RBDEDCHG(22).
           MOVE QSPC-RBRECAST-22 TO SPC-RBRECAST(22).
           MOVE QSPC-RBEARLY-22 TO SPC-RBEARLY(22).
           MOVE QSPC-RBDEFER-22 TO SPC-RBDEFER(22).
           MOVE QSPC-RBPCT-22 TO SPC-RBPCT(22).
           MOVE QSPC-RBREDUC-22 TO SPC-RBREDUC(22).
           MOVE QSPC-RBMIN-22 TO SPC-RBMIN(22).
           MOVE QSPC-RBSPOPT1-22 TO SPC-RBSPOPT1(22).
           MOVE QSPC-RBSPOPT2-22 TO SPC-RBSPOPT2(22).
           MOVE QSPC-RBMANAGER-22 TO SPC-RBMANAGER(22).
           MOVE QSPC-RBUNITPER-CD-22 TO SPC-RBUNITPER-CD(22).
           MOVE QSPC-RBFRMLA2-22 TO SPC-RBFRMLA2(22).
           MOVE QSPC-RBCOMCD TO SPC-RBCOMCD.
           MOVE QSPC-ADDON-DISFRMLA TO SPC-ADDON-DISFRMLA.
           MOVE QSPC-ADDON-WHOLE-FG TO SPC-ADDON-WHOLE-FG.
           MOVE QSPC-ADDON-ORG-MATURITY TO SPC-ADDON-ORG-MATURITY.
           MOVE QSPC-CONSOLIDATE-RT-FG TO SPC-CONSOLIDATE-RT-FG.
           MOVE QSPC-1STPY-ADDON-DAYS TO SPC-1STPY-ADDON-DAYS.
           MOVE QSPC-1STPY-ADDON-YRTYPE TO SPC-1STPY-ADDON-YRTYPE.
           MOVE QSPC-ADDON-RATE-FG TO SPC-ADDON-RATE-FG.
           MOVE QSPC-ADDON-RATE TO SPC-ADDON-RATE.
           MOVE QSPC-FEEFRMLA-1 TO SPC-FEEFRMLA(1).
           MOVE QSPC-FEECD-1 TO SPC-FEECD(1).
           MOVE QSPC-FEEID-1 TO SPC-FEEID(1).
           MOVE QSPC-FEEFRMLA-2 TO SPC-FEEFRMLA(2).
           MOVE QSPC-FEECD-2 TO SPC-FEECD(2).
           MOVE QSPC-FEEID-2 TO SPC-FEEID(2).
           MOVE QSPC-ROUND-PAY-FG TO SPC-ROUND-PAY-FG.
           MOVE QSPC-IRREGULAR-PAY-FG TO SPC-IRREGULAR-PAY-FG.
           MOVE QSPC-DLRVCHGS-RB-CD-1 TO SPC-DLRVCHGS-RB-CD(1).
           MOVE QSPC-DLRVCHGS-RB-CD-2 TO SPC-DLRVCHGS-RB-CD(2).
           MOVE QSPC-DLRVCHGS-RB-CD-3 TO SPC-DLRVCHGS-RB-CD(3).
           MOVE QSPC-PARVHELD-RB-CD TO SPC-PARVHELD-RB-CD.
           MOVE QSPC-PARVPAID-RB-CD TO SPC-PARVPAID-RB-CD.
           MOVE QSPC-CONTR-CREDIT TO SPC-CONTR-CREDIT.
           MOVE QSPC-CONTR-CREDIT-CD TO SPC-CONTR-CREDIT-CD.
           MOVE QSPC-CONTR-CREDIT-MIN-DEL-PER
              TO SPC-CONTR-CREDIT-MIN-DEL-PER.
           MOVE QSPC-OPT-CAL-CHGABLE TO SPC-OPT-CAL-CHGABLE.
           MOVE QSPC-PBDEL-DAYS TO SPC-PBDEL-DAYS.
           MOVE QSPC-PBINCR-PERCENT TO SPC-PBINCR-PERCENT.
           MOVE QSPC-CPOT30-CD TO SPC-CPOT30-CD.
           MOVE QSPC-CPOTCHGOFF-CD TO SPC-CPOTCHGOFF-CD.
           MOVE QSPC-RDPOT30-CD TO SPC-RDPOT30-CD.
           MOVE QSPC-RDPOTCHGOFF-CD TO SPC-RDPOTCHGOFF-CD.
           MOVE QSPC-MAX-ALLOW-DELINQ TO SPC-MAX-ALLOW-DELINQ.
           MOVE QSPC-RESCIND-BUS-DAYS TO SPC-RESCIND-BUS-DAYS.
           MOVE QSPC-RESCIND-SATURDAY TO SPC-RESCIND-SATURDAY.
           MOVE QSPC-MIN-CREDIT-SCORE TO SPC-MIN-CREDIT-SCORE.
           MOVE QSPC-DUAL-IN-BRANCH TO SPC-DUAL-IN-BRANCH.
           MOVE QSPC-DUAL-IN-STATE TO SPC-DUAL-IN-STATE.
           MOVE QSPC-PACESETTER-FG TO SPC-PACESETTER-FG.
           MOVE QSPC-WAGE-ASSIGN-DAYS TO SPC-WAGE-ASSIGN-DAYS.
           MOVE QSPC-CAL-PAYMENT-ROUND-FG TO SPC-CAL-PAYMENT-ROUND-FG.
           MOVE QSPC-CAN-LOANS-FG TO SPC-CAN-LOANS-FG.
           MOVE QSPC-ALLOW-DELINQ-POLCD TO SPC-ALLOW-DELINQ-POLCD.
           MOVE QSPC-YTD-MAX-ALLOW-DELINQ TO SPC-YTD-MAX-ALLOW-DELINQ.
           MOVE QSPC-LNCOST-FRMLA TO SPC-LNCOST-FRMLA.
           MOVE QSPC-LNCOST-AMT TO SPC-LNCOST-AMT.
           MOVE QSPC-DLDISC-RVPRIN1-PCNT TO SPC-DLDISC-RVPRIN1-PCNT.
           MOVE QSPC-RENEWABLE-PAYS TO SPC-RENEWABLE-PAYS.
           MOVE QSPC-RENEWABLE-DAYS TO SPC-RENEWABLE-DAYS.
           MOVE QSPC-ALLOW-LN-BACK-DATE TO SPC-ALLOW-LN-BACK-DATE.
           MOVE QSPC-DLDISC-RVPRIN1-AF-PCNT
              TO SPC-DLDISC-RVPRIN1-AF-PCNT.
           MOVE QSPC-CAL-MAX-AT-ESTIMATE TO SPC-CAL-MAX-AT-ESTIMATE.
           MOVE QSPC-INSAH-RETRO TO SPC-INSAH-RETRO.
           MOVE QSPC-INSAH-DAYS-WAIT TO SPC-INSAH-DAYS-WAIT.
           MOVE QSPC-ADDON-EXCEPT-FG TO SPC-ADDON-EXCEPT-FG.
           MOVE QSPC-REPO-TRCD-1 TO SPC-REPO-TRCD(1).
           MOVE QSPC-REPO-FMNO-1-1 TO SPC-REPO-FMNO(1 1).
           MOVE QSPC-REPO-FMNO-1-2 TO SPC-REPO-FMNO(1 2).
           MOVE QSPC-REPO-FMNO-1-3 TO SPC-REPO-FMNO(1 3).
           MOVE QSPC-REPO-FMNO-1-4 TO SPC-REPO-FMNO(1 4).
           MOVE QSPC-REPO-TRCD-2 TO SPC-REPO-TRCD(2).
           MOVE QSPC-REPO-FMNO-2-1 TO SPC-REPO-FMNO(2 1).
           MOVE QSPC-REPO-FMNO-2-2 TO SPC-REPO-FMNO(2 2).
           MOVE QSPC-REPO-FMNO-2-3 TO SPC-REPO-FMNO(2 3).
           MOVE QSPC-REPO-FMNO-2-4 TO SPC-REPO-FMNO(2 4).
           MOVE QSPC-REPO-TRCD-3 TO SPC-REPO-TRCD(3).
           MOVE QSPC-REPO-FMNO-3-1 TO SPC-REPO-FMNO(3 1).
           MOVE QSPC-REPO-FMNO-3-2 TO SPC-REPO-FMNO(3 2).
           MOVE QSPC-REPO-FMNO-3-3 TO SPC-REPO-FMNO(3 3).
           MOVE QSPC-REPO-FMNO-3-4 TO SPC-REPO-FMNO(3 4).
           MOVE QSPC-CANCEL-ADDON-FG TO SPC-CANCEL-ADDON-FG.
           MOVE QSPC-DEFAULT-O2-INS-COMP TO SPC-DEFAULT-O2-INS-COMP.
           MOVE QSPC-LC-ON-JUDGEMENTS TO SPC-LC-ON-JUDGEMENTS.
           MOVE QSPC-DELQ-IB-AGE TO SPC-DELQ-IB-AGE.
           MOVE QSPC-DELQ-IB-MAX-DAYS TO SPC-DELQ-IB-MAX-DAYS.
           MOVE QSPC-INSURANCE-WRITTEN TO SPC-INSURANCE-WRITTEN.
           MOVE QSPC-INTERIM-COUPON TO SPC-INTERIM-COUPON.
           MOVE QSPC-AUTO-ASSESS-LCHG TO SPC-AUTO-ASSESS-LCHG.
           MOVE QSPC-MAX-CASH-PROCEEDS TO SPC-MAX-CASH-PROCEEDS.
           MOVE QSPC-ALLOW-ZERO-PROC TO SPC-ALLOW-ZERO-PROC.
           MOVE QSPC-BANKRULE-RATE TO SPC-BANKRULE-RATE.
           MOVE QSPC-AUTO-SEND-TRCD-1 TO SPC-AUTO-SEND-TRCD(1).
           MOVE QSPC-AUTO-SEND-FMNO-1-1 TO SPC-AUTO-SEND-FMNO(1 1).
           MOVE QSPC-AUTO-SEND-FMNO-1-2 TO SPC-AUTO-SEND-FMNO(1 2).
           MOVE QSPC-AUTO-SEND-FMNO-1-3 TO SPC-AUTO-SEND-FMNO(1 3).
           MOVE QSPC-AUTO-SEND-FMNO-1-4 TO SPC-AUTO-SEND-FMNO(1 4).
           MOVE QSPC-AUTO-SEND-TRCD-2 TO SPC-AUTO-SEND-TRCD(2).
           MOVE QSPC-AUTO-SEND-FMNO-2-1 TO SPC-AUTO-SEND-FMNO(2 1).
           MOVE QSPC-AUTO-SEND-FMNO-2-2 TO SPC-AUTO-SEND-FMNO(2 2).
           MOVE QSPC-AUTO-SEND-FMNO-2-3 TO SPC-AUTO-SEND-FMNO(2 3).
           MOVE QSPC-AUTO-SEND-FMNO-2-4 TO SPC-AUTO-SEND-FMNO(2 4).
           MOVE QSPC-DLDISC-CONV-BF-PCNT TO SPC-DLDISC-CONV-BF-PCNT.
           MOVE QSPC-UNITPER-CD TO SPC-UNITPER-CD.
           MOVE QSPC-RENEWAL-EDIT TO SPC-RENEWAL-EDIT.
           MOVE QSPC-ROUND-MFEE TO SPC-ROUND-MFEE.
           MOVE QSPC-ADV-TO-1ST-NO-CORR TO SPC-ADV-TO-1ST-NO-CORR.
           MOVE QSPC-LC-INT-ON-REPO-NON-PL
              TO SPC-LC-INT-ON-REPO-NON-PL.
           MOVE QSPC-CONTRACTUAL-SET-NONACCRUAL
              TO SPC-CONTRACTUAL-SET-NONACCRUAL.
           MOVE QSPC-CONTRACTUAL-RESET-ACCRUAL
              TO SPC-CONTRACTUAL-RESET-ACCRUAL.
           MOVE QSPC-MONTHS-PAY-NAPP-COUNTER
              TO SPC-MONTHS-PAY-NAPP-COUNTER.
           MOVE QSPC-SHORT-PAY-THRESHOLD TO SPC-SHORT-PAY-THRESHOLD.
           MOVE QSPC-CASH-AVAIL-PERCENT TO SPC-CASH-AVAIL-PERCENT.
           MOVE QSPC-O1-JOINT-FG TO SPC-O1-JOINT-FG.
           MOVE QSPC-NET-BAL-REQ TO SPC-NET-BAL-REQ.
           MOVE QSPC-AMT-PROCEEDS-REQ TO SPC-AMT-PROCEEDS-REQ.
           MOVE QSPC-ALT-PREPAY-MONTHS TO SPC-ALT-PREPAY-MONTHS.
           MOVE QSPC-PERCENT-REGPAY-AVAIL TO SPC-PERCENT-REGPAY-AVAIL.
           MOVE QSPC-ALT-DEFFRMLA TO SPC-ALT-DEFFRMLA.
           MOVE QSPC-ALT-DEFMIN TO SPC-ALT-DEFMIN.
           MOVE QSPC-ALT-DEFMAX TO SPC-ALT-DEFMAX.
           MOVE QSPC-NON-LOAN-FLAG TO SPC-NON-LOAN-FLAG.
           MOVE QSPC-SKIP-TRW TO SPC-SKIP-TRW.
 
      *-----------------------------------------------------------------
      *    LOAD QSPC-REC FROM SPC-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
