      *================================================================*
      * EMBEDDED COPYBOOK: LIBLP\LPSPGS_SQL.CPY                           *
      *================================================================*
      * COPYMEMBER: LIBLP/LPSPGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - SPFILE (SPAFILE, SPBFILE, SPCFILE)
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD SPA-REC FROM QSPA-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-SPA-FIELDS.
           MOVE QSPA-ORGST TO SPA-ORGST.
           MOVE QSPA-SPRCLASS TO SPA-SPRCLASS.
           MOVE QSPA-SUBCLASS TO SPA-SUBCLASS.
           MOVE QSPA-LAWCODE TO SPA-LAWCODE.

           IF ( QSPA-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO SPA-LTOUCH-DATE
           ELSE
              MOVE QSPA-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO SPA-LTOUCH-DATE.

           MOVE QSPA-DESC TO SPA-DESC.
           MOVE QSPA-NOTES TO SPA-NOTES.

           IF ( QSPA-EFFDATE = "1900-01-01" )
              MOVE ZEROES TO SPA-EFFDATE
           ELSE
              MOVE QSPA-EFFDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO SPA-EFFDATE.


           IF ( QSPA-EXPDATE = "1900-01-01" )
              MOVE ZEROES TO SPA-EXPDATE
           ELSE
              MOVE QSPA-EXPDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO SPA-EXPDATE.

           MOVE QSPA-EXPD-MONTHS TO SPA-EXPD-MONTHS.
           MOVE QSPA-EXPD-DAYS TO SPA-EXPD-DAYS.
           MOVE QSPA-EXPD-FRMLA TO SPA-EXPD-FRMLA.
           MOVE QSPA-EXPD-EXCEPT TO SPA-EXPD-EXCEPT.
           MOVE QSPA-EXPR-FRMLA TO SPA-EXPR-FRMLA.
           MOVE QSPA-EXPR-REDU-FRMLA TO SPA-EXPR-REDU-FRMLA.
           MOVE QSPA-EXPR-RATE-1 TO SPA-EXPR-RATE(1).
           MOVE QSPA-EXPR-BREAK-1 TO SPA-EXPR-BREAK(1).
           MOVE QSPA-EXPR-YRTYPE-1 TO SPA-EXPR-YRTYPE(1).
           MOVE QSPA-EXPR-INTMETH-1 TO SPA-EXPR-INTMETH(1).
           MOVE QSPA-EXPR-RATE-2 TO SPA-EXPR-RATE(2).
           MOVE QSPA-EXPR-BREAK-2 TO SPA-EXPR-BREAK(2).
           MOVE QSPA-EXPR-YRTYPE-2 TO SPA-EXPR-YRTYPE(2).
           MOVE QSPA-EXPR-INTMETH-2 TO SPA-EXPR-INTMETH(2).
           MOVE QSPA-EXPR-RATE-3 TO SPA-EXPR-RATE(3).
           MOVE QSPA-EXPR-BREAK-3 TO SPA-EXPR-BREAK(3).
           MOVE QSPA-EXPR-YRTYPE-3 TO SPA-EXPR-YRTYPE(3).
           MOVE QSPA-EXPR-INTMETH-3 TO SPA-EXPR-INTMETH(3).
           MOVE QSPA-EXPR-RATE-4 TO SPA-EXPR-RATE(4).
           MOVE QSPA-EXPR-BREAK-4 TO SPA-EXPR-BREAK(4).
           MOVE QSPA-EXPR-YRTYPE-4 TO SPA-EXPR-YRTYPE(4).
           MOVE QSPA-EXPR-INTMETH-4 TO SPA-EXPR-INTMETH(4).
           MOVE QSPA-EXPR-RATE-5 TO SPA-EXPR-RATE(5).
           MOVE QSPA-EXPR-BREAK-5 TO SPA-EXPR-BREAK(5).
           MOVE QSPA-EXPR-YRTYPE-5 TO SPA-EXPR-YRTYPE(5).
           MOVE QSPA-EXPR-INTMETH-5 TO SPA-EXPR-INTMETH(5).
           MOVE QSPA-EXPR-LCHG TO SPA-EXPR-LCHG.
           MOVE QSPA-JUDGFRMLA TO SPA-JUDGFRMLA.
           MOVE QSPA-JUDGRATE TO SPA-JUDGRATE.
           MOVE QSPA-JUDGYRTYPE TO SPA-JUDGYRTYPE.
           MOVE QSPA-JUDGINTMETH TO SPA-JUDGINTMETH.
           MOVE QSPA-ACC-FRMLA TO SPA-ACC-FRMLA.
           MOVE QSPA-ACC-YRTYPE TO SPA-ACC-YRTYPE.
           MOVE QSPA-ACC-INTMETH TO SPA-ACC-INTMETH.
           MOVE QSPA-ACC-RATE-1 TO SPA-ACC-RATE(1).
           MOVE QSPA-ACC-BREAK-1 TO SPA-ACC-BREAK(1).
           MOVE QSPA-ACC-RATE-2 TO SPA-ACC-RATE(2).
           MOVE QSPA-ACC-BREAK-2 TO SPA-ACC-BREAK(2).
           MOVE QSPA-ACC-RATE-3 TO SPA-ACC-RATE(3).
           MOVE QSPA-ACC-BREAK-3 TO SPA-ACC-BREAK(3).
           MOVE QSPA-ACC-RATE-4 TO SPA-ACC-RATE(4).
           MOVE QSPA-ACC-BREAK-4 TO SPA-ACC-BREAK(4).
           MOVE QSPA-ACC-RATE-5 TO SPA-ACC-RATE(5).
           MOVE QSPA-ACC-BREAK-5 TO SPA-ACC-BREAK(5).
           MOVE QSPA-1098FRMLA TO SPA-1098FRMLA.
           MOVE QSPA-DISFRMLA TO SPA-DISFRMLA.
           MOVE QSPA-CONTRFRMLA TO SPA-CONTRFRMLA.
           MOVE QSPA-BANKRULE TO SPA-BANKRULE.
           MOVE QSPA-CONTPDTH TO SPA-CONTPDTH.
           MOVE QSPA-FINCHG TO SPA-FINCHG.
           MOVE QSPA-BANKUNITPER-CD TO SPA-BANKUNITPER-CD.
           MOVE QSPA-TRWBANKRULE TO SPA-TRWBANKRULE.
           MOVE QSPA-TRWCONTPDTH TO SPA-TRWCONTPDTH.
           MOVE QSPA-TRWBANKUNITPER-CD TO SPA-TRWBANKUNITPER-CD.
           MOVE QSPA-RECFRMLA TO SPA-RECFRMLA.
           MOVE QSPA-RECPAYCD TO SPA-RECPAYCD.
           MOVE QSPA-RECPDTH TO SPA-RECPDTH.
           MOVE QSPA-DISFRMLA-SPAY-FG TO SPA-DISFRMLA-SPAY-FG.
           MOVE QSPA-ERNFRMLA-1 TO SPA-ERNFRMLA(1).
           MOVE QSPA-ERNAMT-1 TO SPA-ERNAMT(1).
           MOVE QSPA-ERNPERCT-1 TO SPA-ERNPERCT(1).
           MOVE QSPA-ERNPERCD-1 TO SPA-ERNPERCD(1).
           MOVE QSPA-ERNACCRL-FG-1 TO SPA-ERNACCRL-FG(1).
           MOVE QSPA-ERNACCRL-START-CD-1 TO SPA-ERNACCRL-START-CD(1).
           MOVE QSPA-ERNACCRL-DFCD-1 TO SPA-ERNACCRL-DFCD(1).
           MOVE QSPA-ERN-DAYS-1 TO SPA-ERN-DAYS(1).
           MOVE QSPA-ERN-TERM-1 TO SPA-ERN-TERM(1).
           MOVE QSPA-ERN-TYPE-1 TO SPA-ERN-TYPE(1).
           MOVE QSPA-ERNFRMLA-2 TO SPA-ERNFRMLA(2).
           MOVE QSPA-ERNAMT-2 TO SPA-ERNAMT(2).
           MOVE QSPA-ERNPERCT-2 TO SPA-ERNPERCT(2).
           MOVE QSPA-ERNPERCD-2 TO SPA-ERNPERCD(2).
           MOVE QSPA-ERNACCRL-FG-2 TO SPA-ERNACCRL-FG(2).
           MOVE QSPA-ERNACCRL-START-CD-2 TO SPA-ERNACCRL-START-CD(2).
           MOVE QSPA-ERNACCRL-DFCD-2 TO SPA-ERNACCRL-DFCD(2).
           MOVE QSPA-ERN-DAYS-2 TO SPA-ERN-DAYS(2).
           MOVE QSPA-ERN-TERM-2 TO SPA-ERN-TERM(2).
           MOVE QSPA-ERN-TYPE-2 TO SPA-ERN-TYPE(2).
           MOVE QSPA-ERNFRMLA-3 TO SPA-ERNFRMLA(3).
           MOVE QSPA-ERNAMT-3 TO SPA-ERNAMT(3).
           MOVE QSPA-ERNPERCT-3 TO SPA-ERNPERCT(3).
           MOVE QSPA-ERNPERCD-3 TO SPA-ERNPERCD(3).
           MOVE QSPA-ERNACCRL-FG-3 TO SPA-ERNACCRL-FG(3).
           MOVE QSPA-ERNACCRL-START-CD-3 TO SPA-ERNACCRL-START-CD(3).
           MOVE QSPA-ERNACCRL-DFCD-3 TO SPA-ERNACCRL-DFCD(3).
           MOVE QSPA-ERN-DAYS-3 TO SPA-ERN-DAYS(3).
           MOVE QSPA-ERN-TERM-3 TO SPA-ERN-TERM(3).
           MOVE QSPA-ERN-TYPE-3 TO SPA-ERN-TYPE(3).
           MOVE QSPA-ERNFRMLA-4 TO SPA-ERNFRMLA(4).
           MOVE QSPA-ERNAMT-4 TO SPA-ERNAMT(4).
           MOVE QSPA-ERNPERCT-4 TO SPA-ERNPERCT(4).
           MOVE QSPA-ERNPERCD-4 TO SPA-ERNPERCD(4).
           MOVE QSPA-ERNACCRL-FG-4 TO SPA-ERNACCRL-FG(4).
           MOVE QSPA-ERNACCRL-START-CD-4 TO SPA-ERNACCRL-START-CD(4).
           MOVE QSPA-ERNACCRL-DFCD-4 TO SPA-ERNACCRL-DFCD(4).
           MOVE QSPA-ERN-DAYS-4 TO SPA-ERN-DAYS(4).
           MOVE QSPA-ERN-TERM-4 TO SPA-ERN-TERM(4).
           MOVE QSPA-ERN-TYPE-4 TO SPA-ERN-TYPE(4).
           MOVE QSPA-ERNFRMLA-5 TO SPA-ERNFRMLA(5).
           MOVE QSPA-ERNAMT-5 TO SPA-ERNAMT(5).
           MOVE QSPA-ERNPERCT-5 TO SPA-ERNPERCT(5).
           MOVE QSPA-ERNPERCD-5 TO SPA-ERNPERCD(5).
           MOVE QSPA-ERNACCRL-FG-5 TO SPA-ERNACCRL-FG(5).
           MOVE QSPA-ERNACCRL-START-CD-5 TO SPA-ERNACCRL-START-CD(5).
           MOVE QSPA-ERNACCRL-DFCD-5 TO SPA-ERNACCRL-DFCD(5).
           MOVE QSPA-ERN-DAYS-5 TO SPA-ERN-DAYS(5).
           MOVE QSPA-ERN-TERM-5 TO SPA-ERN-TERM(5).
           MOVE QSPA-ERN-TYPE-5 TO SPA-ERN-TYPE(5).
           MOVE QSPA-ERNFRMLA-6 TO SPA-ERNFRMLA(6).
           MOVE QSPA-ERNAMT-6 TO SPA-ERNAMT(6).
           MOVE QSPA-ERNPERCT-6 TO SPA-ERNPERCT(6).
           MOVE QSPA-ERNPERCD-6 TO SPA-ERNPERCD(6).
           MOVE QSPA-ERNACCRL-FG-6 TO SPA-ERNACCRL-FG(6).
           MOVE QSPA-ERNACCRL-START-CD-6 TO SPA-ERNACCRL-START-CD(6).
           MOVE QSPA-ERNACCRL-DFCD-6 TO SPA-ERNACCRL-DFCD(6).
           MOVE QSPA-ERN-DAYS-6 TO SPA-ERN-DAYS(6).
           MOVE QSPA-ERN-TERM-6 TO SPA-ERN-TERM(6).
           MOVE QSPA-ERN-TYPE-6 TO SPA-ERN-TYPE(6).
           MOVE QSPA-ERNFRMLA-7 TO SPA-ERNFRMLA(7).
           MOVE QSPA-ERNAMT-7 TO SPA-ERNAMT(7).
           MOVE QSPA-ERNPERCT-7 TO SPA-ERNPERCT(7).
           MOVE QSPA-ERNPERCD-7 TO SPA-ERNPERCD(7).
           MOVE QSPA-ERNACCRL-FG-7 TO SPA-ERNACCRL-FG(7).
           MOVE QSPA-ERNACCRL-START-CD-7 TO SPA-ERNACCRL-START-CD(7).
           MOVE QSPA-ERNACCRL-DFCD-7 TO SPA-ERNACCRL-DFCD(7).
           MOVE QSPA-ERN-DAYS-7 TO SPA-ERN-DAYS(7).
           MOVE QSPA-ERN-TERM-7 TO SPA-ERN-TERM(7).
           MOVE QSPA-ERN-TYPE-7 TO SPA-ERN-TYPE(7).
           MOVE QSPA-ERNFRMLA-8 TO SPA-ERNFRMLA(8).
           MOVE QSPA-ERNAMT-8 TO SPA-ERNAMT(8).
           MOVE QSPA-ERNPERCT-8 TO SPA-ERNPERCT(8).
           MOVE QSPA-ERNPERCD-8 TO SPA-ERNPERCD(8).
           MOVE QSPA-ERNACCRL-FG-8 TO SPA-ERNACCRL-FG(8).
           MOVE QSPA-ERNACCRL-START-CD-8 TO SPA-ERNACCRL-START-CD(8).
           MOVE QSPA-ERNACCRL-DFCD-8 TO SPA-ERNACCRL-DFCD(8).
           MOVE QSPA-ERN-DAYS-8 TO SPA-ERN-DAYS(8).
           MOVE QSPA-ERN-TERM-8 TO SPA-ERN-TERM(8).
           MOVE QSPA-ERN-TYPE-8 TO SPA-ERN-TYPE(8).
           MOVE QSPA-ERNFRMLA-9 TO SPA-ERNFRMLA(9).
           MOVE QSPA-ERNAMT-9 TO SPA-ERNAMT(9).
           MOVE QSPA-ERNPERCT-9 TO SPA-ERNPERCT(9).
           MOVE QSPA-ERNPERCD-9 TO SPA-ERNPERCD(9).
           MOVE QSPA-ERNACCRL-FG-9 TO SPA-ERNACCRL-FG(9).
           MOVE QSPA-ERNACCRL-START-CD-9 TO SPA-ERNACCRL-START-CD(9).
           MOVE QSPA-ERNACCRL-DFCD-9 TO SPA-ERNACCRL-DFCD(9).
           MOVE QSPA-ERN-DAYS-9 TO SPA-ERN-DAYS(9).
           MOVE QSPA-ERN-TERM-9 TO SPA-ERN-TERM(9).
           MOVE QSPA-ERN-TYPE-9 TO SPA-ERN-TYPE(9).
           MOVE QSPA-ERNFRMLA-10 TO SPA-ERNFRMLA(10).
           MOVE QSPA-ERNAMT-10 TO SPA-ERNAMT(10).
           MOVE QSPA-ERNPERCT-10 TO SPA-ERNPERCT(10).
           MOVE QSPA-ERNPERCD-10 TO SPA-ERNPERCD(10).
           MOVE QSPA-ERNACCRL-FG-10 TO SPA-ERNACCRL-FG(10).
           MOVE QSPA-ERNACCRL-START-CD-10 TO SPA-ERNACCRL-START-CD(10).
           MOVE QSPA-ERNACCRL-DFCD-10 TO SPA-ERNACCRL-DFCD(10).
           MOVE QSPA-ERN-DAYS-10 TO SPA-ERN-DAYS(10).
           MOVE QSPA-ERN-TERM-10 TO SPA-ERN-TERM(10).
           MOVE QSPA-ERN-TYPE-10 TO SPA-ERN-TYPE(10).
           MOVE QSPA-ERNACCEL-CD TO SPA-ERNACCEL-CD.
           MOVE QSPA-ERNJD-CD TO SPA-ERNJD-CD.
           MOVE QSPA-MIDSTRERNCD TO SPA-MIDSTRERNCD.
           MOVE QSPA-EARN-ORDER-1 TO SPA-EARN-ORDER(1).
           MOVE QSPA-EARN-ORDER-2 TO SPA-EARN-ORDER(2).
           MOVE QSPA-EARN-ORDER-3 TO SPA-EARN-ORDER(3).
           MOVE QSPA-EARN-ORDER-4 TO SPA-EARN-ORDER(4).
           MOVE QSPA-EARN-ORDER-5 TO SPA-EARN-ORDER(5).
           MOVE QSPA-EARN-ORDER-6 TO SPA-EARN-ORDER(6).
           MOVE QSPA-EARN-ORDER-7 TO SPA-EARN-ORDER(7).
           MOVE QSPA-EARN-ORDER-8 TO SPA-EARN-ORDER(8).
           MOVE QSPA-EARN-ORDER-9 TO SPA-EARN-ORDER(9).
           MOVE QSPA-EARN-ORDER-10 TO SPA-EARN-ORDER(10).
           MOVE QSPA-ERNDELQFRMLA TO SPA-ERNDELQFRMLA.
           MOVE QSPA-ERNDELQ-START TO SPA-ERNDELQ-START.
           MOVE QSPA-ERNDELQ-STOP TO SPA-ERNDELQ-STOP.
           MOVE QSPA-1098-INC-LC TO SPA-1098-INC-LC.
           MOVE QSPA-MAX-IB-ACR-DAYS TO SPA-MAX-IB-ACR-DAYS.
           MOVE QSPA-LCGRACE TO SPA-LCGRACE.
           MOVE QSPA-LCGRACECD TO SPA-LCGRACECD.
           MOVE QSPA-LCTYPE TO SPA-LCTYPE.
           MOVE QSPA-LCRATE TO SPA-LCRATE.
           MOVE QSPA-LCFRMLA TO SPA-LCFRMLA.
           MOVE QSPA-LCMINCHG TO SPA-LCMINCHG.
           MOVE QSPA-LCMAXAMT TO SPA-LCMAXAMT.
           MOVE QSPA-LCDELFAC TO SPA-LCDELFAC.
           MOVE QSPA-LCYRTYPE TO SPA-LCYRTYPE.
           MOVE QSPA-LC-CODE TO SPA-LC-CODE.
           MOVE QSPA-LCUNITPER-CD TO SPA-LCUNITPER-CD.
           MOVE QSPA-DEFFRMLA TO SPA-DEFFRMLA.
           MOVE QSPA-DEFEXCEPT TO SPA-DEFEXCEPT.
           MOVE QSPA-DEFWORKER TO SPA-DEFWORKER.
           MOVE QSPA-DEFPERCD TO SPA-DEFPERCD.
           MOVE QSPA-DEFBASE TO SPA-DEFBASE.
           MOVE QSPA-DEFPOLCD TO SPA-DEFPOLCD.
           MOVE QSPA-DEFPOLMX-1 TO SPA-DEFPOLMX(1).
           MOVE QSPA-DEFPOLMX-2 TO SPA-DEFPOLMX(2).
           MOVE QSPA-DEFPOLMX-3 TO SPA-DEFPOLMX(3).
           MOVE QSPA-DEFMIN TO SPA-DEFMIN.
           MOVE QSPA-DEFMAX TO SPA-DEFMAX.
           MOVE QSPA-DEFUNITPER-CD TO SPA-DEFUNITPER-CD.
           MOVE QSPA-PRFORM-1 TO SPA-PRFORM(1).
           MOVE QSPA-PRFLAG-1 TO SPA-PRFLAG(1).
           MOVE QSPA-PRFORM-2 TO SPA-PRFORM(2).
           MOVE QSPA-PRFLAG-2 TO SPA-PRFLAG(2).
           MOVE QSPA-PRFORM-3 TO SPA-PRFORM(3).
           MOVE QSPA-PRFLAG-3 TO SPA-PRFLAG(3).
           MOVE QSPA-PRFORM-4 TO SPA-PRFORM(4).
           MOVE QSPA-PRFLAG-4 TO SPA-PRFLAG(4).
           MOVE QSPA-PRFORM-5 TO SPA-PRFORM(5).
           MOVE QSPA-PRFLAG-5 TO SPA-PRFLAG(5).
           MOVE QSPA-PRFORM-6 TO SPA-PRFORM(6).
           MOVE QSPA-PRFLAG-6 TO SPA-PRFLAG(6).
           MOVE QSPA-PRFORM-7 TO SPA-PRFORM(7).
           MOVE QSPA-PRFLAG-7 TO SPA-PRFLAG(7).
           MOVE QSPA-PRFORM-8 TO SPA-PRFORM(8).
           MOVE QSPA-PRFLAG-8 TO SPA-PRFLAG(8).
           MOVE QSPA-PRFORM-9 TO SPA-PRFORM(9).
           MOVE QSPA-PRFLAG-9 TO SPA-PRFLAG(9).
           MOVE QSPA-PRFORM-10 TO SPA-PRFORM(10).
           MOVE QSPA-PRFLAG-10 TO SPA-PRFLAG(10).
           MOVE QSPA-PRFORM-11 TO SPA-PRFORM(11).
           MOVE QSPA-PRFLAG-11 TO SPA-PRFLAG(11).
           MOVE QSPA-PRFORM-12 TO SPA-PRFORM(12).
           MOVE QSPA-PRFLAG-12 TO SPA-PRFLAG(12).
           MOVE QSPA-PRFORM-13 TO SPA-PRFORM(13).
           MOVE QSPA-PRFLAG-13 TO SPA-PRFLAG(13).
           MOVE QSPA-PRFORM-14 TO SPA-PRFORM(14).
           MOVE QSPA-PRFLAG-14 TO SPA-PRFLAG(14).
           MOVE QSPA-PRFORM-15 TO SPA-PRFORM(15).
           MOVE QSPA-PRFLAG-15 TO SPA-PRFLAG(15).
           MOVE QSPA-PRFORM-16 TO SPA-PRFORM(16).
           MOVE QSPA-PRFLAG-16 TO SPA-PRFLAG(16).
           MOVE QSPA-PRFORM-17 TO SPA-PRFORM(17).
           MOVE QSPA-PRFLAG-17 TO SPA-PRFLAG(17).
           MOVE QSPA-PRFORM-18 TO SPA-PRFORM(18).
           MOVE QSPA-PRFLAG-18 TO SPA-PRFLAG(18).
           MOVE QSPA-PRFORM-19 TO SPA-PRFORM(19).
           MOVE QSPA-PRFLAG-19 TO SPA-PRFLAG(19).
           MOVE QSPA-PRFORM-20 TO SPA-PRFORM(20).
           MOVE QSPA-PRFLAG-20 TO SPA-PRFLAG(20).
           MOVE QSPA-IMED-REC TO SPA-IMED-REC.
           MOVE QSPA-SCFRMLA TO SPA-SCFRMLA.
           MOVE QSPA-SCRATE TO SPA-SCRATE.
           MOVE QSPA-SCMIN TO SPA-SCMIN.
           MOVE QSPA-SCMAX TO SPA-SCMAX.
           MOVE QSPA-MFFRMLA TO SPA-MFFRMLA.
           MOVE QSPA-MFRATE TO SPA-MFRATE.
           MOVE QSPA-MFMIN TO SPA-MFMIN.
           MOVE QSPA-MFMAX TO SPA-MFMAX.
           MOVE QSPA-INTMETHOD TO SPA-INTMETHOD.
           MOVE QSPA-YEARTYPE TO SPA-YEARTYPE.
           MOVE QSPA-PYEXFRMLA TO SPA-PYEXFRMLA.
           MOVE QSPA-PYEXSPCODE TO SPA-PYEXSPCODE.
           MOVE QSPA-PYEXYEARTP TO SPA-PYEXYEARTP.
           MOVE QSPA-PYEXFMDATE TO SPA-PYEXFMDATE.
           MOVE QSPA-PYEXBASECD TO SPA-PYEXBASECD.
           MOVE QSPA-PYEXBASE TO SPA-PYEXBASE.
           MOVE QSPA-PYEXDAYS TO SPA-PYEXDAYS.
           MOVE QSPA-CAL-SPFRMLA TO SPA-CAL-SPFRMLA.
           MOVE QSPA-CAL-RATETYPE-1 TO SPA-CAL-RATETYPE(1).
           MOVE QSPA-CAL-BREAKTYPE-1 TO SPA-CAL-BREAKTYPE(1).
           MOVE QSPA-CAL-CHGABLE-1 TO SPA-CAL-CHGABLE(1).
           MOVE QSPA-CAL-NORATES-1 TO SPA-CAL-NORATES(1).
           MOVE QSPA-CAL-TBFRMLA-1 TO SPA-CAL-TBFRMLA(1).
           MOVE QSPA-CAL-RATE-1-1 TO SPA-CAL-RATE(1 1).
           MOVE QSPA-CAL-BREAK-1-1 TO SPA-CAL-BREAK(1 1).
           MOVE QSPA-CAL-RATE-1-2 TO SPA-CAL-RATE(1 2).
           MOVE QSPA-CAL-BREAK-1-2 TO SPA-CAL-BREAK(1 2).
           MOVE QSPA-CAL-RATE-1-3 TO SPA-CAL-RATE(1 3).
           MOVE QSPA-CAL-BREAK-1-3 TO SPA-CAL-BREAK(1 3).
           MOVE QSPA-CAL-RATE-1-4 TO SPA-CAL-RATE(1 4).
           MOVE QSPA-CAL-BREAK-1-4 TO SPA-CAL-BREAK(1 4).
           MOVE QSPA-CAL-RATE-1-5 TO SPA-CAL-RATE(1 5).
           MOVE QSPA-CAL-BREAK-1-5 TO SPA-CAL-BREAK(1 5).
           MOVE QSPA-CAL-RATETYPE-2 TO SPA-CAL-RATETYPE(2).
           MOVE QSPA-CAL-BREAKTYPE-2 TO SPA-CAL-BREAKTYPE(2).
           MOVE QSPA-CAL-CHGABLE-2 TO SPA-CAL-CHGABLE(2).
           MOVE QSPA-CAL-NORATES-2 TO SPA-CAL-NORATES(2).
           MOVE QSPA-CAL-TBFRMLA-2 TO SPA-CAL-TBFRMLA(2).
           MOVE QSPA-CAL-RATE-2-1 TO SPA-CAL-RATE(2 1).
           MOVE QSPA-CAL-BREAK-2-1 TO SPA-CAL-BREAK(2 1).
           MOVE QSPA-CAL-RATE-2-2 TO SPA-CAL-RATE(2 2).
           MOVE QSPA-CAL-BREAK-2-2 TO SPA-CAL-BREAK(2 2).
           MOVE QSPA-CAL-RATE-2-3 TO SPA-CAL-RATE(2 3).
           MOVE QSPA-CAL-BREAK-2-3 TO SPA-CAL-BREAK(2 3).
           MOVE QSPA-CAL-RATE-2-4 TO SPA-CAL-RATE(2 4).
           MOVE QSPA-CAL-BREAK-2-4 TO SPA-CAL-BREAK(2 4).
           MOVE QSPA-CAL-RATE-2-5 TO SPA-CAL-RATE(2 5).
           MOVE QSPA-CAL-BREAK-2-5 TO SPA-CAL-BREAK(2 5).
           MOVE QSPA-MINSF-FRMLA TO SPA-MINSF-FRMLA.
           MOVE QSPA-MINSF-CHG TO SPA-MINSF-CHG.
           MOVE QSPA-MAXAPR-FRMLA TO SPA-MAXAPR-FRMLA.
           MOVE QSPA-EDT-NOEDITS-1 TO SPA-EDT-NOEDITS(1).
           MOVE QSPA-EDT-TYPE-1-1 TO SPA-EDT-TYPE(1 1).
           MOVE QSPA-EDT-HL-1-1 TO SPA-EDT-HL(1 1).
           MOVE QSPA-EDT-COLL-1-1 TO SPA-EDT-COLL(1 1).
           MOVE QSPA-EDT-CD-1-1 TO SPA-EDT-CD(1 1).
           MOVE QSPA-EDT-RATE-1-1 TO SPA-EDT-RATE(1 1).
           MOVE QSPA-EDT-RATETYPE-1-1 TO SPA-EDT-RATETYPE(1 1).
           MOVE QSPA-EDT-AMT-1-1 TO SPA-EDT-AMT(1 1).
           MOVE QSPA-EDT-AMTYPE-1-1 TO SPA-EDT-AMTYPE(1 1).
           MOVE QSPA-EDT-TERM-1-1 TO SPA-EDT-TERM(1 1).
           MOVE QSPA-EDT-TYPE-1-2 TO SPA-EDT-TYPE(1 2).
           MOVE QSPA-EDT-HL-1-2 TO SPA-EDT-HL(1 2).
           MOVE QSPA-EDT-COLL-1-2 TO SPA-EDT-COLL(1 2).
           MOVE QSPA-EDT-CD-1-2 TO SPA-EDT-CD(1 2).
           MOVE QSPA-EDT-RATE-1-2 TO SPA-EDT-RATE(1 2).
           MOVE QSPA-EDT-RATETYPE-1-2 TO SPA-EDT-RATETYPE(1 2).
           MOVE QSPA-EDT-AMT-1-2 TO SPA-EDT-AMT(1 2).
           MOVE QSPA-EDT-AMTYPE-1-2 TO SPA-EDT-AMTYPE(1 2).
           MOVE QSPA-EDT-TERM-1-2 TO SPA-EDT-TERM(1 2).
           MOVE QSPA-EDT-TYPE-1-3 TO SPA-EDT-TYPE(1 3).
           MOVE QSPA-EDT-HL-1-3 TO SPA-EDT-HL(1 3).
           MOVE QSPA-EDT-COLL-1-3 TO SPA-EDT-COLL(1 3).
           MOVE QSPA-EDT-CD-1-3 TO SPA-EDT-CD(1 3).
           MOVE QSPA-EDT-RATE-1-3 TO SPA-EDT-RATE(1 3).
           MOVE QSPA-EDT-RATETYPE-1-3 TO SPA-EDT-RATETYPE(1 3).
           MOVE QSPA-EDT-AMT-1-3 TO SPA-EDT-AMT(1 3).
           MOVE QSPA-EDT-AMTYPE-1-3 TO SPA-EDT-AMTYPE(1 3).
           MOVE QSPA-EDT-TERM-1-3 TO SPA-EDT-TERM(1 3).
           MOVE QSPA-EDT-TYPE-1-4 TO SPA-EDT-TYPE(1 4).
           MOVE QSPA-EDT-HL-1-4 TO SPA-EDT-HL(1 4).
           MOVE QSPA-EDT-COLL-1-4 TO SPA-EDT-COLL(1 4).
           MOVE QSPA-EDT-CD-1-4 TO SPA-EDT-CD(1 4).
           MOVE QSPA-EDT-RATE-1-4 TO SPA-EDT-RATE(1 4).
           MOVE QSPA-EDT-RATETYPE-1-4 TO SPA-EDT-RATETYPE(1 4).
           MOVE QSPA-EDT-AMT-1-4 TO SPA-EDT-AMT(1 4).
           MOVE QSPA-EDT-AMTYPE-1-4 TO SPA-EDT-AMTYPE(1 4).
           MOVE QSPA-EDT-TERM-1-4 TO SPA-EDT-TERM(1 4).
           MOVE QSPA-EDT-TYPE-1-5 TO SPA-EDT-TYPE(1 5).
           MOVE QSPA-EDT-HL-1-5 TO SPA-EDT-HL(1 5).
           MOVE QSPA-EDT-COLL-1-5 TO SPA-EDT-COLL(1 5).
           MOVE QSPA-EDT-CD-1-5 TO SPA-EDT-CD(1 5).
           MOVE QSPA-EDT-RATE-1-5 TO SPA-EDT-RATE(1 5).
           MOVE QSPA-EDT-RATETYPE-1-5 TO SPA-EDT-RATETYPE(1 5).
           MOVE QSPA-EDT-AMT-1-5 TO SPA-EDT-AMT(1 5).
           MOVE QSPA-EDT-AMTYPE-1-5 TO SPA-EDT-AMTYPE(1 5).
           MOVE QSPA-EDT-TERM-1-5 TO SPA-EDT-TERM(1 5).
           MOVE QSPA-EDT-TYPE-1-6 TO SPA-EDT-TYPE(1 6).
           MOVE QSPA-EDT-HL-1-6 TO SPA-EDT-HL(1 6).
           MOVE QSPA-EDT-COLL-1-6 TO SPA-EDT-COLL(1 6).
           MOVE QSPA-EDT-CD-1-6 TO SPA-EDT-CD(1 6).
           MOVE QSPA-EDT-RATE-1-6 TO SPA-EDT-RATE(1 6).
           MOVE QSPA-EDT-RATETYPE-1-6 TO SPA-EDT-RATETYPE(1 6).
           MOVE QSPA-EDT-AMT-1-6 TO SPA-EDT-AMT(1 6).
           MOVE QSPA-EDT-AMTYPE-1-6 TO SPA-EDT-AMTYPE(1 6).
           MOVE QSPA-EDT-TERM-1-6 TO SPA-EDT-TERM(1 6).
           MOVE QSPA-EDT-NOEDITS-2 TO SPA-EDT-NOEDITS(2).
           MOVE QSPA-EDT-TYPE-2-1 TO SPA-EDT-TYPE(2 1).
           MOVE QSPA-EDT-HL-2-1 TO SPA-EDT-HL(2 1).
           MOVE QSPA-EDT-COLL-2-1 TO SPA-EDT-COLL(2 1).
           MOVE QSPA-EDT-CD-2-1 TO SPA-EDT-CD(2 1).
           MOVE QSPA-EDT-RATE-2-1 TO SPA-EDT-RATE(2 1).
           MOVE QSPA-EDT-RATETYPE-2-1 TO SPA-EDT-RATETYPE(2 1).
           MOVE QSPA-EDT-AMT-2-1 TO SPA-EDT-AMT(2 1).
           MOVE QSPA-EDT-AMTYPE-2-1 TO SPA-EDT-AMTYPE(2 1).
           MOVE QSPA-EDT-TERM-2-1 TO SPA-EDT-TERM(2 1).
           MOVE QSPA-EDT-TYPE-2-2 TO SPA-EDT-TYPE(2 2).
           MOVE QSPA-EDT-HL-2-2 TO SPA-EDT-HL(2 2).
           MOVE QSPA-EDT-COLL-2-2 TO SPA-EDT-COLL(2 2).
           MOVE QSPA-EDT-CD-2-2 TO SPA-EDT-CD(2 2).
           MOVE QSPA-EDT-RATE-2-2 TO SPA-EDT-RATE(2 2).
           MOVE QSPA-EDT-RATETYPE-2-2 TO SPA-EDT-RATETYPE(2 2).
           MOVE QSPA-EDT-AMT-2-2 TO SPA-EDT-AMT(2 2).
           MOVE QSPA-EDT-AMTYPE-2-2 TO SPA-EDT-AMTYPE(2 2).
           MOVE QSPA-EDT-TERM-2-2 TO SPA-EDT-TERM(2 2).
           MOVE QSPA-EDT-TYPE-2-3 TO SPA-EDT-TYPE(2 3).
           MOVE QSPA-EDT-HL-2-3 TO SPA-EDT-HL(2 3).
           MOVE QSPA-EDT-COLL-2-3 TO SPA-EDT-COLL(2 3).
           MOVE QSPA-EDT-CD-2-3 TO SPA-EDT-CD(2 3).
           MOVE QSPA-EDT-RATE-2-3 TO SPA-EDT-RATE(2 3).
           MOVE QSPA-EDT-RATETYPE-2-3 TO SPA-EDT-RATETYPE(2 3).
           MOVE QSPA-EDT-AMT-2-3 TO SPA-EDT-AMT(2 3).
           MOVE QSPA-EDT-AMTYPE-2-3 TO SPA-EDT-AMTYPE(2 3).
           MOVE QSPA-EDT-TERM-2-3 TO SPA-EDT-TERM(2 3).
           MOVE QSPA-EDT-TYPE-2-4 TO SPA-EDT-TYPE(2 4).
           MOVE QSPA-EDT-HL-2-4 TO SPA-EDT-HL(2 4).
           MOVE QSPA-EDT-COLL-2-4 TO SPA-EDT-COLL(2 4).
           MOVE QSPA-EDT-CD-2-4 TO SPA-EDT-CD(2 4).
           MOVE QSPA-EDT-RATE-2-4 TO SPA-EDT-RATE(2 4).
           MOVE QSPA-EDT-RATETYPE-2-4 TO SPA-EDT-RATETYPE(2 4).
           MOVE QSPA-EDT-AMT-2-4 TO SPA-EDT-AMT(2 4).
           MOVE QSPA-EDT-AMTYPE-2-4 TO SPA-EDT-AMTYPE(2 4).
           MOVE QSPA-EDT-TERM-2-4 TO SPA-EDT-TERM(2 4).
           MOVE QSPA-EDT-TYPE-2-5 TO SPA-EDT-TYPE(2 5).
           MOVE QSPA-EDT-HL-2-5 TO SPA-EDT-HL(2 5).
           MOVE QSPA-EDT-COLL-2-5 TO SPA-EDT-COLL(2 5).
           MOVE QSPA-EDT-CD-2-5 TO SPA-EDT-CD(2 5).
           MOVE QSPA-EDT-RATE-2-5 TO SPA-EDT-RATE(2 5).
           MOVE QSPA-EDT-RATETYPE-2-5 TO SPA-EDT-RATETYPE(2 5).
           MOVE QSPA-EDT-AMT-2-5 TO SPA-EDT-AMT(2 5).
           MOVE QSPA-EDT-AMTYPE-2-5 TO SPA-EDT-AMTYPE(2 5).
           MOVE QSPA-EDT-TERM-2-5 TO SPA-EDT-TERM(2 5).
           MOVE QSPA-EDT-TYPE-2-6 TO SPA-EDT-TYPE(2 6).
           MOVE QSPA-EDT-HL-2-6 TO SPA-EDT-HL(2 6).
           MOVE QSPA-EDT-COLL-2-6 TO SPA-EDT-COLL(2 6).
           MOVE QSPA-EDT-CD-2-6 TO SPA-EDT-CD(2 6).
           MOVE QSPA-EDT-RATE-2-6 TO SPA-EDT-RATE(2 6).
           MOVE QSPA-EDT-RATETYPE-2-6 TO SPA-EDT-RATETYPE(2 6).
           MOVE QSPA-EDT-AMT-2-6 TO SPA-EDT-AMT(2 6).
           MOVE QSPA-EDT-AMTYPE-2-6 TO SPA-EDT-AMTYPE(2 6).
           MOVE QSPA-EDT-TERM-2-6 TO SPA-EDT-TERM(2 6).
 
      *-----------------------------------------------------------------
      *    LOAD QSPA-REC FROM SPA-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
