      * NEW SOUTH PRE-PAYOFF PENALTY, WISCONSIN FINANCE  ($75.00 FLAT)
      * IF PAYOFF OS PAID OFF ANY TIME PRIOR TO THE LAST THREE MONTHS OF
      *    THE LOAN
      *
      * NOTE: IN CALCULATING THE 3 MONTHS, THE LOANS ORIGINAL MATURITY DATE
      *       IS USED WITHOUT REGARD FOR DEFERMENTS OR ADDONS.
       INTEREST-DUE-PENALTY-NEWS.
           IF SP-RBREDUC(7) NOT = 9999.05
              GO TO INTEREST-DUE-PENALTY-NC.

           IF INDU-LPTRCD = "PO"
      * CALCULATE ORIGINAL MATURITY DATE
              MOVE "Y" TO MDTE-FLAG
                          MDTE-ORGTERM-FG
              PERFORM MATURITY-DATE-CALCULATION
      * CALCULATE DATE 3 MONTHS PRIOR TO MATURITY DATE
              MOVE MDTE-DATE TO NDTE-DATE
              MOVE -3        TO NDTE-HOLD
              PERFORM INCREMENT-MONTHS
      * TEST PAYOFF DATE < MATURITY - 3 MONTHS
      *   IF PAYOFF OCCURS MORE THAN 3 MONTHS FROM MATURITY
      *   THEN ADD A FLAT RATE OF $75.00 AS A PREPAYMENT PENALTY
              MOVE NDTE-DATE TO NUM-DATE
              MOVE RATE-DATE TO SYS-DATE
              IF SYS-DATE NOT > NUM-DATE
                 MOVE 75.00 TO INDU-PENALTY
                 COMPUTE INDU-INTEREST ROUNDED = INDU-INTEREST
                                               + INDU-PENALTY.

           GO TO INTEREST-DUE-PENALTY-EXIT.

      * NORTH CAROLINA, PRE-PAYOFF PENALTY, CAROLINA FINANCE  (10% OR $25.00)
      * IF PAID OFF ANY TIME PRIOR TO MATURITY OF THE LOAN
      *
      * NOTE: THE LOANS ORIGINAL MATURITY DATE
      *       IS USED WITHOUT REGARD FOR DEFERMENTS OR ADDONS.
      
