       INTEREST-DUE-PENALTY-MS.
           IF SP-RBREDUC(7) NOT = 9999.01
              GO TO INTEREST-DUE-PENALTY-NV.

      * 07/02/2018 MOVED A01-MS-PENALTY OUT OF REBATEW AND INTO LPRATEW AS
      *            INDU-A01-PENALTY, REMOVED CLEAR OF REB-MS-PENALTY
      *    MOVE 0 TO INDU-PENALTY A01-MS-PENALTY REB-MS-PENALTY.

           MOVE 0 TO INDU-PENALTY INDU-A01-PENALTY.

           IF NOT (INDU-LPTRCD = "PO" OR "PA")
              GO TO INTEREST-DUE-PENALTY-NV.

           IF INDU-ASSESS-PENALTY = "N"
              MOVE SPACES TO INDU-ASSESS-PENALTY
              GO TO NO-PENALTY-MS.

      * TEST IF WITHIN 5 YEARS
           MOVE LN-LOANDATE TO NUM-DATE
           MOVE INDU-DATE-2 TO SYS-DATE
           PERFORM TIM360
           IF ELAPSED-MONTHS < 0 OR > 60
              GO TO INTEREST-DUE-PENALTY-NV.

           IF ELAPSED-REM > 0
              ADD 1 TO ELAPSED-MONTHS.

           MOVE ELAPSED-MONTHS TO INDU-A01-ELAPSED-MO.
           MOVE INDU-DATE-2    TO INDU-A01-PAYDATE.
           MOVE 0              TO INDU-COMMON-REBATE.
           MOVE "CL/REBA01"    TO FORM-NAM.
           CALL FORM-PROGX USING FORM-PATH INDU-COMMON LN-REC LTI-REC.
           CANCEL FORM-PROGX.

           MOVE INDU-A01-PENALTY TO INDU-PENALTY.

           COMPUTE INDU-INTEREST ROUNDED = INDU-INTEREST
                                         + INDU-PENALTY.

           MOVE "N" TO INDU-ASSESS-PENALTY.

