      * WISCONSIN PRE-PAYOFF PENALTY, WISCONSIN FINANCE (IB REAL ESTATE)
      * IF PAYOFF IS PRIOR TO 4TH YEAR TAKE PENALTY:
       INTEREST-DUE-PENALTY-WI.
           IF SP-RBREDUC(7) NOT = 9999.04
              GO TO INTEREST-DUE-PENALTY-NEWS.

           IF INDU-LPTRCD = "PO"
      * CALL SUBPROGRAM TO DETERMINE PENALTY:
              MOVE "X"         TO INDU-COMMON-RTNCD
              MOVE 0           TO INDU-A02-PENALTY
              MOVE INDU-DATE-2 TO INDU-A02-PAYDATE
              MOVE "CL/REBA02" TO FORM-NAM
              CALL FORM-PROGX USING FORM-PATH INDU-COMMON LN-REC SP-REC
              CANCEL FORM-PROGX
              IF INDU-COMMON-RTNCD = " "
                 COMPUTE INDU-INTEREST ROUNDED =
                      INDU-INTEREST + INDU-A02-PENALTY
                 MOVE INDU-A02-PENALTY TO INDU-PENALTY.

           GO TO INTEREST-DUE-PENALTY-EXIT.

      * NEW SOUTH PRE-PAYOFF PENALTY, WISCONSIN FINANCE  ($75.00 FLAT)
      * IF PAYOFF OS PAID OFF ANY TIME PRIOR TO THE LAST THREE MONTHS OF
      *    THE LOAN
      *
      * NOTE: IN CALCULATING THE 3 MONTHS, THE LOANS ORIGINAL MATURITY DATE
      *       IS USED WITHOUT REGARD FOR DEFERMENTS OR ADDONS.
      
