       LATE-CHARGE-CALC-NORMAL-END.
           IF LCHG-CHARGE < SP-LCMINCHG
              MOVE SP-LCMINCHG TO LCHG-CHARGE.
           IF LCHG-CHARGE > SP-LCMAXAMT
              MOVE SP-LCMAXAMT TO LCHG-CHARGE.

