      * REDUCE TRANSACTION AMOUNT BY PAYMENT:
       LCAP-N-PMT.
           SUBTRACT LCAP-AMTNEEDED FROM LCAP-TRAMT.
           MOVE LN-REGPYAMT TO LCAP-AMTNEEDED
                               LCHG-CURPAY.
           GO TO LCAP-N-DATE-CHK.

