      *******************************************************
      * NO ASSESSMENT IS REQUIRED; ADVANCE LCAP-LCPDTH-DATE
      * TO WHERE PAYMENTS TODATE ARE PAID THRU, ONLY
      * IF IT WILL ADVANCE LCPDTH, SINCE LCPDTH COULD
      * HAVE ADVANCED BEYOND PAID THRU VIA TIME.
      *******************************************************
       LCAP-I-L-NOASSESS.

           IF LCAP-LPTRCD NOT = "AL"
              ADD LCAP-TRAMT LCAP-PAYMNTD GIVING PDTH-PAYMNTD.

      *08/13/15 PR#694
      *MULLEN REPORTED ACCOUNT THAT WAS PAID AHEAD DID NOT ADVANCE
      *LATE CHARGE PAID THRU, CAUSING THE NEXT ON TIME PAYMENT TO
      *ASSESS A LATE CHARGE. THE ACCOUNT WAS PAID AHEAD BUT THE PAYMENT WENT
      *TO INTEREST-OWING. WHEN I WAIVED THE INTEREST-DUE, THE ACCOUNT ADVANCED
      *LCPDTH SO I ADDED SUBTRACT OF LCAP-LPAPINT(INT-OWE)FROM LCAP-WRK. I
      *AM NOT QUITE SURE WHY WE ADD LN-TOTLCHG,LCAP-LPAPLC,LCAP-APP
      *LCAP-LPAPINT TO THIS WORKER. I DO REMEMBER PACESETTER DID NOT WANT
      *AN ACCT TO BE PAST DUE BECAUSE OF PAID LATE CHGS BUT ALSO DID NOT
      *WANT HIM TO BE PAID AHEAD IF HE DID PAY THEM BUT I SEE NO REASON THAT
      *COLLECTED INTEREST OWING SHOULD BE INCLUDED IN THIS WORKER.
      *
      *IN MULLEN'S EXAMPLE LCAP-WRK WAS 30.00(LN-TOTLCHG) + 408.92(INT
      *OWE, WHEN IT COMPUTED PDTH-PAYMENTS IT WAS > 1, SO IT SUBTRACTED
      *A REGPYAMT FROM PAYMENTS TO DATE.
      *
      *HERE IS THE ACCOUNT
      *          TRCD   AMT   INT       PDTH  LCPD       INT/LC OWE
      * 03/28/10  D2                    05/10  05/10        789.73
      * 05/28/10  PY   408.92 408.92    06/10  05/10        868.96
      *WHEN I WAIVED THE INTEREST OWING
      *          TRCD   AMT   INT       PDTH  LCPD       INT/LC OWE
      * 03/28/10  D2                    05/10  05/10        789.73
      * 05/28/10  PY   408.92           06/10  06/10        868.96
      *
      *PAYMENTS TO DATE WAS THE SAME AMOUNT IN BOTH EXAMPLES, BUT DID NOT
      *ADVANCE LCPDTH WITH INTEREST OWING COLLECTED.

           IF LCAP-LPTRCD NOT = "AL"
              IF SP-LCFRMLA = "I" OR "L"
                 ADD LN-TOTLCHG LCAP-LPAPLC LCAP-APP LCAP-LPAPINT
                                                    GIVING LCAP-WRK
                 ADD LCAP-WRK TO PDTH-PAYMNTD

      *PL#694 SEE ABOVE
                 SUBTRACT LCAP-LPAPINT FROM LCAP-WRK

                 COMPUTE PDTH-PAYMENTS = LCAP-WRK / LN-REGPYAMT
                 IF PDTH-PAYMENTS > 1
                    COMPUTE PDTH-PAYMNTD =
                       PDTH-PAYMNTD - ( PDTH-PAYS * LN-REGPYAMT).

           IF LCAP-LPTRCD NOT = "AL"
              IF LN-PAY-SCHLD-FG = "Y"
                 MOVE LCAP-PAYMNTD TO LCAP-HOLDER
                 MOVE PDTH-PAYMNTD TO LCAP-PAYMNTD
                 PERFORM LCAP-PICK-PDTH-CALC
                 MOVE LCAP-HOLDER TO LCAP-PAYMNTD
              ELSE
                 PERFORM LCAP-PICK-PDTH-CALC
              END-IF
              MOVE NDTE-DATE TO SYS-DATE
              PERFORM LCAP-LCPDTH-DATE-TEST
              IF ELAPSED-DAYS NOT < 0
                 MOVE PDTH-DATE-FULL TO LCAP-LCPDTH-DATE
                 IF LCAP-UNPAID-PORTION NOT = 0
                          AND LCAP-UNPAID-PORTION < LCAP-DELFAC
                    PERFORM LCAP-UPD-LCPD.

      * INSURE THAT LCPDTH ADVANCES TO CURRENT PAYMENT DATE
      * IF  CURRENT  PAYMENT IS NOT DELIQUENT:
           IF LCAP-CURDATE NOT = 0
              MOVE LCAP-CURDATE TO SYS-DATE
              PERFORM LCAP-LCPDTH-DATE-TEST
              IF ELAPSED-DAYS > 0
                 IF LCAP-CURDUE < LCAP-DELFAC
                    IF ELAPSED-DAYS > 0
                       MOVE LCAP-CURDATE TO LCAP-LCPDTH-DATE
                    ELSE
                       PERFORM LCAP-UPD-LCPD.

      * ? PAST MATURITY,
      * IF SO FORCE LCAP-LCPDTH-DATE TO MATURITY:
