      * IF CURRENT PAYDATE IS THE SAME AS LAST CURRENT PAYDATE,
      * SET CURRENT PAYMENT DATE TO LAST CURRENT PAYMENT DATE,
      * MAKE CURRENT DUE EQUAL TO REDUCED LAST CURRENT DUE:
       LCAP-P-CURRENT-PERIOD-SETDUE.
           IF LCAP-CURDATE NOT = LCAP-LST-CURDATE
              GO TO LCAP-P-CURRENT-PERIOD-NEWCUR.
           MOVE LCAP-LST-CURDATE TO LCAP-CURDATE.
           IF LCAP-TRAMT < LCAP-LST-CURDUE
              SUBTRACT LCAP-TRAMT FROM LCAP-LST-CURDUE
                                        GIVING LCAP-CURDUE
           ELSE
              MOVE 0 TO LCAP-CURDUE.
           MOVE 0 TO LCAP-LST-CURDATE LCAP-LST-CURDUE.
           GO TO LCAP-P-CURRENT-PERIOD-EXIT.

