       LCAP-E-X-RETRY.
           IF LCAP-TRAMT-PLUS-AP > LCAP-AMTNEEDED
              PERFORM LCAP-UPD-LCPD
              GO TO LCAP-E-X-PMT.

      * TEST TO SEE IF THE SHORTAGE IS NOT GREATER
      * THAN THE DELINQUINCY FACTOR, SETUP IN STATE PARAMETERS.
           COMPUTE LCAP-WRK2 =
                  LCAP-AMTNEEDED - LCAP-TRAMT-PLUS-AP.

           IF LCAP-WRK2 < LCAP-DELFAC
              PERFORM LCAP-UPD-LCPD.

