       MOVE-TO-LT SECTION.
           COMPUTE LTP-SCHLD-TERM(SCHD-SUB2) = SCHD-SUB - SCHD-SUB3 - 1.
           ADD LTP-SCHLD-TERM(SCHD-SUB2) TO SCHD-TERM.
           MOVE SCHD-AMT(SCHD-SUB - 1) TO LTP-SCHLD-PAYMNT(SCHD-SUB2).
           COMPUTE SCHD-SUB3  = SCHD-SUB - 1.
           ADD 1 TO SCHD-SUB2.

       EXIT-MOVE-TO-LT.
           EXIT.

