       REBATE-FIND-INS-TABLE.

           MOVE REB-REMTERM TO IRREBT-REMTERM.
           MOVE REB-INSSUB TO IRREBT-INSSUB.
           MOVE 0 TO IRREBT-MANYDECIMALS.
           MOVE "CL/IRREBT" TO FORM-NAM.
           CALL FORM-PROGX USING FORM-PATH REB-COMMON LN-REC SP-REC.
           CANCEL FORM-PROGX.

           MOVE IRREBT-MANYDECIMALS TO REB-MANYDECIMALS REB-HUNDREDS.
           GO TO REBATE-FIND-INS-RATE-EXIT.

