      * GEORGIA PRORATA / RULE 78 SLICE W/SWING FOR MAINT. FEES:
       REBATE-PRORATA-GA-SWING.
           PERFORM REBATE-PRORATA-ROUTINE.
           MOVE REB-REBATE TO REB-STATEWK.
           MOVE REB-TOTCHG TO REB-STATEWK2.
           MOVE LN-MAINTFEE TO REB-TOTCHG.
           PERFORM REBATE-78.
           MOVE REB-STATEWK2 TO REB-TOTCHG.
           COMPUTE REB-REBATE = REB-STATEWK
                          + (LN-MAINTFEE - REB-REBATE).

      * GEORGIA PRORATA / RULE 78 SLICE W/NO SWING FOR MAINT. FEES:
