      ***************************************
       TIM365 SECTION.
      ***************************************
           MOVE 365 TO ELAPSED-YRTYPE.
           PERFORM TIMALL.

      ***************************************
