      ***************************************
       TIM360 SECTION.
      ***************************************
           MOVE 360 TO ELAPSED-YRTYPE.
           PERFORM TIMALL.

      ***************************************
