      * COPYMEMBER: LIBGL/ALSCANW
      *  2024.0503 BAH MADE LEVEL 01, CALL NOT WINDOW
       01  ALSCAN-BUF.
           03  ALSCAN-MAX-ACCTS    PIC 99.
           03  ALSCAN-KEY          PIC X(14).
           03  ALSCAN-DESC         PIC X(34).
           03  ALSCAN-NO-ACCTS     PIC Z9.
           03  ALSCAN-STATUS       PIC XX.

