      * COPYMEMBER: LIBGB/CAPASSWDW
      * GLB  07/20/99
      * MJD 131126 ADDED CAPASSWD-ELIST. USED TO DISPLAY WITH ECHO WHEN
      *            CLEARING THE FIELD FROM THE FORM (I.E. MN/CAMAIN)
       01  CAPASSWD-STATUS     PIC X    VALUE " ".
       01  CAPASSWD-OKAY       PIC X    VALUE " ".
       01  CAPASSWD-VDUSTATUS  PIC XX   VALUE " ".
       01  CAPASSWD-UNIVERSAL  PIC X(4) VALUE "$$$".
       01  CAPASSWD-LIST       PIC X(9) VALUE "CAPASSWD.".
       01  CAPASSWD-ELIST      PIC X(11) VALUE "CAPASSWD:E.".
       01  CAPASSWD-BUF        PIC X(8).

       01  HOLD-CA1-KEY.
           03  HOLD-CA-BRNO        PIC 9(4).
           03  HOLD-CA-DATE        PIC 9(8).
           03  HOLD-CA-TILLNO      PIC 99.

