      ******************************************************************
      *    GBAUCL    AUDIT CHANGES FILE CLEAR ROUTINE
      *
      ******************************************************************
       CLEAR-AU-FILE SECTION.
           MOVE SPACES TO AU-REC.

           MOVE 0      TO AU-DATE AU-SEQ
                          AU-BRANCH AU-TIME AU-LTOUCH-DATE.

