      * COPYMEMBER: LIBGB/GBFSER
           SELECT ERRLOG-FILE ASSIGN ERRLOG-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  ACCESS SEQUENTIAL
                  FILE STATUS FILE-STAT.
