      * COPYMEMBER: LIBGB/GBFSFL    IN FILE.DOC, NOT DATABASE
           SELECT FL-FILE ASSIGN TO FL-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY FL1-KEY
                  FILE STATUS FILE-STAT.
