      ****************************************************
       CLEAR-GR-FILE SECTION.
      ****************************************************
           MOVE SPACES   TO GR-REC.

           MOVE 0   TO GR-LEVEL  GR-PHONE GR-LTOUCH-DATE
                       GR-LN-APPROVAL-LIMIT.
