
      *********************************************************
      *        LIBLP/LPWSHE: HE FILE PATH
      *  EXPANDED HE-PROG TO X(10) TO ACCOUNT FOR ".TXT" EXTENSION
      *********************************************************
       01  HE-PATH.
           03  FILLER             PIC X(01) VALUE "/".
           03  HE-REL             PIC X(07).
           03  HE-HELP            PIC X(06) VALUE "/HELP/".
           03  HE-PROG            PIC X(14).
