      * COPYMEMBER: LIBGB/GETENVW
      ******************************************************
      *    GETENVW: WORKERS TO RETRIEVE ENVIROMENT VARIABLES
      *
      *    LIMIT NAME AND VALUE TO 19 BYTES
      ******************************************************
       01  GETENV-BUF    PIC X(20).
