      * COPYMEMBER: LIBGB/MKTEMP
      *****************************************
      *  PLACE PATH PREFIX IN MKTEMP-BUF.
      *  UNIQUE PATH APPEARS IN MKTEMP-BUF.
      *  NOTE THAT CALL DOES NOT CREATE FILE
      *  (RETURNS UNIQUE PATH FOR OPEN OUTPUT)
      *
      * REV:
      * MJD 130404 CHANGED TO CALL GB/MKTEMP.C THE VERYANT CONVERTED VERSION
      *            OF PFS C ROUTINE.
      *
      *            ADDED IF STAT = "05" TO BE ABLE TO RUN EITHER IN DEBUG
      *            FOR TESTING.
      * BLM 140417 SAVE & RESTORE FORM-PATH, SO CORRECT PROGRAM WILL
      *            GET CANCELED
      *****************************************
       MKTEMP-CALL.
           MOVE "05" TO STAT.
           MOVE FORM-PATH TO MKTEMP-SAVE-FORM-PATH.
           MOVE "GB/MKTEMP" TO FORM-NAM.
           CALL FORM-PROGX USING STAT MKTEMP-BUF.
           CANCEL FORM-PROGX.
           MOVE MKTEMP-SAVE-FORM-PATH TO FORM-PATH.
