
      *********************************************************
      * VERYANT
      *
      * WORKERS FOR UTILITIES TO PERFORM BITWISE OPERATIONS ON INTEGERS
      *
      * REV:
      *********************************************************
       01 PASSARGS.
          05 PA-STAT         PIC X(2).
          05 PA-PP           PIC X(10).
          05 PA-ENCRYPTED    PIC X(14).

