      * COPYMEMBER: LIBGB/PRINT.CPY

      * "TPUT CLEAR".
       01  CMD-CLEAR     PIC X(10) VALUE X'7470757420636C656172'.

      * TRANSPARENT PRINT ON:
      * "TPUT MC5".
       01  CMD-TPUT-MC5       PIC X(8)  VALUE X'74707574206D6335'.

      * TRANSPARENT PRINT OFF:
      * "TPUT MC4".
       01  CMD-TPUT-MC4       PIC X(8)  VALUE X'74707574206D6334'.

      * 132 COLUMN MODE:
      * "TPUT KF23".
       01  CMD-VDU       PIC X(9)  VALUE X'74707574206B663233'.

      * ENABLE FLOW CONTROL (DC1-DC3):
      * "STTY IXON".
       01  CMD-IXON      PIC X(9)  VALUE X'737474792069786F6E'.

      * DISABLE FLOW CONTROL (DC1-DC3):
      * "STTY -IXON".
       01  CMD-IXON-OFF  PIC X(10) VALUE X'73747479202D69786F6E'.

      * TEST EMPTY PRINT FILE
       01  TEST-0.
      *  "IF [ ! -S ".
           03  FILLER         PIC X(10) VALUE X'6966205B2021202D7320'.
           03  TEST-0-FILE    PIC X(32).
           03  FILLER         PIC X(24) VALUE
      *  "];THEN ECHO X 1>&2; FI".
                      X'5D3B7468656E206563686F205820313E26323B206669'.

      *   "/USR/TMP/".
       01  SPOOL-PATH-DEFAULT   PIC X(9) VALUE X'2F7573722F746D702F'.
      *    "/DEV/TTY".
       01  TTY-DEVICE           PIC X(8) VALUE X'2F6465762F747479'.
