      * COPYMEMBER: LIBSP/INSTRP.CMD
      *
      *    Commands for install program report
      *
      *    DO NOT CHANGE THE CASE OF THIS FILE!!!!!!
      *
      *REV:

       01  LOG-PATH-R1               PIC X(21) VALUE
           "/usr/data/r1/LG/prlog".
       01  LOG-PATH-R2               PIC X(21) VALUE
           "/usr/data/r2/LG/prlog".
       01  LOG-PATH-R3               PIC X(21) VALUE
           "/usr/mexi/r3/LG/prlog".

       01  R1                  PIC XX value "r1".
       01  R2                  PIC XX value "r2".
       01  R3                  PIC XX value "r3".

