      * COPYMEMBER: LIBSP/SPFSTW
           SELECT TRW-FILE ASSIGN TO TRW-PATH
                           ORGANIZATION RELATIVE
                           ACCESS DYNAMIC
                           LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                           RELATIVE KEY TRW-KEY
                           FILE STATUS FILE-STAT.
