      ****************************************************************
      *  6/12/12  I STARTED THIS SOMETIME IN 2011.  TOOK SPINQ.C
      *           & SPINQ0.C & COMBINED.  IDEA IS TO GET RID OF ALL
      *           THE STUFF THAT WAS GETTING PASSED, INCLUDING THE
      *           ENTIRE SP-REC, LN-REC & BR-REC.  JUST ADDING
      *           SPINQ1 TODAY, SO IT IS CURRENT AS OF 6/12/12.
      *           THIS IS JUST AN EXPERIMENT, BUT MIGHT BE ABLE
      *           TO USE THIS WHEN WE GO FORWARD.  ALWAYS HATED
      *           THE SPINQ1.CX/XPINQ1 STUFF, MAYBE WE CAN FIGURE OUT
      *           ANOTHER WAY TO HANDLE THIS IF THEY NEED TO LOAD
      *           2 COPIES OF COLLECTION WORK SCREEN.
      *
      * 9/15/16   HEY!!  WE HAD PROBLEMS WITH DUPLICATE SECONDARY CQ
      *           KEYS, SAME COLLECTOR, BAL, DEL.  SO I ADDED A SEQ,
      *           AND CHANGED SELECT TO SAY NO DUPS ON CQ2-KEY
      *           AND IT WILL STOP DUPS ON CQ2 KEY, BUT ONLY IF
      *           YOU REMOVE THE FILE & RE-CREATE, WITH THE
      *           NEW FILE SELECT!!  THIS IS ONLY NEEDED IF
      *           THEY HAVE DUPS & CAN'T DO F1 SKIP.
      *           IF IN DOUBT, DO VUTIL -I -X & LOOK AT DUPS 
      *           FOR KEY2.
      *
      *  7/3/12   WORKING ON ADDING STUFF FROM SPINQ1.  WILL MARK
      *           STUFF I AM NOT DEALING WITH IMMEDIATELY AS
      *           "** NEEDS WORK **".  IN ADDITION, NEED TO LOOK AT:
      *
      *           CHDIR STUFF, SEE SPINQ.  DOING FLDVAL ON OLD & NEW
      *           DATA PATHS TO DOUBLE CHECK AND CHANGE BACK TO OLD
      *           IF ACCESSING ACCT IN OTHER BACK.  SHOULD BE ABLE TO
      *           JUST SAVE AT THE BEG OF THIS PROGRAM & CHECK AT END.
      *
      *       CALLED FROM LPCPMU
      *
      *         SP/XPINQ IS NEW INQUIRY CALLED FROM F10 INTERRUPT
      *                 IF BR-NEW-COLL-INQUIRY = "Y"
      *         SP/OPINQ0 IS OLD INQUIRY CALLED FROM LPCPMU
      *                 IF BR-NEW-COLL-INQUIRY = "N"
      *         SP/CPINQ0 IS OLD INQUIRY CALLED FROM F10 INTERRUPT
      *                 IF BR-NEW-COLL-INQUIRY = "N"
      *
      *  REV:
      *  JTG 092591 CHANGED DISPLAY OF TODAY DUE & NEXT DUE
      *             REMOVED ADD OF LATE CHARGES
      *  101794 BAH REMOVED ALL OCCURANCES OF LP2
      *  123094 BAH ADDED EXT-WI-CL-SYSDATE FOR HARD COPY PRINT FROM F9
      *             ALL ACCTS WERE MATURED WITHOUT SYSDATE.
      *  050995 BAH ADDED COMAKER DISPLAY, BEFORE IT TESTS FOR SPOUSE
      *  083195 KEC ADDED LIBLP/LPNOCL
      *  090495 JTG ADDED TEST FOR GP-NO-LC-IN-ARREARAGE
      *  011696 BAH ADDED SET OF CRNO-LPTRCD TO "PO" FOR A TRUE PAYOFF QUOTE
      *  013196 JTG STOPPED FLASHING HIGH CREDIT WHEN CREDIT LIMIT = 0
      *  020696 BLL CHANGE SEQUENCING ON CQ TO DELINQUENCY,HIGH BAL
      *  020696 KEC CONVERTED LOGIN TO UPPER CASE LETTERS.
      *  022196 KEC USED BR-COLLECTOR-QUEUE TO PREVENT ACCESS TO CQ-FILE
      *  041096 KEC ADDED OPTION TO CHANGE COLLECTOR QUEUE.
      *  MJD 042496 CHANGED TO ACCEPT 8 DIGIT ACCOUNT NUMBER FROM BWLNSC.
      *             REPLACED LNDISP WITH MORELN WINDOW.
      *  BAH 071596 DISPLAY LT-B-MISC3 (FIELD 19) FROM BANKRUPT WINDOW, IF
      *             IT ISN'T SPACES.
      *  MJD 071696 ADDED LIBLP/LPUPWK FOR CHANGES IN LIBLP/AGEING
      *  MJD 071896 ADDED LOGIC FOR WEEKLY UNITPER.
      *  BLL 072596 MOVED MORELNW SO 03 LEVEL WAS UNDER WINDOWSW
      *  BLV 072596 LINKED FILES WILL BE PASSED FROM SPINQ & TO SPINQ1:
      *             GP, BR, SP, LN TO AVOID IO
      *  JTG 082896 CHANGED TO DISPLAY 9999 FOR CONTRACTUAL & RECENCY
      *  BLV 102996 IF ACCOUNT SELECTED FROM SCAN, SET QUEUED FLAG SO
      *             QUEUE WILL CONTINUE FORWARD FROM SELECTED ACCOUNT.
      *  JTG 110796 ADDED DISPLAY OF CLOSED (BW-PRLOANS)
      *  BAH 111596 ADDED BR-AVAIL-CREDIT = "S" FOR WDT (335)
      *  KEC 111496 CHANGED LN-POCD FOR RESCISSION.
      *  BLV 120596 FIX IN-PROCESS FLAG FOR COLLECTOR QUEUE
      *  BLV 120596 SEND MSG IF QUEUEING & BALANCE HAS CHANGED
      *  JTG 121296 ADDED SEND-MESS FOR RESCISSION RENEWAL STATUS
      *  JTG 010397 CHANGED TEST FOR LCPDTH & LCHG DISPLAY TO NEVER DISPLAY
      *             IF SP-LCFRMLA = " " AND REMOVED TEST ON JUDGEMENT
      *             SINCE ACCOUNTS IN JUDGEMENT CAN CONTINUE AS PRECOMP
      *  MJD 011097 ADDED EXT-WI-CL-PAY-SCHLD-FG
      *  BLV 012097 IF ACCT SELECTED FROM CQSCAN; READ CQ UPON RETURN FROM
      *             SCAN; MARK AS IN-PROCESS UNLESS CQ-IN-PROCESS ALREADY Y
      *  BLV 012297 FIXED BUG IN FIND-NEXT-ACCOUNT IN QUEUE: WAS MARKING
      *             SCHEDULED RECS IN-PROCESS WHEN END OF QUEUE WAS REACHED
      *  GLF 050797 ADDED COPY MEMBERS: SETCTBLW AND SETCTBL
      *  MJD 051597 ADDED LPPOF2 COPY MEMBER (PREVIOUSLY WAS PART OF LPPOFF)
      *   CS 052097 ADD DISPLAY OF BW-CREDIT-SCORE IF GREATER THAN ZERO
      *  JTG 052097 ADDED 'LIBLP/ADDONSPR' TO GET CORRECT SPR RE: INS RB
      *  BLV 052197 WRITE PLACEHOLDER MEMO SO COLLECTION MEMO WILL END UP
      *             IN LMFILE BEFORE OTHER MEMOS ENTERED IN SESSION
      *  MJD 061097 ADDED GLOBAL LOAN SCAN TO PULL LOANS ACCROSS BRANCHES.
      *  BLV 072197 CHANGED CQ2-KEY, NOW CAN KEEP UNWORKED ACCTS IN QUEUE
      *  JTG 072897 ADDED LPWDEL/W  MERCURY #E135
      *  MJD 082297 CHANGED LN-REC/CONPROFILE TO LN-REC/CONPROFILE(1)
      *  GLF 092297 ADDED BW-OTHPHONE
      *  GLF 101797 ADDED MOVE LN-APPNO TO EXT-WI-CL-APPNO
      *  JTG 111197 ADDED LOGIC FOR LIBLP/DEFPOL RE: BR-NODEF-1ST-X-MONTHS #167
      *  GLF 110998 MADE MEMO DATE 2000 COMPATIBLE
      *  JTG 121698 DISPLAYED 'R' VIA UNITPER-MASK LOGIC FOR REVOLVING ACCOUNT
      *  JTG 990129 ALLOWED NEGITIVE BALANCES TO DISPLAY WITH '- SIGN'
      *             AND STOPPED DISPLAY OF PAYOFF AMOUNT FOR REVOLVING
      *  MJD 990204 CHANGED TO DISPLAY "S" AFTER REGPYAMT IF THE ACCOUNT
      *             HAS A PAYMENT SCHEDULE. (REQ# 798 - SECURITY GROUP)
      *  GLF 990428 IF BR-AVAIL-CREDIT = 'N' OR SPACE, WILL DISPLAY MATURITY
      *             DATE IN ITS PLACE (PR#21, TFC)
      *  BLV 990715 IF USING COLLECTOR QUEUEING & ACCT IS RESCHEDULED,
      *             DISPLAY CURRENT RESCHED DATE & TIME, TFC PR# 36
      *  BLV 990803 IF BR-PRIO-MEMO-FLAG = C, DISPLAY COLLATER CODE &
      *             ID INSTEAD OF BORROWER PRIORITY MEMO
      *  MJD 990901 CHANGED THE FOLLOWING: IF BR-INBR-BILNSC-FG = "M"  THEN,
      *             WHEN F4-GLOBAL IS USED, THE USER WILL SEE A SMALL WINDOW
      *             PROMPTING THEM TO ENTER A BRNO AND ACCTNO.  UPON ENTRY
      *             THE USER WILL SEE THE LOAN DISPLAYED. (MULL PR# 925)
      *  MJD 991110 ADDED SRCD TO SCREEN DISPLAY (WORLD PR#215)
      *  BLV 000216 REGWAN PL#264, COLLECTOR QUEUE - IF SAME COLLECTOR, SAME
      *             DELINQUENCY, SAME BALANCE (WITHOUT CENTS), 2ND ACCT WILL
      *             NOT COME UP WITH F3 NEXT ACCT, CHANGED START-CQ2-GREATER
      *             TO JUST START-CQ2
      *  JTG 000621 CORRECTED FORMULA'S 99, 98 AND 97 INTEREST BEARING
      *             DEFERMENT CHARGES, BY SETTING UP DEF-TOTAL-INTDUE
      *             AS A INPUT FIELD AND NOT USING INDU-INTEREST MERCURY #224
      *  MJD 000818 ADDED LOGIC TO DISPLAY THE LOCAL TIME FOR THE
      *             BORROWER BEING CALLED. TIME IS BASED ON TIME ZONE OF
      *             BORROWERS HOME PHONE. IF THE HOME PHONE IS ZERO THEN
      *             I WILL TRY TO COMPUTE REMOTE TIME BY USING THE WORK PHONE.
      *             (TFC PR#25)
      *  BAH 001004 DISPLAY BW-REPCODE AFTER NAME FOR TAX PREREG WORLD PR# 240
      *  MJD 001129 ADDED LOGIC FOR GQFILE - GLOBAL COLLECTOR QUEUEING.
      *             (TFC PR#60).
      *  BAH 010108 SUBTRACT INDU-PENALTY FROM NO-DEFERMENT, USES "PO" FOR
      *             CRNORC WHICH CREATES A PENALTY, AND NEEDS TO NOT BE PART
      *             OF THE NO-DEFERMENT, OTHER INQUIRIES USE "PY" !! THIS ONE
      *             NEEDS "PO" FOR SOME OTHER NET PAYOFF FIGURES (LENDMARK)
      *  BLV 010209 FIX BUG IN GET-REMOTE-TIME WITH INCORRECT AMPM DISPLAYING,
      *             TFC, PR# 25
      *  BLV 010308 CHANGE "IF" WHICH COMPARED GP-CALL-START-TIME TO TIME-NOW
      *             TO COMPARE TO H-AND-M...OLD COMPARE WORKED, BUT MIKE WAS
      *             COMPARING X(8) TO 9(4) & IT SCARED ME
      *  BLV 010418 FIX, IF GLOBAL QUEUING & YOU SELECT ACCT FROM QUEUE INFO
      *             SCAN & ACCOUNT IS IN DIFFERENT BRANCH, PROGRAM DID NOT
      *             CHANGE DIRECTORY & YOU GOT "ACCOUNT NOT FOUND"
      *  BLV 010618 FIX IF F3 NEXT ACCOUNT IS A RESCHEDULE & GLOBAL QUEUING,
      *             SCREEN WOULD BRING UP BILN SCAN INSTEAD OF NEXT ACCOUNT!!
      *             CHANGED FIND-NX-GLOBAL-ACCT-QUEUED
      *  BAH 010628 DISPLAY "OO" IF BW-PRIVACY-OPT-OUT = "Y", TFC PR# 90
      *  CS  010823 GP-BW-PRIVACY-OPT-OUT MUST BE SET TO "Y" TO DISPLAY "OO"
      *             WHEN BW-PRIVACY-OPT-OUT IS "Y"
      *  JTG 010904 ALLOWED IB TYPE LOANS TO ACCELERATE     JIM R. (ALL) PR#1582
      *  BAH 011023 DISPLAY "BRANCH", BR-NO IF BR-AVAIL-CREDIT = "N",
      *             MERC PR# 262
      *  BLV 020607 CHANGE START-CQ2-FILE BACK TO START-CQ2-FILE-GREATER,
      *             BASICALLY UNDOING CHANGE FROM 2/16/00, PROBLEM THEN
      *             WAS F1 SKIP STUCK ON ACCTS WITH SAME 2NDARY KEY SO I
      *             ADDED 1 TO CQ-REV-BAL TO GET PAST TO NEXT ACCOUNT.  NOW
      *             PROBLEM IS THAT REGENCY HAS MANY ACCTS WITH SAME 2NDARY
      *             KEY, SO THAT LOGIC WAS SKIPPING ALL OF THEM INSTEAD OF
      *             JUST 1. SO NOW WILL SET A FLAG & KEEP ACCT # TO SKIP;
      *             THIS IS NOT PERFECT, FOR EX. STILL CAN'T SKIP 2 ACCTS
      *             WITH SAME 2NDARY KEY, BUT IT'S ALL I CAN COME UP WITH
      *             TIL NEXT RELEASE WHEN I WILL EXPAND KEY, REGWAN PL# 368
      *  BLV 020724 RESTORED SAVED COPY FROM 6/7/02, UN-DOING PL #386,
      *             COMPLAINTS FROM DIRK & WDT ABOUT TROUBLE SKIPPING
      *             ACCOUNTS, GETTING "STUCK"
      *  JTG 020910 CHANGED FOR (MIP) MONTHLY INSURANCE PREMIUMS   REGENCY #1801
      *             CHANGED SEND-DUE-DATE ROUTINE TO INCLUDE DUE MONTHLY
      *             INSURANCE PREMIUMS (MIP)
      *  JTG 030205 CHANGED LDUE & TDUE DISPLAY PER DIRK FOR EXCLUSION
      *             OF MIP INSURANCE PREMIUMS                      REGENCY #1998
      *  BAH 030602 REMOVE "AVAILABLE:" ON RIGHT HAND SIDE IF BR-AVAIL-CREDIT
      *             = "S" (FINMGM) AND CLASS 5, FINMGM PR# 2086
      *  CS  030624 PROMPT FOR PASSWORD IF ACCOUNT IS BANKRUPT BEFORE DISPLAY
      *             OF LOAN INFO AND ALLOWING PROCESS TO CONTINUE[REGACC PR#31]
      *  BAH 040114 WHEN ENTERRING THE BK-SEQ PASSWORD WRONG, THE JOINT MAKER
      *             WAS COMING BACK ON THE NEXT ACCOUNT, NEEDED TO CLEAR
      *             HOLD-BORR-INFO
      *  BAH 040422 REPLACE D-SRCD WITH BEHAVIOR GRADE SCORE FOR GP-I-AM-REGACC
      *             REGACC PR# 56
      *  BAH 040525 STRING LT-B-WHO-FILED ONTO THE BANKRUPT MESSAGE, PR# 2303
      *  BAH 040614 REMOVE "IF LR-PR10-DELQ-STGY-ID > 200" SO BEHAVIOR GRADE
      *             ALWAYS DISPLAYS FOR REGACC PR# 63
      *  BLV 040623 ADD SAVE-CQ-REV-BEHAVIOR-RISK TO SAVE-CQ2-KEY, REGACC PR#59
      *  BLV 040719 ADD ABILITY TO SET A STARTING POINT & REVIEW WORKED
      *             ACCOUNTS BY HITTING F3 FOR NEXT WORKED, REGACC PR# 62
      *  BAH 040916 ADDED GP-CHBORR-PAST-DUE-DAYS TO TEST DELINQUENT CUSTOMERS
      *             AND FORCE THEM INTO CHBORR, ONLY GP-I-AM-SOAUTO PR# 2317
      *  BAH 050426 WAS NOT DISPLAYING LOAN ENDORSER, ONLY JOINT, THRIFT PL# 482
      *  BAH 050713 ADDED GP-HIDE-FIRST-5-SSNO TO "X" OUT FIRST 5 OF SSNO IF
      *             SET TO "Y", REGACC PR# 109
      *  BAH 060108 CHANGED THE PROMPT "DEF/ADEL :" TO A FIELD SO SOUTHERN
      *             AUTO COULD HAVE IT INVERSE BOLD, SOAUTO PR# 2674
      *      * * *  NEEDS NEW FORM FOR ABOVE CHANGE, SOAUTO PR# 2674
      *  BAH 060208 REMOVE "AVAILABLE:" ON RIGHT HAND SIDE IF BR-AVAIL-CREDIT
      *             = "S" (FINMGM) AND CLASS 8, FINMGM PR# 2702
      *  BAH 060411 ADD LN-OTHBAL TO DUE AND NEXT DUE, SOAUTO PR# 2757
      *  BLF 060612 IF LN-ACH = "Y" & GP-LOAN-ACH-PROCESSING = "Y"
      *             DISPLAY INVERSE PROMPT "PAY ACH" INSTEAD OF
      *             "PAYMENT", NEWS PR# 2711
      *  BAH 060801 DISPLAY CELL PHONE (BW-MISC-PHONE(1)) FOR REGACC PR# 144
      *  BAH 060911 DISPLAY CELL PHONE (BW-MISC-PHONE(1)) FOR PCCREDIT
      *  MJD 061005 ADDED LOGIC TO HANDLE CHANGE TO COLLECTION WORK SCREEN.
      *             ADDED THE ABILITY TO ALLOW, WHEN YOU F3 (SPINQ1) TO
      *             HIGHLIGHT AN ACCOUNT AND BRING IT UP IN THE COLLECTION
      *             WORK SCRREN FORMAT, JUST LIKE IT WOULD HAVE HAD YOU USED
      *             THE F10 AND ENTERRED THE ACCOUNT MANUALLY.             #2843
      *  BAH 061107 DISPLAY LN-LAST-PYPA-DATE INSTEAD OF LN-DATE-PAID-LAST FOR
      *             LENDMARK ONLY BECAUSE BULKT2 UPDATES LN-DATE-PAID-LAST
      *             WHICH IS WORTHLESS TO THE COLLECTOR !!  LENDMARK PR# 2864
      *
      * KEC 070202 {PR#00000} REGIONAL ACCEPTANCE <A15> [KEVIN MULLEN]
      *            ADDED BX-REC.
      * BLF 070416 CHANGED TO SKIP ACCOUNT WHICH WAS JUST WORKED (BUT DID
      *            NOT HAVE RESULT CODE WHICH FLAGGED AS WORKED). CHECKED
      *            LOAN-KEY TO DETERMINE ACCOUNT # TO CHECK. SUPPORT PL#584
      * BAH 070504 DISPLAY NEW INSURANCE TRACKING FIELDS FROM THE LT-A RECORD
      *            IN PLACE OF THE BM PRIORITY MEMO FOR REGACC PR# 173
      * BAH 071016 DISPLAY "Y" UNTIL LN-PART-RECOURSE-DATE PASSES, THEN DISPLAY
      *            "N" IN THE RECOURSE FLAG, REGACC PR# 184
      * BAH 071017 DISPLAY "PRIME PAPER" IF PURCD = "PP" AND NOT BANKRUPT,
      *            GP-I-AM-REGACC ONLY REGACC PR# 189
      * BAH 071101 WHEN ADDING LN-OTHBAL TO TDUE AND NDUE, DO NOT ALLOW IT
      *            TO BE GREATER THAN PAYOFF. SOAUTO/FFG PL# 607
      *  CS 080411 ADD NEW DISPLAY OF DEFERMENTS FOR REGACC, WANTED BOTH DF & D2
      *            AMOUNTS, AND HIGHLIGHT  PR#202 REGACC
      *  CS 080421 HIGHLIGHT THE DF AMOUNT EVEN WHEN ZERO IF CUSTOMER IS ELIGIBL      *            FOR DF TRANSACTION PR#202 REGACC
      * BAH 080715 DISPLAY BW-CELL-PHONE, UNITED PR# 3218
      * BAH 080722 DO NOT DISPLAY AVAIL CREDIT FOR WORLD IF SCFRMLA 18 AND
      *            CASH AVAIL < 10 % OF AMTFIN, WORLD PR# 593
      * BAH 081014 DISPLAY LT-B-ACTIVE-INACTIVE REGACC PR# 223
      * BAH 081110 DISPLAY COUNTY DESCRIPTION FOR MIDATL ONLY, MIDATL PR# 3275
      * BLM 090414 ADD REVIEW MODE ABILITY (SET A STARTING POINT & REVIEW
      *            WORKED ACCOUNTS BY HITTING F3 FOR NEXT WORKED) FOR
      *            GLOBAL QUEUEING, REGACC PR# 243
      * BAH 090609 LATE CHARGE WAS NOT DISPLAYING WHEN USING DEALER LATE CHG
      *            FORMULA AND SPR FORMULA BLANK, UNITED PL# 657
      *            JTG FIXED THIS AS J027 IN LONPF0 ON 7/1/2003
      * BAH 091210 ADDED GP-DAYS-IDENT-NEW-PAPER AND CHANGED DISPLAY
      *            IN THE SPMEMO FIELD FOR REGACC PR# 262
      * BAH 100303 DO NOT DISPLAY TIME ZONE FOR UNITED, THEY WANT CELL
      *            PHONE BUT HAVE TIME ZONES TURNED ON, PR# 3444
      * BLM 100304 INCLUDE THE TIME ZONE DESCRIPTION IN THE ERROR MSG IF
      *            BORROWERS TIME IS OUT OF LEGAL RANGE, FOR EX.
      *            "WARNING: BORROWERS TIME OUTSIDE EST LEGAL HOURS:",
      *            UNITED PR# 3474
      * BAH 101018 DO NOT DISPLAY "DUE CONTR" FIELD FOR REGENCY PR# 3674
      * BAH 110214 DISPLAY SPECIAL STATUS CODES FOR GPS INFORMATION, PCCREDIT
      *                                                      PR # 3699
      *  CS 110314 DISPLAY ACCOUNT IN REVERSE VIDEO IF ACCOUNT IN CEASE &
      *            DESIST (CHANGES MENU), SETS LOAN STATUS CODE 'C'
      *            MODERN PR#3720
      * BAH 110328 IF GP-USE-SCRA "Y" AND LS-R-SCRA-ACTIVE "Y", DISPLAY
      *            "SCRA" IN PRIME PAPER AREA, REGACC PR# 289
      *
      ********************A30 CHANGES BELOW
      * BLM 120713 CHANGED SEND-HEAD-3 TO BE DUMMY PARAGRAPH INSTEAD OF
      *            COPIED BY LIBSP/SPMEMO (SENDING TO NON-DISPLAY FIELD
      *            CALLED TITLE).
      * BLM 120713 STARRED OFF SEND OF ACTIVITY DESCRIPTION TO FIELD 011,
      *            RESULT DESC TO 021, THESE WERE NON-DISPLAY FIELDS,
      *            WHO KNOWS.....
      * BAH 120727 ADDED CLASS 11 TO BR-AVAIL-CREDIT "S" IF STATEMENT,
      *                                                      FINMGM PR# 4085
      * BAH 121105 ADD "CND " AND "LGL " TO THE "NIVR" PASSWORD, SOAUTO PR# 4146
      * BAH 130326 ADDED CHECK OF FD-TRAILER-REC AND FTFILE, REGACC PR# 335
      * BAH 130521 ADDED CODE FOR GP-DUE-29-30-31, SOAUTO PR# 4239
      * BLM 130801 IF DISPLAYING & HIGHLIGHTING BAD ADDRESS, IF CHARACTERS
      *            25 & 26 OF D-JOINT-NAME WERE "BA", DISPLAYED AS BAD
      *            ADDRESS.  TAGGED BAD ADDR WITH "##" TO AVOID CONFLICT
      *            WITH NAMES LIKE BARBARA, REGACC PL # 803
      * BAH 130819 DONT DISPLAY "OO" FOR WORLD BW-PRIVACY-OPT-OUT PR# 919
      * BAH 130903 ADDED BR-AVAIL-CREDIT "B" TO DISPLAY "BRANCH", BR-NO
      *            AND HIGHLIGHT (REVERSE) HONOR PR# 4358
      * BLM 131203 WHEN ENTERING ACTIVITY & RESULT CODES, CHECK IF CODE IS
      *            SET UP AS "SUPERVISOR ONLY" & CHECK FOR PASSWORD IF LOGIN
      *            LETTER IS GREATER THAN CD-SUPERVISOR-ONLY.  PASSWORD FOR
      *            POSTING SUPERVISOR ONLY ACITIVITY IF YOUR LETTER IS GREATER:
      *            SP/SPINQ1/11.  RESULT SUPERVISOR ONLY: SP/SPINQ1/12.
      *            NOT A FORCED PASSWORD, WILL ONLY REQUIRE PASSWORD IF ONE
      *            IS SET UP, AND CD-SUPERVISOR ONLY IS NOT A SPACE OR
      *            CAPITAL Y OR N, AND LOGIN LETTER IS > CD-SUPERVISOR-ONLY,
      *            DEVELOPMENT PR# 4391
      *************************************************************************
      * BLM 131206 AUDITED MISSING A15 CHANGES SINCE BEG OF 2011 & FIXED:
      * BLM 111221 FIX PROBLEM FROM PR# 3474, IF UNITED & BOTH HOME &
      *            WORK PHONE ARE ZERO, CHECK CELL PHONE & GIVE MESSAGE
      *            IF ILLEGAL CALL TIME, UNITED PR# 3474
      * KEC 120212 {PR#03978} PARADATA <A15> [DAVID SINCLAIR]
      *            CREATED THE ABILITY TO CHOOSE THE WAY THE 'MESSAGE'
      *            IS DISPLAYED ON THE ACCOUNT INQUIRY, PAYMENT
      *            POSTING AND COLLECTION WORK SCREENS.
      * BAH 120522 ADDED DEBTAID-SEQ FOR REGACC PR# 311, PASSWORD ACCTS
      *            THAT ARE DEBTAID TO NOT DISPLAY
      * BLM 120725 CHECK SECURITY WHEN CREATING A FORM REQUEST, IF USER PROFILE
      *            GREATER THAN FD-SECURITY-PROFILE, DON'T ALLOW FORM REQUEST,
      *            REGACC PR# 316
      *** END OF A15/A30 AUDIT CHANGES, 12/06/2013 ***************************
      * BAH 120727 ADDED CLASS 11 TO BR-AVAIL-CREDIT "S" IF STATEMENT,
      *                                                      FINMGM PR# 4085
      * BAH 130521 ADDED CODE FOR GP-DUE-29-30-31, SOAUTO PR# 4239
      * BLM 130801 IF DISPLAYING & HIGHLIGHTING BAD ADDRESS, IF CHARACTERS
      *            25 & 26 OF D-JOINT-NAME WERE "BA", DISPLAYED AS BAD
      *            ADDRESS.  TAGGED BAD ADDR WITH "##" TO AVOID CONFLICT
      *            WITH NAMES LIKE BARBARA, REGACC PL # 803
      * BAH 130819 DONT DISPLAY "OO" FOR WORLD BW-PRIVACY-OPT-OUT PR# 919
      * BAH 130903 ADDED BR-AVAIL-CREDIT "B" TO DISPLAY "BRANCH", BR-NO
      *            AND HIGHLIGHT (REVERSE) HONOR PR# 4358
      * BAH 140814 QUEUE AND SYSDATE WERE NOT DISPLAYING, MOVED THEM TO 
      *            FORM-RESET SECTION, THE ERASE WAS CLEARING THEM
      * BLM 140825 ADD BREAKDOWN OF NEW-DATA-PATH & OLD-DATA-PATH, GETTING
      *            RID OF CHDIR, BARB & CINDY
      *  CS 140904 REMOVED BREAKDOWN OF NEW-DATA-PATH & OLD-DATA-PATH, NOW     
      *            USING SPINQ1-DATA-PATH TO SETUP THE PATHS. WHEN F4-GLOBAL
      *            INQUIRY, USE EXT-USE-EXT-FILPATH = "Y", WHEN DONE, SET BACK 
      *            TO "N", ALSO ADDED A MOVE OF OLD-DATA-PATH TO EXTERNAL'S 
      *            IN END-ROUTINE IN CASE OF PREMATURE EXIT BEFORE THE 
      *            EXT-USE-EXT-FILPATH IS SET BACK TO "N".
      * BLM 140923 ADD SAVE-WI-CL-WORKER, NEED TO PRESERVE INFO FROM SPINQ.
      *            IF ANOTHER ACCT SELECTED WITH F3 (BWLNS3), BWLNS3 CALLS
      *            XPINQ, WHICH WILL CHANGE EXT-WI-CL-ACCTNO & OTHER INFO
      *            IN EXT-WI-CL-WORKER. NOW WILL RESTORE ORIGINAL INFO
      *            AFTER CALLING BWLNS3.
      * BLM 141020 SAVE ORIG EXT-FILPATH IN HOLD-EXT-FILPATH & RESTORE
      *            UPON EXIT
      * BAH 150420 DISPLAY "F" AFTER ACCOUNT NUMBER IF FROZEN, NEWPORT PR#4717
      *
      * KEC 150514 PR#4754 GREATER SUBURBAN <A15> [DAVID SINCLAIR]
      *            ADDED THE USE OF PDUE-DAYS WITHIN MEMO-ACTIONCD.
      * BAH 150529 SET LN-TRW-COMPLIANCE-CODE FOR UNITED, PR# 4766
      * BAH 150716 ADD "BKD " TO THE "NIVR" PASSWORD, SOAUTO PR#4792
      * BLM 150922 ADD ABILITY TO PASSWORD SPECIFIC ACTION CODES.  CREATE
      *            PASSWORD WITH DIR OF SP, OPTION OF 0, AND PUT ACTIONCD
      *            IN PROGRAM NAME.  WORLD PR# 1108
      * BLM 150923 REVISE ACTION CODE PASSWORD (ABOVE) SO NO CONFLICT:
      *            PASSWORD WITH DIR OF SP, OPTION OF 0, AND PUT
      *            "AC-" FOLLOWED BY ACCTION CODE IN PROGRAM NAME,
      *            LIKE "AC-REPO".  WORLD PR# 1108
      * BLM 151007 CHECK ACTION CODE & REQUIRE PASSWORD IF CHANGING A
      *            PASSWORDED ACTION CODE.  FIX TO NOT CHECK PASSWORD IF
      *            ACTION CODE IS NOT CHANGED.  WORLD PR# 1108A
      * BLM 151023 IF I-AM-UNITED, CHECK MISC PHONES FOR TIME WARNINGS IN
      *            COLLECTIONS, UNITED PR# 4881
      * BLM 151030 REDISPLAY ORIGINAL ACTION CODE IF INCORRECT PASSWORD
      *            ENTERED, WORLD PR# 1108B
      * BAH 151103 IF USER SECURITY IS NOT AUTHORIZED FOR FORM#, ZERO IT OUT
      *            BECAUSE IF YOU EXIT AND UPDATE, IT WILL REQUEST IT ANYWAY!
      *                                                       REGACC PL# 908
      *
      * KEC 2016.0119 {PD#00003} PARADATA <A30> [JAY CISZEWSKI]
      *         FIXED KEYS & RECS FOR FD-REC.
      *         ADDED NEW FDB-FILE; WAS IN FD-FILE.
      *         REMOVED FT-FILE; MERGED INTO FD-FILE.
      * BAH 160118 SPLIT OUT LTFILE, PD0003
      *
      *
      * KEC 2016.0205 {PD#00003} PARADATA <A30> [JAY CISZEWSKI]
      *         FIXED KEYS & RECS FOR FD-REC & FM-REC.
      *         CHANGED FMNO/FORMNO/NEXTFM/SETFM FROM 3 TO 4 BYTES.
      *  BAH 160209 SPLIT OUT LSFILE, PD0003
      *
      * KEC 2016.0309 {PD#00003} PARADATA <A30> [JAY CISZEWSKI]
      *         CHANGED CD-CL???? TO BE CD-CL-????.
      *         CHANGED CD-ACTION???? TO BE CD-ACTION-????.
      *         CHANGED CD-AC-RE-REC TO BE SPLIT INTO CD-AT-REC &
      *         CD-RE-REC.  FIELDS CD-??-ACTIONCD, CD-??-MEMO-REQUIRED,
      *         CD-??-SUPERVISOR-ONLY ARE IDENTICAL (LOCATION, NAME,
      *         SIZE) IN SITUATIONS WERE NOT SURE WHICH TYPE CD-REC
      *         WAS READ.
      * KEC 2016.0323 {PD#00003} PARADATA <A30> [JAY CISZEWSKI]
      *         CHANGED CDSCAN-WINDOW-BUF TO HAVE MATCHING CD1-KEY
      *         LAYOUTS (FOR EACH CODE TYPE; CD-TYPE).
      *         CDSCAN-CD1-KEY IS THE NEW (PRIMARY) WITH REDEFINES OF
      *         CDSCAN-CD-??-KEY (NEW).
      *
      *  BAH 160419 DISPLAY REAFFIRMED AND DISCHARGED FOR WORLD PR#1150
      *  BAH 160513 REMOVED BX
      *  BLM 160913 FIX SAVE-CQ2-KEY & SAVE-GQ2-KEY, REMOVE OLD CQ & GQ
      *             SET DATE WORKERS, REMOVE MORELN
      *
      * KEC 2016.1004 {PD#00003} PARADATA <A30> [JAY CISZEWSKI]
      *         FIXED NEW-SEND-FORM & ORIG-SEND-FORM TO BE PIC 9(4).
      *         RENAMED LAST-WORKED TO BE LAST-WORKED-CQ2-KEY AND
      *         REDEFINES AS LAST-WORKED-GQ2-KEY;
      *         MADE LAST-WORKED-CQ2-KEY TO BE PIC X(58) WHICH IS
      *         THE SAME SIZE AS CQ2-KEY & GQ2-KEY.
      * BAH 161031 CHANGED H-SP1-KEY TO X(9).
      * BAH 161102 REMOVED TEST-IF-SC-RESTRICTION FROM SPINQ2.CPY, PUT
      *            IN LPAVCR, WORLD PR# 1199
      * KEC 2017.0109 {PR#00000} PARADATA <A30> [JAY CISZEWSKI]
      *          CHANGED CQSCAN-NUMBER AND GQSCAN-NUMBER TO BE
      *                  CQSCAN-ACCTNO AND GQSCAN-ACCTNO.
      * KEC 2017.0119 {PR#00000} PARADATA <A30> [JAY CISZEWSKI]
      *          CHANGED FD-SMARTPORT TO FD-OPTION [88 LEVELS].
      * BLM 170125 IN WORLD-CREDIT-DISPLAY, IF ACCOUNT WOULD BE A PB
      *            DELINQUENT IF RENEWED TODAY, DISPLAY A "D" NEXT TO
      *            THE AVAILABLE CREDIT, WORLD PR# 1220
      * BAH 170220 REMOVE THE CHECK TO ONLY DISPLAY [PBD] OR [PBI] IF NOT P&L
      *            HARD CODE THE COPY MEMBER LPSRCD ALSO TO NOT TEST FOR P&L
      *            THE PBI, PBD INDICATORS WERE CLEARING WHEN ACCOUNT IS
      *            CHARGED OFF, AUDITORS TRY TO MATCH UP THE INDICATORS WITH
      *            THE STEPS TAKEN ON THE LOAN AND THEY DON'T MATCH. WORLD 1229
      *  BAH 170320 DISPLAY LT-B-DISCHARGE-DATE WITH DISCHARGE MESSAGE FROM
      *             ABOVE CHANGE WORLD PR#1150, WORLD PR#1234
      *   CS 170324 IF WORLD, IF ACCOUNT IS 'BK' PERFORM VERIFY-PASSWORD, IF
      *             STAT NOT 'OK', DISPLAY FULL SCREEN WINDOW, IF THE USER
      *             TYPES 'Y' TO CONTINUE INTO ACCOUNT, CREATE A LOAN MEMO
      *             "BK ACCOUNT ACCESSED" WITH USERID /TIME. ALSO CREATE A
      *             LOG FILE /USR/DATA/R?/LG WORLD PR#1234
      *   CS 170411 FIXED DISPLAY IN VERIFY-PASSWORD-WORLD WORLD PR#1234
      *   CS 170517 CHANGED FULL SCREEN BK WINDOW TO NOT DISPLAY IF THERE
      *             IS A VALID REAFFIRMATION DATE AND DISCHARGE DATE IS 0
      *                                              WORLD PR#1234A
      *   CS 170728 WHEN ANSWERING 'Q' TO QUIT THE ACCOUNT IN WLRDBK SCREEN,
      *             (DISPLAYED ON BK ACCOUNTS) IF THE NEXT ACCOUNT ENTERED
      *             DID NOT HAVE A PHONE, ETC, THE VALUE WAS CARRIED OVER
      *             TO THE NEW LOAN FROM THE BANKRUPT LOAN, SPACES WERE 
      *             BEING MOVED TO DISPLAY-BORR-BUF BUT HOLD-BORR-INFO
      *             WAS NOT SET TO SPACES ORIG PR #1234, THIS IS PL#1263
      *   CS 180330 CHANGED HOLD-FACTOR TO HAVE VALUE OF +0 LIKE A15, WITHOUT
      *             THIS, IT JUNKED UP ADDING HOLD-FACTOR TO TEST-HOUR
      *  BAH 180716 REPLACED CRNORC WITH CRNOR2
      *   CS 190128 ADD SAVE-BRNO TO SAVE-CQ2-KEY AND REMOVE FILLER IN MIDDLE
      *             OF C2-KEY. CHANGED LAST-WORK-CQ2 SIZE TO 59 FROM 58
      *   CS 190205 COMMENT AWFILE COPIES AND REPLACE WITH WORKER 
      *             LIBLP/LPCPAW
      *   CS 190215 BROKE OUT CQ-FILE. CQ-FILE WILL BE THE DETAIL RECORDS,
      *             THE SUMMARY/HEADER ARE CQS-FILE
      *  KEC 190307 ADDED BACK THE SAVE-CQ2-KEY WITH FIELDS THAT
      *             MATCH FOR CQ2-KEY & CQS-CQ2-KEY-FIELDS TO WORK
      *             WITH A15/A30 LOGIC PRIOR TO ADDING BRANCH NUMBER
      *             WITHIN THE KEYS FOR LOCAL FILES. CS & KC 2019-0307
      * BAH 190311 MOVED FM-BRNO2 INTO LPWSFM-EDIT-FM-INITKEY TO REMOVE THE
      *            REDEFINE IN THE FM-REC
      *  CS 190313 ADDED CQSFILE, GQSFILE, SUMMARY/TOTAL WHICH PREVIOUS WAS
      *            A REDEFINE OF RECORD IN CQFILE.
      *  CS 190313 ADDED LAST-WORKED-CQ2-KEY,LAST-WORKED-GQ2-KEY
      *  CS 190327 COMMENT KEEP-GQ-BRNO,GQ-BRNO IS NOT PART OF GQ2-KEY
      *  CS 190327 REMOVED FILLER FROM KEEP-GQ2-KEY
      *  CS 20210506 REMOVE KEEP-CQ-FUTURE-KEY1,KEY2,KEEP-GQ-FUTURE-KEY1,KEY2
      *              KEEP-GQ-FUTURE-KEY1,KEY2, LWCQ2-FUTURE-KEY1,KEY2
      *              LWGQ-FUTURE-KEY1,KEY2
      *
      * SMR 2023-0925 ADDED VCQFILE LOGIC TO RESOLVE DIFFICULTY WITH
      *          THE CQ2-KEY WORKING WITH A SCAN WINDOW AND/OR USING A
      *          START-GREATER IO PARAGRAPH.  USING A TEMPORARY VISION
      *          CQFILE HELPS KEEP THE SAME EXPECT RESULTS FROM A15.
      *
      * SMR 2024-0213 ADDED VGQFILE LOGIC TO RESOLVE DIFFICULTY WITH
      *          THE GQ2-KEY WORKING WITH A SCAN WINDOW AND/OR USING A
      *          START-GREATER IO PARAGRAPH.  USING A TEMPORARY VISION
      *          GQFILE HELPS KEEP THE SAME EXPECT RESULTS FROM A15.
      * BAH 2024.0321 REMOVED COURTW
      * BAH 2025.0320 ADDED ORIG-FORM-PROGX AND XPINQ-FORM-PATHNAME FOR
      *               A USER SECURITY ERROR, NEED SPINQ IN THE FORM-PATHNAME
      *               AND FORM-PROGX WHEN COMING FROM XPINQ, BUT NEED IT
      *               PUT BACK TO XPINQ AFTER USER SECURITY AS IT IS TESTED
      *               IN OTHER PLACES S35Q-187
      *
      * JKC 2025-0324 S35Q-191 MASSIVE FIX FOR COLLECTIONS; FOR USING
      *         A IDENTICAL A15 VISION STRUCTURE FOR THE VCQFILE; FIX
      *         HANDLING DUPLICATE CQ2-KEY WITHIN THE VCQFILE WHICH YOU
      *         CAN READ LIBSP/SP01VCQ FOR MORE DETAIL INFORMATION.
      *         ADDED HOLD-CQ-REC AND SHOW-BRNO-ACCT-COLLID.
      *
      * JKC 2025-0401 S35Q-191 REMOVED SINCE NO LONGER USED:
      *         - 01  ACCT-AND-SEQ      PIC 9(8).
      *         - 01  ACCT-NO-WORK REDEFINES ACCT-AND-SEQ.
      *         -     03  ACCT-NO-NUM   PIC 9(6).
      *         -     03  ACCT-NO-SEQ   PIC 9(2).
      *
      * JKC 2025-0424 S35Q-200 ADDED NEW LOGIC FOR UPDATE THE VCQFILE;
      *          THE ORIGINAL VCQFILE WAS CREATED ONE PER USER PUT INTO
      *          /USR/TMP; THE NEW VCQFILE IS CREATED FOR ONE PER BRANCH
      *          PUT INTO /USR/DATA/R#/WK/VCQ#### WHICH WAS DONE FOR
      *          POTENTIALLY AVOID ISSUES WITH A VCQFILE ONE PER USER.
      *
      *************************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. 3B.
       OBJECT-COMPUTER. 3B.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       COPY "LIBSP/SPFSVCQ.CPY".
       COPY "LIBSP/SPFSVGQ.CPY".

       I-O-CONTROL.
       DATA DIVISION.
       FILE SECTION.

       COPY "LIBSP/SPFDVCQ.CPY".
       COPY "LIBSP/SPFDVGQ.CPY".

       WORKING-STORAGE SECTION.
       77  SCCS-IDENTIFIER PIC X(26) VALUE
           "@(#)LIBSP/SPINQ1.CPY J35 >".
       COPY "LIBGB/GB01BR.CPY".
       COPY "LIBGB/GB01BR_SQL.CPY".
       COPY "LIBGB/GBWSBR.CPY".
       COPY "LIBGB/GB01GB.CPY".
       COPY "LIBGB/GB01GB_SQL.CPY".
       COPY "LIBGB/GBWSGB.CPY".
       COPY "LIBLP/LP01LC.CPY".
       COPY "LIBLP/LP01LC_SQL.CPY".
       COPY "LIBLP/LPWSLC.CPY".
       COPY "LIBLP/LP01CD.CPY".
       COPY "LIBLP/LP01CD_SQL.CPY".
       COPY "LIBLP/LPWSCD.CPY".
       COPY "LIBLP/LP01CDB.CPY".
       COPY "LIBLP/LP01CDB_SQL.CPY".
       COPY "LIBLP/LPWSCDB.CPY".
       COPY "LIBLP/LP01SP.CPY".
       COPY "LIBLP/LP01SPA.CPY".
       COPY "LIBLP/LP01SPB.CPY".
       COPY "LIBLP/LP01SPC.CPY".
       COPY "LIBLP/LP01SP_SQL.CPY".
       COPY "LIBLP/LPWSSP.CPY".
       COPY "LIBLP/LP01LN.CPY".
       COPY "LIBLP/LP01LN_SQL.CPY".
       COPY "LIBLP/LPWSLN.CPY".
       COPY "LIBLP/LP01LSG.CPY".
       COPY "LIBLP/LP01LSG_SQL.CPY".
       COPY "LIBLP/LPWSLSG.CPY".
       COPY "LIBLP/LP01LSR.CPY".
       COPY "LIBLP/LP01LSR_SQL.CPY".
       COPY "LIBLP/LPWSLSR.CPY".
       COPY "LIBLP/LP01BW.CPY".
       COPY "LIBLP/LP01BW_SQL.CPY".
       COPY "LIBLP/LPWSBW.CPY".
       COPY "LIBLP/LP01BM.CPY".
       COPY "LIBLP/LP01BM_SQL.CPY".
       COPY "LIBLP/LPWSBM.CPY".
       COPY "LIBLP/LP01LP.CPY".
       COPY "LIBLP/LP01LP_SQL.CPY".
       COPY "LIBLP/LPWSLP.CPY".
       COPY "LIBLP/LP01LTA.CPY".
       COPY "LIBLP/LP01LTA_SQL.CPY".
       COPY "LIBLP/LPWSLTA.CPY".
       COPY "LIBLP/LP01LTB.CPY".
       COPY "LIBLP/LP01LTB_SQL.CPY".
       COPY "LIBLP/LPWSLTB.CPY".
       COPY "LIBLP/LP01LTI.CPY".
       COPY "LIBLP/LP01LTI_SQL.CPY".
       COPY "LIBLP/LPWSLTI.CPY".
       COPY "LIBLP/LP01LTP.CPY".
       COPY "LIBLP/LP01LTP_SQL.CPY".
       COPY "LIBLP/LPWSLTP.CPY".
       COPY "LIBSP/SP01CQ.CPY".
       COPY "LIBSP/SP01CQ_SQL.CPY".
       COPY "LIBSP/SPWSCQ.CPY".
       COPY "LIBSP/SP01CQS.CPY".
       COPY "LIBSP/SP01CQS_SQL.CPY".
       COPY "LIBSP/SPWSCQS.CPY".
       COPY "LIBSP/SP01GQ.CPY".
       COPY "LIBSP/SP01GQ_SQL.CPY".
       COPY "LIBSP/SPWSGQ.CPY".
       COPY "LIBSP/SP01GQS.CPY".
       COPY "LIBSP/SP01GQS_SQL.CPY".
       COPY "LIBSP/SPWSGQS.CPY".
       COPY "LIBLP/LP01LM.CPY".
       COPY "LIBLP/LP01LM_SQL.CPY".
       COPY "LIBLP/LPWSLM.CPY".
       COPY "LIBLP/LP01TZ.CPY".
       COPY "LIBLP/LP01TZ_SQL.CPY".
       COPY "LIBLP/LPWSTZ.CPY".
       COPY "LIBLP/LP01FD.CPY".
       COPY "LIBLP/LP01FD_SQL.CPY".
       COPY "LIBLP/LPWSFD.CPY".
       COPY "LIBLP/LP01FM.CPY".
       COPY "LIBLP/LP01FM_SQL.CPY".
       COPY "LIBLP/LPWSFM.CPY".
       COPY "LIBLP/LP01NO.CPY".
       COPY "LIBLP/LP01NO_SQL.CPY".
       COPY "LIBLP/LPWSNO.CPY".
       COPY "LIBSP/SP01CJ.CPY".
       COPY "LIBSP/SP01CJ_SQL.CPY".
       COPY "LIBSP/SPWSCJ.CPY".
       COPY "LIBLP/LP01DM.CPY".
       COPY "LIBLP/LP01DM_SQL.CPY".
       COPY "LIBLP/LPWSDM.CPY".
       COPY "LIBGB/GB01GR.CPY".
       COPY "LIBGB/GB01GR_SQL.CPY".
       COPY "LIBGB/GBWSGR.CPY".
       COPY "LIBSP/SPWSVCQ.CPY".
       COPY "LIBSP/SPWSVGQ.CPY".

       01  HOLD-CQ-REC       PIC X(CQ-SIZE)    VALUE SPACES.
       01  WK-PATH.
           03  FILLER        PIC X(11)   VALUE "/USR/TMP/WK".
           03  WK-USER-ID    PIC X(10)    VALUE " ".
       COPY "LIBSP/SPINQ1_CMD.CPY".

       01  CHAN                    PIC X(4)   VALUE " ".
       01  RESCHED-MEMO-FG         PIC X VALUE SPACES.
       01  UN-RESCHEDULE-FG        PIC X VALUE "N".
       01  BK-REAFF-STAT           PIC XX VALUE "XX".
      * ------------------------------------------------------------
      * WORKERS USED TO HANDLE INFO COMING FROM SPINQ1 F3 LOANS SCAN
      *                                                        #2843
      * ------------------------------------------------------------
       01  ALREADY-DISPLAYED-LOANS        PIC X     VALUE "N".

       01  TIME-WK-BUF.
           03  FILLER              PIC X(9)     VALUE
           "TIME__:__".
           03  TIME-WK-BUF-AM-PM   PIC XX       VALUE
           "PM".
       01  TIME-WK-LIST            PIC X(27)    VALUE
           "TIME:S 020 021 022 023 024.".

       01  TIME-WK-BUF-2.
           03  FILLER              PIC X(5)     VALUE
           "__:__".
           03  TIME-WK-BUF-AM-PM-2 PIC XX       VALUE
           "PM".
       01  TIME-WK-LIST-2          PIC X(20)    VALUE
           "020 021 022 023 024.".


       01  TIME-NOW-BUF            PIC X(8).
       01  TIME-NOW-LIST           PIC X(16)    VALUE
           "TIMENOW.".

       01  REMOTE-TIME-EDIT        PIC X(8).
       01  FILLER REDEFINES REMOTE-TIME-EDIT.
           03  REMOTE-HOUR         PIC 9(02).
           03  REMOTE-COLON        PIC X(01).
           03  REMOTE-MIN          PIC 9(02).
           03  REMOTE-SPACE        PIC X(01).
           03  REMOTE-AMPM         PIC X(02).
       01  REMOTE-TIME-LIST        PIC X(16)    VALUE
           "REMTIME.".
       01  REMOTE-TIME-LIST2       PIC X(16)    VALUE
           "RESTIME.".
       01  HOLD-REMOTE-PHONE-TABLE.
           03  HOLD-REMOTE-PHONE PIC 9(10) OCCURS 6.

       78  WS-AM                         VALUE X"616D".
       78  WS-PM                         VALUE X"706D".
       01  TZ-FOUND          PIC X(01).
       01  HOLD-SSNO         PIC 9(09)   VALUE 0.
       01  TEST-HOUR         PIC S99.

       01  HOLD-TIME1        PIC 9(04).
       01  FILLER REDEFINES HOLD-TIME1.
           03  HOLD-HH       PIC 99.
           03  HOLD-MM       PIC 99.

       01  REMOTE-MILITARY-TIME PIC 9(04).
       01  FILLER REDEFINES REMOTE-MILITARY-TIME.
           03  REMOTE-MIL-HH PIC 99.
           03  REMOTE-MIL-MM PIC 99.

       01  HOLD-AM-PM.
           03  HOLD-A-P            PIC X.
           03  HOLD-A-P-M          PIC X.
       01  SAVE-NEXT-DATE          PIC 9(8)    COMP-3.
       01  SAVE-NEXT-TIME          PIC 9(4).
       01  FILLER REDEFINES SAVE-NEXT-TIME.
           03  SAVE-NEXT-HH        PIC 9(2).
           03  SAVE-NEXT-MM        PIC 9(2).

       01  SAVE-OLD-WORKED-FG      PIC X.
       01  SAVE-NEW-WORKED-FG      PIC X.
       01  SAVE-RESULT-WORKED-FG   PIC X.
       01  SAVE-START-TIME         PIC 9(4)    COMP-3.
       01  SAVE-LM-DATE            PIC 9(8).
       01  SAVE-CON-STAT           PIC X(3).
       01  SAVE-REC-STAT           PIC X(3).
       01  CON-REC-STAT-ALP.
           03  CON-REC-STAT        PIC 999B.
       01  TOTAL-MINUTES           PIC 9(5) VALUE 0.

       01  VALID-PROMISE-PASSWD    PIC X VALUE SPACES.
       01  VALID-PROM2-PASSWD      PIC X VALUE SPACES.

       01  ACTIVITY-MEMO-REQUIRED    PIC X      VALUE " ".
       01  ACTIVITY-RESULT-REQUIRED  PIC X      VALUE " ".
       01  RESULT-MEMO-REQUIRED      PIC X      VALUE " ".
       01  RESULT-RESCHED-REQ        PIC X      VALUE " ".
       01  RESULT-ACTIVITY-REQUIRED  PIC X      VALUE " ".
       01  ACTIVITY-CODE-ENTERED     PIC X      VALUE " ".
       01  MEMO-ENTERED-FG           PIC X      VALUE "N".
       01  MEMOSC-MEMO-TYPE          PIC XX     VALUE "  ".
       01  MEMOSC-ONLY               PIC X      VALUE " ".

       01  ERRCD-LIST              PIC X(3)   VALUE "CD.".
       01  ORIG-1STFILE            PIC 9(2)   COMP-3.
       01  ORIG-FMTYPE             PIC X.
      *01  MOD-FM-TYPE             PIC X(3)   VALUE SPACES.
      *01  MOD-FM-KEY              REDEFINES MOD-FM-TYPE
      *                            PIC 9(3).            *> KEC 2016.0205
       01  ORIG-TRANS-DATE         PIC 9(8).

       01  PROM-LIST               PIC X(12)  VALUE "030 040 050.".

       01  SET-LM-MEMO-TYPE        PIC XX.
       01  MEMO-COLLECTOR-BUF.
           03  MEMO-COLLID         PIC XXX.
           03  FILLER              PIC X.
           03  MEMO-TIME           PIC X(8).
           03  FILLER              PIC X.
           03  MEMO-ACTIVITY       PIC XXX.
           03  FILLER              PIC X.
           03  MEMO-RESULT         PIC XXX.
           03  FILLER              PIC X.
           03  MEMO-PROMDATE       PIC 99/99/99      BLANK ZERO.
           03  MEMO-PROMAMT        PIC ZZZZZ9.99     BLANK ZERO.
           03  FILLER              PIC X.
           03  MEMO-PROMDATE2      PIC 99/99/99      BLANK ZERO.
           03  FILLER              PIC X.
           03  MEMO-FORM           PIC ZZZ.
           03  FILLER              PIC X.
           03  MEMO-ACTIONCD       PIC XXXX.
           03  FILLER              PIC X.
           03  MEMO-NEW-COLLID     PIC XXX.
       01  MEMO-PLACEHOLDER-BUF.
           03  MEMO-PLACEHOLDER-TIME    PIC X(8).
           03  FILLER                   PIC X.
           03  MEMO-PLACEHOLDER         PIC X(37) VALUE
               "ACCOUNT IS CURRENTLY BEING WORKED BY ".
           03  MEMO-PLACEHOLDER-COLLID  PIC XXX.
           03  FILLER              PIC X(11).

       01  RESCHEDULE-MEMO-BUF.
           03  RESCHED-MEMO-TIME   PIC X(8).
           03  FILLER              PIC X.
           03  RESCHED-MEMO-USERID PIC X(10).
           03  RESCHED-MEMO        PIC X(24).
           03  RESCHED-MEMO-DATE   PIC 99/99/99.
           03  FILLER              PIC X.
           03  RESCHED-MEMO-TIME2  PIC X(8).

      * FOR CHANGES TO LN-MESSAGE
       01  MEMO-AREA.
           03  FILLER          PIC X(4)  VALUE "OLD ".
           03  MEMO-DESCRIPT   PIC X(14).
           03  FILLER          PIC X     VALUE " ".
           03  MEMO-ORG-CHAR   PIC X(30).
           03  FILLER          PIC X     VALUE " ".
           03  MEMO-USERID     PIC X(10).

       01  DL-BRNO               PIC 9(4).
       01  DL-NUM                PIC 9(6).
       01  DL-DLNO               REDEFINES DL-NUM
                                 PIC 9(4)V99.

      * ORIGINAL SCREEN FIELDS:
       01  ORIG-FIELDS.
           03  ORIG-LN-ATCODE          PIC XXX.
           03  ORIG-LN-RECODE          PIC XXX.
           03  ORIG-LN-PROMDATE        PIC 9(8).
           03  ORIG-LN-PROMAMT         PIC S9(6)V99.
           03  ORIG-LN-PROMDATE2       PIC 9(8).
           03  ORIG-SEND-FORM          PIC 9(4).
           03  ORIG-LN-MESSAGE         PIC X(30).
           03  ORIG-LN-ACTIONCD        PIC X(4).
           03  ORIG-LN-COLLECTOR       PIC XXX.

      * ORIGINAL SCREEN FIELDS:
       01  NEW-FIELDS.
           03  NEW-LN-ATCODE           PIC XXX.
           03  NEW-LN-RECODE           PIC XXX.
           03  NEW-LN-PROMDATE         PIC 9(8).
           03  NEW-LN-PROMAMT          PIC S9(6)V99.
           03  NEW-LN-PROMDATE2        PIC 9(8).
           03  NEW-SEND-FORM           PIC 9(4).
           03  NEW-LN-MESSAGE          PIC X(30).
           03  NEW-LN-ACTIONCD         PIC X(4).
           03  NEW-LN-COLLECTOR        PIC XXX.

       01  HOLD-1STFILE            PIC 99.
       01  HOLD-FMTYPE             PIC X.

       01  HOLD-FD-OPTION              PIC X(1).
           88  HOLD-FD-OPTION-CUSTMT       VALUE "C".
           88  HOLD-FD-OPTION-EXTRACTION   VALUE "E".
           88  HOLD-FD-OPTION-STANDARD     VALUE "N" " ".
           88  HOLD-FD-OPTION-PCL-LASER    VALUE "P".
           88  HOLD-FD-OPTION-PST-LASER    VALUE "T".
           88  HOLD-FD-OPTION-SMARTPORT    VALUE "Y".
           88  HOLD-FD-OPTION-VALID        VALUE "C" "E" "N"
                                                 "P" "T" "Y".

       01  LEGEND                  PIC X(78).
       01  WINDOW-LEGEND           PIC X(35).
       01  NEW-FLAG                PIC 9.
       01  FIRST-TIME              PIC 9      VALUE 0.
       01  FIRST-MEMO              PIC 9      VALUE 0.
       01  TYP                     PIC 9      VALUE 0.
       01  ONE                     PIC S9.
       01  ELE                     PIC 99.
       01  ACTION.
           03  CHKEY               PIC X(4).
           03  CHNO                PIC 9(2).

       01  TEST-STATE          PIC X(2).
       01  TEST-LN-ACTIONCD    PIC X(4).
       01  HOLD-BK-MEMO.
           03  HOLD-BK-TEXT        PIC X(30).
           03  HOLD-POST-USERID    PIC X(10).
           03  HOLD-POST-TIME      PIC X(8).

       01  WORK-ERRLOG-DETAIL.
           03  WORK-ERRLOG-BR      PIC 9(4).
           03  FILLER              PIC X.
           03  WORK-ERRLOG-NUMBER  PIC 9(6).
           03  FILLER              PIC X.
           03  WORK-ERRLOG-DATE    PIC 99/99/9999.
           03  FILLER              PIC X.
           03  WORK-ERRLOG-BK-MSG.
               05  WORK-EL-BK-TEXT PIC X(30).

       01  SYSDATE-YYYYMMDD        PIC 9(8).
      *----------------------------------------------------------------
      * CODE-FOUND     : CODE IS " " OR EXISTS IN CD-FILE.
      * CODE-NOT FOUND : CODE DOES NOT EXIST IN CD-FILE.
      *----------------------------------------------------------------
       01  CODE-FOUND        PIC X     VALUE "Y".
           88 CODE-NOT-FOUND           VALUE "N".

      *----------------------------------------------------------------
      * CUSTOM I-AM-REGACC ACTIVITY CODE CHECKING
      *----------------------------------------------------------------
       01  TEST-ACTIVITY-CODE            PIC X(3).
           88 RIGHT-PARTY-CONTACT      VALUE
              "RPR" "RPE" "RPO" "RPI" "RPB" "RPM" "RPP" "RPW" "RPD".

      *************************************
      *   SCREEN DISPLAY BUFFER
      *************************************
       01  DISPLAY-BUF          VALUE SPACES.
           03  F01              PIC X(3).
           03  F02              PIC X(3).
           03  F03              PIC 99/99/99      BLANK ZERO.
           03  F04              PIC ZZZZZ.ZZ      BLANK ZERO.
           03  F05              PIC 99/99/99      BLANK ZERO.
           03  F06              PIC Z(3).
           03  F07              PIC X(4).
           03  F08              PIC X(3).
           03  F09              PIC X(30).

       01  DISPLAY-LIST.
           03  FILLER PIC X(20) VALUE "010 020 030 040 050 ".
           03  FILLER PIC X(12) VALUE "060 070 080 ".
           03  DISPLAY-F09-LIST.
               05  FILLER PIC X(03) VALUE "090".
               05  DISPLAY-F09-ATTR
                          PIC X(04) VALUE ":FR.".

       01  STAR-LINE.
           03  FILLER     PIC X(40) VALUE
           "****************************************".
           03  FILLER     PIC X(40) VALUE
           "****************************************".

       01  MAX             PIC 99   VALUE 9.
       01  MAX-FLAG        PIC X    VALUE "N".

      *    **********************************
      *    *   ELEMENT SPECIFICATIONS
      *    **********************************
       01  SPEC-TABLE.
      * 1. ACTIVITY CODE
           03  FILLER      PIC X(8) VALUE "E  A030 ".
      * 2. RESULT CODE
           03  FILLER      PIC X(8) VALUE "E  A030 ".
      * 3. PROMISED TO PAY DATE #1
           03  FILLER      PIC X(8) VALUE "ERNM060 ".
      * 4. AMOUNT PROMISED TO PAY
           03  FILLER      PIC X(8) VALUE "ENNN052 ".
      * 5. PROMISED TO PAY DATE #2
           03  FILLER      PIC X(8) VALUE "ERNM060 ".
      * 6. SEND FORM #
           03  FILLER      PIC X(8) VALUE "ENNN030 ".
      * 7. ACTION CODE
           03  FILLER      PIC X(8) VALUE "E  A040 ".
      * 8. COLLECTOR ID
           03  FILLER      PIC X(8) VALUE "E  A050 ".
      * 9. FLASHING MESSAGE
           03  FILLER      PIC X(8) VALUE "E  A300 ".

      *10. MEMO ENTRY ----> SUB ENTRY TO F05 <----
      *    03  FILLER      PIC X(8) VALUE "E  A600 ".

       01  SPEC-TAB       REDEFINES SPEC-TABLE.
           03  SPEC-REC   OCCURS 9 TIMES.
               05  SPEC    PIC X(7).
               05  CHFG    PIC X.

       01  IO-TYPE           PIC X(3).
       01  UNEARNED          PIC S9(6)V99 COMP-3.
       01  SUB               PIC 9(6)     VALUE 0.
       01  S1                PIC 9(2)     VALUE 0.
      *01  FIRST-TIME        PIC 9     VALUE 0.
       01  FIRST-SCAN        PIC 9     VALUE 0.

       01  NEW-PAPER         PIC X.
       01  PRIME-PAPER       PIC X.
       01  HOLD-NDUE         PIC S9(5)V99 COMP-3 VALUE 0.
       01  REMOTE-PHONE      PIC 9(10).
       01  REMOTE-TIME       PIC X(05).
       01  REMOTE-TIME-X     REDEFINES REMOTE-TIME
                             PIC Z9/99.
       01  REMOTE-AM-PM      PIC X(02).
       01  HOLD-FACTOR       PIC S9(02) VALUE +0.
       01  HOLD-PHONE        PIC 9(10).
       01  HOLD-PHONEX REDEFINES HOLD-PHONE.
           03  HOLD-AC       PIC 9(03).
           03  HOLD-PF       PIC 9(03).
           03  HOLD-4567     PIC 9(04).
       01  ILLEGAL-TIME-MSG.
           03  FILLER            PIC X(32) VALUE
               "WARNING: BORROWERS TIME OUTSIDE ".
           03  D-TIME-ZONE.
               05  FILLER        PIC X.
               05  D-DAYLIGHT    PIC X.
               05  FILLER        PIC X.
           03  FILLER            PIC X(12) VALUE
               " LEGAL HRS: ".
           03  D-CALL-START-TIME PIC 99/99.
           03  FILLER            PIC X(3) VALUE " - ".
           03  D-CALL-END-TIME   PIC 99/99.

      *    ------------------------------------------------------------
      *    IF LOAN IS PULLED FROM BWLN-SCAN THEN DO NOT CALL MORELN.
      *    ------------------------------------------------------------
       01  CALLED-BWLNSC-FG  PIC X     VALUE "N".

      *----------------------------------------------------------------
      *  WK-DATA-PATH  = WORKER USED FOR SETTING UP PATHS.
      *  NEW-DATA-PATH = OWNING BRANCHES DATA PATH
      *  OLD-DATA-PATH = POSTING BRANCHES DATA PATH.
      *----------------------------------------------------------------
       01  SPINQ1-DATA-PATH.
           03  SPINQ1-DATA-PATH-BASE         PIC X(09).
           03  FILLER              REDEFINES SPINQ1-DATA-PATH-BASE.
               05  SPINQ1-DATA-PATH-BASE-USR PIC X(05).
               05  SPINQ1-DATA-PATH-BASE-DIR PIC X(04).
           03  FILLER                        PIC X(01)   VALUE "/".
           03  SPINQ1-DATA-PATH-DISPLAY.
               05  SPINQ1-DATA-PATH-MACHINE  PIC X(02).
               05  FILLER                    PIC X(01)   VALUE "/".
               05  SPINQ1-DATA-PATH-DATA     PIC X(06).

       01  MSEL-LIST                   PIC X(5)    VALUE "MSEL.".
       01  WSEL-LIST                   PIC X(5)    VALUE "WSEL.".
       01  SOURCE-MACHINE              PIC X(02).
      *  NOTE: ERR-NUM NEEDS TO BE COMP-4.
       01  ERR-NUM                     PIC 9(9)  COMP-4.
       01  LSCAN-ERR                   PIC X(01) VALUE SPACE.
       01  GET-ACCOUNT-FOR-GQ          PIC X     VALUE " ".
       01  GET-ACCOUNT-ERR             PIC X     VALUE " ".
       
       01  DATA-PATH-BUF.
           03  NEW-DATA-PATH          PIC X(21)  VALUE SPACES.
           03  OLD-DATA-PATH          PIC X(21)  VALUE SPACES.

       01  DEFAULT1-KEY       PIC X.
       01  SCAN-FLAG         PIC 9     VALUE 0.
       01  SCAN              PIC X(2)  VALUE SPACES.
           88  SCAN-ON       VALUE "ON".
       01  HOLD-BW-SSNO      PIC 9(11) VALUE 0.
       01  NAME-WORKER       PIC X(40) VALUE SPACES.
       01  NAME              PIC X(16) VALUE SPACES.
       01  TYP               PIC 9     VALUE 0.
       01  ENTER-SEQNO       PIC X     VALUE SPACES.
       01  BORROWER-SCAN     PIC X     VALUE SPACES.
       01  TIME-TEST-FG      PIC X.
       01  TEST-CALL-TIME-FG PIC X     VALUE "Y".
       01  IX1               PIC 99    COMP-3.
       01  IX2               PIC 99    COMP-3.

       01  KEEP-CQ2-KEY. 
           03  KEEP-CQ-BRNO              PIC 9(4).
           03  KEEP-CQ-COLLID            PIC XXX.
           03  KEEP-CQ-REV-BEHAVIOR-RISK PIC 9.
           03  KEEP-CQ-SEQ-FG            PIC X.
           03  KEEP-CQ-DATE              PIC 9(8).
           03  KEEP-CQ-START-TIME        PIC S9(4)   COMP-3.
           03  KEEP-CQ-REV-DEL           PIC 9(5).
           03  KEEP-CQ-MISC-KEY-FLD      PIC X(3).
           03  KEEP-CQ-REV-PDUE-DAYS     PIC 9(5).
           03  KEEP-CQ-REV-BAL           PIC 9(7).
           03  KEEP-CQ-SEQ               PIC 9(3).

       01  KEEP-GQ2-KEY                  PIC X(58).
       01  FILLER              REDEFINES KEEP-GQ2-KEY.
           03  KEEP-GQ-COLLID            PIC XXX.
           03  KEEP-GQ-SEQ-FG            PIC X.
           03  KEEP-GQ-DATE              PIC 9(8).
           03  KEEP-GQ-START-TIME        PIC S9(4)   COMP-3.
           03  KEEP-GQ-SEQ-FIELDS.
               05  KEEP-GQ-REV-DEL       PIC 9(5).
               05  KEEP-GQ-MISC-KEY-FLD  PIC X(3).
               05  KEEP-GQ-REV-PDUE-DAYS PIC 9(5).
               05  KEEP-GQ-REV-BAL       PIC 9(7).
               05  KEEP-GQ-SEQ           PIC 9(3).
       01  ACCTS-TO-WORK            PIC 9(5) VALUE 0.
       01  HOLD-CQ-SEQ              PIC 999  VALUE 0.
       01  HOLD-GQ-SEQ              PIC 999  VALUE 0.

       01  NUM-BW            PIC 9(9).
       01  NUM-BW-WK         REDEFINES NUM-BW.
           03  NUM-BW1       PIC 999.
           03  NUM-BW2       PIC 99.
           03  NUM-BW3       PIC 9999.
       01  ALP-BW.
           03  ALP-BW1       PIC 999.
           03  ALP-HYPHEN1   PIC X.
           03  ALP-BW2       PIC 99.
           03  ALP-HYPHEN2   PIC X.
           03  ALP-BW3       PIC 9999.

       01  PROFILE-EDIT      PIC 9(12).
       01  PROFILE-ED        REDEFINES PROFILE-EDIT
                             PIC X(12).

       01  DELINQ-VALUE.
           03  DELINQ-ALP.
               05  DELINQ-NUM      PIC ZZZZ,ZZ9.99-  BLANK ZERO.
       01  DELINQ-BUF              PIC X(3)         VALUE " ".
       01  DELINQ-CODE             PIC X.
       01  BAL-WORKER              PIC 9(6).
       01  PBD-FLAG                PIC X.

       01  LEGEND-E1.
           03  FILLER              PIC X(51)  VALUE
           "F7-EXIT, F3-NEXT LOAN, F4-GLOBAL, F5-QUEUE INFO, F6".
           03  FILLER              PIC X(22)  VALUE
           "-SCAN, ENTER LNNO:".
       01  LEGEND-EX.
           03  FILLER              PIC X(51)  VALUE
           "F7-EXIT, F4-GLOBAL, F6-LOAN SCAN, ENTER ACCTNO:".

       01  DIS-BRANCH.
           03  FILLER             PIC X(21) VALUE
           "A/C OWNED BY BRANCH# ".
           03  DIS-BR             PIC ZZZ9.

       01  HOLD-EXT-FILPATH            PIC X(35).

       COPY "LIBWI/BWLNSCW.CPY".
       COPY "LIBWI/GQSCANW.CPY".
       COPY "LIBWI/CQSCANW.CPY".
       COPY "LIBWI/BWLNS3W.CPY".
       COPY "LIBWI/CDSCANW.CPY".
       COPY "LIBWI/CDBSCNW.CPY".
       COPY "LIBCL/CLMENUW_EXT.CPY".
       COPY "LIBWI/PFSWINDOWSW.CPY".

       COPY "LIBLP/LPCPAW.CPY".
       COPY "LIBWI/COLASTW.CPY".
       COPY "LIBWI/FDSCANW.CPY".
       COPY "LIBWI/BILNSCW.CPY".

      ********************************
      *   S C R E E N   B U F F E R  *
      ********************************
       01  HIGH-BUF.
           03  HIGH-CREDIT-X-BUF         PIC X(12).
           03  HIGH-CREDIT-BUF           PIC Z(5)B.
           03  AVA-BUF                   PIC X(7).
           03  AVAIL-BUF                 PIC Z(6)9.99B.
           03  AVAIL-SPACE               REDEFINES AVAIL-BUF.
               05  FILLER                PIC X(10).
               05  AVAIL-BUF-RESTRICT-FG PIC X.
           03  AVAIL-DATE                REDEFINES AVAIL-BUF.
               05  FILLER                PIC X(2).
               05  MATU-DATE             PIC 99/99/99.
               05  FILLER                PIC X.
           03  WORLD-AVAIL-BUF           REDEFINES AVAIL-BUF.
               05  AVAIL-AMT             PIC Z(5)9.99.
               05  AVAIL-FLAG1           PIC X.
               05  AVAIL-FLAG2           PIC X.

       01  HIGH-LIST.
           03  FILLER                    PIC X(16) VALUE
               "H22 H23 H24 H25.".

       01  HIGH-LIST-ATTR.
           03  FILLER                    PIC X(24) VALUE
               "H22:R H23:R H24:R H25:R.".
       01  HIGH-LIST-S5      PIC X(25) VALUE "H22:R H23:R H24 H25.".

       01  DEF-ADEL-LIST.
           03  FILLER                    PIC X(10) VALUE "ADELALP:R.".
       01  DEF-ADEL-BUF                  PIC X(10).


       01  HOLD-BORR-INFO    VALUE " ".
           03  HOLD-SPOUSE.
               05  D-SP0         PIC X(8).
               05  D-SP1         PIC X(11).
               05  D-SP1-X-OUT REDEFINES D-SP1.
                   07  D-SP1-1   PIC X(3).
                   07  FILLER    PIC X.
                   07  D-SP1-2   PIC XX.
                   07  FILLER    PIC X(5).
           03  HOLD-SPOUSE-NAME.
               05  FILLER        PIC X(8).
               05  D-SP2         PIC X(18).
               05  FILLER REDEFINES D-SP2.
                   07  D-SP2-NAME PIC X(15).
                   07  D-SP2-BAD  PIC X(3).
           03  HOLD-HOME-PHONE.
               05  HOME-PROMPT   PIC X(13).
               05  D-PHONE       PIC 999/999/9999 BLANK ZERO.
               05  FILLER           PIC X(05).
           03  FILLE REDEFINES HOLD-HOME-PHONE.
               05  HOME-PROMPT2  PIC X(06).
               05  D-PHONE2      PIC 999/999/9999 BLANK ZERO.
               05  FILLER        PIC X(04).
               05  D-HTIME       PIC X(05).
               05  D-HAMPM       PIC X(02).
               05  FILLER        PIC X(01).
           03  FILLER REDEFINES HOLD-HOME-PHONE.
               05  H-PROMPT      PIC X(2).
               05  D-HPHONE      PIC 999/999/9999 BLANK ZERO.
               05  C-PROMPT      PIC X(3).
               05  D-CPHONE      PIC 999/999/9999 BLANK ZERO.
               05  FILLER        PIC X.
           03  HOLD-WORK-PHONE.
               05  D-WPHONE      PIC 999/999/9999 BLANK ZERO.
               05  FILLER        PIC X.
               05  D-WEXT        PIC 9999 BLANK ZERO.
               05  FILLER        PIC XX.
               05  D-EMP-HOURS   PIC X(9).
               05  FILLER REDEFINES D-EMP-HOURS.
                   07  FILLER    PIC X(02).
                   07  D-WTIME   PIC X(05).
                   07  D-WAMPM   PIC X(02).
           03  HOLD-EMP-NAME.
               05  EMP-PROMPT    PIC X(5).
               05  D-EMP-NAME    PIC X(24).

       01  DISPLAY-BORR-LIST.
           03  FILLER        PIC X(48) VALUE
           "SOC OPEN CLOSED  A1 A2 A3 A4 A5 A6 A7 A8 A9 P01 ".
           03  FILLER        PIC X(20) VALUE
            "SCORE:S CREDITSCORE.".

       01  DISPLAY-BORR-BUF  VALUE " ".
           03  D-SOC         PIC X(11).
           03  D-SOC-X-OUT REDEFINES D-SOC.
               05  D-SOC1    PIC X(3).
               05  FILLER    PIC X.
               05  D-SOC2    PIC XX.
               05  FILLER    PIC X.
               05  D-SOC3    PIC X(4).
           03  D-OPEN-LNS    PIC ZZ.
           03  D-CLOSED-LNS  PIC ZZ.
           03  D-X-NAME.
               05  D-NAME    PIC X(30) OCCURS 9.
           03  D-Y-NAME REDEFINES D-X-NAME.
               05  FILLER    OCCURS 9.
                   07  D-NAME-WORLD PIC X(25).
                   07  FILLER       PIC X.
                   07  D-REP-WORLD  PIC X(3).
                   07  FILLER       PIC X.
      * USE THIS TO TEST IF BAD ADDRESS FLAG WAS SET, I KNOW ITS UGLY
           03  D-Z-NAME REDEFINES D-X-NAME.
               05  FILLER    OCCURS 9.
                   07  D-JOINT-NAME PIC X(24).
                   07  D-JOINT-BAD  PIC X(2).
                   07  FILLER       PIC X(4).
           03  D-MEMO        PIC X(25).
           03  FILLER REDEFINES D-MEMO.
               05  D-COLLCD  PIC X(4).
               05  D-COLLID  PIC X(21).
           03  D-SCOREPROMPT PIC X(6).
           03  D-CREDIT-SCORE PIC ZZZZ.


       01  TEST-JOINT-BAD        PIC X(30).
       01  FILLER REDEFINES TEST-JOINT-BAD.
           03  TEST-JOINT-NAME   PIC X(24).
           03  TEST-JOINT-BA     PIC X(2).
           03  FILLER            PIC X(4).


       01  DISPLAY-LOAN-LIST.
           03  FILLER        PIC X(22) VALUE
           "LNNO LNSEQ SRCD MAKER ".
           03  FILLER        PIC X(27) VALUE
           "LOANDATE 1STPYDATE LOANAMT ".
           03  FILLER        PIC X(47) VALUE
           "REGPYAMT REGPYAMT-S PDTHRU LCPDTHRU NODEF ADEL ".
           03  FILLER        PIC X(38) VALUE
           "DEFALP:S DEFD DEF BALANCE PAYOFF TDUE ".
           03  FILLER        PIC X(22) VALUE
           "TDUEPROMPT:S TDUECONT ".
           03  FILLER        PIC X(38) VALUE
           "TERM LDUED LDUE NDUED NDUE LPAYD LPAY ".
           03  FILLER        PIC X(25) VALUE
           "CONPROMPT CON CONPROFILE ".
           03  FILLER        PIC X(25) VALUE
           "RECPROMPT REC RECPROFILE ".
           03  FILLER        PIC X(21) VALUE
           "LCHG DLNO DLRECOURSE.".

       01  DISPLAY-LOAN-BUF  VALUE " ".
           03  D-LOAN-NUM    PIC X(16).
           03  D-SRCD        PIC X(05).
           03  D-MAKER       PIC X(8).
           03  D-LOANDATE    PIC 99/99/99.
           03  D-1STPYDATE   PIC X(8).
           03  D-LOANAMT     PIC ZZZZZZ.99.
           03  D-REGPYAMT    PIC Z(5).99.
           03  D-REGPYAMT-S  PIC X.
           03  D-PDTHRU      PIC 9999.
           03  D-LCPDTH      PIC 9999.
           03  D-NO-DEF      PIC ZZ.
           03  D-ADEL        PIC ZZ.
           03  D-DEFALP      PIC X(4).
           03  D-DEFD        PIC 99/99            BLANK ZERO.
           03  D-DEF         PIC Z(5).99          BLANK ZERO.
           03  D-BALANCE     PIC ZZZZZZ.99-.
           03  D-PAYOFF      PIC ZZZZZZ.99.
           03  D-TDUE        PIC Z(5).99.
           03  D-TDUE-PROMPT PIC X(10).
           03  D-TDUE-CONT   PIC Z(5).ZZ          BLANK ZERO.
           03  D-ORGTERM     PIC ZZ9.
           03  D-LDUED       PIC 99/99/99         BLANK ZERO.
           03  D-LDUE        PIC Z(5).99          BLANK ZERO.
           03  D-NDUED       PIC 99/99/99         BLANK ZERO.
           03  D-NDUE        PIC Z(5).99          BLANK ZERO.
           03  D-LPAYD       PIC 99/99/99         BLANK ZERO.
           03  D-LPAY        PIC Z(5).99          BLANK ZERO.
           03  D-CONPROMPT   PIC X(4).
           03  D-CONX.
               05  D-CON     PIC Z999.
           03  D-CONPROFILE  PIC X(12).
           03  D-RECPROMPT   PIC X(4).
           03  D-RECX.
               05  D-REC     PIC Z999.
           03  D-RECPROFILE  PIC X(12).
           03  D-LCHG        PIC Z(3).99.
           03  D-DLNO        PIC ZZZ9.99.
           03  D-DLRECOURSE  PIC X.


       01  PMT-PROMPT-LIST   PIC X(12) VALUE "PMTPROMPT:D.".
       01  ACH-PROMPT-LIST   PIC X(12) VALUE "PMTPROMPT:R.".
       01  PMT-PROMPT-BUF    PIC X(10) VALUE "PAYMENT  :".
       01  ACH-PROMPT-BUF    PIC X(10) VALUE "PAY ACH  :".

       01  D-MESSAGE         PIC X(30).
       01  MESSAGE-LIST-ATTR PIC X(11) VALUE "MESSAGE:R.".
       01  MESSAGE-LIST      PIC X(8)  VALUE "MESSAGE.".

       01  LOAN-INFO-LIST.
           03  FILLER          PIC X(39) VALUE
           "HEAD:S L01 L02 L03 L04 L05 L06 L07 L08.".

       01  LOAN-INFO-BUF.
           03  FILLER          PIC X(40) VALUE
           "ACCOUNT #         DATE  LOAN AMT TRM  DE".
           03  FILLER          PIC X(16) VALUE
           "ALER COL PL/JD  ".
           03  DELINQ-PROMPT   PIC X(11).
           03  FILLER          PIC X(13) VALUE
           "  BAL/PDOFF M".
           03  LOAN-INFO-TABLE.
               05  LOAN-INFO-TAB OCCURS 8.
                   07  LI-LOAN-NUM PIC X(16).
                   07  FILLER      PIC X.
                   07  LI-LNDATE   PIC 9(6).
                   07  LI-LOAN-AMT PIC ZZZZZZ.ZZ.
                   07  FILLER      PIC X.
                   07  LI-TRM      PIC ZZZ.
                   07  FILLER      PIC X.
                   07  LI-DEALER   PIC ZZZZ.ZZ.
                   07  FILLER      PIC X.
                   07  LI-COLL     PIC XX.
                   07  FILLER      PIC X.
                   07  LI-PLFG     PIC X.
                   07  LI-JDPLDT   PIC 9(6)  BLANK ZERO.
                   07  FILLER      PIC X.
                   07  LI-CONTRACT PIC X(12).
                   07  FILLER      PIC X.
                   07  LI-BAL.
                       09  LI-LOAN-BAL PIC ZZZZZZ.ZZ-.
                       09  LI-MKR      PIC X.
                   07  LI-POFF REDEFINES LI-BAL.
                       09  LI-POCD     PIC XX.
                       09  FILLER      PIC X.
                       09  LI-PAIDOFF  PIC 9(6).
                       09  FILLER      PIC XX.
       01  COLQUEUE-LIST       PIC X(9) VALUE
           "COLQUEUE.".
       01  COLQUEUE-BUF.
           03  COLQUEUE-PROMPT PIC X(7) VALUE
               "QUEUE: ".
           03  D-COLLECTOR     PIC XXX.

       01  DISPLAY-TRACKING.
           03  FILLER           PIC X(10) VALUE "TRK ONLY: ".
           03  D-TRACK          PIC X.
           03  FILLER           PIC X(6) VALUE " INS: ".
           03  D-INS            PIC X.
           03  FILLER           PIC X(6) VALUE " CPP: ".
           03  D-CPP            PIC X.

       01  RESCHEDULE-BUF.
           03  FILLER          PIC X(2) VALUE "R:".
           03  D-RESCH-DATE    PIC Z9/99/99 BLANK WHEN ZEROES.
           03  FILLER          PIC X.
           03  D-TIME.
               05  D-HH            PIC Z9.
               05  D-COLON         PIC X.
               05  D-MM            PIC 99.
               05  D-AM-PM         PIC XX.

       01  WK-START-TIME           PIC 9(4).
       01  WK-START-TIMEX          REDEFINES WK-START-TIME.
           03  WK-START-HH         PIC 99.
           03  WK-START-MM         PIC 99.
       01  SAVE-WI-CL-WORKER       PIC X(120).
       01  ORIG-FORM-PROGX         PIC X(6).
       01  XPINQ-FORM-PATHNAME.
           03  FILLER             PIC X(15).
           03  XPINQ-FORM-NAME    PIC X(7).

       01  SHOW-BRNO-ACCT-COLLID   PIC X(17).

      ************************************
      *     C O M M O N   M E M O R Y    *
      ************************************
       01  INQ0-FIELDS-LIST         PIC X(5)     VALUE "INQ0.".
       01  INQ0-FIELDS.
           03  PAYOFF              PIC S9(7)V99 COMP-3.
           03  START-TIME          PIC 999999   COMP-3.
           03  QUEUED-FG           PIC X.
       01  PROG-BUF                       VALUE SPACE.
           03  ERRCD                      PIC X.
           03  ROUTE-CD                   PIC X.
           03  TRANS-DATE                 PIC 9(8).
           03  LOAN-KEY                   PIC 9(8).
           03  BORROWER-KEY               PIC 9(9).
           03  DELINQ-PROFS.
               05  DELINQ-PROF1           PIC X.
               05  DELINQ-PROF2           PIC X.
               05  DELINQ-PROF3           PIC X.
           03  USER-COLLID                PIC X(3).
           03  MAKER-CD                   PIC X.
           03  SELECTED-COLLID            PIC X(3).
           03  SAVE-LM-COL-SEQ            PIC 9(3).
           03  SAVE-TDUE                  PIC S9(7)V99 COMP-3.
           03  LAST-WORKED-CQ2-KEY.
               05  LWCQ2-BRNO              PIC 9(4).
               05  LWCQ2-COLLID            PIC XXX.
               05  LWCQ2-REV-BEHAVIOR-RISK PIC 9.
               05  LWCQ2-SEQ-FG            PIC X.
               05  LWCQ2-DATE              PIC 9(8).
               05  LWCQ2-START-TIME        PIC S9(4)   COMP-3.
               05  LWCQ2-REV-DEL           PIC 9(5).
               05  LWCQ2-MISC-KEY-FLD      PIC X(3).
               05  LWCQ2-REV-PDUE-DAYS     PIC 9(5).
               05  LWCQ2-REV-BAL           PIC 9(7).
               05  LWCQ2-SEQ               PIC 9(3).

           03  LAST-WORKED-GQ2-KEY.
               05  LWGQ2-BRNO             PIC 9(4).
               05  LWGQ2-COLLID            PIC XXX.
               05  LWGQ2-SEQ-FG            PIC X.
               05  LWGQ2-DATE              PIC 9(8).
               05  LWGQ2-START-TIME        PIC S9(4)   COMP-3.
               05  LWGQ2-REV-DEL           PIC 9(5).
               05  LWGQ2-MISC-KEY-FLD      PIC X(3).
               05  LWGQ2-REV-PDUE-DAYS     PIC 9(5).
               05  LWGQ2-REV-BAL           PIC 9(7).
               05  LWGQ2-SEQ               PIC 9(3).


       COPY "LIBCL/VCQUPD_LNK.CPY".
       COPY "LIBLP/LP01CH.CPY".
       COPY "LIBSP/SPMEMO_CMD.CPY".
       COPY "LIBSP/SPMEMOW.CPY".
       COPY "LIBGB/ACCESSW.CPY".
       COPY "LIBGB/SYSTEMW.CPY".
       COPY "LIBLP/LPLCHGW.CPY".
       COPY "LIBGB/AGEINGW.CPY".
       COPY "LIBLP/LPUPWKW.CPY".
       COPY "LIBGB/REBATEW.CPY".
       COPY "LIBGB/RBACTW.CPY".
       COPY "LIBLP/LPAPRZW.CPY".
       COPY "LIBLP/LPUPERW.CPY".
       COPY "LIBLP/LPAPRSW.CPY".
       COPY "LIBLP/LPAVCRW.CPY".
       COPY "LIBLP/LPMDTEW.CPY".
       COPY "LIBLP/LPCEPPW.CPY".
       COPY "LIBGB/SPPDTHW.CPY".
       COPY "LIBLP/LPSCHDW.CPY".
       COPY "LIBLP/LPCDELW.CPY".
       COPY "LIBLP/LPLCASW.CPY".
       COPY "LIBLP/LPLCAPW.CPY".
       COPY "LIBLP/LPRATEW.CPY".
       COPY "LIBLP/LPIBPCW.CPY".
       COPY "LIBLP/LPXDTEW.CPY".
       COPY "LIBLP/LPSTATW.CPY".
       COPY "LIBGB/CONNECTW_SQL.CPY".
       COPY "LIBGB/FILEWK.CPY".
       COPY "LIBGB/MESSWK.CPY".
       01 MESSXX REDEFINES MESS.
           03  FILLER      PIC XXX.
           03  MESSX       PIC X(10).

       COPY "LIBGB/GETDLSW.CPY".
       COPY "LIBGB/DATERW.CPY".
       COPY "LIBGB/GRWORKW.CPY".
       COPY "LIBLP/DEFPOLW.CPY".
       COPY "LIBLP/SETCTBLW.CPY".
       COPY "LIBGB/MKTEMPW_CMD.CPY".
       COPY "LIBGB/TIMEWK.CPY".
       COPY "LIBLP/ADDONSPRW.CPY".
       COPY "LIBLP/LPPOFFW.CPY".
       COPY "LIBLP/LPPDUEW.CPY".
       COPY "LIBLP/LPEARNW.CPY".
       COPY "LIBLP/LPDEFW.CPY".
       COPY "LIBLP/LPITRMW.CPY".
       COPY "LIBLP/LPAMTSW.CPY".
       COPY "LIBGB/SCREENW.CPY".
       COPY "LIBSP/SPINQ_DEF.CPY".
       COPY "LIBWI/NXCNTC_DEF.CPY".
       COPY "LIBWI/NXCNT2_DEF.CPY".
       COPY "LIBWI/INBRT2_DEF.CPY".
       COPY "LIBWI/WRLDBK_DEF.CPY".
       COPY "LIBSP/SPINQ_WKS.CPY".
       COPY "LIBWI/NXCNTC_WKS.CPY".
       COPY "LIBWI/NXCNT2_WKS.CPY".
       COPY "LIBWI/INBRT2_WKS.CPY".
       COPY "LIBWI/WRLDBK_WKS.CPY".
       COPY "LIBGB/GPENVW.CPY".
       COPY "LIBGB/GETENVW.CPY".
       COPY "LIBGB/CONAME_EXT.CPY".
       COPY "LIBGB/HELPLINK.CPY".
       01  SPINQ-WINDOW-HANDLE PIC X(10).
       COPY "LIBLP/POSTDATEW.CPY".

       COPY "LIBGB/PASSWDW.CPY".
       01  CASE-BUF                 PIC X(4).

       78  GLOBAL-SCAN   VALUE 0.
       78  BK-SEQ        VALUE 1.
       78  DEBTAID-SEQ   VALUE 2.
       78  BK-WORLD-SEQ  VALUE 3.
      *    PASSWORD SEQUENCES FOR PROG SPINQ1
       78  ELAPS-5             VALUE 0.
       78  ELAPS-30            VALUE 1.
       78  PROM30-SEQ1         VALUE 2.
       78  ACTIONCD-SEQ        VALUE 3.
       78  COLLECTOR-SEQ       VALUE 4.
       78  PRIOR-PROM-SEQ      VALUE 5.
       78  NIVR-SEQ            VALUE 7.
       78  PROM-GPMAX-SEQ      VALUE 8.
       78  UN-RESCHED-SEQ      VALUE 9.
       78  FD-MIN-DAYS-SEQ     VALUE 10.
       78  SUPERVISOR-ACT-SEQ  VALUE 11.
       78  SUPERVISOR-RES-SEQ  VALUE 12.
       COPY "LIBLP/LPSRCDW.CPY".
       COPY "LIBCL/CRNOR2W.CPY".
       COPY "LIBWI/RVLINEW.CPY".
