      * COPYMEMBER: LIBSP/SPWSVGQ
      *********************************************************
      *        LIBSP/SPWSVGQ: VISION GQFILE PATH WORKERS
      *********************************************************
       01  VGQ-PATH            PIC X(35) VALUE SPACES.
