      * COPYMEMBER: LIBSP/SPWSREPORT
      ******************************************************************
      *
      * IDENTIFICATION:  LIBSP/SPWSREPORT
      *
      * DESCRIPTION   :  STANDARD REPORT FILE (WS)
      *
      *=================================================================
      * REV:
      * KEC 2003.1023 {PR#00000} PARADATA <A15> [KEN CISZEWSKI]
      *               ***NEW***
      *
      ******************************************************************
       01  REPORT-IFN               PIC X(06) VALUE "REPORT".
       01  REPORT-PATH              PIC X(35) VALUE SPACES.

