      * COPYMEMBER: LIBEX/EX01XCQ
      ******************************************************************
      *    DAILY COLLECTOR QUEUE EXTRACTION FILE, 166 BYTES
      *
      *    REGACC, DATA WAREHOUSE EXTRACTION, PR# 257
      ******************************************************************
       01  XCQ-REC.
           03  XCQ-BRACCTNO          PIC 9(10).
           03  XCQ-NUMBER            PIC 9(6).
           03  XCQ-SEQNO             PIC 9(2).
           03  XCQ-COLLID            PIC XXX.
           03  XCQ-REV-BEHAVIOR-RISK PIC 9.
           03  XCQ-SEQ-FG            PIC X.
           03  XCQ-DATE              PIC 9(8).
           03  XCQ-START-TIME        PIC +9(4).
           03  XCQ-REV-DEL           PIC 9(5).
           03  XCQ-REV-PDUE-DAYS     PIC 9(5).
           03  XCQ-REV-BAL           PIC 9(6).
           03  XCQ-WORK-COLLID       PIC XXX.
           03  XCQ-WORKED-FG         PIC X.
           03  XCQ-IN-PROCESS        PIC X.
           03  XCQ-DATE-QUEUED       PIC 9(8).
           03  XCQ-TIME-ZONE-ERROR   PIC X.
           03  XCQ-FILLER            PIC X(100).
           03  XCQ-CR                PIC X.
           03  XCQ-LF                PIC X.
