      * COPYMEMBER: LIBEX/EXFSXLSL LEGAL FILE LSFILE "L"
           SELECT XLSL-FILE ASSIGN TO XLSL-PATH
                  ORGANIZATION RELATIVE
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RELATIVE KEY XLSL-KEY
                  FILE STATUS FILE-STAT.

