      * COPYMEMBER: LIBAP/AP01AI
       01  AI-REC.
           03  AI-APGL       PIC 9(11).
           03  AI-BANK       PIC 9(11).
           03  AI-DISC       PIC 9(11).
           03  AI-DATE       PIC X(8).
           03  AI-DIR-PAY    PIC 9(11).
           03  AI-UNUSED     PIC X(30).
