      * COPYMEMBER: LIBGB/GB01B2
      **************************************************************************
      *            ( BRANCH TRAILER FILE )
      *                     GB01B2
      *  RSZ 1000
      *
      * REV:
      *  040116 BAH NEW, REGACC PR# 47
      *  040726 BAH ADDED B2-ALT-INTO-THIS-BRANCH FOR SOAUTO PR# 2327
      *  060720 BAH ADDED B2-POFF-TITLE-WINDOW FOR REGACC PR# 137
      *  061205 BAH ADDED B2-COUPON-STATEMENT FOR REGACC PR# 158
      *  061211  CS ADDED B2-AREA-MANAGER,B2-SUPERVISOR REGACC PR#159
      *  070131 BAH ADDED B2-MIN-MONTHS-DEF FOR REGACC PR# 162
      *             TEST NUMBER OF MONTHS BETWEEN DEFERMENTS
      *  070220 BAH ADDED COLLECTION CENTER INFO, REGACC PR# 164
      *  071210  CS ADD B2-USE-PARTIC-FLAT-TABLE REGACC PR#185
      *  080407  CS ADD B2-MIN-MONTHS-D2  REGACC PR#202
      *  090826 BAH ADDED B2-SKIP-MIDSTREAM-TRW  FOR REGACC PR# 252
      *  100304 BLM ADD 2 GL NUMBERS FOR ESCROW: B2-GL-ESCROW-BALANCE
      *             AND B2-GL-ESCROW-PAYABLE, REGWAN PR# 3506
      *  100312 BLM ADD B2-ALLOW-FORCE-OPEN-FG, REGACC PR# 265
      *  130405 BLM ADD B2-ACH-BANK-NO, CITIZENS PR# 4244
      *  130930 BAH ADD B2-WIMENU-CHECK-WRITING FOR F10, BAY PR#4379
      *  141230 BLM ADD B2-ADP-PAY-GROUP, WORLD PR# 1035 
      *  160914 BLM ADD B2-ALLOW-SCANNED-CKS, WORLD PR# 1188
      *  160915 BLM ADD B2-CHECK-DEPOSIT-GL, WORLD PR# 1188
      *  161028 AMM ADD B2-OPTION-PST-LASER, WORLD PR# 1200 
      *  180214 BAH ADDED B2-USE-DEBIT-CARDS, B2-GL-DEBIT-CARD-PROCEEDS 
      *             FOR NETSPEND, WORLD PR#1306 
      *  190123  CS ADDED B2-WKDAY-BANKID    PR#1353
      *  220907 BAH ADDED B2-VERITEC-LICENSE FOR VERITEC EXTRACT #1570
      *  230419 BAH ADDED B2-TEST-PP-AUTO-INSCOVR #1594A
      *  230628 BAH ADDED B2-USE-NEW-WFARGO-ACCT, NEW CHECKING ACCT #1616
      *  230727 BAH ADDED B2-BRANCH-CLOSED TO STOP LIVE CHK POST #1618
      *  231110 BAH ADDED B2-ALLOW-F3-ALL-DOCS FOR DOCUMENT PRINT, #1630
      **************************************************************************
       78  B2-SIZE                     VALUE 1000.
       01  B2-REC.
           03  B21-KEY.
               05  B2-BRNO             PIC 9(4).

           03  B2-COLLECT-MANAGER      PIC X(25).
           03  B2-COLLECT-PHONE        PIC 9(10) COMP-6.
           03  B2-COLLECT-EXT          PIC 9(4)  COMP-6.

           03  B2-ALT-INTO-THIS-BRANCH PIC X.
           03  B2-POFF-TITLE-WINDOW    PIC X.
           03  B2-COUPON-STATEMENT     PIC X.
           03  B2-SUPERVISOR           PIC X(25).
           03  B2-AREA-MANAGER         PIC X(25).

           03  B2-MIN-MONTHS-DEF       PIC 99.

      * COLLECTION CENTER INFO, PR# 164 REGACC
           03  B2-CC-FLAG              PIC X.
           03  B2-CC-ADR1              PIC X(24).
           03  B2-CC-CITY              PIC X(15).
           03  B2-CC-STATE             PIC XX.
           03  B2-CC-ZIP               PIC X(10).
      *USED TO INTERRUPT GRADE CODES COMING FROM CMSI TO POPULATE 
      *PARTIC. HELD
           03  B2-USE-PARTIC-FLAT-TABLE  PIC X.
           03  B2-MIN-MONTHS-D2          PIC 99. 
           03  B2-SKIP-MIDSTREAM-TRW     PIC X.
           03  B2-GL-ESCROW-BALANCE      PIC 9(11) COMP-6.
           03  B2-GL-ESCROW-PAYABLE      PIC 9(11) COMP-6.
           03  B2-ALLOW-FORCE-OPEN-FG    PIC X.
           03  B2-ACH-BANK-NO            PIC 9.
           03  B2-WIMENU-CHECK-WRITING   PIC X.
           03  B2-ADP-PAY-GROUP          PIC X(3).
           03  B2-ALLOW-SCANNED-CKS      PIC X.
           03  B2-CHECK-DEPOSIT-GL       PIC 9(11) COMP-3.
           03  B2-OPTION-PST-LASER       PIC X.
           03  B2-USE-DEBIT-CARDS        PIC X.
           03  B2-GL-DEBIT-CARD-PROCEEDS PIC 9(11) COMP-3.
           03  B2-WKDAY-BANKID           PIC 9(4) COMP-3.       
           03  B2-VERITEC-LICENSE        PIC 9(7).
           03  B2-TEST-PP-AUTO-INSCOVR   PIC X.
           03  B2-USE-NEW-WFARGO-ACCT    PIC X.
           03  B2-BRANCH-CLOSED          PIC X.
           03  B2-ALLOW-F3-ALL-DOCS      PIC X.
           03  FILLER                    PIC X(806).
