      * COPYMEMBER: LIBGB/GBFSPR
           SELECT PR-FILE ASSIGN PRU-FILE
                  ORGANIZATION LINE SEQUENTIAL
                  LOCK MODE EXCLUSIVE
                  FILE STATUS FILE-STAT.
           SELECT DPR-FILE ASSIGN "FORM"
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
