      * COPYMEMBER: LIBGB/GBFSSN
           SELECT SN-FILE ASSIGN TO SN-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY SN1-KEY
                  ALTERNATE RECORD KEY SN2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
