      * COPYMEMBER: LIBLP/LPFSDS
           SELECT DS-FILE ASSIGN TO DS-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY DS1-KEY
                  ALTERNATE RECORD KEY DS2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
