      * COPYMEMBER: LIBLP/LPFSBY
           SELECT BY-FILE ASSIGN TO BY-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY BY1-KEY
                  FILE STATUS FILE-STAT.
