      * COPYMEMBER: LIBLP/LPFSMP
      * MEMO PAYMENT FILE - EXACTLY LIKE THE LP, CONVERTED PAYMENT RECORDS
      * REGACC PR# 154
           SELECT MP-FILE ASSIGN TO MP-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY MP1-KEY
                  FILE STATUS FILE-STAT.
