      * COPYMEMBER: LIBLP/LPFSER
           SELECT ER-FILE ASSIGN TO ER-PATH
                  ORGANIZATION LINE SEQUENTIAL
                  FILE STATUS FILE-STAT.
