      * COPYMEMBER: LIBLP/LPFSCH
           SELECT CH-FILE ASSIGN TO CHANGE-PATH
                  ORGANIZATION SEQUENTIAL
                  ACCESS SEQUENTIAL
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  FILE STATUS FILE-STAT.
