      * COPYMEMBER: LIBLP/LPFSFM
           SELECT FM-FILE ASSIGN TO FM-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY FM1-KEY
                  ALTERNATE RECORD KEY FM2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
