      * COPYMEMBER: LIBLP/LPFSBW
           SELECT BW-FILE ASSIGN TO BW-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY BW1-KEY
                  ALTERNATE RECORD KEY BW2-KEY WITH DUPLICATES
                  ALTERNATE RECORD KEY BW3-KEY WITH DUPLICATES
                  ALTERNATE RECORD KEY BW4-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
