      * COPYMEMBER: LIBLP/LPFSBI
           SELECT BI-FILE ASSIGN TO BI-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY BI1-KEY
                  ALTERNATE RECORD KEY BI2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
