      * COPYMEMBER: LIBLP/LPFSPA
           SELECT PA-FILE ASSIGN PA-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY PA1-KEY
                  ALTERNATE RECORD KEY PA2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
