      * COPYMEMBER: LIBLP/LPFSPD
           SELECT PD-FILE ASSIGN TO PD-PATH
                  ORGANIZATION INDEXED
                  ACCESS DYNAMIC
                  LOCK MODE AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY PD1-KEY
                  ALTERNATE RECORD KEY PD2-KEY WITH DUPLICATES
                  FILE STATUS FILE-STAT.
