      * COPYMEMBER: LIBLP/INSELIGW
      *--------------------------------------------------------
      *                       (INSELIGW)
      *    TEST INSURANCE ELIGIBLITY
      * REV:
      *--------------------------------------------------------
       01  INSELIG-DISPLAY-FG       PIC X      VALUE " ".
