      * COPYMEMBER: LIBLP/LP01FD_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL - FORM DESCRIPTOR FILE
      *
      *=================================================================
      * REV:
      * AMM 2021-0430 ***NEW***
      * BAH 2023.1113 ADDED FD-TYPE-OF-DOC #1630
      *
      ******************************************************************
      *- - -{STANDARD CURSOR FOR START & READ-NEXT}
       01  FD1-CURSOR-STAT              PIC X(2) VALUE SPACES.
           88  FD1-CURSOR-STAT-GOOD              VALUE "00".
           88  FD1-CURSOR-STAT-BAD               VALUE "  " THRU "//"
                                                       "01" THRU "~~".

      *- - -{GREATER CURSOR FOR START-GREATER & READ-NEXT}
       01  FD1-CURSOR-GR-STAT           PIC X(2) VALUE SPACES.
           88  FD1-CURSOR-GR-STAT-GOOD           VALUE "00".
           88  FD1-CURSOR-GR-STAT-BAD            VALUE "  " THRU "//"
                                                       "01" THRU "~~".

       EXEC SQL BEGIN DECLARE SECTION END-EXEC.

       01  FD1-RETURN-CODE              PIC S9(4)   COMP-5.

       01  QFD1-WHERE-BEG-KEY.
           03  QFD1-WBEG-FMNO           PIC 9(04).

       01  QFD1-WHERE-END-KEY.
           03  QFD1-WEND-FMNO           PIC 9(04).

       01  QFD-REC.
           03  QFD-FMNO                     PIC 9(4).
           03  QFD-LTOUCH-DATE              PIC X(10).
           03  QFD-DESC                     PIC X(25).
           03  QFD-OPTION                   PIC X(1).
           03  QFD-FORM-CHG-CD              PIC X.
           03  QFD-PROG-PREFIX              PIC X.
           03  QFD-TYPE                     PIC X.
           03  QFD-LNMEMO               PIC X.
           03  QFD-BODY                 PIC 9(4).
           03  QFD-TOP                  PIC 9(4).
           03  QFD-BOTTOM               PIC 9(4).
           03  QFD-PROG                 PIC XX.
           03  QFD-PROMPTS-1            PIC X(80).
           03  QFD-PROMPTS-2            PIC X(80).
           03  QFD-PROMPTS-3            PIC X(80).
           03  QFD-PROMPTS-4            PIC X(80).
           03  QFD-PROMPTS-5            PIC X(80).
           03  QFD-PROMPTS-6            PIC X(80).
           03  QFD-PROMPTS-7            PIC X(80).
           03  QFD-PROMPTS-8            PIC X(80).
           03  QFD-PROMPTS-9            PIC X(80).
           03  QFD-PROMPTS-10           PIC X(80).
           03  QFD-PROMPTS-11           PIC X(80).
           03  QFD-PROMPTS-12           PIC X(80).
           03  QFD-PROMPTS-13           PIC X(80).
           03  QFD-PROMPTS-14           PIC X(80).
           03  QFD-PROMPTS-15           PIC X(80).
           03  QFD-PROMPTS-16           PIC X(80).
           03  QFD-PROMPTS-17           PIC X(80).
           03  QFD-PROMPTS-18           PIC X(80).
           03  QFD-PROMPTS-19           PIC X(80).
           03  QFD-PROMPTS-20           PIC X(80).
           03  QFD-PROMPTS-21           PIC X(80).
           03  QFD-PROMPTS-22           PIC X(80).
           03  QFD-PROMPTS-23           PIC X(80).
           03  QFD-PROMPTS-24           PIC X(80).
           03  QFD-PROMPTS-25           PIC X(80).
           03  QFD-PROMPTS-26           PIC X(80).
           03  QFD-PROMPTS-27           PIC X(80).
           03  QFD-PROMPTS-28           PIC X(80).
           03  QFD-PROMPTS-29           PIC X(80).
           03  QFD-PROMPTS-30           PIC X(80).
           03  QFD-FIELDNO-1      PIC 9(4).
           03  QFD-FIELDROW-1     PIC 9(2).
           03  QFD-FIELDCOL-1     PIC 9(2).
           03  QFD-FIELDED-1      PIC 9(2).
           03  QFD-FIELDKEY-1     PIC 9(4).
           03  QFD-FIELDNO-2      PIC 9(4).
           03  QFD-FIELDROW-2     PIC 9(2).
           03  QFD-FIELDCOL-2     PIC 9(2).
           03  QFD-FIELDED-2      PIC 9(2).
           03  QFD-FIELDKEY-2     PIC 9(4).
           03  QFD-FIELDNO-3      PIC 9(4).
           03  QFD-FIELDROW-3     PIC 9(2).
           03  QFD-FIELDCOL-3     PIC 9(2).
           03  QFD-FIELDED-3      PIC 9(2).
           03  QFD-FIELDKEY-3     PIC 9(4).
           03  QFD-FIELDNO-4      PIC 9(4).
           03  QFD-FIELDROW-4     PIC 9(2).
           03  QFD-FIELDCOL-4     PIC 9(2).
           03  QFD-FIELDED-4      PIC 9(2).
           03  QFD-FIELDKEY-4     PIC 9(4).
           03  QFD-FIELDNO-5      PIC 9(4).
           03  QFD-FIELDROW-5     PIC 9(2).
           03  QFD-FIELDCOL-5     PIC 9(2).
           03  QFD-FIELDED-5      PIC 9(2).
           03  QFD-FIELDKEY-5     PIC 9(4).
           03  QFD-FIELDNO-6      PIC 9(4).
           03  QFD-FIELDROW-6     PIC 9(2).
           03  QFD-FIELDCOL-6     PIC 9(2).
           03  QFD-FIELDED-6      PIC 9(2).
           03  QFD-FIELDKEY-6     PIC 9(4).
           03  QFD-FIELDNO-7      PIC 9(4).
           03  QFD-FIELDROW-7     PIC 9(2).
           03  QFD-FIELDCOL-7     PIC 9(2).
           03  QFD-FIELDED-7      PIC 9(2).
           03  QFD-FIELDKEY-7     PIC 9(4).
           03  QFD-FIELDNO-8      PIC 9(4).
           03  QFD-FIELDROW-8     PIC 9(2).
           03  QFD-FIELDCOL-8     PIC 9(2).
           03  QFD-FIELDED-8      PIC 9(2).
           03  QFD-FIELDKEY-8     PIC 9(4).
           03  QFD-FIELDNO-9      PIC 9(4).
           03  QFD-FIELDROW-9     PIC 9(2).
           03  QFD-FIELDCOL-9     PIC 9(2).
           03  QFD-FIELDED-9      PIC 9(2).
           03  QFD-FIELDKEY-9     PIC 9(4).
           03  QFD-FIELDNO-10     PIC 9(4).
           03  QFD-FIELDROW-10    PIC 9(2).
           03  QFD-FIELDCOL-10    PIC 9(2).
           03  QFD-FIELDED-10     PIC 9(2).
           03  QFD-FIELDKEY-10    PIC 9(4).
           03  QFD-FIELDNO-11     PIC 9(4).
           03  QFD-FIELDROW-11    PIC 9(2).
           03  QFD-FIELDCOL-11    PIC 9(2).
           03  QFD-FIELDED-11     PIC 9(2).
           03  QFD-FIELDKEY-11    PIC 9(4).
           03  QFD-FIELDNO-12     PIC 9(4).
           03  QFD-FIELDROW-12    PIC 9(2).
           03  QFD-FIELDCOL-12    PIC 9(2).
           03  QFD-FIELDED-12     PIC 9(2).
           03  QFD-FIELDKEY-12    PIC 9(4).
           03  QFD-FIELDNO-13     PIC 9(4).
           03  QFD-FIELDROW-13    PIC 9(2).
           03  QFD-FIELDCOL-13    PIC 9(2).
           03  QFD-FIELDED-13     PIC 9(2).
           03  QFD-FIELDKEY-13    PIC 9(4).
           03  QFD-FIELDNO-14     PIC 9(4).
           03  QFD-FIELDROW-14    PIC 9(2).
           03  QFD-FIELDCOL-14    PIC 9(2).
           03  QFD-FIELDED-14     PIC 9(2).
           03  QFD-FIELDKEY-14    PIC 9(4).
           03  QFD-FIELDNO-15     PIC 9(4).
           03  QFD-FIELDROW-15    PIC 9(2).
           03  QFD-FIELDCOL-15    PIC 9(2).
           03  QFD-FIELDED-15     PIC 9(2).
           03  QFD-FIELDKEY-15    PIC 9(4).
           03  QFD-FIELDNO-16     PIC 9(4).
           03  QFD-FIELDROW-16    PIC 9(2).
           03  QFD-FIELDCOL-16    PIC 9(2).
           03  QFD-FIELDED-16     PIC 9(2).
           03  QFD-FIELDKEY-16    PIC 9(4).
           03  QFD-FIELDNO-17     PIC 9(4).
           03  QFD-FIELDROW-17    PIC 9(2).
           03  QFD-FIELDCOL-17    PIC 9(2).
           03  QFD-FIELDED-17     PIC 9(2).
           03  QFD-FIELDKEY-17    PIC 9(4).
           03  QFD-FIELDNO-18     PIC 9(4).
           03  QFD-FIELDROW-18    PIC 9(2).
           03  QFD-FIELDCOL-18    PIC 9(2).
           03  QFD-FIELDED-18     PIC 9(2).
           03  QFD-FIELDKEY-18    PIC 9(4).
           03  QFD-FIELDNO-19     PIC 9(4).
           03  QFD-FIELDROW-19    PIC 9(2).
           03  QFD-FIELDCOL-19    PIC 9(2).
           03  QFD-FIELDED-19     PIC 9(2).
           03  QFD-FIELDKEY-19    PIC 9(4).
           03  QFD-FIELDNO-20     PIC 9(4).
           03  QFD-FIELDROW-20    PIC 9(2).
           03  QFD-FIELDCOL-20    PIC 9(2).
           03  QFD-FIELDED-20     PIC 9(2).
           03  QFD-FIELDKEY-20    PIC 9(4).
           03  QFD-FIELDNO-21     PIC 9(4).
           03  QFD-FIELDROW-21    PIC 9(2).
           03  QFD-FIELDCOL-21    PIC 9(2).
           03  QFD-FIELDED-21     PIC 9(2).
           03  QFD-FIELDKEY-21    PIC 9(4).
           03  QFD-FIELDNO-22     PIC 9(4).
           03  QFD-FIELDROW-22    PIC 9(2).
           03  QFD-FIELDCOL-22    PIC 9(2).
           03  QFD-FIELDED-22     PIC 9(2).
           03  QFD-FIELDKEY-22    PIC 9(4).
           03  QFD-FIELDNO-23     PIC 9(4).
           03  QFD-FIELDROW-23    PIC 9(2).
           03  QFD-FIELDCOL-23    PIC 9(2).
           03  QFD-FIELDED-23     PIC 9(2).
           03  QFD-FIELDKEY-23    PIC 9(4).
           03  QFD-FIELDNO-24     PIC 9(4).
           03  QFD-FIELDROW-24    PIC 9(2).
           03  QFD-FIELDCOL-24    PIC 9(2).
           03  QFD-FIELDED-24     PIC 9(2).
           03  QFD-FIELDKEY-24    PIC 9(4).
           03  QFD-FIELDNO-25     PIC 9(4).
           03  QFD-FIELDROW-25    PIC 9(2).
           03  QFD-FIELDCOL-25    PIC 9(2).
           03  QFD-FIELDED-25     PIC 9(2).
           03  QFD-FIELDKEY-25    PIC 9(4).
           03  QFD-FIELDNO-26     PIC 9(4).
           03  QFD-FIELDROW-26    PIC 9(2).
           03  QFD-FIELDCOL-26    PIC 9(2).
           03  QFD-FIELDED-26     PIC 9(2).
           03  QFD-FIELDKEY-26    PIC 9(4).
           03  QFD-FIELDNO-27     PIC 9(4).
           03  QFD-FIELDROW-27    PIC 9(2).
           03  QFD-FIELDCOL-27    PIC 9(2).
           03  QFD-FIELDED-27     PIC 9(2).
           03  QFD-FIELDKEY-27    PIC 9(4).
           03  QFD-FIELDNO-28     PIC 9(4).
           03  QFD-FIELDROW-28    PIC 9(2).
           03  QFD-FIELDCOL-28    PIC 9(2).
           03  QFD-FIELDED-28     PIC 9(2).
           03  QFD-FIELDKEY-28    PIC 9(4).
           03  QFD-FIELDNO-29     PIC 9(4).
           03  QFD-FIELDROW-29    PIC 9(2).
           03  QFD-FIELDCOL-29    PIC 9(2).
           03  QFD-FIELDED-29     PIC 9(2).
           03  QFD-FIELDKEY-29    PIC 9(4).
           03  QFD-FIELDNO-30     PIC 9(4).
           03  QFD-FIELDROW-30    PIC 9(2).
           03  QFD-FIELDCOL-30    PIC 9(2).
           03  QFD-FIELDED-30     PIC 9(2).
           03  QFD-FIELDKEY-30    PIC 9(4).
           03  QFD-FIELDNO-31     PIC 9(4).
           03  QFD-FIELDROW-31    PIC 9(2).
           03  QFD-FIELDCOL-31    PIC 9(2).
           03  QFD-FIELDED-31     PIC 9(2).
           03  QFD-FIELDKEY-31    PIC 9(4).
           03  QFD-FIELDNO-32     PIC 9(4).
           03  QFD-FIELDROW-32    PIC 9(2).
           03  QFD-FIELDCOL-32    PIC 9(2).
           03  QFD-FIELDED-32     PIC 9(2).
           03  QFD-FIELDKEY-32    PIC 9(4).
           03  QFD-FIELDNO-33     PIC 9(4).
           03  QFD-FIELDROW-33    PIC 9(2).
           03  QFD-FIELDCOL-33    PIC 9(2).
           03  QFD-FIELDED-33     PIC 9(2).
           03  QFD-FIELDKEY-33    PIC 9(4).
           03  QFD-FIELDNO-34     PIC 9(4).
           03  QFD-FIELDROW-34    PIC 9(2).
           03  QFD-FIELDCOL-34    PIC 9(2).
           03  QFD-FIELDED-34     PIC 9(2).
           03  QFD-FIELDKEY-34    PIC 9(4).
           03  QFD-FIELDNO-35     PIC 9(4).
           03  QFD-FIELDROW-35    PIC 9(2).
           03  QFD-FIELDCOL-35    PIC 9(2).
           03  QFD-FIELDED-35     PIC 9(2).
           03  QFD-FIELDKEY-35    PIC 9(4).
           03  QFD-FIELDNO-36     PIC 9(4).
           03  QFD-FIELDROW-36    PIC 9(2).
           03  QFD-FIELDCOL-36    PIC 9(2).
           03  QFD-FIELDED-36     PIC 9(2).
           03  QFD-FIELDKEY-36    PIC 9(4).
           03  QFD-FIELDNO-37     PIC 9(4).
           03  QFD-FIELDROW-37    PIC 9(2).
           03  QFD-FIELDCOL-37    PIC 9(2).
           03  QFD-FIELDED-37     PIC 9(2).
           03  QFD-FIELDKEY-37    PIC 9(4).
           03  QFD-FIELDNO-38     PIC 9(4).
           03  QFD-FIELDROW-38    PIC 9(2).
           03  QFD-FIELDCOL-38    PIC 9(2).
           03  QFD-FIELDED-38     PIC 9(2).
           03  QFD-FIELDKEY-38    PIC 9(4).
           03  QFD-FIELDNO-39     PIC 9(4).
           03  QFD-FIELDROW-39    PIC 9(2).
           03  QFD-FIELDCOL-39    PIC 9(2).
           03  QFD-FIELDED-39     PIC 9(2).
           03  QFD-FIELDKEY-39    PIC 9(4).
           03  QFD-FIELDNO-40     PIC 9(4).
           03  QFD-FIELDROW-40    PIC 9(2).
           03  QFD-FIELDCOL-40    PIC 9(2).
           03  QFD-FIELDED-40     PIC 9(2).
           03  QFD-FIELDKEY-40    PIC 9(4).
           03  QFD-FIELDNO-41     PIC 9(4).
           03  QFD-FIELDROW-41    PIC 9(2).
           03  QFD-FIELDCOL-41    PIC 9(2).
           03  QFD-FIELDED-41     PIC 9(2).
           03  QFD-FIELDKEY-41    PIC 9(4).
           03  QFD-FIELDNO-42     PIC 9(4).
           03  QFD-FIELDROW-42    PIC 9(2).
           03  QFD-FIELDCOL-42    PIC 9(2).
           03  QFD-FIELDED-42     PIC 9(2).
           03  QFD-FIELDKEY-42    PIC 9(4).
           03  QFD-FIELDNO-43     PIC 9(4).
           03  QFD-FIELDROW-43    PIC 9(2).
           03  QFD-FIELDCOL-43    PIC 9(2).
           03  QFD-FIELDED-43     PIC 9(2).
           03  QFD-FIELDKEY-43    PIC 9(4).
           03  QFD-FIELDNO-44     PIC 9(4).
           03  QFD-FIELDROW-44    PIC 9(2).
           03  QFD-FIELDCOL-44    PIC 9(2).
           03  QFD-FIELDED-44     PIC 9(2).
           03  QFD-FIELDKEY-44    PIC 9(4).
           03  QFD-FIELDNO-45     PIC 9(4).
           03  QFD-FIELDROW-45    PIC 9(2).
           03  QFD-FIELDCOL-45    PIC 9(2).
           03  QFD-FIELDED-45     PIC 9(2).
           03  QFD-FIELDKEY-45    PIC 9(4).
           03  QFD-FIELDNO-46     PIC 9(4).
           03  QFD-FIELDROW-46    PIC 9(2).
           03  QFD-FIELDCOL-46    PIC 9(2).
           03  QFD-FIELDED-46     PIC 9(2).
           03  QFD-FIELDKEY-46    PIC 9(4).
           03  QFD-FIELDNO-47     PIC 9(4).
           03  QFD-FIELDROW-47    PIC 9(2).
           03  QFD-FIELDCOL-47    PIC 9(2).
           03  QFD-FIELDED-47     PIC 9(2).
           03  QFD-FIELDKEY-47    PIC 9(4).
           03  QFD-FIELDNO-48     PIC 9(4).
           03  QFD-FIELDROW-48    PIC 9(2).
           03  QFD-FIELDCOL-48    PIC 9(2).
           03  QFD-FIELDED-48     PIC 9(2).
           03  QFD-FIELDKEY-48    PIC 9(4).
           03  QFD-FIELDNO-49     PIC 9(4).
           03  QFD-FIELDROW-49    PIC 9(2).
           03  QFD-FIELDCOL-49    PIC 9(2).
           03  QFD-FIELDED-49     PIC 9(2).
           03  QFD-FIELDKEY-49    PIC 9(4).
           03  QFD-FIELDNO-50     PIC 9(4).
           03  QFD-FIELDROW-50    PIC 9(2).
           03  QFD-FIELDCOL-50    PIC 9(2).
           03  QFD-FIELDED-50     PIC 9(2).
           03  QFD-FIELDKEY-50    PIC 9(4).
           03  QFD-1STFILE        PIC 9(2).
           03  QFD-INCR-DELCNT          PIC X.
           03  QFD-FMTYPE               PIC X.
           03  QFD-PRCONT               PIC X.
           03  QFD-NEXTFM               PIC 9(4).
           03  QFD-VALID-BRANCH         PIC X(4).
           03  QFD-MIN-FORM-SENT-DAYS   PIC 99.
           03  QFD-SKIP-BAD-ADR         PIC X.
           03  QFD-SECURITY-PROFILE     PIC X.
           03  QFD-FORM-RIGHT-TO-CURE   PIC X.
           03  QFD-TEST-WHICH-STATE     PIC X.
           03  QFD-STATE-1              PIC XX.
           03  QFD-STATE-2              PIC XX.
           03  QFD-STATE-3              PIC XX.
           03  QFD-STATE-4              PIC XX.
           03  QFD-STATE-5              PIC XX.
           03  QFD-STATE-6              PIC XX.
           03  QFD-STATE-7              PIC XX.
           03  QFD-STATE-8              PIC XX.
           03  QFD-STATE-9              PIC XX.
           03  QFD-STATE-10             PIC XX.
           03  QFD-STATE-11             PIC XX.
           03  QFD-STATE-12             PIC XX.
           03  QFD-STATE-13             PIC XX.
           03  QFD-STATE-14             PIC XX.
           03  QFD-STATE-15             PIC XX.
           03  QFD-STATE-16             PIC XX.
           03  QFD-STATE-17             PIC XX.
           03  QFD-STATE-18             PIC XX.
           03  QFD-STATE-19             PIC XX.
           03  QFD-STATE-20             PIC XX.
           03  QFD-STATE-21             PIC XX.
           03  QFD-STATE-22             PIC XX.
           03  QFD-STATE-23             PIC XX.
           03  QFD-STATE-24             PIC XX.
           03  QFD-STATE-25             PIC XX.
           03  QFD-STATE-26             PIC XX.
           03  QFD-STATE-27             PIC XX.
           03  QFD-STATE-28             PIC XX.
           03  QFD-STATE-29             PIC XX.
           03  QFD-STATE-30             PIC XX.
           03  QFD-STATE-31             PIC XX.
           03  QFD-STATE-32             PIC XX.
           03  QFD-STATE-33             PIC XX.
           03  QFD-STATE-34             PIC XX.
           03  QFD-STATE-35             PIC XX.
           03  QFD-STATE-36             PIC XX.
           03  QFD-STATE-37             PIC XX.
           03  QFD-STATE-38             PIC XX.
           03  QFD-STATE-39             PIC XX.
           03  QFD-STATE-40             PIC XX.
           03  QFD-STATE-41             PIC XX.
           03  QFD-STATE-42             PIC XX.
           03  QFD-STATE-43             PIC XX.
           03  QFD-STATE-44             PIC XX.
           03  QFD-STATE-45             PIC XX.
           03  QFD-STATE-46             PIC XX.
           03  QFD-STATE-47             PIC XX.
           03  QFD-STATE-48             PIC XX.
           03  QFD-STATE-49             PIC XX.
           03  QFD-STATE-50             PIC XX.
           03  QFD-TYPE-OF-DOC          PIC XX.

       EXEC SQL END DECLARE SECTION END-EXEC.
