       01  SPB-REC.
           03  SPB1-KEY.
               05  SPB-ORGST                   PIC XX.
               05  SPB-SPRCLASS                PIC 999.
               05  SPB-SUBCLASS                PIC 99.
               05  SPB-LAWCODE                 PIC 99.

       COPY "LIBLP/LP01SPB_AREA.CPY".
