      * COPYMEMBER: LIBLP/LP01SP         
      ******************************************************************
      *
      * DESCRIPTION: STATE PARAMETER FILE   - MASTER LAYOUT
      *
      * COPY USAGE : LIBLP/LPWSSP.CPY
      *
      * FILE SIZE  : ----------- 6500 WAS 6000
      *              SP1-KEY   =    9
      *              SPA       = 1225 WAS 975
      *              SPB       = 2724 WAS 2544
      *              SPC       = 2542 WAS 1358
      *
      * FILE PATHS : /USR/DATA/R#/LP/SPAFILE  (LIBLP/LP01SPA_AREA.CPY)
      *              /USR/DATA/R#/LP/SPBFILE  (LIBLP/LP01SPB_AREA.CPY)
      *              /USR/DATA/R#/LP/SPCFILE  (LIBLP/LP01SPC_AREA.CPY)
      *
      * ATTENTION  : SPECIAL HARDCODED CODING FOR THE MULTIPLE BY FILES:
      *                 SP/SPMEMO
      *                 SP/SPCOPY
      *
      * ***ALL*** REVISION NOTES FOR FIELDS IN THE SPLIT FILES
      *           (SPAFILE, SPBFILE & SPCFILE) ARE LOCATED HERE.
      *
      * *** NOTE ***  : WHEN ADDING NEW FIELDS, NEED TO UPDATE CL/SPMEMO
      *
      *=================================================================
      * REV:
      * JTG 033095 ADDED SP-INS-UNITPER-MON = 11,  FL
      *            N O T E:
      *                LOGIC FOR CODE IN CALCZ3.C & NOT CALCZL.C
      *                USED FOR UNITPER OTHER THAN MONTHLY
      *                THIS IS SP-INSEXCEPT #10 IN REL: A50
      * JTG 033095 ADDED SP-INS-ADJ-CASH-ADVANCE  VALUE "S".
      *            N O T E:
      *                LOGIC FOR CODE IN CALCZ3.C & NOT CALCZL.C
      * JTG 033095 ADDED SP-FEEFRMLA, SP-FEECD , SP-FEEID
      *            N O T E:
      *                LOGIC FOR CODE IN CALCZ3.C & NOT CALCZL.C
      * SLC 051895 ADDED SP-CONTR-CREDIT.
      * SLC 051995 ADDED "U' TO SP-RBFRMLA-VALID.
      * JTG 052495 ADDED SP-CONTR-CREDIT-CD.
      * JTG 061095 ADDED SP-RBEARLY = 9, MERCURY
      * JTG 061295 ADDED SP-SCFRMLA = 20, MERCURY
      * SLC 062495 ADDED SP-DEFBASE VALID THRU 10
      *                  8 = WHOLE REMAINING PMTS
      *                  9 = NET BALANCE
      *                 10 = NET BALANCE + 5.00.
      * JTG 062695 ADDED SP-CONTR-CREDIT-MIN-DEL-PER.
      * JTG 062795 ADDED SP-RBEARLY = 10, MERCURY
      * JTG 062995 ADDED SP-OPT-CAL-CHGABLE, MERCURY MI SERCHG
      * SLC 070295 ADDED "V" AND "W" TO SP-RBFRMLA-VALID.
      * JTG 070595 ADDED SP-SCFRMLA = 21, MERCURY (MI)
      * JTG 070695 ADDED SP-LCFRMLA = L, MERCURY (UCCC) EX. 'IN'
      * SLC 070795 ADDED SP-INSREJECT-FG FOR RESTRICTIONS ON INS BASE
      *            ON AGE & TERM.
      * JTG 071995 ADDED SP-PBDEL-DAYS
      * JTG 072195 ADDED SP-PBINCR-PERCENT
      *                  SP-CPOT30-CD    SP-RDPOT30-CD
      *                  SP-CPOTCHGOFF-CD   SP-RDPOTCHGOFF-CD
      * JTG 081395 ADDED SP-ERNFRMLA = 60, MERCURY ACTUARIAL (ELAPSED DAYS)
      * JTG 082595 ADDED SP-LCFRMLA = M, MERCURY 'LA'
      * JTG 083095 ADDED SP-ERNFRMLA = 61, MERCURY MAINTFEE (ELAPSED DAYS)
      * JTG 083195 ADDED SP-INSRATECD = 5, MERCURY ACTUARIAL 78THS (SF) (VA)
      *                  SP-INSRATECD = 6, MERCURY ACTUARIAL (LOANS) (VA)
      * JTG 091995 ADD SP-INSEXCEPT = 12, MERCURY 'LA' SP-CALC-PREM-LESS-EXTCHG
      * BAH 092595 ADDED SP-RBEARLY = 11, MERCURY 'MS'
      * MJD 092895 ADDED SP-TX-PP-FIRE AS A VALID INS RATE CODE (VALUE 7).
      * JTG 101695 ADDED SP-RBFRMLA = 'X', MERCURY 'WI' DEFERMENT REFUND
      * JTG 110995 ADDED SP-INSCHGABLE = 'O', NC NET PAYOFF WITH CALCULATED MOB
      * BAH 111095 ADDED SP-RBEARLY = 12, MERCURY 'AL' (ACTION SPREAR = 1)
      * BAH 111595 ADDED SP-LCTYPE = "N", MERCURY 'TN' 'KS'
      * BAH 111595 ADDED SP-RBSPOPT1 = 12, MERCURY 'AL' INTEREST REFUND FORMULA
      *            ACTION SPRR78 = 13 RUILE OF 78/PRIOR TO 1STPYDATE
      * JTG 111595 ADDED RATECD SP-CA-NETPAYOFF-5A VALUE 8, ACTION CHARGABLE 5A
      * BAH 111695 ADDED SP-RBFRMLA = 'Y', MERCURY 'SC' DEFERMENT REFUND
      * BAH 111695 ADDED SP-RBFRMLA = 'Z', MERCURY 'AZ' DEFERMENT REFUND
      * BAH 111795 ADDED SP-RBFRMLA2 OCCURS 18 TIMES, RAN OUT OF RBFRMLA'S
      * JTG 112195 ADDED SP-RBSPOPT1 = 13, ACTUARIAL 'F' NEAREST DUE DATE
      *            OPTION MERCURY ARIZONA ACTION 24
      * JTG 112495 ADDED SP-RBEARLY = 13, MERCURY 'NV' PP REFUND ACTION 8
      * JTG 112895 ADDED SP-LCFRMLA = N, MERCURY 'NV'
      * BAH 011096 ADDED SP-MAX-ALLOW-DELINQ FOR MERCURY
      * JTG 011096 ADDED SP-RBFRMLA2 = 1, MERCURY 'AZ' FIRE REFUND (PP)
      *            ALSO OPENED UP SP-RBFRMLA = 0, AS TRIGGER TO SP-RBFRMLA2
      * JTG 112195 CHANGED SP-RBSPOPT1 = 13, TO ALSO BASE THE INTEREST START
      *            DATE FROM ONE MONTH PRIOR TO ORIGINAL FIRST PAY DATE
      *            ----
      *            ADDED SP-RBSPOPT1 = 14, TO  BASE THE INTEREST START DATE
      *            FROM ONE MONTH PRIOR TO ORIGINAL FIRST PAY DATE
      *            ACTION REBATE FORMULA 27
      * JTG 012696 ADDED RATECD SP-AL-NETPAYOFF VALUE 10, MERCURY ITT LYNDON
      * BAH 020296 ADDED LCTYPE = "O" FOR EAST TENNESSEE
      * JTG 021196 ADDED SP-RBSPOPT1 = 15, MERCURY 'OREGON' RULE OF
      *            ANTICIPATION OPTION
      * BAH 042996 ADDED SP-SCFRMLA = 22 , PACESETTER (MI)
      * BAH 043096 ADDED SP-SCFRMLA = 23 , NORTH CAROLINA
      * JTG 051596 CHANGED SP-INS-RATE-FILE VALUES TO 71 THRU 99
      * JTG 060396 RESERVED SP-SCFRMLA = 24 , NEBRASKA (GRAND ISLAND A48)
      * BAH 070196 REMOVED SP-INSTBL(13,14), SP-INSFEETBL(13,14)
      *                    SP-REBTBL(17,18), SP-REBTBL2(17,18)
      * JTG 070296 ADDED SP-LCUNITPER-CD, SP-DEFUNITPER-CD,
      *                  SP-RBUNITPER-CD(OCCURS 16)
      * BAH 070896 ADDED SP-SCFRMLA = 25, MERCURY 'KS'
      * BAH 072496 ADDED SP-DEFPERCD = 8 (INSTANT AUTO)
      * BAH 082996 ADDED SP-RBEARLY = 14 (SUN, LA)
      * JFF 100896 ADDED SP-SCFRMLA = 26, MERCURY 'WA'
      * JTG 102896 ADDED SP-ERNFRMLA = 21, ACTUARIAL PRIN.REDUCTION (INTDATE)
      *                  SAME AS SP-ERNFRMLA 12, EXCEPT FOR ACTUARIAL RATE USED
      * JTG 111596 ADDED SP-INSRATECD = 11, (88) SP-ADVANCE-MTG-FIRE
      * KEC 111596 ADDED SP-RESCIND-BUS-DAYS;
      *             (88) SP-RESCIND-BUS-DAYS-VALID
      * JTG 120496 CHANGED THE FOLLOWING TO ALLOW A 'Z' AND NOT 'B'
      *            TO MATCH LOGIC IN LONPFA.C & LONPFB.C
      *            88  SP-DLRVCHGS-RB-CD-VALID        VALUE " " "A" "Z".
      *            88  SP-PARVHELD-RB-CD-VALID        VALUE " " "A" "Z".
      *            88  SP-PARVPAID-RB-CD-VALID        VALUE " " "A" "Z".
      * BAH 121396 ADDED SCFRMLA 27, MERCURY CALIF. #L 042
      * BAH 121696 ADDED SCFRMLA 28, ADVANCE  # 405
      * JTG 011097 ADDED SP-ERNFRMLA = 22 DISCOUNT EARN FORMULA, ATLANTIC FIN
      *                  BALANCE REMAINING METHOD
      * BAH 021197 ADDED RBEARLY 15 = ALABAMA, SAME AS 12, EXCEPT 120 DAYS
      *            FOR MERCURY
      * BAH 021197 ADDED RBEARLY 16 = ALABAMA, SAME AS 3, EXCEPT 120 DAYS
      *            FOR SUN FINANCE
      * JTG 021297 ADDED THE FOLLOWING FOR MERCURY, OH 30 1 1
      *              88  SP-PYEXSPCODE-REGZ      VALUE 0.
      *              88  SP-PYEXSPCODE-REMAIN    VALUE 1.
      * BLV 022097 ADD SP-MIN-CREDIT-SCORE
      * KEC 031297 ADDED SP-RESCIND-SATURDAY; PR#459.
      * JTG 041097 MADE SP-EXPR-FRMLA 'B' VALID AND ADDED
      *            88  SP-EXPR-FRMLA-ORIG         VALID "B".
      *            88  SP-EXPR-FRMLA-USE-EXPIRED  VALID "A" "B".
      * JTG 051397 ADDED SP-RBEARLY = 17, CLAY FINANCIAL SINGLE PAY LOANS ONLY
      * BAH 062597 ADDED SP-RBEARLY 18, 19 AND 20 FOR WORLD (A90-9,10,11)
      * JTG 071197 ADDED SP-ERNFRMLA = 64, MERCURY DISCOUNT EARN FORMULA
      *            SAME RATIO AS INTEREST IS EARNED
      * BAH 071197 ADDED INSFINCHG(), AND REARRANGED RECORD.....CREATED FIX
      * JTG 071897 ADDED SP-PACESETTER-FG RE: GRAND ISLAND #135
      * JTG 072897 ADDED SP-WAGE-ASSIGN-DAYS RE: MERCURY/MIDLAND #E135
      * MJD 072997 ADDED SP-RBEARLY = 21: EARLY PROVISION FOR ACQUISITION
      *            CHARGES. ADDED 99 TO SP-RBEARLY-VALID.
      * JTG 091697 ADDED 'D' WORLD A90, TO SP-BANKRULE & SP-TRWBANKRULE
      * BAH 102997 ADDED FEEFRMLA = 'C' FOR DOC STAMPS, COMMERCIAL PR#579
      * BAH 123097 ADDED SP-SCFRMLA 29 FOR MULLEN, SAME AS 5 BUT WITH
      *            4'S RENEWAL RESTRICTION, PR# 589
      * JTG 051298 ADDED SP-CAL-PAYMENT-ROUND-FG, CAVILER #XXX
      * BLV 061198 ADDED SP-SIZE 4513; ALL REFERENCES TO SP REC SIZE IN
      *            A10 HAVE BEEN 4502 SINCE FALL OF 97!
      * KEC 071398 ADDED SP-CAN-LOANS-FG.                       PR# 187
      * JTG 072198 ADDED SP-INSRATECD = 13, SP-LYNDON-NET-PAYOFF MERCURY, AL
      * JTG 072198 REMOVED SP-INSRATECD = 13, SP-LYNDON-NET-PAYOFF MERCURY, AL
      * BAH 081098 ADDED SP-ALLOW-DELINQ-POLCD AND SP-YTD-MAX-ALLOW-DELINQ
      *            FOR MERCURY'S NEW EDIT ON ALLOW DELINQ'S, #193
      * JTG 082898 ADDED SP-ERNPERCD-EFFSMP  VALUE "S" CITIZENS #733.
      * KEC 092498 ADDED THE FOLLOWING FOR REVOLVING CREDIT (REGENCY):
      *              SP-REVOL-APPLY-ORDER[5]
      *              SP-REVOL-APPLY-PURCHASE
      *              SP-REVOL-BAL-FRMLA
      *              SP-REVOL-CYCLE-DATE-FRMLA
      *              SP-REVOL-CYCLE-DATE-TABLE[31]
      *              SP-REVOL-PYMT-DUE-FRMLA
      *              SP-REVOL-PYMT-DUE-WORK
      *              SP-REVOL-PYMT-EXCEPTION
      *              SP-REVOL-PYMT-MINIMUM
      *              SP-REVOL-PYMT-MAXIMUM
      *              SP-REVOL-PYMT-PERCENT
      *              SP-REVOL-PYMT-ROUND-CODE
      *              SP-REVOL-PROGRAM-TABLE[10]
      *              SP-REVOL-NO-MTHS-NA-PRINT-STMT
      * JTG 100598 ADDED SP-CAL-BREAK-ON-FLATAMT    VALUE "F", WORLD 'MO'
      * JTG 091697 ADDED 'R' REGENCY REVOL, TO SP-BANKRULE & SP-TRWBANKRULE
      *            ADDED 'R' REGENCY REVOL, TO SP-LCFRMLA
      * BAH 102198 ADDED SP-RBEARLY 22 FOR FREEDOM, AL #775, WITHIN 90 DAYS
      *            DO PRORATA, OTHERWISE, NO REFUND
      * KEC 103098 ADDED SP-REVOL-MEMBERSHIP-FEE
      *                  SP-REVOL-MEMBERSHIP-FORMULA; REGENCY REVOLVING
      * BAH 110398 ADDED SP-SCFRMLA 30, CITIZENS TN PR# 779
      * JTG 112098 EXPANDED SP-REVOL-APPLY-ORDER[5] TO [15]
      *                     SP-REVOL-IS-FINCHG[15]
      * JTG 122198 ADDED SP-RBSPOPT1 = 16 OHIO PREPAY PENALTY, REGENCY #001
      * JTG 122198 ADDED SP-LCTYPE = 'P'  OHIO PRIOR 07/12/96, REGENCY #002
      * JTG 122198 ADDED SP-SCFRMLA = 31, OHIO FLAT DOLLAR   , REGENCY #003
      * JTG 122198 ADDED SP-SCFRMLA = 32, OHIO % PRINCIPAL   , REGENCY #004
      * JTG 122198 ADDED SP-SCFRMLA = 33, OHIO %PRIN /FEE    , REGENCY #005
      * JTG 122198 ADDED SP-SCFRMLA-POINTS  VALUE 1 8 28 32 33
      * JTG 990112 ADDED SP-LNCOST-FRMLA AND SP-LNCOST-AMT,    REGENCY #006
      * JTG 990113 ADDED SP-EDT-TYPE 'P' POINTS,               REGENCY #012
      * JTG 990121 ADDED 88  SP-LCTYPE-REVOL-VALID VALUE " " "A" "B" "E" "F".
      * MJD 990127 ----- UPDATED IN FLEXGEN -----
      * JTG 990210 ADDED SP-SCFRMLA = 34, PA %CASH ADV.        REGENCY #013
      * KEC 990211 CHANGED SP-RESCIND-BUS-DAYS-VALID FROM
      *             'VALUE "0" THRU "5"' TO 'VALUE "0" THRU "8"'.
      *                                               REGENCY PR# 00015
      * BAH 990217 ADDED SP-SCFRMLA = 35, PA REGENCY #016
      * JTG 990218 ADDED SP-INSCHGABLE = 'F', CASH ADV LESS FEES, REGENCY #020
      * JTG 990218 ADDED SP-INSRATECD = 13,14,15, REGENCY CL NET PAYOFF FRMLA'S
      *           88  SP-RG-PA-NET                VALUE 13.
      *           88  SP-RG-OH-NET                VALUE 14.
      *           88  SP-RG-NY-NET                VALUE 15.
      * JTG 990218 ADDED SP-INSCHGABLE = 'K', AMTFIN - CL,         REGENCY
      * JTG 990218 ADDED SP-INSCHGABLE = 'L', AMTFIN + SC - CL,    REGENCY
      * BAH 990222 ADDED SP-INSEXCEPT 13, REGENCY  (SP-CL-AH-MAXIMUMS) #023
      * CS  1999.0301 >>>>>>>> 'A10-TO-A15' CONVERSION UPDATED <<<<<<<<
      * GLF 030299 ADDED SP-LCTYPE-VALID OF "Q" FOR MULLEN
      * JTG 990309 ADDED SP-CPOTCHGOFF-CD-VALID "B" REGENCY
      * JTG 990311 ADDED SP-BANKUNITPER-CD & SP-TRWBANKUNITPER-CD = 'E' TFC
      * JTG 990317 ADDED SP-DLDISC-RVPRIN1-PCNT,                       TFC #008
      *                  SP-LNCOST-FRMLA-VALID VALUE "D"
      * JTG 990329 ADDED SP-ERNDELQFRMLA 'C'                           TFC #005
      * JTG 990419 ADDED SP-RECFRMLA-CALENDAR-DUEDAY  "D"         FROM REL: A50
      *            ADDED SP-RECFRMLA-PERCNT-PMT       "P"         MERCURY  #183
      * KEC 1999.0503 >>>>>>>> 'A10-TO-A15' CONVERSION UPDATED <<<<<<<<
      * BAH 990519 ADDED SP-RBFRMLA2 = '2', CL NET PAYOFF BALBOA  MULLEN   #???
      * JTG 990519 ADDED SP-RBFRMLA2 = '3', MEAN RULE 78THS       REGACC   #N/A
      * JTG 990520 ADDED SP-MAINE-NET            VALUE 16          MAINE   #999
      *                  SP-FREEDOM-NET-BALLOON  VALUE 17        FREEDOM   #862
      * BAH 990603 ADDED SP-RBEARLY = 23, WORLD (MO) #206
      * BAH 990603 ADDED SP-RBSPOPT1 = 17, REGACC  #875
      * BAH 990623 ADDED SP-SCFRMLA = 36,(POINTS) WESTERN  #879
      * JTG 990624 ADDED SP-BANKRULE & SP-TRWBANKRULE = 'S' REVOL REGENCY  #044
      * BAH 990720 ADDED SP-SCFRMLA 37, FIXED CHG WITH RENEW EDITS, #894 EXCEL
      * BAH 990720 ADDED SP-RBSPOPT2 8, INSURANCE ORGTERM SWING 16 DAYS FOR
      *            REBATES, REGACC # 911
      * KEC 990805 >>>>>>>> 'A10-TO-A15' CONVERSION UPDATED <<<<<<<<
      * KEC 990811 >>>>>>>> 'A60-TO-A15' CONVERSION UPDATED <<<<<<<<
      * BAH 991014 ADDED MFFRMLA 3 FOR MERCURY PR# 220
      * GLB 991115 ADD NEW REVOLVING FIELD, SP-REVOLV-STMT-FORMAT
      * BLV 991117 ADDED SP-RENEWABLE-PAYS, SP-RENEWABLE-DAYS: WORLD PR# 213
      * JTG 991203 ADDED SP-ALLOW-LN-BACK-DATE, REGMGM# 1029
      * JTG 990317 ADDED SP-DLDISC-RVPRIN1-AF-PCNT,                    TFC #058
      * JTG 991202 ADDED SP-RBREDUC = 9999.03 NEW SOUTH, (GA)
      * MJD 991220 ADDED SP-DEFPOLCD = "B" (WORLD PR#216)
      * JTG 000104 ADDED SP-RBREDUC = 9999.04 WISCONSIN IB REAL ESTATE
      *            PREPAY PENALTY, WISCONSIN #1031
      * JTG 000111 ADDED SP-INSREJECT-FG OPTION 'C', WHICH WILL CAUSE WRITTING
      *            THE NO OF MONTHS INSURANCE NOT IN VIOLATION, WISCONSIN #1032
      * JTG 000119 ADDED SP-RBFRMLA2 '4', TN PROPERTY REFUND (SHORT RATE
      *            METHOD) CONSUMER FINANCIAL PR#1062
      * BAH 000124 ADDED SP-RBCOMCD  VALUE "B" FOR REGENCY, PR# 1048 FOR
      *            NOT ALLOWING COMBINED CL & AH REFS OF LESS THAN $10.
      * JTG 000124 ADDED SP-CAL-MAX-AT-ESTIMATE INSTANT AUTO #1047
      * BLV 000202 ADDED SIGN TO SP-RENEWABLE-PAYS, SP-RENEWABLE-DAYS:
      *            WORLD PR# 213, NEED SPECIAL FORMULA FOR WORLD CLASS 5
      * BAH 000225 ADDED SP-SCFRMLA 38 FOR REGENCY, PR# 1095
      * MJD 000228 ADDED SP-RBREDUC = 9999.05 NEW SOUTH, (GA)
      * JTG 000308 ADDED LOGIC FOR UNION SECURITY CREDIT LIFE NET PAYOFF,
      *                   SP-RG-TN-NET & SP-RG-KY-NET          REGENCY  TN & KY
      * JTG 000320 NEW DEFERMENT FORMULA SP-DEFFRMLA (> OF INTDUE OR 1/3 OF
      *            REGPAY)  MERCURY #224
      * GLB 000404 ADD VALID OPTION "M" TO SP-REVOL-CYCLE-DATE-FRMLA
      * GLB 000406 ADDED SP-RBREDUC = 9999.06 CAROLINA, (NC), PR# 1149
      * JTG 000406 ADDED NEW SP-ERNACCRL-FG() N D, NEW SOUTH #1129 TAKE EARN
      *            AFTER SAME AS CASH DATE
      * BAH 000407 ADDED SP-RBSPOPT1 = 18, SAME AS OPT1 = 7 PLUS MORE,
      *            MULLEN PR# 1118
      * KEC 2000.0410 >>>>>>>> 'A10-TO-A15' CONVERSION UPDATED <<<<<<<<
      * BLV 000508 ADDED SP-CPOTCHGOFF-CD-VALID "C", CONSIDER 120+ AS
      *            POTENTIAL CHARGE-OFFS,  MERC PR# 230
      * MJD 000516 ADDED SCFRMLA-VALID FOR 39 (SUPPORT PR#1181)
      * BAH 000517 ADDED 88 SP-INSRATECD-NET-PAYOFF FOR REGENCY AMPLE
      *            REPORTING, TIRED OF TESTING STATES AND CLASSES !!
      * BAH 000523 ADDED SP-INSAH-RETRO AND SP-INSAH-DAYS-WAIT SO WE CAN
      *            STOP HARD CODING THESE OPTIONS !! ADD TO A&H PAGE 9
      * GLB 000524 ADD "B";VALID SP-REVOL-MEMBERSHIP-FRMLA TO " " OR "A"
      * JTG 000619 ADDED LOGIC FOR TENNESSEE RATE TYPE 'M' FLAT MONTHLY CHARGE
      *            #1225
      * MJD 000619 ADDED "V" TO SP-EDT-TYPE-VALID (PR#1220)
      * JTG 000621 CORRECTED FORMULA'S 99, 98 AND 97 INTEREST BEARING
      *            DEFERMENT CHARGES, BY SETTING UP DEF-TOTAL-INTDUE
      *            AS A INPUT FIELD AND NOT USING INDU-INTEREST MERCURY #224
      *            AND CREATED 88 SP-DEFFRMLA-IB-FORMULAS   VALUE 97 98 99.
      * JTG 000720 ADDED TWO 88'S FOR SP-LCFRMLA RE: FXLCGD.C, ETC
      *            SP-LCFRMLA-PRIN-ONLY
      *            SP-LCFRMLA-TOTAL-MONEY
      * JTG 000822 ADDED LOGIC FOR KENTUCKY 60 DAY NO CHARGE LAW, ADDED
      *            SP-RBSPOPT1() = 19, WORLD #233
      * JTG 000919 ADDED SP-ADDON-EXCEPT-FG REGACC #71225 PR#1297
      * BAH 000920 ADDED SCFRMLA 40 AND TOTALLY CHANGING SCFRMLA 39, REGWAN
      *            NEVER USED AS WAS, AND NOW NEED 2 MORE !! PR# 1314
      * MJD 001030 ADDED SP-SCFRMLA = 41,(POINTS) WESTERN  #879
      * JTG 010112 ADDED NEW 88 SP-CAL-SET-SMPRATE-OVRRIDE VALUE 4 MERC PR#J016
      * JTG 010228 ADDED NEW RATE TYPE 'Z' AMORTIZED WHERE RUNTIME COMPUTES
      *            INTEREST ON A 30 DAY METHOD (REAL ESTATE) AND LOAN CALCS
      *            ARE DONE SIMPLE                   LENDMARK PR#1045 & PR#1380
      * BAH 010413 ADDED SP-RBSPOPT2 9 FOR LENDMARK, FULL REFUND UP TO "SAME
      *            AS CASH" DATE, PR# 1443
      * JTG 010503 NEW CODE 'B' FOR SP-RBUNITPER-CD(OCCURS 16)    PAACO PR#1466
      * BAH 010518 ADDED SP-SCFRMLA = 42,(SC SMALL LOANS)      SUNBELT  PR#1484
      * JTG 010521 NEW CODE 'T' FOR SP-ERNPERCD-VALID-SC
      *            NEW CODE '23' FOR SP-ERFRMLA                   PAACO PR#1469
      * BAH 010607 ADDED SP-SCFRMLA = 43 FOR FCF "NC", PR# 1506
      * BAH 010607 ADDED SP-SCFRMLA = 44 FOR FCF "VA", PR# 1498
      * KEC 010608 {PR#01478} REGIONAL ACCEPTANCE [KEVIN MULLEN]
      *            ADDED '03  SP-REPO-TRCD-FMNO-TABLE OCCURS 3 TIMES.'
      * BAH 010620 ADDED SP-PYEXFRMLA 11 FOR REGWAN, PR# 1515
      * JTG 010625 CREATED LCAP-X (BAD LOGIC) BY PUTTING BACK THE OLD LOGIC
      *            FOR LCAP-E                                     IDEAL PR#1509
      * JTG 010808 ADDED SP-LNCOST-FRMLA-VALID 'P' AMORTIZED
      *            PARTICIPATION EXPENSE                         REGACC PR#1559
      * BAH 010910 ADDED SP-RBSPOPT2 = 10, FULL REFUND UP TO 60 DAYS,
      *            REGACC PR# 1550
      * JTG 010912 NEW SP-CAL-TBFRMLA (5) SP-FORCE-ENTRY-OVRDRATE CENTRIX #1592
      * JTG 011024 NEW DEFERMENT REFUND SP-RBFRMLA2 = 5 SMALL LOANS
      *                                                          CITIZENS #1622
      * JTG 011026 CHANGED RBACT-APRATE TO RBACT-RATE FOR NEW REFUND FORMULA
      *            '0  6'                                       REGENCY PR#1631
      * JTG 011106 NEW SP-INSRATECD (20) 88 SP-CA-TRUNC-NET-MULL MULLEN PR#1641
      * JTG 011107 PLUS NEW SP-RBFRMLA (0 7) CL & AH REFUNDS     MULLEN PR#1641
      * BAH 011203 ADDED SP-INSEXCEPT 14, REGENCY (SP-ORGTERM-MAXIMUM)  PR#1657
      * BAH 011228 ADDED SP-SCFRMLA 45, HCRED "NC"  PR#1695
      * JTG 020419 PUT A48 LOGIC PACK AS AN OPTION FOR COMPUTING THE INTEREST
      *            REFUNDS FOR ALL ADDED: SP-CANCEL-ADDON-FG        COSMO #355
      * JTG 020530 CHANGED FOR (MIP) MONTHLY INSURANCE PREMIUMS   REGENCY #1801
      *            ADDED SP-INSCHGABL = 'Y' SP-INS-MIP
      * BAH 020802 ADDED SP-MFFRMLA 4 FOR REGWAN, "TN" PR# 1867
      * KEC 020821 {PR#01832} LENDMARK <A15> [JIM ROSENAUER]
      *             ADDED "SP-REVOL-STMT-EXTRACTION PIC X(01)"  (Y/N)
      * JTG 020919 ADDED NEW SHORT RATE FORMULA SP-RBEARLY = 24 (PP)    TFC #96
      * GLB 021114 ADD NEW FIELD SP-REVOL-ZERO-ADB PR#1946 FOR LENDMARK
      *            IF "Y" AND LN-CURBAL = 0, DONT CALCULATE CURRENT INTEREST
      * JTG 030128 CREATED FORMULA 12 LIKE 2 BUT SPREADS EXTENSION CHARGE
      *            OVER PAYMENTS  88  SP-PYEXFRMLA-SAME2-SPREAD VALUE 12.
      *                                                          CITIZENS #2006
      * BAH 030129 ADDED SCFRMLA 46 FOR LENDMARK PR# 2004
      * JTG 030513 ADDED SP-RBFRMLA2 (0 8) WISCONSIN CPI REFUND FORMULA
      *                                                          CITIZENS #2065
      * JTG 030528 ADDED SP-LCFRMLA = 'P' LIKE 'I'                  PACE #408
      * JTG 030620 ADDED LOGIC FOR IB SALES FINANCE AMORTIZATED PARTICIPATION
      *            RESERVE PAID EXPENSE, DIFFERENCE BETWEEN A BUY RATE
      *            AND THE CONTRACT RATE
      *            ADDED SP-LNCOST-FRMLA = '3'          WISCONSIN FINANCE #2049
      * JTG 030709 NEW INTEREST REFUND FORMULA (0 9) STATE OF TEXAS BASED
      *            ON DAILY INTEREST USING 365 DAYS AND SIMPLE      EXCEL #2111
      * JTG 030728 NEW INSURANCE REFUND 2ND FORMULAS:
      *            (0 A) MEAN OF PRORATA & RULE 78 (WORLD "NM", A&H)
      *            (0 B) RULE 78 FOR NET + 1  (WORLD "AL", LIFE)   WORLD #326
      * BAH 031001 ADDED 2 NEW INSURANCE CHARGEABLE CODES(SP-INSCHGABL) FOR
      *            SIGNAL(WISC), SP-INS-AMTFIN-2PMTS, SP-INS-AMTFIN-1PMTS
      *            AMTFIN-2PMTS = "2" AND AMTFIN-1PMT = "1", PR# 2157
      * BAH 040304 ADDED SP-DEFAULT-O2-INS-COMP FOR LENDMARK PR# 2258
      * BAH 040331 ADDED SP-LC-ON-JUDGEMENTS FOR RIVERSIDE PR# 2272
      *            STATE LAW SAYS NO LATE CHARGES ON JUDGEMENT ACCOUNTS
      * JTG 040501 ADDED LOGIC TO CAUSE THE UNEARNED LOAN COST TO ROLL TO
      *            THE NEW LOAN AFTER 'RENEWAL'. NOTE: THIS COST IS REFLECTIVE
      *            OF THE DISCOUNT WHEN PURCHASING LOAN PAPER NOT CARRIED AS
      *            SALES PAPER WITH DEALER DISCOUNT.
      *            ADDED SP-LNCOST-FRMLA = 'R'                    REGENCY #2287
      * BAH 040526 ADDED SP-RBSPOPT1 = 20, ACTUARIAL OREGON, DOLLAR PR# 2306`
      * JTG 040608 ADDED NEW SP-RBFRMLA (0 C) SHORT RATE FORMULA   MULLEN #2302
      * JTG 040811 ADDED SP-DELQ-IB-AGE AND SP-DELQ-IB-MAX-DAYS  LENDMARK #2344
      * JTG 040917 ADDED NEW FIELDS FOR SP-RBFRMLA (0 D)
      *            RULE 78THS USING DAYS IN TERM AND ELAPSED DAYS INSTEAD
      *            OF UNIT PERIODS IN TERM AND ELAPSE UNIT PERIODS
      *            ADDED AERN-LN-INSEFF & AERN-LN-INSEXP
      *            ALSO ADDED SP-RBSPOPT2 = 11 NEW ROUNDING OPTION TO
      *            TAKE COMPUTED REBATE AND ROUNDED UP OR DOWN TO
      *            WHOLE DOLLARS                                   REGACC #0074
      * JTG 041026 ADDED RATECD SP-AL-NETPAY-PLUS1       VALUE 21  WORLD  #J050
      * JTG 041102 ADDED ALAMAMA REFUND FRMLA ACTUARIAL (0 E)      WORLD  #J050
      * JTG 050324 ADDED RATECD SP-IN-NET-PACE           VALUE 22  PACE   #2469
      *  CS 050325 ADD SP-INSURANCE-WRITTEN (IF "N", INPUT TO ALL INSURANCES
      *            INCLUDING O2, O3 ARE BLOCKED). LENDMARK PR#2479
      * JTG 050401 REMOVED RATECD SP-IN-NET-PACE       REMOVED 22  PACE   #2469
      * BAH 050405 ADDED SP-RBSPOPT1 = 22, SUN "LA" PR# 2504
      * JTG 050418 NEW REFUND FORMULA '0 F' TRUE DAILY PRORATA REFUND FORMULA
      *            FOR STATE OF COLORADO                            WORLD #0401
      *  CS 050518 NEW VALUE FOR SP-EXPR-FRMLA OF 'C', PER JUDY ALWAYS USE
      *            EXPIRED RATES PR#484 (SP-EXPR-FRMLA-EXPRLA). PER JUDY
      *            WHEN LOAN IS EXPIRED CHARGE LESSER OF SIMPLE/EXPIRED RATE
      * JTG 050519 ADDED NEW FORMULAS FOR MEXICO
      *            SP-MFFRMLA-05 SP-RBFRMLA2 (G) SP-ERNFRMLA (24)   WORLD #0408
      *  CS 050520 ADDED NEW SP-RBFRMLA2 "H" FOR REGIONAL. WORKS THE SAME AS
      *     0 9 EXCEPT.. IT USES THE SPLIT RATE TABLE TO ACCESS INTEREST
      *     INSTEAD OF THE SIMPLE RATE [REGIONAL MGMT] [PR#2527]
      * JTG 050718 ADDED RATECD SP-IN-NET-PACE           VALUE 22  PACE   #2469
      * BAH 050830 ADDED NEW SCFRMLA 47, EXACTLY LIKE 46 BUT INCLUDE "FB"
      *            BAY COUNTRY PR# 2582
      *  CS 060203 ADD SP-RBSPOPT1 23 DONT ROUND REBATE TO WHOLE DOLLARS #2670
      *                                                          PEOPLE
      * BAH 060214 ADDED SP-INTERIM-COUPON TO REQUEST INTERIM COUPONS AT
      *            SALES FINANCE INPUT, ACC PR# 2704
      *  CS 060215 ADD SP-RBSPOPT1 24 TO USE TIM360 INSTEAD OF 365 [PR#2680
      *                                                            PEOPLE]
      * JTG 060612 CHANGED LOGIC FOR SINGLE PAYS LOANS > 11 MONTHS
      *            TO YIELD REMAINING DAYS FROM UPER-INTDATE PLUS
      *            FULL UNIT PERIODS TO UPER-1STPYDATE
      *            ADDED NEW LOAN CALCULATION FOR RICHARD        LENDMARK #2709
      * MJD 060823 ADDED NEW IN CHARGEABLE CODE "D"  THIS WILL CAUSE
      *            COVERAGE AND PREMIUM TO BE CALCULATED BASED ON THE MAX
      *            TERM OF THE INSURANCE                       PACESETTER #2771
      * JTG 061205 ADDED SP-SCFRMLA = 48,(POINTS)FOR TN REAL ESTATE LOANS
      *            REGENCY  #2880
      * MJD 061207 ADDED SP-RBSPOPT1 = 25 OHIO PREPAY PENALTY, REGENCY #2878
      *  CS 070227 ADDED SP-AUTO-ASSESS-LCHG REGIONAL PR#152-R
      *  CS 070330 ADDED SP-LNCOST-FRMLA 'M' MANUALLY ENTERED AT DIRECT LOAN
      *            INPUT TIME PR#2942 COLTN
      *  CS 070703 NEW SP-DFFRMLA 96 INTEREST BEARING 2% OF BALANCE MULLEN
      *                                                             PR#2477
      * BAH 070726 NEW SP-SCFRMLA 49 FOR REGMGM, SAME AS 29 EXCEPT CLASSES
      *            CAN BE DIFFERENT ON THE RESTRICTION,, PR# 3017
      * BAH 070814 ADDED SP-RBSPOPT1 = 26 TO USE APR INSTEAD OF SMPRATE
      *            ONLY IN RBFRMLA 'Q', LENDMARK PR# 3026
      * JTG 071030 NEW INSURANCE REFUND FORMULA (0 I) FOR CPI POLICYS
      *            WHICH ARE ALWAYS 1 (ONE) YEAR TERMS          CITIZENS #3097
      * BAH 071127 ADDED SP-MAX-CASH-PROCEEDS FOR REGMGM PR# 3110
      * MJD 080206 ADDED INS REB FRMLA 2 VALID = "J" FOR NM   WORLD #563
      * BAH 080910 ADDED INS REB FRMLA 2  "K" FOR MULLEN PR#3250
      * BAH 081118 ADDED IB DEFFRMLA 95 FOR HAMPMTON PR# 3280
      * MJD 090406 ADDED SP-ALLOW-ZERO-PROC FLAG TO ALLOW FOR
      *            ENTRY OF A ZERO PROCEEDS LOAN                    REGMGM #3341
      * MJD 090424 ADDED SP-BANKRULE-PCT                 (BARNETT)  71284 #3189
      *            ADDED SP-BANKRULE "E"                 (BARNETT)  71284 #3189
      * BAH 090522 ADDED SP-AUTO-SEND-TABLE OCCURS 2 TIMES TO ADD ONTO THE REPO
      *            TRCD TABLE OF 3, REGACC PR# 245
      * BAH 090624 ADDED SP-INSEXCEPT 15, ITS 2 AND 13 COMBINED SO ADDED 15 TO
      *            SP-EXTEND-INSURANCE AND SP-CL-AH-MAXIMUMS, REGWAN PR# 3383
      *  CS 090729 ADD SP-DLDISC-CONV-BF-PCNT, THIS WILL BE USED BY WORLD AT
      *            CONVERSION BF LINE TO COMPUTE A DISCOUNT PR#648
      * BAH 090821 ADDED SP-INSCHGABLE "E" FOR REGMGM PR# 3437
      * BAH 100301 ADDED SP-INSRATECD 23 FOR REGMGM PR# 3553
      *  CS 100304 ADDED SP-RBFRMLA2 'L' FOR UNITED PR#3548
      * MJD 100311 ADDED SP-INSRATECD(24) FOR REGMGM ALABAMA      (71226) #3455
      * BAH 040415 ADDED SP-RBSPOPT2 = 12, FULL REFUND WITHIN 3 DAYS,
      *                                                       REGMGM PR #3570
      *  CS 100624 ADDED SP-UNITPER-INFO  WORLD(MEXICO) PR# 692
      * BAH 100810 ADDED SP-RBEARLY = 25, REGMGM PR# 3614
      * BAH 100908 ADDED SP-RBFRMLA2 'M' FOR WORLD TX ANTICAPTED PR# 711
      * BAH 101229 ADDED SP-SCFRMLA '50' FOR WORLD IL  PR# 731
      *  CS 110106 ADDED SP-RBEARLY = 26, THIS IS THE SAME AS SP-RBEARLY =21
      *            EXCEPT THAT THERE IS NO REFUND IF NOT A "PO" . ONLY VALID
      *            FOR SERVICE CHARGE WORLD PR#733
      * BAH 110117 ADDED SP-RENEWAL-EDIT FOR WORLD TO STOP RENEWALS WITHIN
      *            75 DAYS AND ALSO 'PO' CAN NOT BE REMADE SAME DAY PR# 734
      * MJD 110126 ADDED SP-LCFRMLA = 'S'.  SAME AS "F" BUT DOES NOT CHARGE
      *            LATE CHAGE ON THE LAST PAYMENT                   WORLD #0723
      * BAH 110307 ADDED SP-RBCOMCD "C" THAT ALLOWS A COMBINED MINIMUM
      *            OF $5, REGENCY PR# 3743
      *  CS 110407 ADD SP-LNCOST-FRMLA '4' DOES THE FLAT RATE 'F' (AMOUNT IN
      *            LOAN COST %, AND TAKES PARTICIPATION PAID & UPDATES
      *            TO LN-ANTICERN(3)  REGMGMT PR#3765
      * BAH 110601 ADDED SP-SCFRMLA 52 AND 53 FOR MULLEN PR# 3799
      * MJD 110516 ADDED SP-BANKRULE = "F"                          WORLD #0752
      * MJD 110614 ADDED SP-ROUND-MFEE.  THIS IS USED FOR NON-CAN MX LOANS
      *            USING MFFRMLA 05.  THE VAT CHARGE CAN CAUSE THE CALCULATOR
      *            TO GO OUT OF BALANCE IF IT IS NOT DIVISIBLE BY THE TERM.
      *            THE CALCULATOR HAS BEEN MODIFIED TO REOUND UP BY ENOUGH
      *            PENNIES TO MAKE IT EVENLY DIVISIBLE.
      *                                                  ADDENDUM TO WORLD 692
      *  CS 110823 ADD SP-TRWBANKRULE 'F' SP-BANKRULE 'F' WORLD PR#752
      *  CS 110907 ADD SP-RBEARLY 98 REGIONAL MGT   PR#3865
      * BAH 111031 ADD SP-RBSPOPT2 = 13 FOR COLTN, PR# 3900
      * MJD 111201 ADDED SP-ADV-TO-1ST-NO-CORR.  THIS OPTION NEEDS TO BE
      *            ABLE TO BE CONTROLLED VIA SPR SO IT CAN VARY BY CLASS PR#3907
      * MJD 120126 ADDED SP-RBFRMLA2 = "N"                          CFSC PR#3795
      *            THIS IS A NEW RULE OF ANTICIPATION FOR CREDIT LIFE.
      * MJD 120321 ADDED SP-OPT-CAL-PRO-INS-SC-NO-03.  THIS WILL WORK LIKE "B"
      *            BUT WILL EXCLUDE OTHER 3 (O3) FROM THE CALCULATION.
      * MJD 120502 ADDED SP-RBFRMLA2 = "O".  TX RULE OF ANTICIPATION FOR LIFE.
      *            GROSS LIFE, SINGLE PREMIUM PER $100/YEAR WITH DISCOUNT.
      *                                                              71226 #3938
      *  CS 120717 ADD SP-LC-INT-ON-REPO-NON-PL PR#314 REGACC, DONT ASSESS OR
      *            COLLECT LC/INT ON SX OR SS ACCOUNTS.
      *  CS 121005 ADD SP-CONTRACTUAL-SET-NONACCRUAL,SP-CONTRACTUAL-RESET-ACC
      *           RUAL, SP-MONTH-PAY-NAPP-COUNTER, THESE ARE INTERNAL REPORTING
      *           REQUIRMENT FOR THIS CUSTOMER AND HAVE NOT IMPACT ON
      *           THE ACCRUAL PROCESS #323 REGACC.
      * BAH 121009 ADDED SP-INSREJECT-FG "D" FOR MULLEN PR# 4088
      *            REJECT A&H IF WORK-HRS < 30
      *  CS 121116 ADD  SP-ERNDELQFRMLA 'R' ADJUST EARNINGS TO CASH
      *                                                 WORLD PR#829
      * MJD 130102 ADDED SP-INSRATECD-25.   SIMILAR TO RATECD 24 BUT WILL
      *            WORK WITH EXTENDED FIRST PAYMENTS.               REGMGM #4185
      * BAH 130115 ADDED SP-RBSPOPT1 27 FOR "CA" (MULLEN, COSMO) MULLEN PR# 4182
      * BAH 130426 ADDED SP-INSREJECT-FG "E" FOR CASHCO PR# 4261
      * BAH 130501 ADDED SP-SHORT-PAY-THRESHOLD FOR NEWPORT, PR# 4256
      * MJD 120530 ADDED 54 TO SCFRMLA-VALID                         WORLD #0874
      * MJD 130802 ADDED RBEARLY = 27 (ONLY WORKS WITH SCFRMLA 54)   WORLD #0911
      * BAH 130814 ADDED SCFMLA 55 "IN" WORLD, CROSS BETWEEN 23 & 32 WORLD #918
      * BAH 130912 ADDED SP-RBFRMLA2 = "P".  "IN" DECREASING LIFE, CFSC PR# 4367
      * BAH 130916 ADDED SP-RENEWAL-EDIT "B" AND "C" FOR WORLD, PR# 923
      *  CS 130919 ADD SP-ERNFRMLA 65 WORLD ONLY, USES FORMULA 52 BUT SETS THE
      *            DATE USED FOR THE ACCRUAL BASED ON FULL/PARTIAL PAYMENTS
      *                                                WROLD PR#930
      * BAH 131017 ADDED SP-DEFPOLCD "C" HONOR PR# 4382
      *
      * KEC 131107 {PR#00345} REGIONAL ACCEPTANCE <A15> [K.MULLEN]
      *            ADD SP-LNCOST-FRMLA '5' DOES THE FLAT RATE 'F'
      *            (AMOUNT IN LOAN COST %, AND TAKES PARTICIPATION PAID
      *            & UPDATES TO LN-ANTICERN(4)
      * BAH 131125 ADDED SP-CASH-AVAIL-PERCENT FOR WORLD PR# 944
      * BAH 131213 ADDED SP-SCFRMLA 56 FOR WORLD TX PR# 953
      * MJD 140128  ADDED SP-RBSPOPT1 = 28                           WORLD #0954
      * CS  140505 ADDED SP-O1-JOINT-FG  SUPPORT PR#4537
      * MJD 140723 ADDED SP-ADDON-RATE-FG = "A"           MULLEN/KSTREET PR#4556
      * BAH 150508 ADDED SP-SCFRMLA 57 FOR NSA PR# 4747
      * MJD 150512 ADDED SP-DEFBASE = 11                           REGENCY #4753
      *
      * BAH 151103 ADDED SP-NET-BAL-REQ AND SP-AMT-PROCEEDS-REQ, AND NEW
      *            SP-RENEWAL-EDIT "D" AND "E"  TO USE THESE NEW FIELDS REGMGM
      *                                                        REGMGM PR#4885
      * KEC 151117 {PD#00003} PARADATA <A30> [JAY CISZEWSKI]
      *            SP-REC & SP-SIZE = %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
      *            ADDED SP-LTOUCH-DATE
      *            DATES CHANGED TO CCYYMMDD --- PIC 9(08) COMP-3.
      *            CHANGED COMP-6 TO BE COMP-3
      *  CS  160225 ADDED SP-ALT-PREPAY-MONTHS WHICH IS THE NUMBER OF MONTHS
      *             PAID AHEAD MINIMUM THAT FORCES A REBATE OF INTEREST,
      *             USED IN ALABAMA   WORLD PR#1140
      * BAH 160427 ADDED SP-SCFRMLA 58 FOR WORLD TX, NO SERCHG IF BORROWER HAD
      *            PREVIOUS SERCHG WITHIN 1 YR IN SAME STATE AND CLASS PR#1154
      * MJD 160511 ADDED SP-RBDTE = "D"                             71105#0918
      *  CS 160714 CHANGED CLASS 9(3)
      *            SP-ERNPERTBL FROM OCCURS 6 TO  OCCURS 10.
      *            SP-EARN-ORDER OCCURS FROM 6 TO 10.                  
      *            SP-INSTBL OCCURS FROM 12 TO 14.               
      *            SP-REBTBL OCCURS FROM 16 TO 22.
      *            SP-REVOL-APPLY-ORDER-TBL FROM 15 TO 21 CURS 21
      *            SP-REVOL-APPLY-ORDER             PIC 99.
      *            88  SP-REVOL-APPLY-ORDER-VALID       VALUE 1 -  12.
      *            88  SP-REVOL-APPLY-ORDER-NEW         VALUE 16 - 21.
      *            SP-SPRCLASS FROM 2 TO 3
      *            SP-EXPR-BREAK FROM 9(6) TO 9(7)
      *            SP-ACC-BREAK FROM 9(6) TO 9(7)                      
      *            SP-ERNAMT (UPFRONT) FROM 9(5) TO 9(7)          
      *            SP-MFMAX FROM 9(4) TO 9(5)                        
      *            SP-INSMAXCHGABL FROM 9(6) TO 9(7)
      *            SP-INSMAXBENIF FROM 9(6) TO 9(7)                     
      *            SP-INSMAXCOV  FROM 9(6) TO 9(7)                    
      *            SP-REVOL-PYMT-MINIMUM FROM 9(4) TO 9(7)                   
      *            SP-REVOL-PYMT-MAXIMUM FROM 9(4) TO 9(7)                  
      *            SP-REVOL-MEMBERSHIP-FEE FROM 9(4) TO 9(7)                 
      *            SP-LCGRACE REMOVED COMP                         
      *            SP-LNCOST-AMT FROM 9(5) TO 9(7) 
      *            SP-EDT-AMT FROM 9(6)V99 TO 9(7)V99                
      *            SP-LCFRMLA FROM PIC X TO PIC X(2)     
      *            SP-LCTYPE FROM PIC X TO PIC X(2).    
      *            SP-INS-FILLER FROM 5 TO 15                   
      *            SP-RB-FILLER FROM X(5) TO X(10)                
      *            SP-INSCHGABL FROM PIC X TO PIC X(2)         
      *            SP-RBFRMLA FROM PIC X TO PIC X(2)            
      *            SP-RBFRMLA2  FROM PIC X TO PIC X(2)   
      *            NEW   SP-INSEARN-ORDER   PIC 9(2) OCCURS 14.
      *            CHANGED COMP TO COMP-3
      *            ADD 500 FILLER
      *            SP-SIZE = 8050
      * BAH 161010 ADDED SP-PERCENT-REGPAY-AVAIL FOR WORLD PR# 1194
      * MJD 161213 ADDED DEFERMENT FORMULA 10 (71225 PR#384)
      * MJD 170330 ADDED SP-ALT-DEFFRMLA, SP-ALT-DEFMIN, SP-ALT-DEFMAX
      *            USED IN WI/COLAS2, USE FX/FIXSP8 TO SET INITIAL.
      *            NOTE THESE ARE NOT USED FOR ANY CALCULATIONS WITHIN LOAN
      *            PROCESSING                                          71225#386
      * BAH 170516 ADDED SP-EDT-AMTYPE "R" TOTAL REPAY FOR REGMGM PR#5291
      * BAH 171204 SP-NON-LOAN-FLAG AND SP-SKIP-TRW FOR TAX LOANS, WORLD PR#1288
      * BAH 190213 SPLIT INTO 3 FILES
      *            REMOVED SP-ANTICIATED, REMOVED ALL REVOLVING FIELDS
      *            CHANGED INSVERTBL TO OCCUR 5 INSTEAD OF 14 (IVER)
      *            CHANGED INSTBL    TO OCCUR 12 INSTEAD OF 14 (ILEV)
      *            CHANGED SPC-INSEARN-ORDER TO 12 FROM 14 TO MATCH INSTBL
      * KEC 190219 A32 FFR - REMOVED REDEFINE FOR SP-LC-CODEX; UNUSED
      *  CS 190508 LP01SPC, REPLACED ENDING FILLER WITH FUTURE FIELDS
      *  CS 190509 SIZE 5096 WAS 5500
      * BAH 2019.0529 ADDED SP-SCFRMLA 59, KY HB225, WORLD #1374
      * BAH 2020.0128 ADDED SP-RBEARLY 28, IL, WORLD #1417
      * AMM 2021.0427 REMOVED FUTURE FIELDS, RESIZED FILE
      * BAH 2021.0615 ADDED SP-SCFRMLA 60 & 61, TN, WORLD #1500
      * BAH 2021.0617 ADDED SP-RBEARLY 97, TN, WORLD #1500
      * BAH 2021.0813 ADDED SP-INSREJECT-FG "F" #1510
      * BAH 2023.0301 SP-INS-O1-EDIT ADDED "I" IUI AND "C" CPI/AUTO, #1594
      * BAH 2023.0328 SP-LCFRMLA "T", SAME AS "S" BUT TOTAL MONEY "WI" #1597
      * BAH 2023.0608 ADDED SP-SCFRMLA 62, TN, WORLD #1608
      * BAH 2024.1008 ADDED SP-SCFRMLA 63, WI, #1682
      ******************************************************************
       78  SP-SIZE                            VALUE 6500.
       01  SP-REC.
           03  SP1-KEY.
               05  SP-ORGST                   PIC XX.
               05  SP-SPRCLASS                PIC 999.
               05  SP-SUBCLASS                PIC 99.
               05  SP-LAWCODE                 PIC 99.

      * FIELDS ARE ALSO CALLED SPA-EXPR, ONLY WANT TO CHANGE INDEX
      * SIZE= 1225
       COPY "LIBLP/LP01SPA_AREA.CPY" REPLACING LEADING "SPA-" BY "SP-"
                                     LEADING "AEXPR" BY "EXPR"
                                     LEADING "AASTP" BY "ASTP"
                                     LEADING "ACTBL" BY "CTBL"
                                     LEADING "ACSTP" BY "CSTP"
                                     LEADING "AETBL" BY "ETBL"
                                     LEADING "AESTP" BY "ESTP".
      * SIZE=2724
       COPY "LIBLP/LP01SPB_AREA.CPY" REPLACING LEADING "SPB-" BY "SP-"
                                        LEADING "BILEV" BY "ILEV"
                                        LEADING "BISTP" BY "ISTP"
                                        LEADING "BIVER" BY "IVER".
      * SIZE=2542
       COPY "LIBLP/LP01SPC_AREA.CPY" REPLACING LEADING "SPC-" BY "SP-".

