      * COPYMEMBER: LIBLP/LP01SP_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL - STATE PARAMETER FILE
      *
      *=================================================================
      * REV:
      * AMM 2021-0503 ***NEW***
      * JKC 2022-0427 ADDED '01 QSP-REC' AND MOVED ALL OF QSPA|B|C-REC
      *               UNDER IT.  DID THIS AS PART OF THE USE OF 'JOIN'
      *               USAGE IN THE IO (READ/READ-NEXT).
      *
      ******************************************************************
      *- - -{STANDARD CURSOR FOR START & READ-NEXT}
       01  SPA1-CURSOR-STAT             PIC X(2) VALUE SPACES.
           88  SPA1-CURSOR-STAT-GOOD             VALUE "00".
           88  SPA1-CURSOR-STAT-BAD              VALUE "  " THRU "//"
                                                       "01" THRU "~~".

      *- - -{GREATER CURSOR FOR START-GREATER & READ-NEXT}
       01  SPA1-CURSOR-GR-STAT          PIC X(2) VALUE SPACES.
           88  SPA1-CURSOR-GR-STAT-GOOD          VALUE "00".
           88  SPA1-CURSOR-GR-STAT-BAD           VALUE "  " THRU "//"
                                                       "01" THRU "~~".

       01  SPA1-CURSOR-NG-STAT          PIC X(2) VALUE SPACES.
           88  SPA1-CURSOR-NG-STAT-GOOD          VALUE "00".
           88  SPA1-CURSOR-NG-STAT-BAD           VALUE "  " THRU "//"
                                                       "01" THRU "~~".

      *- - -{STANDARD CURSOR FOR START & READ-NEXT}
       01  SPB1-CURSOR-STAT             PIC X(2) VALUE SPACES.
           88  SPB1-CURSOR-STAT-GOOD             VALUE "00".
           88  SPB1-CURSOR-STAT-BAD              VALUE "  " THRU "//"
                                                       "01" THRU "~~".
      *- - -{STANDARD CURSOR FOR START & READ-NEXT}
       01  SPC1-CURSOR-STAT             PIC X(2) VALUE SPACES.
           88  SPC1-CURSOR-STAT-GOOD             VALUE "00".
           88  SPC1-CURSOR-STAT-BAD              VALUE "  " THRU "//"
                                                       "01" THRU "~~".

       EXEC SQL BEGIN DECLARE SECTION END-EXEC.

       01  SP1-RETURN-CODE                 PIC S9(4)   COMP-5.

       01  QSP1-WHERE-BEG-KEY.
           03  QSP1-WBEG-ORGST             PIC XX.
           03  QSP1-WBEG-SPRCLASS          PIC 999.
           03  QSP1-WBEG-SUBCLASS          PIC 99.
           03  QSP1-WBEG-LAWCODE           PIC 99.
 
       01  QSP1-WHERE-END-KEY.
           03  QSP1-WEND-ORGST             PIC XX.
           03  QSP1-WEND-SPRCLASS          PIC 999.
           03  QSP1-WEND-SUBCLASS          PIC 99.
           03  QSP1-WEND-LAWCODE           PIC 99.

       01  QSP-REC.
           03  QSPA-REC.
               05  QSPA-ORGST                         PIC XX.
               05  QSPA-SPRCLASS                      PIC 999.
               05  QSPA-SUBCLASS                      PIC 99.
               05  QSPA-LAWCODE                       PIC 99.
               05  QSPA-LTOUCH-DATE                   PIC X(10).
               05  QSPA-DESC                          PIC X(15).
               05  QSPA-NOTES                         PIC X(60).
               05  QSPA-EFFDATE                       PIC X(10).
               05  QSPA-EXPDATE                       PIC X(10).
               05  QSPA-EXPD-MONTHS                   PIC 99.
               05  QSPA-EXPD-DAYS                     PIC 99.
               05  QSPA-EXPD-FRMLA                    PIC X.
               05  QSPA-EXPD-EXCEPT                   PIC X.
               05  QSPA-EXPR-FRMLA                    PIC X.
               05  QSPA-EXPR-REDU-FRMLA               PIC X.
               05  QSPA-EXPR-RATE-1                   PIC 999V999.
               05  QSPA-EXPR-BREAK-1                  PIC 9(7)V99.
               05  QSPA-EXPR-YRTYPE-1                 PIC 9(4).
               05  QSPA-EXPR-INTMETH-1                PIC X.
               05  QSPA-EXPR-RATE-2                   PIC 999V999.
               05  QSPA-EXPR-BREAK-2                  PIC 9(7)V99.
               05  QSPA-EXPR-YRTYPE-2                 PIC 9(4).
               05  QSPA-EXPR-INTMETH-2                PIC X.
               05  QSPA-EXPR-RATE-3                   PIC 999V999.
               05  QSPA-EXPR-BREAK-3                  PIC 9(7)V99.
               05  QSPA-EXPR-YRTYPE-3                 PIC 9(4).
               05  QSPA-EXPR-INTMETH-3                PIC X.
               05  QSPA-EXPR-RATE-4                   PIC 999V999.
               05  QSPA-EXPR-BREAK-4                  PIC 9(7)V99.
               05  QSPA-EXPR-YRTYPE-4                 PIC 9(4).
               05  QSPA-EXPR-INTMETH-4                PIC X.
               05  QSPA-EXPR-RATE-5                   PIC 999V999.
               05  QSPA-EXPR-BREAK-5                  PIC 9(7)V99.
               05  QSPA-EXPR-YRTYPE-5                 PIC 9(4).
               05  QSPA-EXPR-INTMETH-5                PIC X.
               05  QSPA-EXPR-LCHG                     PIC X.
               05  QSPA-JUDGFRMLA                     PIC X.
               05  QSPA-JUDGRATE                      PIC 999V999.
               05  QSPA-JUDGYRTYPE                    PIC 9(4).
               05  QSPA-JUDGINTMETH                   PIC X.
               05  QSPA-ACC-FRMLA                     PIC X.
               05  QSPA-ACC-YRTYPE                    PIC 9(4).
               05  QSPA-ACC-INTMETH                   PIC X.
               05  QSPA-ACC-RATE-1                    PIC 999V999.
               05  QSPA-ACC-BREAK-1                   PIC 9(7)V99.
               05  QSPA-ACC-RATE-2                    PIC 999V999.
               05  QSPA-ACC-BREAK-2                   PIC 9(7)V99.
               05  QSPA-ACC-RATE-3                    PIC 999V999.
               05  QSPA-ACC-BREAK-3                   PIC 9(7)V99.
               05  QSPA-ACC-RATE-4                    PIC 999V999.
               05  QSPA-ACC-BREAK-4                   PIC 9(7)V99.
               05  QSPA-ACC-RATE-5                    PIC 999V999.
               05  QSPA-ACC-BREAK-5                   PIC 9(7)V99.
               05  QSPA-1098FRMLA                     PIC X.
               05  QSPA-DISFRMLA                      PIC X.
               05  QSPA-CONTRFRMLA                    PIC X.
               05  QSPA-BANKRULE                      PIC X.
               05  QSPA-CONTPDTH                      PIC 9(4).
               05  QSPA-FINCHG                        PIC 99.
               05  QSPA-BANKUNITPER-CD                PIC X.
               05  QSPA-TRWBANKRULE                   PIC X.
               05  QSPA-TRWCONTPDTH                   PIC 9(4).
               05  QSPA-TRWBANKUNITPER-CD             PIC X.
               05  QSPA-RECFRMLA                      PIC X.
               05  QSPA-RECPAYCD                      PIC X.
               05  QSPA-RECPDTH                       PIC 9(3).
               05  QSPA-DISFRMLA-SPAY-FG              PIC X.
               05  QSPA-ERNFRMLA-1                    PIC 99.
               05  QSPA-ERNAMT-1                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-1                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-1                    PIC X.
               05  QSPA-ERNACCRL-FG-1                 PIC X.
               05  QSPA-ERNACCRL-START-CD-1           PIC X.
               05  QSPA-ERNACCRL-DFCD-1               PIC X.
               05  QSPA-ERN-DAYS-1                    PIC 99.
               05  QSPA-ERN-TERM-1                    PIC 999.
               05  QSPA-ERN-TYPE-1                    PIC X.
               05  QSPA-ERNFRMLA-2                    PIC 99.
               05  QSPA-ERNAMT-2                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-2                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-2                    PIC X.
               05  QSPA-ERNACCRL-FG-2                 PIC X.
               05  QSPA-ERNACCRL-START-CD-2           PIC X.
               05  QSPA-ERNACCRL-DFCD-2               PIC X.
               05  QSPA-ERN-DAYS-2                    PIC 99.
               05  QSPA-ERN-TERM-2                    PIC 999.
               05  QSPA-ERN-TYPE-2                    PIC X.
               05  QSPA-ERNFRMLA-3                    PIC 99.
               05  QSPA-ERNAMT-3                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-3                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-3                    PIC X.
               05  QSPA-ERNACCRL-FG-3                 PIC X.
               05  QSPA-ERNACCRL-START-CD-3           PIC X.
               05  QSPA-ERNACCRL-DFCD-3               PIC X.
               05  QSPA-ERN-DAYS-3                    PIC 99.
               05  QSPA-ERN-TERM-3                    PIC 999.
               05  QSPA-ERN-TYPE-3                    PIC X.
               05  QSPA-ERNFRMLA-4                    PIC 99.
               05  QSPA-ERNAMT-4                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-4                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-4                    PIC X.
               05  QSPA-ERNACCRL-FG-4                 PIC X.
               05  QSPA-ERNACCRL-START-CD-4           PIC X.
               05  QSPA-ERNACCRL-DFCD-4               PIC X.
               05  QSPA-ERN-DAYS-4                    PIC 99.
               05  QSPA-ERN-TERM-4                    PIC 999.
               05  QSPA-ERN-TYPE-4                    PIC X.
               05  QSPA-ERNFRMLA-5                    PIC 99.
               05  QSPA-ERNAMT-5                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-5                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-5                    PIC X.
               05  QSPA-ERNACCRL-FG-5                 PIC X.
               05  QSPA-ERNACCRL-START-CD-5           PIC X.
               05  QSPA-ERNACCRL-DFCD-5               PIC X.
               05  QSPA-ERN-DAYS-5                    PIC 99.
               05  QSPA-ERN-TERM-5                    PIC 999.
               05  QSPA-ERN-TYPE-5                    PIC X.
               05  QSPA-ERNFRMLA-6                    PIC 99.
               05  QSPA-ERNAMT-6                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-6                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-6                    PIC X.
               05  QSPA-ERNACCRL-FG-6                 PIC X.
               05  QSPA-ERNACCRL-START-CD-6           PIC X.
               05  QSPA-ERNACCRL-DFCD-6               PIC X.
               05  QSPA-ERN-DAYS-6                    PIC 99.
               05  QSPA-ERN-TERM-6                    PIC 999.
               05  QSPA-ERN-TYPE-6                    PIC X.
               05  QSPA-ERNFRMLA-7                    PIC 99.
               05  QSPA-ERNAMT-7                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-7                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-7                    PIC X.
               05  QSPA-ERNACCRL-FG-7                 PIC X.
               05  QSPA-ERNACCRL-START-CD-7           PIC X.
               05  QSPA-ERNACCRL-DFCD-7               PIC X.
               05  QSPA-ERN-DAYS-7                    PIC 99.
               05  QSPA-ERN-TERM-7                    PIC 999.
               05  QSPA-ERN-TYPE-7                    PIC X.
               05  QSPA-ERNFRMLA-8                    PIC 99.
               05  QSPA-ERNAMT-8                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-8                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-8                    PIC X.
               05  QSPA-ERNACCRL-FG-8                 PIC X.
               05  QSPA-ERNACCRL-START-CD-8           PIC X.
               05  QSPA-ERNACCRL-DFCD-8               PIC X.
               05  QSPA-ERN-DAYS-8                    PIC 99.
               05  QSPA-ERN-TERM-8                    PIC 999.
               05  QSPA-ERN-TYPE-8                    PIC X.
               05  QSPA-ERNFRMLA-9                    PIC 99.
               05  QSPA-ERNAMT-9                      PIC 9(7)V99.
               05  QSPA-ERNPERCT-9                    PIC 9(3)V99.
               05  QSPA-ERNPERCD-9                    PIC X.
               05  QSPA-ERNACCRL-FG-9                 PIC X.
               05  QSPA-ERNACCRL-START-CD-9           PIC X.
               05  QSPA-ERNACCRL-DFCD-9               PIC X.
               05  QSPA-ERN-DAYS-9                    PIC 99.
               05  QSPA-ERN-TERM-9                    PIC 999.
               05  QSPA-ERN-TYPE-9                    PIC X.
               05  QSPA-ERNFRMLA-10                   PIC 99.
               05  QSPA-ERNAMT-10                     PIC 9(7)V99.
               05  QSPA-ERNPERCT-10                   PIC 9(3)V99.
               05  QSPA-ERNPERCD-10                   PIC X.
               05  QSPA-ERNACCRL-FG-10                PIC X.
               05  QSPA-ERNACCRL-START-CD-10          PIC X.
               05  QSPA-ERNACCRL-DFCD-10              PIC X.
               05  QSPA-ERN-DAYS-10                   PIC 99.
               05  QSPA-ERN-TERM-10                   PIC 999.
               05  QSPA-ERN-TYPE-10                   PIC X.
               05  QSPA-ERNACCEL-CD                   PIC X.
               05  QSPA-ERNJD-CD                      PIC X.
               05  QSPA-MIDSTRERNCD                   PIC X.
               05  QSPA-EARN-ORDER-1                  PIC 99.
               05  QSPA-EARN-ORDER-2                  PIC 99.
               05  QSPA-EARN-ORDER-3                  PIC 99.
               05  QSPA-EARN-ORDER-4                  PIC 99.
               05  QSPA-EARN-ORDER-5                  PIC 99.
               05  QSPA-EARN-ORDER-6                  PIC 99.
               05  QSPA-EARN-ORDER-7                  PIC 99.
               05  QSPA-EARN-ORDER-8                  PIC 99.
               05  QSPA-EARN-ORDER-9                  PIC 99.
               05  QSPA-EARN-ORDER-10                 PIC 99.
               05  QSPA-ERNDELQFRMLA                  PIC X.
               05  QSPA-ERNDELQ-START                 PIC 999.
               05  QSPA-ERNDELQ-STOP                  PIC 999.
               05  QSPA-1098-INC-LC                   PIC X.
               05  QSPA-MAX-IB-ACR-DAYS               PIC 999.
               05  QSPA-LCGRACE                       PIC 9(2).
               05  QSPA-LCGRACECD                     PIC X.
               05  QSPA-LCTYPE                        PIC X(2).
               05  QSPA-LCRATE                        PIC 9(4)V9(4).
               05  QSPA-LCFRMLA                       PIC X(2).
               05  QSPA-LCMINCHG                      PIC 99V99.
               05  QSPA-LCMAXAMT                      PIC 9(4)V99.
               05  QSPA-LCDELFAC                      PIC 9(3).
               05  QSPA-LCYRTYPE                      PIC 9(4).
               05  QSPA-LC-CODE                       PIC 99.
               05  QSPA-LCUNITPER-CD                  PIC X.
               05  QSPA-DEFFRMLA                      PIC 99.
               05  QSPA-DEFEXCEPT                     PIC X.
               05  QSPA-DEFWORKER                     PIC 99V9999.
               05  QSPA-DEFPERCD                      PIC 99.
               05  QSPA-DEFBASE                       PIC 99.
               05  QSPA-DEFPOLCD                      PIC X.
               05  QSPA-DEFPOLMX-1                    PIC 99.
               05  QSPA-DEFPOLMX-2                    PIC 99.
               05  QSPA-DEFPOLMX-3                    PIC 99.
               05  QSPA-DEFMIN                        PIC 99V99.
               05  QSPA-DEFMAX                        PIC 9999V99.
               05  QSPA-DEFUNITPER-CD                 PIC X.
               05  QSPA-PRFORM-1                      PIC 9(4).
               05  QSPA-PRFLAG-1                      PIC X.
               05  QSPA-PRFORM-2                      PIC 9(4).
               05  QSPA-PRFLAG-2                      PIC X.
               05  QSPA-PRFORM-3                      PIC 9(4).
               05  QSPA-PRFLAG-3                      PIC X.
               05  QSPA-PRFORM-4                      PIC 9(4).
               05  QSPA-PRFLAG-4                      PIC X.
               05  QSPA-PRFORM-5                      PIC 9(4).
               05  QSPA-PRFLAG-5                      PIC X.
               05  QSPA-PRFORM-6                      PIC 9(4).
               05  QSPA-PRFLAG-6                      PIC X.
               05  QSPA-PRFORM-7                      PIC 9(4).
               05  QSPA-PRFLAG-7                      PIC X.
               05  QSPA-PRFORM-8                      PIC 9(4).
               05  QSPA-PRFLAG-8                      PIC X.
               05  QSPA-PRFORM-9                      PIC 9(4).
               05  QSPA-PRFLAG-9                      PIC X.
               05  QSPA-PRFORM-10                     PIC 9(4).
               05  QSPA-PRFLAG-10                     PIC X.
               05  QSPA-PRFORM-11                     PIC 9(4).
               05  QSPA-PRFLAG-11                     PIC X.
               05  QSPA-PRFORM-12                     PIC 9(4).
               05  QSPA-PRFLAG-12                     PIC X.
               05  QSPA-PRFORM-13                     PIC 9(4).
               05  QSPA-PRFLAG-13                     PIC X.
               05  QSPA-PRFORM-14                     PIC 9(4).
               05  QSPA-PRFLAG-14                     PIC X.
               05  QSPA-PRFORM-15                     PIC 9(4).
               05  QSPA-PRFLAG-15                     PIC X.
               05  QSPA-PRFORM-16                     PIC 9(4).
               05  QSPA-PRFLAG-16                     PIC X.
               05  QSPA-PRFORM-17                     PIC 9(4).
               05  QSPA-PRFLAG-17                     PIC X.
               05  QSPA-PRFORM-18                     PIC 9(4).
               05  QSPA-PRFLAG-18                     PIC X.
               05  QSPA-PRFORM-19                     PIC 9(4).
               05  QSPA-PRFLAG-19                     PIC X.
               05  QSPA-PRFORM-20                     PIC 9(4).
               05  QSPA-PRFLAG-20                     PIC X.
               05  QSPA-IMED-REC                      PIC X.
               05  QSPA-SCFRMLA                       PIC 99.
               05  QSPA-SCRATE                        PIC 99V99.
               05  QSPA-SCMIN                         PIC 9(4)V99.
               05  QSPA-SCMAX                         PIC 9(6)V99.
               05  QSPA-MFFRMLA                       PIC 99.
               05  QSPA-MFRATE                        PIC 99V99.
               05  QSPA-MFMIN                         PIC 9(4)V99.
               05  QSPA-MFMAX                         PIC 9(5)V99.
               05  QSPA-INTMETHOD                     PIC X.
               05  QSPA-YEARTYPE                      PIC 9(4).
               05  QSPA-PYEXFRMLA                     PIC 99.
               05  QSPA-PYEXSPCODE                    PIC 99.
               05  QSPA-PYEXYEARTP                    PIC 9(4).
               05  QSPA-PYEXFMDATE                    PIC X.
               05  QSPA-PYEXBASECD                    PIC X.
               05  QSPA-PYEXBASE                      PIC 9(4).
               05  QSPA-PYEXDAYS                      PIC 9(4).
               05  QSPA-CAL-SPFRMLA                   PIC 99.
               05  QSPA-CAL-RATETYPE-1                PIC X.
               05  QSPA-CAL-BREAKTYPE-1               PIC X.
               05  QSPA-CAL-CHGABLE-1                 PIC X.
               05  QSPA-CAL-NORATES-1                 PIC S9.
               05  QSPA-CAL-TBFRMLA-1                 PIC 99.
               05  QSPA-CAL-RATE-1-1                  PIC 999V999.
               05  QSPA-CAL-BREAK-1-1                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-1-2                  PIC 999V999.
               05  QSPA-CAL-BREAK-1-2                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-1-3                  PIC 999V999.
               05  QSPA-CAL-BREAK-1-3                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-1-4                  PIC 999V999.
               05  QSPA-CAL-BREAK-1-4                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-1-5                  PIC 999V999.
               05  QSPA-CAL-BREAK-1-5                 PIC 9(6)V99.
               05  QSPA-CAL-RATETYPE-2                PIC X.
               05  QSPA-CAL-BREAKTYPE-2               PIC X.
               05  QSPA-CAL-CHGABLE-2                 PIC X.
               05  QSPA-CAL-NORATES-2                 PIC S9.
               05  QSPA-CAL-TBFRMLA-2                 PIC 99.
               05  QSPA-CAL-RATE-2-1                  PIC 999V999.
               05  QSPA-CAL-BREAK-2-1                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-2-2                  PIC 999V999.
               05  QSPA-CAL-BREAK-2-2                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-2-3                  PIC 999V999.
               05  QSPA-CAL-BREAK-2-3                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-2-4                  PIC 999V999.
               05  QSPA-CAL-BREAK-2-4                 PIC 9(6)V99.
               05  QSPA-CAL-RATE-2-5                  PIC 999V999.
               05  QSPA-CAL-BREAK-2-5                 PIC 9(6)V99.
               05  QSPA-MINSF-FRMLA                   PIC 99.
               05  QSPA-MINSF-CHG                     PIC 9(6)V99.
               05  QSPA-MAXAPR-FRMLA                  PIC 99.
               05  QSPA-EDT-NOEDITS-1                 PIC S9.
               05  QSPA-EDT-TYPE-1-1                  PIC X.
               05  QSPA-EDT-HL-1-1                    PIC X.
               05  QSPA-EDT-COLL-1-1                  PIC XX.
               05  QSPA-EDT-CD-1-1                    PIC X.
               05  QSPA-EDT-RATE-1-1                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-1-1              PIC X.
               05  QSPA-EDT-AMT-1-1                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-1-1                PIC X.
               05  QSPA-EDT-TERM-1-1                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-1-2                  PIC X.
               05  QSPA-EDT-HL-1-2                    PIC X.
               05  QSPA-EDT-COLL-1-2                  PIC XX.
               05  QSPA-EDT-CD-1-2                    PIC X.
               05  QSPA-EDT-RATE-1-2                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-1-2              PIC X.
               05  QSPA-EDT-AMT-1-2                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-1-2                PIC X.
               05  QSPA-EDT-TERM-1-2                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-1-3                  PIC X.
               05  QSPA-EDT-HL-1-3                    PIC X.
               05  QSPA-EDT-COLL-1-3                  PIC XX.
               05  QSPA-EDT-CD-1-3                    PIC X.
               05  QSPA-EDT-RATE-1-3                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-1-3              PIC X.
               05  QSPA-EDT-AMT-1-3                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-1-3                PIC X.
               05  QSPA-EDT-TERM-1-3                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-1-4                  PIC X.
               05  QSPA-EDT-HL-1-4                    PIC X.
               05  QSPA-EDT-COLL-1-4                  PIC XX.
               05  QSPA-EDT-CD-1-4                    PIC X.
               05  QSPA-EDT-RATE-1-4                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-1-4              PIC X.
               05  QSPA-EDT-AMT-1-4                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-1-4                PIC X.
               05  QSPA-EDT-TERM-1-4                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-1-5                  PIC X.
               05  QSPA-EDT-HL-1-5                    PIC X.
               05  QSPA-EDT-COLL-1-5                  PIC XX.
               05  QSPA-EDT-CD-1-5                    PIC X.
               05  QSPA-EDT-RATE-1-5                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-1-5              PIC X.
               05  QSPA-EDT-AMT-1-5                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-1-5                PIC X.
               05  QSPA-EDT-TERM-1-5                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-1-6                  PIC X.
               05  QSPA-EDT-HL-1-6                    PIC X.
               05  QSPA-EDT-COLL-1-6                  PIC XX.
               05  QSPA-EDT-CD-1-6                    PIC X.
               05  QSPA-EDT-RATE-1-6                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-1-6              PIC X.
               05  QSPA-EDT-AMT-1-6                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-1-6                PIC X.
               05  QSPA-EDT-TERM-1-6                  PIC 9(3)V9.
               05  QSPA-EDT-NOEDITS-2                 PIC S9.
               05  QSPA-EDT-TYPE-2-1                  PIC X.
               05  QSPA-EDT-HL-2-1                    PIC X.
               05  QSPA-EDT-COLL-2-1                  PIC XX.
               05  QSPA-EDT-CD-2-1                    PIC X.
               05  QSPA-EDT-RATE-2-1                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-2-1              PIC X.
               05  QSPA-EDT-AMT-2-1                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-2-1                PIC X.
               05  QSPA-EDT-TERM-2-1                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-2-2                  PIC X.
               05  QSPA-EDT-HL-2-2                    PIC X.
               05  QSPA-EDT-COLL-2-2                  PIC XX.
               05  QSPA-EDT-CD-2-2                    PIC X.
               05  QSPA-EDT-RATE-2-2                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-2-2              PIC X.
               05  QSPA-EDT-AMT-2-2                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-2-2                PIC X.
               05  QSPA-EDT-TERM-2-2                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-2-3                  PIC X.
               05  QSPA-EDT-HL-2-3                    PIC X.
               05  QSPA-EDT-COLL-2-3                  PIC XX.
               05  QSPA-EDT-CD-2-3                    PIC X.
               05  QSPA-EDT-RATE-2-3                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-2-3              PIC X.
               05  QSPA-EDT-AMT-2-3                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-2-3                PIC X.
               05  QSPA-EDT-TERM-2-3                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-2-4                  PIC X.
               05  QSPA-EDT-HL-2-4                    PIC X.
               05  QSPA-EDT-COLL-2-4                  PIC XX.
               05  QSPA-EDT-CD-2-4                    PIC X.
               05  QSPA-EDT-RATE-2-4                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-2-4              PIC X.
               05  QSPA-EDT-AMT-2-4                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-2-4                PIC X.
               05  QSPA-EDT-TERM-2-4                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-2-5                  PIC X.
               05  QSPA-EDT-HL-2-5                    PIC X.
               05  QSPA-EDT-COLL-2-5                  PIC XX.
               05  QSPA-EDT-CD-2-5                    PIC X.
               05  QSPA-EDT-RATE-2-5                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-2-5              PIC X.
               05  QSPA-EDT-AMT-2-5                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-2-5                PIC X.
               05  QSPA-EDT-TERM-2-5                  PIC 9(3)V9.
               05  QSPA-EDT-TYPE-2-6                  PIC X.
               05  QSPA-EDT-HL-2-6                    PIC X.
               05  QSPA-EDT-COLL-2-6                  PIC XX.
               05  QSPA-EDT-CD-2-6                    PIC X.
               05  QSPA-EDT-RATE-2-6                  PIC 99V99.
               05  QSPA-EDT-RATETYPE-2-6              PIC X.
               05  QSPA-EDT-AMT-2-6                   PIC 9(7)V99.
               05  QSPA-EDT-AMTYPE-2-6                PIC X.
               05  QSPA-EDT-TERM-2-6                  PIC 9(3)V9.
           03  QSPB-REC.
               05  QSPB-ORGST                         PIC XX.
               05  QSPB-SPRCLASS                      PIC 999.
               05  QSPB-SUBCLASS                      PIC 99.
               05  QSPB-LAWCODE                       PIC 99.
               05  QSPB-INSCOM-1                      PIC 99.
               05  QSPB-INSRATECD-1                   PIC 999.
               05  QSPB-INSJFAC-1                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-1                   PIC 99V99.
               05  QSPB-INSCHGABL-1                   PIC X(2).
               05  QSPB-INSTERM-1-1                   PIC 9(3).
               05  QSPB-INSRATE-1-1                   PIC 99V9999.
               05  QSPB-INSTERM-1-2                   PIC 9(3).
               05  QSPB-INSRATE-1-2                   PIC 99V9999.
               05  QSPB-INSTERM-1-3                   PIC 9(3).
               05  QSPB-INSRATE-1-3                   PIC 99V9999.
               05  QSPB-INSTERM-1-4                   PIC 9(3).
               05  QSPB-INSRATE-1-4                   PIC 99V9999.
               05  QSPB-INSTERM-1-5                   PIC 9(3).
               05  QSPB-INSRATE-1-5                   PIC 99V9999.
               05  QSPB-INSTERM-1-6                   PIC 9(3).
               05  QSPB-INSRATE-1-6                   PIC 99V9999.
               05  QSPB-INSTERM-1-7                   PIC 9(3).
               05  QSPB-INSRATE-1-7                   PIC 99V9999.
               05  QSPB-INSTERM-1-8                   PIC 9(3).
               05  QSPB-INSRATE-1-8                   PIC 99V9999.
               05  QSPB-INSTERM-1-9                   PIC 9(3).
               05  QSPB-INSRATE-1-9                   PIC 99V9999.
               05  QSPB-INSTERM-1-10                  PIC 9(3).
               05  QSPB-INSRATE-1-10                  PIC 99V9999.
               05  QSPB-INSTERM-1-11                  PIC 9(3).
               05  QSPB-INSRATE-1-11                  PIC 99V9999.
               05  QSPB-INSTERM-1-12                  PIC 9(3).
               05  QSPB-INSRATE-1-12                  PIC 99V9999.
               05  QSPB-INSTERM-1-13                  PIC 9(3).
               05  QSPB-INSRATE-1-13                  PIC 99V9999.
               05  QSPB-INSTERM-1-14                  PIC 9(3).
               05  QSPB-INSRATE-1-14                  PIC 99V9999.
               05  QSPB-INSTERM-1-15                  PIC 9(3).
               05  QSPB-INSRATE-1-15                  PIC 99V9999.
               05  QSPB-INSTERM-1-16                  PIC 9(3).
               05  QSPB-INSRATE-1-16                  PIC 99V9999.
               05  QSPB-INSTERM-1-17                  PIC 9(3).
               05  QSPB-INSRATE-1-17                  PIC 99V9999.
               05  QSPB-INSTERM-1-18                  PIC 9(3).
               05  QSPB-INSRATE-1-18                  PIC 99V9999.
               05  QSPB-INSTERM-1-19                  PIC 9(3).
               05  QSPB-INSRATE-1-19                  PIC 99V9999.
               05  QSPB-INSTERM-1-20                  PIC 9(3).
               05  QSPB-INSRATE-1-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-1                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-1                PIC 9(6).
               05  QSPB-INSMAXCHGABL-1                PIC 9(7).
               05  QSPB-INSMAXBENIF-1                 PIC 9(7).
               05  QSPB-INSMAXTERM-1                  PIC 9(3).
               05  QSPB-INSCHGBEN-1                   PIC X.
               05  QSPB-INSEXCEPT-1                   PIC 99.
               05  QSPB-INSNOVER-1                    PIC 99.
               05  QSPB-INSMINAGE-1-1                 PIC 99.
               05  QSPB-INSMAXAGE-1-1                 PIC 99.
               05  QSPB-INSMAXCOV-1-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-1-1                 PIC 9(3).
               05  QSPB-INSMINAGE-1-2                 PIC 99.
               05  QSPB-INSMAXAGE-1-2                 PIC 99.
               05  QSPB-INSMAXCOV-1-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-1-2                 PIC 9(3).
               05  QSPB-INSMINAGE-1-3                 PIC 99.
               05  QSPB-INSMAXAGE-1-3                 PIC 99.
               05  QSPB-INSMAXCOV-1-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-1-3                 PIC 9(3).
               05  QSPB-INSMINAGE-1-4                 PIC 99.
               05  QSPB-INSMAXAGE-1-4                 PIC 99.
               05  QSPB-INSMAXCOV-1-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-1-4                 PIC 9(3).
               05  QSPB-INSMINAGE-1-5                 PIC 99.
               05  QSPB-INSMAXAGE-1-5                 PIC 99.
               05  QSPB-INSMAXCOV-1-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-1-5                 PIC 9(3).
               05  QSPB-INSFEECD-1                    PIC XX.
               05  QSPB-INSFEE-FRMLA-1                PIC X.
               05  QSPB-INSCHGABL-FG-1                PIC X.
               05  QSPB-INSREJECT-FG-1                PIC X.
               05  QSPB-INSFINCHG-1                   PIC X.
               05  QSPB-INSCOM-2                      PIC 99.
               05  QSPB-INSRATECD-2                   PIC 999.
               05  QSPB-INSJFAC-2                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-2                   PIC 99V99.
               05  QSPB-INSCHGABL-2                   PIC X(2).
               05  QSPB-INSTERM-2-1                   PIC 9(3).
               05  QSPB-INSRATE-2-1                   PIC 99V9999.
               05  QSPB-INSTERM-2-2                   PIC 9(3).
               05  QSPB-INSRATE-2-2                   PIC 99V9999.
               05  QSPB-INSTERM-2-3                   PIC 9(3).
               05  QSPB-INSRATE-2-3                   PIC 99V9999.
               05  QSPB-INSTERM-2-4                   PIC 9(3).
               05  QSPB-INSRATE-2-4                   PIC 99V9999.
               05  QSPB-INSTERM-2-5                   PIC 9(3).
               05  QSPB-INSRATE-2-5                   PIC 99V9999.
               05  QSPB-INSTERM-2-6                   PIC 9(3).
               05  QSPB-INSRATE-2-6                   PIC 99V9999.
               05  QSPB-INSTERM-2-7                   PIC 9(3).
               05  QSPB-INSRATE-2-7                   PIC 99V9999.
               05  QSPB-INSTERM-2-8                   PIC 9(3).
               05  QSPB-INSRATE-2-8                   PIC 99V9999.
               05  QSPB-INSTERM-2-9                   PIC 9(3).
               05  QSPB-INSRATE-2-9                   PIC 99V9999.
               05  QSPB-INSTERM-2-10                  PIC 9(3).
               05  QSPB-INSRATE-2-10                  PIC 99V9999.
               05  QSPB-INSTERM-2-11                  PIC 9(3).
               05  QSPB-INSRATE-2-11                  PIC 99V9999.
               05  QSPB-INSTERM-2-12                  PIC 9(3).
               05  QSPB-INSRATE-2-12                  PIC 99V9999.
               05  QSPB-INSTERM-2-13                  PIC 9(3).
               05  QSPB-INSRATE-2-13                  PIC 99V9999.
               05  QSPB-INSTERM-2-14                  PIC 9(3).
               05  QSPB-INSRATE-2-14                  PIC 99V9999.
               05  QSPB-INSTERM-2-15                  PIC 9(3).
               05  QSPB-INSRATE-2-15                  PIC 99V9999.
               05  QSPB-INSTERM-2-16                  PIC 9(3).
               05  QSPB-INSRATE-2-16                  PIC 99V9999.
               05  QSPB-INSTERM-2-17                  PIC 9(3).
               05  QSPB-INSRATE-2-17                  PIC 99V9999.
               05  QSPB-INSTERM-2-18                  PIC 9(3).
               05  QSPB-INSRATE-2-18                  PIC 99V9999.
               05  QSPB-INSTERM-2-19                  PIC 9(3).
               05  QSPB-INSRATE-2-19                  PIC 99V9999.
               05  QSPB-INSTERM-2-20                  PIC 9(3).
               05  QSPB-INSRATE-2-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-2                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-2                PIC 9(6).
               05  QSPB-INSMAXCHGABL-2                PIC 9(7).
               05  QSPB-INSMAXBENIF-2                 PIC 9(7).
               05  QSPB-INSMAXTERM-2                  PIC 9(3).
               05  QSPB-INSCHGBEN-2                   PIC X.
               05  QSPB-INSEXCEPT-2                   PIC 99.
               05  QSPB-INSNOVER-2                    PIC 99.
               05  QSPB-INSMINAGE-2-1                 PIC 99.
               05  QSPB-INSMAXAGE-2-1                 PIC 99.
               05  QSPB-INSMAXCOV-2-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-2-1                 PIC 9(3).
               05  QSPB-INSMINAGE-2-2                 PIC 99.
               05  QSPB-INSMAXAGE-2-2                 PIC 99.
               05  QSPB-INSMAXCOV-2-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-2-2                 PIC 9(3).
               05  QSPB-INSMINAGE-2-3                 PIC 99.
               05  QSPB-INSMAXAGE-2-3                 PIC 99.
               05  QSPB-INSMAXCOV-2-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-2-3                 PIC 9(3).
               05  QSPB-INSMINAGE-2-4                 PIC 99.
               05  QSPB-INSMAXAGE-2-4                 PIC 99.
               05  QSPB-INSMAXCOV-2-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-2-4                 PIC 9(3).
               05  QSPB-INSMINAGE-2-5                 PIC 99.
               05  QSPB-INSMAXAGE-2-5                 PIC 99.
               05  QSPB-INSMAXCOV-2-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-2-5                 PIC 9(3).
               05  QSPB-INSFEECD-2                    PIC XX.
               05  QSPB-INSFEE-FRMLA-2                PIC X.
               05  QSPB-INSCHGABL-FG-2                PIC X.
               05  QSPB-INSREJECT-FG-2                PIC X.
               05  QSPB-INSFINCHG-2                   PIC X.
               05  QSPB-INSCOM-3                      PIC 99.
               05  QSPB-INSRATECD-3                   PIC 999.
               05  QSPB-INSJFAC-3                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-3                   PIC 99V99.
               05  QSPB-INSCHGABL-3                   PIC X(2).
               05  QSPB-INSTERM-3-1                   PIC 9(3).
               05  QSPB-INSRATE-3-1                   PIC 99V9999.
               05  QSPB-INSTERM-3-2                   PIC 9(3).
               05  QSPB-INSRATE-3-2                   PIC 99V9999.
               05  QSPB-INSTERM-3-3                   PIC 9(3).
               05  QSPB-INSRATE-3-3                   PIC 99V9999.
               05  QSPB-INSTERM-3-4                   PIC 9(3).
               05  QSPB-INSRATE-3-4                   PIC 99V9999.
               05  QSPB-INSTERM-3-5                   PIC 9(3).
               05  QSPB-INSRATE-3-5                   PIC 99V9999.
               05  QSPB-INSTERM-3-6                   PIC 9(3).
               05  QSPB-INSRATE-3-6                   PIC 99V9999.
               05  QSPB-INSTERM-3-7                   PIC 9(3).
               05  QSPB-INSRATE-3-7                   PIC 99V9999.
               05  QSPB-INSTERM-3-8                   PIC 9(3).
               05  QSPB-INSRATE-3-8                   PIC 99V9999.
               05  QSPB-INSTERM-3-9                   PIC 9(3).
               05  QSPB-INSRATE-3-9                   PIC 99V9999.
               05  QSPB-INSTERM-3-10                  PIC 9(3).
               05  QSPB-INSRATE-3-10                  PIC 99V9999.
               05  QSPB-INSTERM-3-11                  PIC 9(3).
               05  QSPB-INSRATE-3-11                  PIC 99V9999.
               05  QSPB-INSTERM-3-12                  PIC 9(3).
               05  QSPB-INSRATE-3-12                  PIC 99V9999.
               05  QSPB-INSTERM-3-13                  PIC 9(3).
               05  QSPB-INSRATE-3-13                  PIC 99V9999.
               05  QSPB-INSTERM-3-14                  PIC 9(3).
               05  QSPB-INSRATE-3-14                  PIC 99V9999.
               05  QSPB-INSTERM-3-15                  PIC 9(3).
               05  QSPB-INSRATE-3-15                  PIC 99V9999.
               05  QSPB-INSTERM-3-16                  PIC 9(3).
               05  QSPB-INSRATE-3-16                  PIC 99V9999.
               05  QSPB-INSTERM-3-17                  PIC 9(3).
               05  QSPB-INSRATE-3-17                  PIC 99V9999.
               05  QSPB-INSTERM-3-18                  PIC 9(3).
               05  QSPB-INSRATE-3-18                  PIC 99V9999.
               05  QSPB-INSTERM-3-19                  PIC 9(3).
               05  QSPB-INSRATE-3-19                  PIC 99V9999.
               05  QSPB-INSTERM-3-20                  PIC 9(3).
               05  QSPB-INSRATE-3-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-3                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-3                PIC 9(6).
               05  QSPB-INSMAXCHGABL-3                PIC 9(7).
               05  QSPB-INSMAXBENIF-3                 PIC 9(7).
               05  QSPB-INSMAXTERM-3                  PIC 9(3).
               05  QSPB-INSCHGBEN-3                   PIC X.
               05  QSPB-INSEXCEPT-3                   PIC 99.
               05  QSPB-INSNOVER-3                    PIC 99.
               05  QSPB-INSMINAGE-3-1                 PIC 99.
               05  QSPB-INSMAXAGE-3-1                 PIC 99.
               05  QSPB-INSMAXCOV-3-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-3-1                 PIC 9(3).
               05  QSPB-INSMINAGE-3-2                 PIC 99.
               05  QSPB-INSMAXAGE-3-2                 PIC 99.
               05  QSPB-INSMAXCOV-3-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-3-2                 PIC 9(3).
               05  QSPB-INSMINAGE-3-3                 PIC 99.
               05  QSPB-INSMAXAGE-3-3                 PIC 99.
               05  QSPB-INSMAXCOV-3-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-3-3                 PIC 9(3).
               05  QSPB-INSMINAGE-3-4                 PIC 99.
               05  QSPB-INSMAXAGE-3-4                 PIC 99.
               05  QSPB-INSMAXCOV-3-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-3-4                 PIC 9(3).
               05  QSPB-INSMINAGE-3-5                 PIC 99.
               05  QSPB-INSMAXAGE-3-5                 PIC 99.
               05  QSPB-INSMAXCOV-3-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-3-5                 PIC 9(3).
               05  QSPB-INSFEECD-3                    PIC XX.
               05  QSPB-INSFEE-FRMLA-3                PIC X.
               05  QSPB-INSCHGABL-FG-3                PIC X.
               05  QSPB-INSREJECT-FG-3                PIC X.
               05  QSPB-INSFINCHG-3                   PIC X.
               05  QSPB-INSCOM-4                      PIC 99.
               05  QSPB-INSRATECD-4                   PIC 999.
               05  QSPB-INSJFAC-4                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-4                   PIC 99V99.
               05  QSPB-INSCHGABL-4                   PIC X(2).
               05  QSPB-INSTERM-4-1                   PIC 9(3).
               05  QSPB-INSRATE-4-1                   PIC 99V9999.
               05  QSPB-INSTERM-4-2                   PIC 9(3).
               05  QSPB-INSRATE-4-2                   PIC 99V9999.
               05  QSPB-INSTERM-4-3                   PIC 9(3).
               05  QSPB-INSRATE-4-3                   PIC 99V9999.
               05  QSPB-INSTERM-4-4                   PIC 9(3).
               05  QSPB-INSRATE-4-4                   PIC 99V9999.
               05  QSPB-INSTERM-4-5                   PIC 9(3).
               05  QSPB-INSRATE-4-5                   PIC 99V9999.
               05  QSPB-INSTERM-4-6                   PIC 9(3).
               05  QSPB-INSRATE-4-6                   PIC 99V9999.
               05  QSPB-INSTERM-4-7                   PIC 9(3).
               05  QSPB-INSRATE-4-7                   PIC 99V9999.
               05  QSPB-INSTERM-4-8                   PIC 9(3).
               05  QSPB-INSRATE-4-8                   PIC 99V9999.
               05  QSPB-INSTERM-4-9                   PIC 9(3).
               05  QSPB-INSRATE-4-9                   PIC 99V9999.
               05  QSPB-INSTERM-4-10                  PIC 9(3).
               05  QSPB-INSRATE-4-10                  PIC 99V9999.
               05  QSPB-INSTERM-4-11                  PIC 9(3).
               05  QSPB-INSRATE-4-11                  PIC 99V9999.
               05  QSPB-INSTERM-4-12                  PIC 9(3).
               05  QSPB-INSRATE-4-12                  PIC 99V9999.
               05  QSPB-INSTERM-4-13                  PIC 9(3).
               05  QSPB-INSRATE-4-13                  PIC 99V9999.
               05  QSPB-INSTERM-4-14                  PIC 9(3).
               05  QSPB-INSRATE-4-14                  PIC 99V9999.
               05  QSPB-INSTERM-4-15                  PIC 9(3).
               05  QSPB-INSRATE-4-15                  PIC 99V9999.
               05  QSPB-INSTERM-4-16                  PIC 9(3).
               05  QSPB-INSRATE-4-16                  PIC 99V9999.
               05  QSPB-INSTERM-4-17                  PIC 9(3).
               05  QSPB-INSRATE-4-17                  PIC 99V9999.
               05  QSPB-INSTERM-4-18                  PIC 9(3).
               05  QSPB-INSRATE-4-18                  PIC 99V9999.
               05  QSPB-INSTERM-4-19                  PIC 9(3).
               05  QSPB-INSRATE-4-19                  PIC 99V9999.
               05  QSPB-INSTERM-4-20                  PIC 9(3).
               05  QSPB-INSRATE-4-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-4                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-4                PIC 9(6).
               05  QSPB-INSMAXCHGABL-4                PIC 9(7).
               05  QSPB-INSMAXBENIF-4                 PIC 9(7).
               05  QSPB-INSMAXTERM-4                  PIC 9(3).
               05  QSPB-INSCHGBEN-4                   PIC X.
               05  QSPB-INSEXCEPT-4                   PIC 99.
               05  QSPB-INSNOVER-4                    PIC 99.
               05  QSPB-INSMINAGE-4-1                 PIC 99.
               05  QSPB-INSMAXAGE-4-1                 PIC 99.
               05  QSPB-INSMAXCOV-4-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-4-1                 PIC 9(3).
               05  QSPB-INSMINAGE-4-2                 PIC 99.
               05  QSPB-INSMAXAGE-4-2                 PIC 99.
               05  QSPB-INSMAXCOV-4-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-4-2                 PIC 9(3).
               05  QSPB-INSMINAGE-4-3                 PIC 99.
               05  QSPB-INSMAXAGE-4-3                 PIC 99.
               05  QSPB-INSMAXCOV-4-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-4-3                 PIC 9(3).
               05  QSPB-INSMINAGE-4-4                 PIC 99.
               05  QSPB-INSMAXAGE-4-4                 PIC 99.
               05  QSPB-INSMAXCOV-4-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-4-4                 PIC 9(3).
               05  QSPB-INSMINAGE-4-5                 PIC 99.
               05  QSPB-INSMAXAGE-4-5                 PIC 99.
               05  QSPB-INSMAXCOV-4-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-4-5                 PIC 9(3).
               05  QSPB-INSFEECD-4                    PIC XX.
               05  QSPB-INSFEE-FRMLA-4                PIC X.
               05  QSPB-INSCHGABL-FG-4                PIC X.
               05  QSPB-INSREJECT-FG-4                PIC X.
               05  QSPB-INSFINCHG-4                   PIC X.
               05  QSPB-INSCOM-5                      PIC 99.
               05  QSPB-INSRATECD-5                   PIC 999.
               05  QSPB-INSJFAC-5                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-5                   PIC 99V99.
               05  QSPB-INSCHGABL-5                   PIC X(2).
               05  QSPB-INSTERM-5-1                   PIC 9(3).
               05  QSPB-INSRATE-5-1                   PIC 99V9999.
               05  QSPB-INSTERM-5-2                   PIC 9(3).
               05  QSPB-INSRATE-5-2                   PIC 99V9999.
               05  QSPB-INSTERM-5-3                   PIC 9(3).
               05  QSPB-INSRATE-5-3                   PIC 99V9999.
               05  QSPB-INSTERM-5-4                   PIC 9(3).
               05  QSPB-INSRATE-5-4                   PIC 99V9999.
               05  QSPB-INSTERM-5-5                   PIC 9(3).
               05  QSPB-INSRATE-5-5                   PIC 99V9999.
               05  QSPB-INSTERM-5-6                   PIC 9(3).
               05  QSPB-INSRATE-5-6                   PIC 99V9999.
               05  QSPB-INSTERM-5-7                   PIC 9(3).
               05  QSPB-INSRATE-5-7                   PIC 99V9999.
               05  QSPB-INSTERM-5-8                   PIC 9(3).
               05  QSPB-INSRATE-5-8                   PIC 99V9999.
               05  QSPB-INSTERM-5-9                   PIC 9(3).
               05  QSPB-INSRATE-5-9                   PIC 99V9999.
               05  QSPB-INSTERM-5-10                  PIC 9(3).
               05  QSPB-INSRATE-5-10                  PIC 99V9999.
               05  QSPB-INSTERM-5-11                  PIC 9(3).
               05  QSPB-INSRATE-5-11                  PIC 99V9999.
               05  QSPB-INSTERM-5-12                  PIC 9(3).
               05  QSPB-INSRATE-5-12                  PIC 99V9999.
               05  QSPB-INSTERM-5-13                  PIC 9(3).
               05  QSPB-INSRATE-5-13                  PIC 99V9999.
               05  QSPB-INSTERM-5-14                  PIC 9(3).
               05  QSPB-INSRATE-5-14                  PIC 99V9999.
               05  QSPB-INSTERM-5-15                  PIC 9(3).
               05  QSPB-INSRATE-5-15                  PIC 99V9999.
               05  QSPB-INSTERM-5-16                  PIC 9(3).
               05  QSPB-INSRATE-5-16                  PIC 99V9999.
               05  QSPB-INSTERM-5-17                  PIC 9(3).
               05  QSPB-INSRATE-5-17                  PIC 99V9999.
               05  QSPB-INSTERM-5-18                  PIC 9(3).
               05  QSPB-INSRATE-5-18                  PIC 99V9999.
               05  QSPB-INSTERM-5-19                  PIC 9(3).
               05  QSPB-INSRATE-5-19                  PIC 99V9999.
               05  QSPB-INSTERM-5-20                  PIC 9(3).
               05  QSPB-INSRATE-5-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-5                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-5                PIC 9(6).
               05  QSPB-INSMAXCHGABL-5                PIC 9(7).
               05  QSPB-INSMAXBENIF-5                 PIC 9(7).
               05  QSPB-INSMAXTERM-5                  PIC 9(3).
               05  QSPB-INSCHGBEN-5                   PIC X.
               05  QSPB-INSEXCEPT-5                   PIC 99.
               05  QSPB-INSNOVER-5                    PIC 99.
               05  QSPB-INSMINAGE-5-1                 PIC 99.
               05  QSPB-INSMAXAGE-5-1                 PIC 99.
               05  QSPB-INSMAXCOV-5-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-5-1                 PIC 9(3).
               05  QSPB-INSMINAGE-5-2                 PIC 99.
               05  QSPB-INSMAXAGE-5-2                 PIC 99.
               05  QSPB-INSMAXCOV-5-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-5-2                 PIC 9(3).
               05  QSPB-INSMINAGE-5-3                 PIC 99.
               05  QSPB-INSMAXAGE-5-3                 PIC 99.
               05  QSPB-INSMAXCOV-5-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-5-3                 PIC 9(3).
               05  QSPB-INSMINAGE-5-4                 PIC 99.
               05  QSPB-INSMAXAGE-5-4                 PIC 99.
               05  QSPB-INSMAXCOV-5-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-5-4                 PIC 9(3).
               05  QSPB-INSMINAGE-5-5                 PIC 99.
               05  QSPB-INSMAXAGE-5-5                 PIC 99.
               05  QSPB-INSMAXCOV-5-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-5-5                 PIC 9(3).
               05  QSPB-INSFEECD-5                    PIC XX.
               05  QSPB-INSFEE-FRMLA-5                PIC X.
               05  QSPB-INSCHGABL-FG-5                PIC X.
               05  QSPB-INSREJECT-FG-5                PIC X.
               05  QSPB-INSFINCHG-5                   PIC X.
               05  QSPB-INSCOM-6                      PIC 99.
               05  QSPB-INSRATECD-6                   PIC 999.
               05  QSPB-INSJFAC-6                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-6                   PIC 99V99.
               05  QSPB-INSCHGABL-6                   PIC X(2).
               05  QSPB-INSTERM-6-1                   PIC 9(3).
               05  QSPB-INSRATE-6-1                   PIC 99V9999.
               05  QSPB-INSTERM-6-2                   PIC 9(3).
               05  QSPB-INSRATE-6-2                   PIC 99V9999.
               05  QSPB-INSTERM-6-3                   PIC 9(3).
               05  QSPB-INSRATE-6-3                   PIC 99V9999.
               05  QSPB-INSTERM-6-4                   PIC 9(3).
               05  QSPB-INSRATE-6-4                   PIC 99V9999.
               05  QSPB-INSTERM-6-5                   PIC 9(3).
               05  QSPB-INSRATE-6-5                   PIC 99V9999.
               05  QSPB-INSTERM-6-6                   PIC 9(3).
               05  QSPB-INSRATE-6-6                   PIC 99V9999.
               05  QSPB-INSTERM-6-7                   PIC 9(3).
               05  QSPB-INSRATE-6-7                   PIC 99V9999.
               05  QSPB-INSTERM-6-8                   PIC 9(3).
               05  QSPB-INSRATE-6-8                   PIC 99V9999.
               05  QSPB-INSTERM-6-9                   PIC 9(3).
               05  QSPB-INSRATE-6-9                   PIC 99V9999.
               05  QSPB-INSTERM-6-10                  PIC 9(3).
               05  QSPB-INSRATE-6-10                  PIC 99V9999.
               05  QSPB-INSTERM-6-11                  PIC 9(3).
               05  QSPB-INSRATE-6-11                  PIC 99V9999.
               05  QSPB-INSTERM-6-12                  PIC 9(3).
               05  QSPB-INSRATE-6-12                  PIC 99V9999.
               05  QSPB-INSTERM-6-13                  PIC 9(3).
               05  QSPB-INSRATE-6-13                  PIC 99V9999.
               05  QSPB-INSTERM-6-14                  PIC 9(3).
               05  QSPB-INSRATE-6-14                  PIC 99V9999.
               05  QSPB-INSTERM-6-15                  PIC 9(3).
               05  QSPB-INSRATE-6-15                  PIC 99V9999.
               05  QSPB-INSTERM-6-16                  PIC 9(3).
               05  QSPB-INSRATE-6-16                  PIC 99V9999.
               05  QSPB-INSTERM-6-17                  PIC 9(3).
               05  QSPB-INSRATE-6-17                  PIC 99V9999.
               05  QSPB-INSTERM-6-18                  PIC 9(3).
               05  QSPB-INSRATE-6-18                  PIC 99V9999.
               05  QSPB-INSTERM-6-19                  PIC 9(3).
               05  QSPB-INSRATE-6-19                  PIC 99V9999.
               05  QSPB-INSTERM-6-20                  PIC 9(3).
               05  QSPB-INSRATE-6-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-6                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-6                PIC 9(6).
               05  QSPB-INSMAXCHGABL-6                PIC 9(7).
               05  QSPB-INSMAXBENIF-6                 PIC 9(7).
               05  QSPB-INSMAXTERM-6                  PIC 9(3).
               05  QSPB-INSCHGBEN-6                   PIC X.
               05  QSPB-INSEXCEPT-6                   PIC 99.
               05  QSPB-INSNOVER-6                    PIC 99.
               05  QSPB-INSMINAGE-6-1                 PIC 99.
               05  QSPB-INSMAXAGE-6-1                 PIC 99.
               05  QSPB-INSMAXCOV-6-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-6-1                 PIC 9(3).
               05  QSPB-INSMINAGE-6-2                 PIC 99.
               05  QSPB-INSMAXAGE-6-2                 PIC 99.
               05  QSPB-INSMAXCOV-6-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-6-2                 PIC 9(3).
               05  QSPB-INSMINAGE-6-3                 PIC 99.
               05  QSPB-INSMAXAGE-6-3                 PIC 99.
               05  QSPB-INSMAXCOV-6-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-6-3                 PIC 9(3).
               05  QSPB-INSMINAGE-6-4                 PIC 99.
               05  QSPB-INSMAXAGE-6-4                 PIC 99.
               05  QSPB-INSMAXCOV-6-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-6-4                 PIC 9(3).
               05  QSPB-INSMINAGE-6-5                 PIC 99.
               05  QSPB-INSMAXAGE-6-5                 PIC 99.
               05  QSPB-INSMAXCOV-6-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-6-5                 PIC 9(3).
               05  QSPB-INSFEECD-6                    PIC XX.
               05  QSPB-INSFEE-FRMLA-6                PIC X.
               05  QSPB-INSCHGABL-FG-6                PIC X.
               05  QSPB-INSREJECT-FG-6                PIC X.
               05  QSPB-INSFINCHG-6                   PIC X.
               05  QSPB-INSCOM-7                      PIC 99.
               05  QSPB-INSRATECD-7                   PIC 999.
               05  QSPB-INSJFAC-7                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-7                   PIC 99V99.
               05  QSPB-INSCHGABL-7                   PIC X(2).
               05  QSPB-INSTERM-7-1                   PIC 9(3).
               05  QSPB-INSRATE-7-1                   PIC 99V9999.
               05  QSPB-INSTERM-7-2                   PIC 9(3).
               05  QSPB-INSRATE-7-2                   PIC 99V9999.
               05  QSPB-INSTERM-7-3                   PIC 9(3).
               05  QSPB-INSRATE-7-3                   PIC 99V9999.
               05  QSPB-INSTERM-7-4                   PIC 9(3).
               05  QSPB-INSRATE-7-4                   PIC 99V9999.
               05  QSPB-INSTERM-7-5                   PIC 9(3).
               05  QSPB-INSRATE-7-5                   PIC 99V9999.
               05  QSPB-INSTERM-7-6                   PIC 9(3).
               05  QSPB-INSRATE-7-6                   PIC 99V9999.
               05  QSPB-INSTERM-7-7                   PIC 9(3).
               05  QSPB-INSRATE-7-7                   PIC 99V9999.
               05  QSPB-INSTERM-7-8                   PIC 9(3).
               05  QSPB-INSRATE-7-8                   PIC 99V9999.
               05  QSPB-INSTERM-7-9                   PIC 9(3).
               05  QSPB-INSRATE-7-9                   PIC 99V9999.
               05  QSPB-INSTERM-7-10                  PIC 9(3).
               05  QSPB-INSRATE-7-10                  PIC 99V9999.
               05  QSPB-INSTERM-7-11                  PIC 9(3).
               05  QSPB-INSRATE-7-11                  PIC 99V9999.
               05  QSPB-INSTERM-7-12                  PIC 9(3).
               05  QSPB-INSRATE-7-12                  PIC 99V9999.
               05  QSPB-INSTERM-7-13                  PIC 9(3).
               05  QSPB-INSRATE-7-13                  PIC 99V9999.
               05  QSPB-INSTERM-7-14                  PIC 9(3).
               05  QSPB-INSRATE-7-14                  PIC 99V9999.
               05  QSPB-INSTERM-7-15                  PIC 9(3).
               05  QSPB-INSRATE-7-15                  PIC 99V9999.
               05  QSPB-INSTERM-7-16                  PIC 9(3).
               05  QSPB-INSRATE-7-16                  PIC 99V9999.
               05  QSPB-INSTERM-7-17                  PIC 9(3).
               05  QSPB-INSRATE-7-17                  PIC 99V9999.
               05  QSPB-INSTERM-7-18                  PIC 9(3).
               05  QSPB-INSRATE-7-18                  PIC 99V9999.
               05  QSPB-INSTERM-7-19                  PIC 9(3).
               05  QSPB-INSRATE-7-19                  PIC 99V9999.
               05  QSPB-INSTERM-7-20                  PIC 9(3).
               05  QSPB-INSRATE-7-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-7                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-7                PIC 9(6).
               05  QSPB-INSMAXCHGABL-7                PIC 9(7).
               05  QSPB-INSMAXBENIF-7                 PIC 9(7).
               05  QSPB-INSMAXTERM-7                  PIC 9(3).
               05  QSPB-INSCHGBEN-7                   PIC X.
               05  QSPB-INSEXCEPT-7                   PIC 99.
               05  QSPB-INSNOVER-7                    PIC 99.
               05  QSPB-INSMINAGE-7-1                 PIC 99.
               05  QSPB-INSMAXAGE-7-1                 PIC 99.
               05  QSPB-INSMAXCOV-7-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-7-1                 PIC 9(3).
               05  QSPB-INSMINAGE-7-2                 PIC 99.
               05  QSPB-INSMAXAGE-7-2                 PIC 99.
               05  QSPB-INSMAXCOV-7-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-7-2                 PIC 9(3).
               05  QSPB-INSMINAGE-7-3                 PIC 99.
               05  QSPB-INSMAXAGE-7-3                 PIC 99.
               05  QSPB-INSMAXCOV-7-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-7-3                 PIC 9(3).
               05  QSPB-INSMINAGE-7-4                 PIC 99.
               05  QSPB-INSMAXAGE-7-4                 PIC 99.
               05  QSPB-INSMAXCOV-7-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-7-4                 PIC 9(3).
               05  QSPB-INSMINAGE-7-5                 PIC 99.
               05  QSPB-INSMAXAGE-7-5                 PIC 99.
               05  QSPB-INSMAXCOV-7-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-7-5                 PIC 9(3).
               05  QSPB-INSFEECD-7                    PIC XX.
               05  QSPB-INSFEE-FRMLA-7                PIC X.
               05  QSPB-INSCHGABL-FG-7                PIC X.
               05  QSPB-INSREJECT-FG-7                PIC X.
               05  QSPB-INSFINCHG-7                   PIC X.
               05  QSPB-INSCOM-8                      PIC 99.
               05  QSPB-INSRATECD-8                   PIC 999.
               05  QSPB-INSJFAC-8                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-8                   PIC 99V99.
               05  QSPB-INSCHGABL-8                   PIC X(2).
               05  QSPB-INSTERM-8-1                   PIC 9(3).
               05  QSPB-INSRATE-8-1                   PIC 99V9999.
               05  QSPB-INSTERM-8-2                   PIC 9(3).
               05  QSPB-INSRATE-8-2                   PIC 99V9999.
               05  QSPB-INSTERM-8-3                   PIC 9(3).
               05  QSPB-INSRATE-8-3                   PIC 99V9999.
               05  QSPB-INSTERM-8-4                   PIC 9(3).
               05  QSPB-INSRATE-8-4                   PIC 99V9999.
               05  QSPB-INSTERM-8-5                   PIC 9(3).
               05  QSPB-INSRATE-8-5                   PIC 99V9999.
               05  QSPB-INSTERM-8-6                   PIC 9(3).
               05  QSPB-INSRATE-8-6                   PIC 99V9999.
               05  QSPB-INSTERM-8-7                   PIC 9(3).
               05  QSPB-INSRATE-8-7                   PIC 99V9999.
               05  QSPB-INSTERM-8-8                   PIC 9(3).
               05  QSPB-INSRATE-8-8                   PIC 99V9999.
               05  QSPB-INSTERM-8-9                   PIC 9(3).
               05  QSPB-INSRATE-8-9                   PIC 99V9999.
               05  QSPB-INSTERM-8-10                  PIC 9(3).
               05  QSPB-INSRATE-8-10                  PIC 99V9999.
               05  QSPB-INSTERM-8-11                  PIC 9(3).
               05  QSPB-INSRATE-8-11                  PIC 99V9999.
               05  QSPB-INSTERM-8-12                  PIC 9(3).
               05  QSPB-INSRATE-8-12                  PIC 99V9999.
               05  QSPB-INSTERM-8-13                  PIC 9(3).
               05  QSPB-INSRATE-8-13                  PIC 99V9999.
               05  QSPB-INSTERM-8-14                  PIC 9(3).
               05  QSPB-INSRATE-8-14                  PIC 99V9999.
               05  QSPB-INSTERM-8-15                  PIC 9(3).
               05  QSPB-INSRATE-8-15                  PIC 99V9999.
               05  QSPB-INSTERM-8-16                  PIC 9(3).
               05  QSPB-INSRATE-8-16                  PIC 99V9999.
               05  QSPB-INSTERM-8-17                  PIC 9(3).
               05  QSPB-INSRATE-8-17                  PIC 99V9999.
               05  QSPB-INSTERM-8-18                  PIC 9(3).
               05  QSPB-INSRATE-8-18                  PIC 99V9999.
               05  QSPB-INSTERM-8-19                  PIC 9(3).
               05  QSPB-INSRATE-8-19                  PIC 99V9999.
               05  QSPB-INSTERM-8-20                  PIC 9(3).
               05  QSPB-INSRATE-8-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-8                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-8                PIC 9(6).
               05  QSPB-INSMAXCHGABL-8                PIC 9(7).
               05  QSPB-INSMAXBENIF-8                 PIC 9(7).
               05  QSPB-INSMAXTERM-8                  PIC 9(3).
               05  QSPB-INSCHGBEN-8                   PIC X.
               05  QSPB-INSEXCEPT-8                   PIC 99.
               05  QSPB-INSNOVER-8                    PIC 99.
               05  QSPB-INSMINAGE-8-1                 PIC 99.
               05  QSPB-INSMAXAGE-8-1                 PIC 99.
               05  QSPB-INSMAXCOV-8-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-8-1                 PIC 9(3).
               05  QSPB-INSMINAGE-8-2                 PIC 99.
               05  QSPB-INSMAXAGE-8-2                 PIC 99.
               05  QSPB-INSMAXCOV-8-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-8-2                 PIC 9(3).
               05  QSPB-INSMINAGE-8-3                 PIC 99.
               05  QSPB-INSMAXAGE-8-3                 PIC 99.
               05  QSPB-INSMAXCOV-8-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-8-3                 PIC 9(3).
               05  QSPB-INSMINAGE-8-4                 PIC 99.
               05  QSPB-INSMAXAGE-8-4                 PIC 99.
               05  QSPB-INSMAXCOV-8-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-8-4                 PIC 9(3).
               05  QSPB-INSMINAGE-8-5                 PIC 99.
               05  QSPB-INSMAXAGE-8-5                 PIC 99.
               05  QSPB-INSMAXCOV-8-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-8-5                 PIC 9(3).
               05  QSPB-INSFEECD-8                    PIC XX.
               05  QSPB-INSFEE-FRMLA-8                PIC X.
               05  QSPB-INSCHGABL-FG-8                PIC X.
               05  QSPB-INSREJECT-FG-8                PIC X.
               05  QSPB-INSFINCHG-8                   PIC X.
               05  QSPB-INSCOM-9                      PIC 99.
               05  QSPB-INSRATECD-9                   PIC 999.
               05  QSPB-INSJFAC-9                     PIC 9(4)V99.
               05  QSPB-INSDISCNT-9                   PIC 99V99.
               05  QSPB-INSCHGABL-9                   PIC X(2).
               05  QSPB-INSTERM-9-1                   PIC 9(3).
               05  QSPB-INSRATE-9-1                   PIC 99V9999.
               05  QSPB-INSTERM-9-2                   PIC 9(3).
               05  QSPB-INSRATE-9-2                   PIC 99V9999.
               05  QSPB-INSTERM-9-3                   PIC 9(3).
               05  QSPB-INSRATE-9-3                   PIC 99V9999.
               05  QSPB-INSTERM-9-4                   PIC 9(3).
               05  QSPB-INSRATE-9-4                   PIC 99V9999.
               05  QSPB-INSTERM-9-5                   PIC 9(3).
               05  QSPB-INSRATE-9-5                   PIC 99V9999.
               05  QSPB-INSTERM-9-6                   PIC 9(3).
               05  QSPB-INSRATE-9-6                   PIC 99V9999.
               05  QSPB-INSTERM-9-7                   PIC 9(3).
               05  QSPB-INSRATE-9-7                   PIC 99V9999.
               05  QSPB-INSTERM-9-8                   PIC 9(3).
               05  QSPB-INSRATE-9-8                   PIC 99V9999.
               05  QSPB-INSTERM-9-9                   PIC 9(3).
               05  QSPB-INSRATE-9-9                   PIC 99V9999.
               05  QSPB-INSTERM-9-10                  PIC 9(3).
               05  QSPB-INSRATE-9-10                  PIC 99V9999.
               05  QSPB-INSTERM-9-11                  PIC 9(3).
               05  QSPB-INSRATE-9-11                  PIC 99V9999.
               05  QSPB-INSTERM-9-12                  PIC 9(3).
               05  QSPB-INSRATE-9-12                  PIC 99V9999.
               05  QSPB-INSTERM-9-13                  PIC 9(3).
               05  QSPB-INSRATE-9-13                  PIC 99V9999.
               05  QSPB-INSTERM-9-14                  PIC 9(3).
               05  QSPB-INSRATE-9-14                  PIC 99V9999.
               05  QSPB-INSTERM-9-15                  PIC 9(3).
               05  QSPB-INSRATE-9-15                  PIC 99V9999.
               05  QSPB-INSTERM-9-16                  PIC 9(3).
               05  QSPB-INSRATE-9-16                  PIC 99V9999.
               05  QSPB-INSTERM-9-17                  PIC 9(3).
               05  QSPB-INSRATE-9-17                  PIC 99V9999.
               05  QSPB-INSTERM-9-18                  PIC 9(3).
               05  QSPB-INSRATE-9-18                  PIC 99V9999.
               05  QSPB-INSTERM-9-19                  PIC 9(3).
               05  QSPB-INSRATE-9-19                  PIC 99V9999.
               05  QSPB-INSTERM-9-20                  PIC 9(3).
               05  QSPB-INSRATE-9-20                  PIC 99V9999.
               05  QSPB-INSMINPREM-9                  PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-9                PIC 9(6).
               05  QSPB-INSMAXCHGABL-9                PIC 9(7).
               05  QSPB-INSMAXBENIF-9                 PIC 9(7).
               05  QSPB-INSMAXTERM-9                  PIC 9(3).
               05  QSPB-INSCHGBEN-9                   PIC X.
               05  QSPB-INSEXCEPT-9                   PIC 99.
               05  QSPB-INSNOVER-9                    PIC 99.
               05  QSPB-INSMINAGE-9-1                 PIC 99.
               05  QSPB-INSMAXAGE-9-1                 PIC 99.
               05  QSPB-INSMAXCOV-9-1                 PIC 9(7).
               05  QSPB-INSMAXTRM-9-1                 PIC 9(3).
               05  QSPB-INSMINAGE-9-2                 PIC 99.
               05  QSPB-INSMAXAGE-9-2                 PIC 99.
               05  QSPB-INSMAXCOV-9-2                 PIC 9(7).
               05  QSPB-INSMAXTRM-9-2                 PIC 9(3).
               05  QSPB-INSMINAGE-9-3                 PIC 99.
               05  QSPB-INSMAXAGE-9-3                 PIC 99.
               05  QSPB-INSMAXCOV-9-3                 PIC 9(7).
               05  QSPB-INSMAXTRM-9-3                 PIC 9(3).
               05  QSPB-INSMINAGE-9-4                 PIC 99.
               05  QSPB-INSMAXAGE-9-4                 PIC 99.
               05  QSPB-INSMAXCOV-9-4                 PIC 9(7).
               05  QSPB-INSMAXTRM-9-4                 PIC 9(3).
               05  QSPB-INSMINAGE-9-5                 PIC 99.
               05  QSPB-INSMAXAGE-9-5                 PIC 99.
               05  QSPB-INSMAXCOV-9-5                 PIC 9(7).
               05  QSPB-INSMAXTRM-9-5                 PIC 9(3).
               05  QSPB-INSFEECD-9                    PIC XX.
               05  QSPB-INSFEE-FRMLA-9                PIC X.
               05  QSPB-INSCHGABL-FG-9                PIC X.
               05  QSPB-INSREJECT-FG-9                PIC X.
               05  QSPB-INSFINCHG-9                   PIC X.
               05  QSPB-INSCOM-10                     PIC 99.
               05  QSPB-INSRATECD-10                  PIC 999.
               05  QSPB-INSJFAC-10                    PIC 9(4)V99.
               05  QSPB-INSDISCNT-10                  PIC 99V99.
               05  QSPB-INSCHGABL-10                  PIC X(2).
               05  QSPB-INSTERM-10-1                  PIC 9(3).
               05  QSPB-INSRATE-10-1                  PIC 99V9999.
               05  QSPB-INSTERM-10-2                  PIC 9(3).
               05  QSPB-INSRATE-10-2                  PIC 99V9999.
               05  QSPB-INSTERM-10-3                  PIC 9(3).
               05  QSPB-INSRATE-10-3                  PIC 99V9999.
               05  QSPB-INSTERM-10-4                  PIC 9(3).
               05  QSPB-INSRATE-10-4                  PIC 99V9999.
               05  QSPB-INSTERM-10-5                  PIC 9(3).
               05  QSPB-INSRATE-10-5                  PIC 99V9999.
               05  QSPB-INSTERM-10-6                  PIC 9(3).
               05  QSPB-INSRATE-10-6                  PIC 99V9999.
               05  QSPB-INSTERM-10-7                  PIC 9(3).
               05  QSPB-INSRATE-10-7                  PIC 99V9999.
               05  QSPB-INSTERM-10-8                  PIC 9(3).
               05  QSPB-INSRATE-10-8                  PIC 99V9999.
               05  QSPB-INSTERM-10-9                  PIC 9(3).
               05  QSPB-INSRATE-10-9                  PIC 99V9999.
               05  QSPB-INSTERM-10-10                 PIC 9(3).
               05  QSPB-INSRATE-10-10                 PIC 99V9999.
               05  QSPB-INSTERM-10-11                 PIC 9(3).
               05  QSPB-INSRATE-10-11                 PIC 99V9999.
               05  QSPB-INSTERM-10-12                 PIC 9(3).
               05  QSPB-INSRATE-10-12                 PIC 99V9999.
               05  QSPB-INSTERM-10-13                 PIC 9(3).
               05  QSPB-INSRATE-10-13                 PIC 99V9999.
               05  QSPB-INSTERM-10-14                 PIC 9(3).
               05  QSPB-INSRATE-10-14                 PIC 99V9999.
               05  QSPB-INSTERM-10-15                 PIC 9(3).
               05  QSPB-INSRATE-10-15                 PIC 99V9999.
               05  QSPB-INSTERM-10-16                 PIC 9(3).
               05  QSPB-INSRATE-10-16                 PIC 99V9999.
               05  QSPB-INSTERM-10-17                 PIC 9(3).
               05  QSPB-INSRATE-10-17                 PIC 99V9999.
               05  QSPB-INSTERM-10-18                 PIC 9(3).
               05  QSPB-INSRATE-10-18                 PIC 99V9999.
               05  QSPB-INSTERM-10-19                 PIC 9(3).
               05  QSPB-INSRATE-10-19                 PIC 99V9999.
               05  QSPB-INSTERM-10-20                 PIC 9(3).
               05  QSPB-INSRATE-10-20                 PIC 99V9999.
               05  QSPB-INSMINPREM-10                 PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-10               PIC 9(6).
               05  QSPB-INSMAXCHGABL-10               PIC 9(7).
               05  QSPB-INSMAXBENIF-10                PIC 9(7).
               05  QSPB-INSMAXTERM-10                 PIC 9(3).
               05  QSPB-INSCHGBEN-10                  PIC X.
               05  QSPB-INSEXCEPT-10                  PIC 99.
               05  QSPB-INSNOVER-10                   PIC 99.
               05  QSPB-INSMINAGE-10-1                PIC 99.
               05  QSPB-INSMAXAGE-10-1                PIC 99.
               05  QSPB-INSMAXCOV-10-1                PIC 9(7).
               05  QSPB-INSMAXTRM-10-1                PIC 9(3).
               05  QSPB-INSMINAGE-10-2                PIC 99.
               05  QSPB-INSMAXAGE-10-2                PIC 99.
               05  QSPB-INSMAXCOV-10-2                PIC 9(7).
               05  QSPB-INSMAXTRM-10-2                PIC 9(3).
               05  QSPB-INSMINAGE-10-3                PIC 99.
               05  QSPB-INSMAXAGE-10-3                PIC 99.
               05  QSPB-INSMAXCOV-10-3                PIC 9(7).
               05  QSPB-INSMAXTRM-10-3                PIC 9(3).
               05  QSPB-INSMINAGE-10-4                PIC 99.
               05  QSPB-INSMAXAGE-10-4                PIC 99.
               05  QSPB-INSMAXCOV-10-4                PIC 9(7).
               05  QSPB-INSMAXTRM-10-4                PIC 9(3).
               05  QSPB-INSMINAGE-10-5                PIC 99.
               05  QSPB-INSMAXAGE-10-5                PIC 99.
               05  QSPB-INSMAXCOV-10-5                PIC 9(7).
               05  QSPB-INSMAXTRM-10-5                PIC 9(3).
               05  QSPB-INSFEECD-10                   PIC XX.
               05  QSPB-INSFEE-FRMLA-10               PIC X.
               05  QSPB-INSCHGABL-FG-10               PIC X.
               05  QSPB-INSREJECT-FG-10               PIC X.
               05  QSPB-INSFINCHG-10                  PIC X.
               05  QSPB-INSCOM-11                     PIC 99.
               05  QSPB-INSRATECD-11                  PIC 999.
               05  QSPB-INSJFAC-11                    PIC 9(4)V99.
               05  QSPB-INSDISCNT-11                  PIC 99V99.
               05  QSPB-INSCHGABL-11                  PIC X(2).
               05  QSPB-INSTERM-11-1                  PIC 9(3).
               05  QSPB-INSRATE-11-1                  PIC 99V9999.
               05  QSPB-INSTERM-11-2                  PIC 9(3).
               05  QSPB-INSRATE-11-2                  PIC 99V9999.
               05  QSPB-INSTERM-11-3                  PIC 9(3).
               05  QSPB-INSRATE-11-3                  PIC 99V9999.
               05  QSPB-INSTERM-11-4                  PIC 9(3).
               05  QSPB-INSRATE-11-4                  PIC 99V9999.
               05  QSPB-INSTERM-11-5                  PIC 9(3).
               05  QSPB-INSRATE-11-5                  PIC 99V9999.
               05  QSPB-INSTERM-11-6                  PIC 9(3).
               05  QSPB-INSRATE-11-6                  PIC 99V9999.
               05  QSPB-INSTERM-11-7                  PIC 9(3).
               05  QSPB-INSRATE-11-7                  PIC 99V9999.
               05  QSPB-INSTERM-11-8                  PIC 9(3).
               05  QSPB-INSRATE-11-8                  PIC 99V9999.
               05  QSPB-INSTERM-11-9                  PIC 9(3).
               05  QSPB-INSRATE-11-9                  PIC 99V9999.
               05  QSPB-INSTERM-11-10                 PIC 9(3).
               05  QSPB-INSRATE-11-10                 PIC 99V9999.
               05  QSPB-INSTERM-11-11                 PIC 9(3).
               05  QSPB-INSRATE-11-11                 PIC 99V9999.
               05  QSPB-INSTERM-11-12                 PIC 9(3).
               05  QSPB-INSRATE-11-12                 PIC 99V9999.
               05  QSPB-INSTERM-11-13                 PIC 9(3).
               05  QSPB-INSRATE-11-13                 PIC 99V9999.
               05  QSPB-INSTERM-11-14                 PIC 9(3).
               05  QSPB-INSRATE-11-14                 PIC 99V9999.
               05  QSPB-INSTERM-11-15                 PIC 9(3).
               05  QSPB-INSRATE-11-15                 PIC 99V9999.
               05  QSPB-INSTERM-11-16                 PIC 9(3).
               05  QSPB-INSRATE-11-16                 PIC 99V9999.
               05  QSPB-INSTERM-11-17                 PIC 9(3).
               05  QSPB-INSRATE-11-17                 PIC 99V9999.
               05  QSPB-INSTERM-11-18                 PIC 9(3).
               05  QSPB-INSRATE-11-18                 PIC 99V9999.
               05  QSPB-INSTERM-11-19                 PIC 9(3).
               05  QSPB-INSRATE-11-19                 PIC 99V9999.
               05  QSPB-INSTERM-11-20                 PIC 9(3).
               05  QSPB-INSRATE-11-20                 PIC 99V9999.
               05  QSPB-INSMINPREM-11                 PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-11               PIC 9(6).
               05  QSPB-INSMAXCHGABL-11               PIC 9(7).
               05  QSPB-INSMAXBENIF-11                PIC 9(7).
               05  QSPB-INSMAXTERM-11                 PIC 9(3).
               05  QSPB-INSCHGBEN-11                  PIC X.
               05  QSPB-INSEXCEPT-11                  PIC 99.
               05  QSPB-INSNOVER-11                   PIC 99.
               05  QSPB-INSMINAGE-11-1                PIC 99.
               05  QSPB-INSMAXAGE-11-1                PIC 99.
               05  QSPB-INSMAXCOV-11-1                PIC 9(7).
               05  QSPB-INSMAXTRM-11-1                PIC 9(3).
               05  QSPB-INSMINAGE-11-2                PIC 99.
               05  QSPB-INSMAXAGE-11-2                PIC 99.
               05  QSPB-INSMAXCOV-11-2                PIC 9(7).
               05  QSPB-INSMAXTRM-11-2                PIC 9(3).
               05  QSPB-INSMINAGE-11-3                PIC 99.
               05  QSPB-INSMAXAGE-11-3                PIC 99.
               05  QSPB-INSMAXCOV-11-3                PIC 9(7).
               05  QSPB-INSMAXTRM-11-3                PIC 9(3).
               05  QSPB-INSMINAGE-11-4                PIC 99.
               05  QSPB-INSMAXAGE-11-4                PIC 99.
               05  QSPB-INSMAXCOV-11-4                PIC 9(7).
               05  QSPB-INSMAXTRM-11-4                PIC 9(3).
               05  QSPB-INSMINAGE-11-5                PIC 99.
               05  QSPB-INSMAXAGE-11-5                PIC 99.
               05  QSPB-INSMAXCOV-11-5                PIC 9(7).
               05  QSPB-INSMAXTRM-11-5                PIC 9(3).
               05  QSPB-INSFEECD-11                   PIC XX.
               05  QSPB-INSFEE-FRMLA-11               PIC X.
               05  QSPB-INSCHGABL-FG-11               PIC X.
               05  QSPB-INSREJECT-FG-11               PIC X.
               05  QSPB-INSFINCHG-11                  PIC X.
               05  QSPB-INSCOM-12                     PIC 99.
               05  QSPB-INSRATECD-12                  PIC 999.
               05  QSPB-INSJFAC-12                    PIC 9(4)V99.
               05  QSPB-INSDISCNT-12                  PIC 99V99.
               05  QSPB-INSCHGABL-12                  PIC X(2).
               05  QSPB-INSTERM-12-1                  PIC 9(3).
               05  QSPB-INSRATE-12-1                  PIC 99V9999.
               05  QSPB-INSTERM-12-2                  PIC 9(3).
               05  QSPB-INSRATE-12-2                  PIC 99V9999.
               05  QSPB-INSTERM-12-3                  PIC 9(3).
               05  QSPB-INSRATE-12-3                  PIC 99V9999.
               05  QSPB-INSTERM-12-4                  PIC 9(3).
               05  QSPB-INSRATE-12-4                  PIC 99V9999.
               05  QSPB-INSTERM-12-5                  PIC 9(3).
               05  QSPB-INSRATE-12-5                  PIC 99V9999.
               05  QSPB-INSTERM-12-6                  PIC 9(3).
               05  QSPB-INSRATE-12-6                  PIC 99V9999.
               05  QSPB-INSTERM-12-7                  PIC 9(3).
               05  QSPB-INSRATE-12-7                  PIC 99V9999.
               05  QSPB-INSTERM-12-8                  PIC 9(3).
               05  QSPB-INSRATE-12-8                  PIC 99V9999.
               05  QSPB-INSTERM-12-9                  PIC 9(3).
               05  QSPB-INSRATE-12-9                  PIC 99V9999.
               05  QSPB-INSTERM-12-10                 PIC 9(3).
               05  QSPB-INSRATE-12-10                 PIC 99V9999.
               05  QSPB-INSTERM-12-11                 PIC 9(3).
               05  QSPB-INSRATE-12-11                 PIC 99V9999.
               05  QSPB-INSTERM-12-12                 PIC 9(3).
               05  QSPB-INSRATE-12-12                 PIC 99V9999.
               05  QSPB-INSTERM-12-13                 PIC 9(3).
               05  QSPB-INSRATE-12-13                 PIC 99V9999.
               05  QSPB-INSTERM-12-14                 PIC 9(3).
               05  QSPB-INSRATE-12-14                 PIC 99V9999.
               05  QSPB-INSTERM-12-15                 PIC 9(3).
               05  QSPB-INSRATE-12-15                 PIC 99V9999.
               05  QSPB-INSTERM-12-16                 PIC 9(3).
               05  QSPB-INSRATE-12-16                 PIC 99V9999.
               05  QSPB-INSTERM-12-17                 PIC 9(3).
               05  QSPB-INSRATE-12-17                 PIC 99V9999.
               05  QSPB-INSTERM-12-18                 PIC 9(3).
               05  QSPB-INSRATE-12-18                 PIC 99V9999.
               05  QSPB-INSTERM-12-19                 PIC 9(3).
               05  QSPB-INSRATE-12-19                 PIC 99V9999.
               05  QSPB-INSTERM-12-20                 PIC 9(3).
               05  QSPB-INSRATE-12-20                 PIC 99V9999.
               05  QSPB-INSMINPREM-12                 PIC 9(4)V99.
               05  QSPB-INSMINCHGABL-12               PIC 9(6).
               05  QSPB-INSMAXCHGABL-12               PIC 9(7).
               05  QSPB-INSMAXBENIF-12                PIC 9(7).
               05  QSPB-INSMAXTERM-12                 PIC 9(3).
               05  QSPB-INSCHGBEN-12                  PIC X.
               05  QSPB-INSEXCEPT-12                  PIC 99.
               05  QSPB-INSNOVER-12                   PIC 99.
               05  QSPB-INSMINAGE-12-1                PIC 99.
               05  QSPB-INSMAXAGE-12-1                PIC 99.
               05  QSPB-INSMAXCOV-12-1                PIC 9(7).
               05  QSPB-INSMAXTRM-12-1                PIC 9(3).
               05  QSPB-INSMINAGE-12-2                PIC 99.
               05  QSPB-INSMAXAGE-12-2                PIC 99.
               05  QSPB-INSMAXCOV-12-2                PIC 9(7).
               05  QSPB-INSMAXTRM-12-2                PIC 9(3).
               05  QSPB-INSMINAGE-12-3                PIC 99.
               05  QSPB-INSMAXAGE-12-3                PIC 99.
               05  QSPB-INSMAXCOV-12-3                PIC 9(7).
               05  QSPB-INSMAXTRM-12-3                PIC 9(3).
               05  QSPB-INSMINAGE-12-4                PIC 99.
               05  QSPB-INSMAXAGE-12-4                PIC 99.
               05  QSPB-INSMAXCOV-12-4                PIC 9(7).
               05  QSPB-INSMAXTRM-12-4                PIC 9(3).
               05  QSPB-INSMINAGE-12-5                PIC 99.
               05  QSPB-INSMAXAGE-12-5                PIC 99.
               05  QSPB-INSMAXCOV-12-5                PIC 9(7).
               05  QSPB-INSMAXTRM-12-5                PIC 9(3).
               05  QSPB-INSFEECD-12                   PIC XX.
               05  QSPB-INSFEE-FRMLA-12               PIC X.
               05  QSPB-INSCHGABL-FG-12               PIC X.
               05  QSPB-INSREJECT-FG-12               PIC X.
               05  QSPB-INSFINCHG-12                  PIC X.
           03  QSPC-REC.
               05  QSPC-ORGST                         PIC XX.
               05  QSPC-SPRCLASS                      PIC 999.
               05  QSPC-SUBCLASS                      PIC 99.
               05  QSPC-LAWCODE                       PIC 99.
               05  QSPC-INSEARN-ORDER-1               PIC 9(2).
               05  QSPC-INSEARN-ORDER-2               PIC 9(2).
               05  QSPC-INSEARN-ORDER-3               PIC 9(2).
               05  QSPC-INSEARN-ORDER-4               PIC 9(2).
               05  QSPC-INSEARN-ORDER-5               PIC 9(2).
               05  QSPC-INSEARN-ORDER-6               PIC 9(2).
               05  QSPC-INSEARN-ORDER-7               PIC 9(2).
               05  QSPC-INSEARN-ORDER-8               PIC 9(2).
               05  QSPC-INSEARN-ORDER-9               PIC 9(2).
               05  QSPC-INSEARN-ORDER-10              PIC 9(2).
               05  QSPC-INSEARN-ORDER-11              PIC 9(2).
               05  QSPC-INSEARN-ORDER-12              PIC 9(2).
               05  QSPC-INSAH-JOINT-FG                PIC X.
               05  QSPC-INS-O1-EDIT                   PIC X.
               05  QSPC-INS-O2-EDIT                   PIC X.
               05  QSPC-RBFRMLA-1                     PIC X(2).
               05  QSPC-RBDTE-1-1                     PIC X.
               05  QSPC-RBDAYS-1-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-1-1                  PIC 9(4).
               05  QSPC-RBDTE-1-2                     PIC X.
               05  QSPC-RBDAYS-1-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-1-2                  PIC 9(4).
               05  QSPC-RBMINRET-1                    PIC 9999V99.
               05  QSPC-RBNOMON-1                     PIC 9(2).
               05  QSPC-RBDEDCHG-1                    PIC 9999V99.
               05  QSPC-RBRECAST-1                    PIC 9(2).
               05  QSPC-RBEARLY-1                     PIC 9(2).
               05  QSPC-RBDEFER-1                     PIC 9(2).
               05  QSPC-RBPCT-1                       PIC 9(3)V9.
               05  QSPC-RBREDUC-1                     PIC 9(4)V99.
               05  QSPC-RBMIN-1                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-1                    PIC 9(2).
               05  QSPC-RBSPOPT2-1                    PIC 9(2).
               05  QSPC-RBMANAGER-1                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-1                PIC X.
               05  QSPC-RBFRMLA2-1                    PIC X(2).
               05  QSPC-RBFRMLA-2                     PIC X(2).
               05  QSPC-RBDTE-2-1                     PIC X.
               05  QSPC-RBDAYS-2-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-2-1                  PIC 9(4).
               05  QSPC-RBDTE-2-2                     PIC X.
               05  QSPC-RBDAYS-2-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-2-2                  PIC 9(4).
               05  QSPC-RBMINRET-2                    PIC 9999V99.
               05  QSPC-RBNOMON-2                     PIC 9(2).
               05  QSPC-RBDEDCHG-2                    PIC 9999V99.
               05  QSPC-RBRECAST-2                    PIC 9(2).
               05  QSPC-RBEARLY-2                     PIC 9(2).
               05  QSPC-RBDEFER-2                     PIC 9(2).
               05  QSPC-RBPCT-2                       PIC 9(3)V9.
               05  QSPC-RBREDUC-2                     PIC 9(4)V99.
               05  QSPC-RBMIN-2                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-2                    PIC 9(2).
               05  QSPC-RBSPOPT2-2                    PIC 9(2).
               05  QSPC-RBMANAGER-2                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-2                PIC X.
               05  QSPC-RBFRMLA2-2                    PIC X(2).
               05  QSPC-RBFRMLA-3                     PIC X(2).
               05  QSPC-RBDTE-3-1                     PIC X.
               05  QSPC-RBDAYS-3-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-3-1                  PIC 9(4).
               05  QSPC-RBDTE-3-2                     PIC X.
               05  QSPC-RBDAYS-3-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-3-2                  PIC 9(4).
               05  QSPC-RBMINRET-3                    PIC 9999V99.
               05  QSPC-RBNOMON-3                     PIC 9(2).
               05  QSPC-RBDEDCHG-3                    PIC 9999V99.
               05  QSPC-RBRECAST-3                    PIC 9(2).
               05  QSPC-RBEARLY-3                     PIC 9(2).
               05  QSPC-RBDEFER-3                     PIC 9(2).
               05  QSPC-RBPCT-3                       PIC 9(3)V9.
               05  QSPC-RBREDUC-3                     PIC 9(4)V99.
               05  QSPC-RBMIN-3                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-3                    PIC 9(2).
               05  QSPC-RBSPOPT2-3                    PIC 9(2).
               05  QSPC-RBMANAGER-3                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-3                PIC X.
               05  QSPC-RBFRMLA2-3                    PIC X(2).
               05  QSPC-RBFRMLA-4                     PIC X(2).
               05  QSPC-RBDTE-4-1                     PIC X.
               05  QSPC-RBDAYS-4-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-4-1                  PIC 9(4).
               05  QSPC-RBDTE-4-2                     PIC X.
               05  QSPC-RBDAYS-4-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-4-2                  PIC 9(4).
               05  QSPC-RBMINRET-4                    PIC 9999V99.
               05  QSPC-RBNOMON-4                     PIC 9(2).
               05  QSPC-RBDEDCHG-4                    PIC 9999V99.
               05  QSPC-RBRECAST-4                    PIC 9(2).
               05  QSPC-RBEARLY-4                     PIC 9(2).
               05  QSPC-RBDEFER-4                     PIC 9(2).
               05  QSPC-RBPCT-4                       PIC 9(3)V9.
               05  QSPC-RBREDUC-4                     PIC 9(4)V99.
               05  QSPC-RBMIN-4                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-4                    PIC 9(2).
               05  QSPC-RBSPOPT2-4                    PIC 9(2).
               05  QSPC-RBMANAGER-4                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-4                PIC X.
               05  QSPC-RBFRMLA2-4                    PIC X(2).
               05  QSPC-RBFRMLA-5                     PIC X(2).
               05  QSPC-RBDTE-5-1                     PIC X.
               05  QSPC-RBDAYS-5-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-5-1                  PIC 9(4).
               05  QSPC-RBDTE-5-2                     PIC X.
               05  QSPC-RBDAYS-5-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-5-2                  PIC 9(4).
               05  QSPC-RBMINRET-5                    PIC 9999V99.
               05  QSPC-RBNOMON-5                     PIC 9(2).
               05  QSPC-RBDEDCHG-5                    PIC 9999V99.
               05  QSPC-RBRECAST-5                    PIC 9(2).
               05  QSPC-RBEARLY-5                     PIC 9(2).
               05  QSPC-RBDEFER-5                     PIC 9(2).
               05  QSPC-RBPCT-5                       PIC 9(3)V9.
               05  QSPC-RBREDUC-5                     PIC 9(4)V99.
               05  QSPC-RBMIN-5                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-5                    PIC 9(2).
               05  QSPC-RBSPOPT2-5                    PIC 9(2).
               05  QSPC-RBMANAGER-5                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-5                PIC X.
               05  QSPC-RBFRMLA2-5                    PIC X(2).
               05  QSPC-RBFRMLA-6                     PIC X(2).
               05  QSPC-RBDTE-6-1                     PIC X.
               05  QSPC-RBDAYS-6-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-6-1                  PIC 9(4).
               05  QSPC-RBDTE-6-2                     PIC X.
               05  QSPC-RBDAYS-6-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-6-2                  PIC 9(4).
               05  QSPC-RBMINRET-6                    PIC 9999V99.
               05  QSPC-RBNOMON-6                     PIC 9(2).
               05  QSPC-RBDEDCHG-6                    PIC 9999V99.
               05  QSPC-RBRECAST-6                    PIC 9(2).
               05  QSPC-RBEARLY-6                     PIC 9(2).
               05  QSPC-RBDEFER-6                     PIC 9(2).
               05  QSPC-RBPCT-6                       PIC 9(3)V9.
               05  QSPC-RBREDUC-6                     PIC 9(4)V99.
               05  QSPC-RBMIN-6                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-6                    PIC 9(2).
               05  QSPC-RBSPOPT2-6                    PIC 9(2).
               05  QSPC-RBMANAGER-6                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-6                PIC X.
               05  QSPC-RBFRMLA2-6                    PIC X(2).
               05  QSPC-RBFRMLA-7                     PIC X(2).
               05  QSPC-RBDTE-7-1                     PIC X.
               05  QSPC-RBDAYS-7-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-7-1                  PIC 9(4).
               05  QSPC-RBDTE-7-2                     PIC X.
               05  QSPC-RBDAYS-7-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-7-2                  PIC 9(4).
               05  QSPC-RBMINRET-7                    PIC 9999V99.
               05  QSPC-RBNOMON-7                     PIC 9(2).
               05  QSPC-RBDEDCHG-7                    PIC 9999V99.
               05  QSPC-RBRECAST-7                    PIC 9(2).
               05  QSPC-RBEARLY-7                     PIC 9(2).
               05  QSPC-RBDEFER-7                     PIC 9(2).
               05  QSPC-RBPCT-7                       PIC 9(3)V9.
               05  QSPC-RBREDUC-7                     PIC 9(4)V99.
               05  QSPC-RBMIN-7                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-7                    PIC 9(2).
               05  QSPC-RBSPOPT2-7                    PIC 9(2).
               05  QSPC-RBMANAGER-7                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-7                PIC X.
               05  QSPC-RBFRMLA2-7                    PIC X(2).
               05  QSPC-RBFRMLA-8                     PIC X(2).
               05  QSPC-RBDTE-8-1                     PIC X.
               05  QSPC-RBDAYS-8-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-8-1                  PIC 9(4).
               05  QSPC-RBDTE-8-2                     PIC X.
               05  QSPC-RBDAYS-8-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-8-2                  PIC 9(4).
               05  QSPC-RBMINRET-8                    PIC 9999V99.
               05  QSPC-RBNOMON-8                     PIC 9(2).
               05  QSPC-RBDEDCHG-8                    PIC 9999V99.
               05  QSPC-RBRECAST-8                    PIC 9(2).
               05  QSPC-RBEARLY-8                     PIC 9(2).
               05  QSPC-RBDEFER-8                     PIC 9(2).
               05  QSPC-RBPCT-8                       PIC 9(3)V9.
               05  QSPC-RBREDUC-8                     PIC 9(4)V99.
               05  QSPC-RBMIN-8                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-8                    PIC 9(2).
               05  QSPC-RBSPOPT2-8                    PIC 9(2).
               05  QSPC-RBMANAGER-8                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-8                PIC X.
               05  QSPC-RBFRMLA2-8                    PIC X(2).
               05  QSPC-RBFRMLA-9                     PIC X(2).
               05  QSPC-RBDTE-9-1                     PIC X.
               05  QSPC-RBDAYS-9-1                    PIC 9(2).
               05  QSPC-RBYRTYPE-9-1                  PIC 9(4).
               05  QSPC-RBDTE-9-2                     PIC X.
               05  QSPC-RBDAYS-9-2                    PIC 9(2).
               05  QSPC-RBYRTYPE-9-2                  PIC 9(4).
               05  QSPC-RBMINRET-9                    PIC 9999V99.
               05  QSPC-RBNOMON-9                     PIC 9(2).
               05  QSPC-RBDEDCHG-9                    PIC 9999V99.
               05  QSPC-RBRECAST-9                    PIC 9(2).
               05  QSPC-RBEARLY-9                     PIC 9(2).
               05  QSPC-RBDEFER-9                     PIC 9(2).
               05  QSPC-RBPCT-9                       PIC 9(3)V9.
               05  QSPC-RBREDUC-9                     PIC 9(4)V99.
               05  QSPC-RBMIN-9                       PIC 9(4)V99.
               05  QSPC-RBSPOPT1-9                    PIC 9(2).
               05  QSPC-RBSPOPT2-9                    PIC 9(2).
               05  QSPC-RBMANAGER-9                   PIC 9(2).
               05  QSPC-RBUNITPER-CD-9                PIC X.
               05  QSPC-RBFRMLA2-9                    PIC X(2).
               05  QSPC-RBFRMLA-10                    PIC X(2).
               05  QSPC-RBDTE-10-1                    PIC X.
               05  QSPC-RBDAYS-10-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-10-1                 PIC 9(4).
               05  QSPC-RBDTE-10-2                    PIC X.
               05  QSPC-RBDAYS-10-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-10-2                 PIC 9(4).
               05  QSPC-RBMINRET-10                   PIC 9999V99.
               05  QSPC-RBNOMON-10                    PIC 9(2).
               05  QSPC-RBDEDCHG-10                   PIC 9999V99.
               05  QSPC-RBRECAST-10                   PIC 9(2).
               05  QSPC-RBEARLY-10                    PIC 9(2).
               05  QSPC-RBDEFER-10                    PIC 9(2).
               05  QSPC-RBPCT-10                      PIC 9(3)V9.
               05  QSPC-RBREDUC-10                    PIC 9(4)V99.
               05  QSPC-RBMIN-10                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-10                   PIC 9(2).
               05  QSPC-RBSPOPT2-10                   PIC 9(2).
               05  QSPC-RBMANAGER-10                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-10               PIC X.
               05  QSPC-RBFRMLA2-10                   PIC X(2).
               05  QSPC-RBFRMLA-11                    PIC X(2).
               05  QSPC-RBDTE-11-1                    PIC X.
               05  QSPC-RBDAYS-11-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-11-1                 PIC 9(4).
               05  QSPC-RBDTE-11-2                    PIC X.
               05  QSPC-RBDAYS-11-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-11-2                 PIC 9(4).
               05  QSPC-RBMINRET-11                   PIC 9999V99.
               05  QSPC-RBNOMON-11                    PIC 9(2).
               05  QSPC-RBDEDCHG-11                   PIC 9999V99.
               05  QSPC-RBRECAST-11                   PIC 9(2).
               05  QSPC-RBEARLY-11                    PIC 9(2).
               05  QSPC-RBDEFER-11                    PIC 9(2).
               05  QSPC-RBPCT-11                      PIC 9(3)V9.
               05  QSPC-RBREDUC-11                    PIC 9(4)V99.
               05  QSPC-RBMIN-11                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-11                   PIC 9(2).
               05  QSPC-RBSPOPT2-11                   PIC 9(2).
               05  QSPC-RBMANAGER-11                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-11               PIC X.
               05  QSPC-RBFRMLA2-11                   PIC X(2).
               05  QSPC-RBFRMLA-12                    PIC X(2).
               05  QSPC-RBDTE-12-1                    PIC X.
               05  QSPC-RBDAYS-12-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-12-1                 PIC 9(4).
               05  QSPC-RBDTE-12-2                    PIC X.
               05  QSPC-RBDAYS-12-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-12-2                 PIC 9(4).
               05  QSPC-RBMINRET-12                   PIC 9999V99.
               05  QSPC-RBNOMON-12                    PIC 9(2).
               05  QSPC-RBDEDCHG-12                   PIC 9999V99.
               05  QSPC-RBRECAST-12                   PIC 9(2).
               05  QSPC-RBEARLY-12                    PIC 9(2).
               05  QSPC-RBDEFER-12                    PIC 9(2).
               05  QSPC-RBPCT-12                      PIC 9(3)V9.
               05  QSPC-RBREDUC-12                    PIC 9(4)V99.
               05  QSPC-RBMIN-12                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-12                   PIC 9(2).
               05  QSPC-RBSPOPT2-12                   PIC 9(2).
               05  QSPC-RBMANAGER-12                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-12               PIC X.
               05  QSPC-RBFRMLA2-12                   PIC X(2).
               05  QSPC-RBFRMLA-13                    PIC X(2).
               05  QSPC-RBDTE-13-1                    PIC X.
               05  QSPC-RBDAYS-13-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-13-1                 PIC 9(4).
               05  QSPC-RBDTE-13-2                    PIC X.
               05  QSPC-RBDAYS-13-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-13-2                 PIC 9(4).
               05  QSPC-RBMINRET-13                   PIC 9999V99.
               05  QSPC-RBNOMON-13                    PIC 9(2).
               05  QSPC-RBDEDCHG-13                   PIC 9999V99.
               05  QSPC-RBRECAST-13                   PIC 9(2).
               05  QSPC-RBEARLY-13                    PIC 9(2).
               05  QSPC-RBDEFER-13                    PIC 9(2).
               05  QSPC-RBPCT-13                      PIC 9(3)V9.
               05  QSPC-RBREDUC-13                    PIC 9(4)V99.
               05  QSPC-RBMIN-13                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-13                   PIC 9(2).
               05  QSPC-RBSPOPT2-13                   PIC 9(2).
               05  QSPC-RBMANAGER-13                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-13               PIC X.
               05  QSPC-RBFRMLA2-13                   PIC X(2).
               05  QSPC-RBFRMLA-14                    PIC X(2).
               05  QSPC-RBDTE-14-1                    PIC X.
               05  QSPC-RBDAYS-14-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-14-1                 PIC 9(4).
               05  QSPC-RBDTE-14-2                    PIC X.
               05  QSPC-RBDAYS-14-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-14-2                 PIC 9(4).
               05  QSPC-RBMINRET-14                   PIC 9999V99.
               05  QSPC-RBNOMON-14                    PIC 9(2).
               05  QSPC-RBDEDCHG-14                   PIC 9999V99.
               05  QSPC-RBRECAST-14                   PIC 9(2).
               05  QSPC-RBEARLY-14                    PIC 9(2).
               05  QSPC-RBDEFER-14                    PIC 9(2).
               05  QSPC-RBPCT-14                      PIC 9(3)V9.
               05  QSPC-RBREDUC-14                    PIC 9(4)V99.
               05  QSPC-RBMIN-14                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-14                   PIC 9(2).
               05  QSPC-RBSPOPT2-14                   PIC 9(2).
               05  QSPC-RBMANAGER-14                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-14               PIC X.
               05  QSPC-RBFRMLA2-14                   PIC X(2).
               05  QSPC-RBFRMLA-15                    PIC X(2).
               05  QSPC-RBDTE-15-1                    PIC X.
               05  QSPC-RBDAYS-15-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-15-1                 PIC 9(4).
               05  QSPC-RBDTE-15-2                    PIC X.
               05  QSPC-RBDAYS-15-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-15-2                 PIC 9(4).
               05  QSPC-RBMINRET-15                   PIC 9999V99.
               05  QSPC-RBNOMON-15                    PIC 9(2).
               05  QSPC-RBDEDCHG-15                   PIC 9999V99.
               05  QSPC-RBRECAST-15                   PIC 9(2).
               05  QSPC-RBEARLY-15                    PIC 9(2).
               05  QSPC-RBDEFER-15                    PIC 9(2).
               05  QSPC-RBPCT-15                      PIC 9(3)V9.
               05  QSPC-RBREDUC-15                    PIC 9(4)V99.
               05  QSPC-RBMIN-15                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-15                   PIC 9(2).
               05  QSPC-RBSPOPT2-15                   PIC 9(2).
               05  QSPC-RBMANAGER-15                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-15               PIC X.
               05  QSPC-RBFRMLA2-15                   PIC X(2).
               05  QSPC-RBFRMLA-16                    PIC X(2).
               05  QSPC-RBDTE-16-1                    PIC X.
               05  QSPC-RBDAYS-16-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-16-1                 PIC 9(4).
               05  QSPC-RBDTE-16-2                    PIC X.
               05  QSPC-RBDAYS-16-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-16-2                 PIC 9(4).
               05  QSPC-RBMINRET-16                   PIC 9999V99.
               05  QSPC-RBNOMON-16                    PIC 9(2).
               05  QSPC-RBDEDCHG-16                   PIC 9999V99.
               05  QSPC-RBRECAST-16                   PIC 9(2).
               05  QSPC-RBEARLY-16                    PIC 9(2).
               05  QSPC-RBDEFER-16                    PIC 9(2).
               05  QSPC-RBPCT-16                      PIC 9(3)V9.
               05  QSPC-RBREDUC-16                    PIC 9(4)V99.
               05  QSPC-RBMIN-16                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-16                   PIC 9(2).
               05  QSPC-RBSPOPT2-16                   PIC 9(2).
               05  QSPC-RBMANAGER-16                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-16               PIC X.
               05  QSPC-RBFRMLA2-16                   PIC X(2).
               05  QSPC-RBFRMLA-17                    PIC X(2).
               05  QSPC-RBDTE-17-1                    PIC X.
               05  QSPC-RBDAYS-17-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-17-1                 PIC 9(4).
               05  QSPC-RBDTE-17-2                    PIC X.
               05  QSPC-RBDAYS-17-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-17-2                 PIC 9(4).
               05  QSPC-RBMINRET-17                   PIC 9999V99.
               05  QSPC-RBNOMON-17                    PIC 9(2).
               05  QSPC-RBDEDCHG-17                   PIC 9999V99.
               05  QSPC-RBRECAST-17                   PIC 9(2).
               05  QSPC-RBEARLY-17                    PIC 9(2).
               05  QSPC-RBDEFER-17                    PIC 9(2).
               05  QSPC-RBPCT-17                      PIC 9(3)V9.
               05  QSPC-RBREDUC-17                    PIC 9(4)V99.
               05  QSPC-RBMIN-17                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-17                   PIC 9(2).
               05  QSPC-RBSPOPT2-17                   PIC 9(2).
               05  QSPC-RBMANAGER-17                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-17               PIC X.
               05  QSPC-RBFRMLA2-17                   PIC X(2).
               05  QSPC-RBFRMLA-18                    PIC X(2).
               05  QSPC-RBDTE-18-1                    PIC X.
               05  QSPC-RBDAYS-18-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-18-1                 PIC 9(4).
               05  QSPC-RBDTE-18-2                    PIC X.
               05  QSPC-RBDAYS-18-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-18-2                 PIC 9(4).
               05  QSPC-RBMINRET-18                   PIC 9999V99.
               05  QSPC-RBNOMON-18                    PIC 9(2).
               05  QSPC-RBDEDCHG-18                   PIC 9999V99.
               05  QSPC-RBRECAST-18                   PIC 9(2).
               05  QSPC-RBEARLY-18                    PIC 9(2).
               05  QSPC-RBDEFER-18                    PIC 9(2).
               05  QSPC-RBPCT-18                      PIC 9(3)V9.
               05  QSPC-RBREDUC-18                    PIC 9(4)V99.
               05  QSPC-RBMIN-18                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-18                   PIC 9(2).
               05  QSPC-RBSPOPT2-18                   PIC 9(2).
               05  QSPC-RBMANAGER-18                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-18               PIC X.
               05  QSPC-RBFRMLA2-18                   PIC X(2).
               05  QSPC-RBFRMLA-19                    PIC X(2).
               05  QSPC-RBDTE-19-1                    PIC X.
               05  QSPC-RBDAYS-19-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-19-1                 PIC 9(4).
               05  QSPC-RBDTE-19-2                    PIC X.
               05  QSPC-RBDAYS-19-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-19-2                 PIC 9(4).
               05  QSPC-RBMINRET-19                   PIC 9999V99.
               05  QSPC-RBNOMON-19                    PIC 9(2).
               05  QSPC-RBDEDCHG-19                   PIC 9999V99.
               05  QSPC-RBRECAST-19                   PIC 9(2).
               05  QSPC-RBEARLY-19                    PIC 9(2).
               05  QSPC-RBDEFER-19                    PIC 9(2).
               05  QSPC-RBPCT-19                      PIC 9(3)V9.
               05  QSPC-RBREDUC-19                    PIC 9(4)V99.
               05  QSPC-RBMIN-19                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-19                   PIC 9(2).
               05  QSPC-RBSPOPT2-19                   PIC 9(2).
               05  QSPC-RBMANAGER-19                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-19               PIC X.
               05  QSPC-RBFRMLA2-19                   PIC X(2).
               05  QSPC-RBFRMLA-20                    PIC X(2).
               05  QSPC-RBDTE-20-1                    PIC X.
               05  QSPC-RBDAYS-20-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-20-1                 PIC 9(4).
               05  QSPC-RBDTE-20-2                    PIC X.
               05  QSPC-RBDAYS-20-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-20-2                 PIC 9(4).
               05  QSPC-RBMINRET-20                   PIC 9999V99.
               05  QSPC-RBNOMON-20                    PIC 9(2).
               05  QSPC-RBDEDCHG-20                   PIC 9999V99.
               05  QSPC-RBRECAST-20                   PIC 9(2).
               05  QSPC-RBEARLY-20                    PIC 9(2).
               05  QSPC-RBDEFER-20                    PIC 9(2).
               05  QSPC-RBPCT-20                      PIC 9(3)V9.
               05  QSPC-RBREDUC-20                    PIC 9(4)V99.
               05  QSPC-RBMIN-20                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-20                   PIC 9(2).
               05  QSPC-RBSPOPT2-20                   PIC 9(2).
               05  QSPC-RBMANAGER-20                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-20               PIC X.
               05  QSPC-RBFRMLA2-20                   PIC X(2).
               05  QSPC-RBFRMLA-21                    PIC X(2).
               05  QSPC-RBDTE-21-1                    PIC X.
               05  QSPC-RBDAYS-21-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-21-1                 PIC 9(4).
               05  QSPC-RBDTE-21-2                    PIC X.
               05  QSPC-RBDAYS-21-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-21-2                 PIC 9(4).
               05  QSPC-RBMINRET-21                   PIC 9999V99.
               05  QSPC-RBNOMON-21                    PIC 9(2).
               05  QSPC-RBDEDCHG-21                   PIC 9999V99.
               05  QSPC-RBRECAST-21                   PIC 9(2).
               05  QSPC-RBEARLY-21                    PIC 9(2).
               05  QSPC-RBDEFER-21                    PIC 9(2).
               05  QSPC-RBPCT-21                      PIC 9(3)V9.
               05  QSPC-RBREDUC-21                    PIC 9(4)V99.
               05  QSPC-RBMIN-21                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-21                   PIC 9(2).
               05  QSPC-RBSPOPT2-21                   PIC 9(2).
               05  QSPC-RBMANAGER-21                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-21               PIC X.
               05  QSPC-RBFRMLA2-21                   PIC X(2).
               05  QSPC-RBFRMLA-22                    PIC X(2).
               05  QSPC-RBDTE-22-1                    PIC X.
               05  QSPC-RBDAYS-22-1                   PIC 9(2).
               05  QSPC-RBYRTYPE-22-1                 PIC 9(4).
               05  QSPC-RBDTE-22-2                    PIC X.
               05  QSPC-RBDAYS-22-2                   PIC 9(2).
               05  QSPC-RBYRTYPE-22-2                 PIC 9(4).
               05  QSPC-RBMINRET-22                   PIC 9999V99.
               05  QSPC-RBNOMON-22                    PIC 9(2).
               05  QSPC-RBDEDCHG-22                   PIC 9999V99.
               05  QSPC-RBRECAST-22                   PIC 9(2).
               05  QSPC-RBEARLY-22                    PIC 9(2).
               05  QSPC-RBDEFER-22                    PIC 9(2).
               05  QSPC-RBPCT-22                      PIC 9(3)V9.
               05  QSPC-RBREDUC-22                    PIC 9(4)V99.
               05  QSPC-RBMIN-22                      PIC 9(4)V99.
               05  QSPC-RBSPOPT1-22                   PIC 9(2).
               05  QSPC-RBSPOPT2-22                   PIC 9(2).
               05  QSPC-RBMANAGER-22                  PIC 9(2).
               05  QSPC-RBUNITPER-CD-22               PIC X.
               05  QSPC-RBFRMLA2-22                   PIC X(2).
               05  QSPC-RBCOMCD                       PIC X.
               05  QSPC-ADDON-DISFRMLA                PIC X.
               05  QSPC-ADDON-WHOLE-FG                PIC X.
               05  QSPC-ADDON-ORG-MATURITY            PIC X.
               05  QSPC-CONSOLIDATE-RT-FG             PIC X.
               05  QSPC-1STPY-ADDON-DAYS              PIC 9(3).
               05  QSPC-1STPY-ADDON-YRTYPE            PIC 9(3).
               05  QSPC-ADDON-RATE-FG                 PIC X.
               05  QSPC-ADDON-RATE                    PIC 999V999.
               05  QSPC-FEEFRMLA-1                    PIC X.
               05  QSPC-FEECD-1                       PIC XX.
               05  QSPC-FEEID-1                       PIC X(7).
               05  QSPC-FEEFRMLA-2                    PIC X.
               05  QSPC-FEECD-2                       PIC XX.
               05  QSPC-FEEID-2                       PIC X(7).
               05  QSPC-ROUND-PAY-FG                  PIC X.
               05  QSPC-IRREGULAR-PAY-FG              PIC X.
               05  QSPC-DLRVCHGS-RB-CD-1              PIC X.
               05  QSPC-DLRVCHGS-RB-CD-2              PIC X.
               05  QSPC-DLRVCHGS-RB-CD-3              PIC X.
               05  QSPC-PARVHELD-RB-CD                PIC X.
               05  QSPC-PARVPAID-RB-CD                PIC X.
               05  QSPC-CONTR-CREDIT                  PIC 99V99.
               05  QSPC-CONTR-CREDIT-CD               PIC X.
               05  QSPC-CONTR-CREDIT-MIN-DEL-PER      PIC 999V9.
               05  QSPC-OPT-CAL-CHGABLE               PIC X.
               05  QSPC-PBDEL-DAYS                    PIC S999.
               05  QSPC-PBINCR-PERCENT                PIC 999.
               05  QSPC-CPOT30-CD                     PIC X.
               05  QSPC-CPOTCHGOFF-CD                 PIC X.
               05  QSPC-RDPOT30-CD                    PIC X.
               05  QSPC-RDPOTCHGOFF-CD                PIC X.
               05  QSPC-MAX-ALLOW-DELINQ              PIC 99.
               05  QSPC-RESCIND-BUS-DAYS              PIC X.
               05  QSPC-RESCIND-SATURDAY              PIC X.
               05  QSPC-MIN-CREDIT-SCORE              PIC 9(4).
               05  QSPC-DUAL-IN-BRANCH                PIC X.
               05  QSPC-DUAL-IN-STATE                 PIC X.
               05  QSPC-PACESETTER-FG                 PIC X.
               05  QSPC-WAGE-ASSIGN-DAYS              PIC 99.
               05  QSPC-CAL-PAYMENT-ROUND-FG          PIC X.
               05  QSPC-CAN-LOANS-FG                  PIC X.
               05  QSPC-ALLOW-DELINQ-POLCD            PIC X.
               05  QSPC-YTD-MAX-ALLOW-DELINQ          PIC 99.
               05  QSPC-LNCOST-FRMLA                  PIC X.
               05  QSPC-LNCOST-AMT                    PIC 9(7)V99.
               05  QSPC-DLDISC-RVPRIN1-PCNT           PIC 9(3)V99.
               05  QSPC-RENEWABLE-PAYS                PIC S9(4).
               05  QSPC-RENEWABLE-DAYS                PIC S9(4).
               05  QSPC-ALLOW-LN-BACK-DATE            PIC X.
               05  QSPC-DLDISC-RVPRIN1-AF-PCNT        PIC 9(3)V99.
               05  QSPC-CAL-MAX-AT-ESTIMATE           PIC X.
               05  QSPC-INSAH-RETRO                   PIC X.
               05  QSPC-INSAH-DAYS-WAIT               PIC XX.
               05  QSPC-ADDON-EXCEPT-FG               PIC X.
               05  QSPC-REPO-TRCD-1                   PIC X(02).
               05  QSPC-REPO-FMNO-1-1                 PIC 9(03).
               05  QSPC-REPO-FMNO-1-2                 PIC 9(03).
               05  QSPC-REPO-FMNO-1-3                 PIC 9(03).
               05  QSPC-REPO-FMNO-1-4                 PIC 9(03).
               05  QSPC-REPO-TRCD-2                   PIC X(02).
               05  QSPC-REPO-FMNO-2-1                 PIC 9(03).
               05  QSPC-REPO-FMNO-2-2                 PIC 9(03).
               05  QSPC-REPO-FMNO-2-3                 PIC 9(03).
               05  QSPC-REPO-FMNO-2-4                 PIC 9(03).
               05  QSPC-REPO-TRCD-3                   PIC X(02).
               05  QSPC-REPO-FMNO-3-1                 PIC 9(03).
               05  QSPC-REPO-FMNO-3-2                 PIC 9(03).
               05  QSPC-REPO-FMNO-3-3                 PIC 9(03).
               05  QSPC-REPO-FMNO-3-4                 PIC 9(03).
               05  QSPC-CANCEL-ADDON-FG               PIC X.
               05  QSPC-DEFAULT-O2-INS-COMP           PIC 9(2).
               05  QSPC-LC-ON-JUDGEMENTS              PIC X.
               05  QSPC-DELQ-IB-AGE                   PIC 999.
               05  QSPC-DELQ-IB-MAX-DAYS              PIC 999.
               05  QSPC-INSURANCE-WRITTEN             PIC X.
               05  QSPC-INTERIM-COUPON                PIC X.
               05  QSPC-AUTO-ASSESS-LCHG              PIC X.
               05  QSPC-MAX-CASH-PROCEEDS             PIC 9(6)V99.
               05  QSPC-ALLOW-ZERO-PROC               PIC X.
               05  QSPC-BANKRULE-RATE                 PIC 9(4).
               05  QSPC-AUTO-SEND-TRCD-1              PIC X(02).
               05  QSPC-AUTO-SEND-FMNO-1-1            PIC 9(03).
               05  QSPC-AUTO-SEND-FMNO-1-2            PIC 9(03).
               05  QSPC-AUTO-SEND-FMNO-1-3            PIC 9(03).
               05  QSPC-AUTO-SEND-FMNO-1-4            PIC 9(03).
               05  QSPC-AUTO-SEND-TRCD-2              PIC X(02).
               05  QSPC-AUTO-SEND-FMNO-2-1            PIC 9(03).
               05  QSPC-AUTO-SEND-FMNO-2-2            PIC 9(03).
               05  QSPC-AUTO-SEND-FMNO-2-3            PIC 9(03).
               05  QSPC-AUTO-SEND-FMNO-2-4            PIC 9(03).
               05  QSPC-DLDISC-CONV-BF-PCNT           PIC 999V999.
               05  QSPC-UNITPER-CD                    PIC X.
               05  QSPC-RENEWAL-EDIT                  PIC X.
               05  QSPC-ROUND-MFEE                    PIC X.
               05  QSPC-ADV-TO-1ST-NO-CORR            PIC X.
               05  QSPC-LC-INT-ON-REPO-NON-PL         PIC X.
               05  QSPC-CONTRACTUAL-SET-NONACCRUAL    PIC 9(3).
               05  QSPC-CONTRACTUAL-RESET-ACCRUAL     PIC 9(3).
               05  QSPC-MONTHS-PAY-NAPP-COUNTER       PIC 99.
               05  QSPC-SHORT-PAY-THRESHOLD           PIC 9(3).
               05  QSPC-CASH-AVAIL-PERCENT            PIC 99.
               05  QSPC-O1-JOINT-FG                   PIC X.
               05  QSPC-NET-BAL-REQ                   PIC S9(3).
               05  QSPC-AMT-PROCEEDS-REQ              PIC S9(7).
               05  QSPC-ALT-PREPAY-MONTHS             PIC 9(2).
               05  QSPC-PERCENT-REGPAY-AVAIL          PIC 9(3).
               05  QSPC-ALT-DEFFRMLA                  PIC 99.
               05  QSPC-ALT-DEFMIN                    PIC 99V99.
               05  QSPC-ALT-DEFMAX                    PIC 9999V99.
               05  QSPC-NON-LOAN-FLAG                 PIC X.
               05  QSPC-SKIP-TRW                      PIC X.

       EXEC SQL END DECLARE SECTION END-EXEC.
