      * COPYMEMBER: LIBLP/LP01TY_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL - TODAYS TOTALS STATTISTICS FILE
      *
      *=================================================================
      * REV:
      * BLM 2021-0503 ***NEW***
      *
      ******************************************************************
      *- - -{GREATER CURSOR FOR START-GREATER & READ-NEXT}
       01  TY1-CURSOR-STAT              PIC X(2) VALUE SPACES.
           88  TY1-CURSOR-STAT-GOOD              VALUE "00".
           88  TY1-CURSOR-STAT-BAD               VALUE "  " THRU "//"
                                                       "01" THRU "~~".

       EXEC SQL BEGIN DECLARE SECTION END-EXEC.

       01  TY1-RETURN-CODE                PIC S9(4)   COMP-5.

       01  QTY1-WHERE-BEG-KEY.
           03  QTY1-WBEG-BRNO             PIC 9(4).
           03  QTY1-WBEG-DATE             PIC X(10).
           03  QTY1-WBEG-CLASS            PIC 9(03).

       01  QTY1-WHERE-END-KEY.
           03  QTY1-WEND-BRNO             PIC 9(4).
           03  QTY1-WEND-DATE             PIC X(10).
           03  QTY1-WEND-CLASS           PIC 9(03).

 
       01  QTY-REC.
           03  QTY-BRNO             PIC 9(4).
           03  QTY-DATE             PIC X(10).
           03  QTY-CLASS            PIC 9(3).
           03  QTY-LTOUCH-DATE      PIC X(10).
           03  QTY-NO-1-1              PIC S9(5).
           03  QTY-AMT-1-1             PIC S9(8)V99.
           03  QTY-O2-1-1              PIC S9(8)V99.
           03  QTY-INT-1-1             PIC S9(8)V99.
           03  QTY-NO-1-2              PIC S9(5).
           03  QTY-AMT-1-2             PIC S9(8)V99.
           03  QTY-O2-1-2              PIC S9(8)V99.
           03  QTY-INT-1-2             PIC S9(8)V99.
           03  QTY-NO-1-3              PIC S9(5).
           03  QTY-AMT-1-3             PIC S9(8)V99.
           03  QTY-O2-1-3              PIC S9(8)V99.
           03  QTY-INT-1-3             PIC S9(8)V99.
           03  QTY-NO-1-4              PIC S9(5).
           03  QTY-AMT-1-4             PIC S9(8)V99.
           03  QTY-O2-1-4              PIC S9(8)V99.
           03  QTY-INT-1-4             PIC S9(8)V99.
           03  QTY-NO-1-5              PIC S9(5).
           03  QTY-AMT-1-5             PIC S9(8)V99.
           03  QTY-O2-1-5              PIC S9(8)V99.
           03  QTY-INT-1-5             PIC S9(8)V99.
           03  QTY-NO-1-6              PIC S9(5).
           03  QTY-AMT-1-6             PIC S9(8)V99.
           03  QTY-O2-1-6              PIC S9(8)V99.
           03  QTY-INT-1-6             PIC S9(8)V99.
           03  QTY-NO-1-7              PIC S9(5).
           03  QTY-AMT-1-7             PIC S9(8)V99.
           03  QTY-O2-1-7              PIC S9(8)V99.
           03  QTY-INT-1-7             PIC S9(8)V99.
           03  QTY-NO-1-8              PIC S9(5).
           03  QTY-AMT-1-8             PIC S9(8)V99.
           03  QTY-O2-1-8              PIC S9(8)V99.
           03  QTY-INT-1-8             PIC S9(8)V99.
           03  QTY-NO-1-9              PIC S9(5).
           03  QTY-AMT-1-9             PIC S9(8)V99.
           03  QTY-O2-1-9              PIC S9(8)V99.
           03  QTY-INT-1-9             PIC S9(8)V99.
           03  QTY-NO-1-10             PIC S9(5).
           03  QTY-AMT-1-10            PIC S9(8)V99.
           03  QTY-O2-1-10             PIC S9(8)V99.
           03  QTY-INT-1-10            PIC S9(8)V99.
           03  QTY-NO-1-11             PIC S9(5).
           03  QTY-AMT-1-11            PIC S9(8)V99.
           03  QTY-O2-1-11             PIC S9(8)V99.
           03  QTY-INT-1-11            PIC S9(8)V99.
           03  QTY-NO-2-1              PIC S9(5).
           03  QTY-AMT-2-1             PIC S9(8)V99.
           03  QTY-O2-2-1              PIC S9(8)V99.
           03  QTY-INT-2-1             PIC S9(8)V99.
           03  QTY-NO-2-2              PIC S9(5).
           03  QTY-AMT-2-2             PIC S9(8)V99.
           03  QTY-O2-2-2              PIC S9(8)V99.
           03  QTY-INT-2-2             PIC S9(8)V99.
           03  QTY-NO-2-3              PIC S9(5).
           03  QTY-AMT-2-3             PIC S9(8)V99.
           03  QTY-O2-2-3              PIC S9(8)V99.
           03  QTY-INT-2-3             PIC S9(8)V99.
           03  QTY-NO-2-4              PIC S9(5).
           03  QTY-AMT-2-4             PIC S9(8)V99.
           03  QTY-O2-2-4              PIC S9(8)V99.
           03  QTY-INT-2-4             PIC S9(8)V99.
           03  QTY-NO-2-5              PIC S9(5).
           03  QTY-AMT-2-5             PIC S9(8)V99.
           03  QTY-O2-2-5              PIC S9(8)V99.
           03  QTY-INT-2-5             PIC S9(8)V99.
           03  QTY-NO-2-6              PIC S9(5).
           03  QTY-AMT-2-6             PIC S9(8)V99.
           03  QTY-O2-2-6              PIC S9(8)V99.
           03  QTY-INT-2-6             PIC S9(8)V99.
           03  QTY-NO-2-7              PIC S9(5).
           03  QTY-AMT-2-7             PIC S9(8)V99.
           03  QTY-O2-2-7              PIC S9(8)V99.
           03  QTY-INT-2-7             PIC S9(8)V99.
           03  QTY-NO-2-8              PIC S9(5).
           03  QTY-AMT-2-8             PIC S9(8)V99.
           03  QTY-O2-2-8              PIC S9(8)V99.
           03  QTY-INT-2-8             PIC S9(8)V99.
           03  QTY-NO-2-9              PIC S9(5).
           03  QTY-AMT-2-9             PIC S9(8)V99.
           03  QTY-O2-2-9              PIC S9(8)V99.
           03  QTY-INT-2-9             PIC S9(8)V99.
           03  QTY-NO-2-10             PIC S9(5).
           03  QTY-AMT-2-10            PIC S9(8)V99.
           03  QTY-O2-2-10             PIC S9(8)V99.
           03  QTY-INT-2-10            PIC S9(8)V99.
           03  QTY-NO-2-11             PIC S9(5).
           03  QTY-AMT-2-11            PIC S9(8)V99.
           03  QTY-O2-2-11             PIC S9(8)V99.
           03  QTY-INT-2-11            PIC S9(8)V99.
           03  QTY-NO-REPO-1-1         PIC S9(5).
           03  QTY-AMT-REPO-1-1        PIC S9(8)V99.
           03  QTY-O2-REPO-1-1         PIC S9(8)V99.
           03  QTY-INT-REPO-1-1        PIC S9(8)V99.
           03  QTY-NO-REPO-1-2         PIC S9(5).
           03  QTY-AMT-REPO-1-2        PIC S9(8)V99.
           03  QTY-O2-REPO-1-2         PIC S9(8)V99.
           03  QTY-INT-REPO-1-2        PIC S9(8)V99.
           03  QTY-NO-REPO-1-3         PIC S9(5).
           03  QTY-AMT-REPO-1-3        PIC S9(8)V99.
           03  QTY-O2-REPO-1-3         PIC S9(8)V99.
           03  QTY-INT-REPO-1-3        PIC S9(8)V99.
           03  QTY-NO-REPO-1-4         PIC S9(5).
           03  QTY-AMT-REPO-1-4        PIC S9(8)V99.
           03  QTY-O2-REPO-1-4         PIC S9(8)V99.
           03  QTY-INT-REPO-1-4        PIC S9(8)V99.
           03  QTY-NO-REPO-1-5         PIC S9(5).
           03  QTY-AMT-REPO-1-5        PIC S9(8)V99.
           03  QTY-O2-REPO-1-5         PIC S9(8)V99.
           03  QTY-INT-REPO-1-5        PIC S9(8)V99.
           03  QTY-NO-REPO-2-1         PIC S9(5).
           03  QTY-AMT-REPO-2-1        PIC S9(8)V99.
           03  QTY-O2-REPO-2-1         PIC S9(8)V99.
           03  QTY-INT-REPO-2-1        PIC S9(8)V99.
           03  QTY-NO-REPO-2-2         PIC S9(5).
           03  QTY-AMT-REPO-2-2        PIC S9(8)V99.
           03  QTY-O2-REPO-2-2         PIC S9(8)V99.
           03  QTY-INT-REPO-2-2        PIC S9(8)V99.
           03  QTY-NO-REPO-2-3         PIC S9(5).
           03  QTY-AMT-REPO-2-3        PIC S9(8)V99.
           03  QTY-O2-REPO-2-3         PIC S9(8)V99.
           03  QTY-INT-REPO-2-3        PIC S9(8)V99.
           03  QTY-NO-REPO-2-4         PIC S9(5).
           03  QTY-AMT-REPO-2-4        PIC S9(8)V99.
           03  QTY-O2-REPO-2-4         PIC S9(8)V99.
           03  QTY-INT-REPO-2-4        PIC S9(8)V99.
           03  QTY-NO-REPO-2-5         PIC S9(5).
           03  QTY-AMT-REPO-2-5        PIC S9(8)V99.
           03  QTY-O2-REPO-2-5         PIC S9(8)V99.
           03  QTY-INT-REPO-2-5        PIC S9(8)V99.
           03  QTY-NO-PL-1-1          PIC S9(5).
           03  QTY-AMT-PL-1-1         PIC S9(8)V99.
           03  QTY-O2-PL-1-1          PIC S9(8)V99.
           03  QTY-INT-PL-1-1         PIC S9(8)V99.
           03  QTY-NO-PL-1-2          PIC S9(5).
           03  QTY-AMT-PL-1-2         PIC S9(8)V99.
           03  QTY-O2-PL-1-2          PIC S9(8)V99.
           03  QTY-INT-PL-1-2         PIC S9(8)V99.
           03  QTY-NO-PL-1-3          PIC S9(5).
           03  QTY-AMT-PL-1-3         PIC S9(8)V99.
           03  QTY-O2-PL-1-3          PIC S9(8)V99.
           03  QTY-INT-PL-1-3         PIC S9(8)V99.
           03  QTY-NO-PL-1-4          PIC S9(5).
           03  QTY-AMT-PL-1-4         PIC S9(8)V99.
           03  QTY-O2-PL-1-4          PIC S9(8)V99.
           03  QTY-INT-PL-1-4         PIC S9(8)V99.
           03  QTY-NO-PL-1-5          PIC S9(5).
           03  QTY-AMT-PL-1-5         PIC S9(8)V99.
           03  QTY-O2-PL-1-5          PIC S9(8)V99.
           03  QTY-INT-PL-1-5         PIC S9(8)V99.
           03  QTY-NO-PL-1-6          PIC S9(5).
           03  QTY-AMT-PL-1-6         PIC S9(8)V99.
           03  QTY-O2-PL-1-6          PIC S9(8)V99.
           03  QTY-INT-PL-1-6         PIC S9(8)V99.
           03  QTY-NO-PL-1-7          PIC S9(5).
           03  QTY-AMT-PL-1-7         PIC S9(8)V99.
           03  QTY-O2-PL-1-7          PIC S9(8)V99.
           03  QTY-INT-PL-1-7         PIC S9(8)V99.
           03  QTY-NO-PL-1-8          PIC S9(5).
           03  QTY-AMT-PL-1-8         PIC S9(8)V99.
           03  QTY-O2-PL-1-8          PIC S9(8)V99.
           03  QTY-INT-PL-1-8         PIC S9(8)V99.
           03  QTY-NO-PL-1-9          PIC S9(5).
           03  QTY-AMT-PL-1-9         PIC S9(8)V99.
           03  QTY-O2-PL-1-9          PIC S9(8)V99.
           03  QTY-INT-PL-1-9         PIC S9(8)V99.
           03  QTY-NO-PL-1-10         PIC S9(5).
           03  QTY-AMT-PL-1-10        PIC S9(8)V99.
           03  QTY-O2-PL-1-10         PIC S9(8)V99.
           03  QTY-INT-PL-1-10        PIC S9(8)V99.
           03  QTY-NO-PL-2-1          PIC S9(5).
           03  QTY-AMT-PL-2-1         PIC S9(8)V99.
           03  QTY-O2-PL-2-1          PIC S9(8)V99.
           03  QTY-INT-PL-2-1         PIC S9(8)V99.
           03  QTY-NO-PL-2-2          PIC S9(5).
           03  QTY-AMT-PL-2-2         PIC S9(8)V99.
           03  QTY-O2-PL-2-2          PIC S9(8)V99.
           03  QTY-INT-PL-2-2         PIC S9(8)V99.
           03  QTY-NO-PL-2-3          PIC S9(5).
           03  QTY-AMT-PL-2-3         PIC S9(8)V99.
           03  QTY-O2-PL-2-3          PIC S9(8)V99.
           03  QTY-INT-PL-2-3         PIC S9(8)V99.
           03  QTY-NO-PL-2-4          PIC S9(5).
           03  QTY-AMT-PL-2-4         PIC S9(8)V99.
           03  QTY-O2-PL-2-4          PIC S9(8)V99.
           03  QTY-INT-PL-2-4         PIC S9(8)V99.
           03  QTY-NO-PL-2-5          PIC S9(5).
           03  QTY-AMT-PL-2-5         PIC S9(8)V99.
           03  QTY-O2-PL-2-5          PIC S9(8)V99.
           03  QTY-INT-PL-2-5         PIC S9(8)V99.
           03  QTY-NO-PL-2-6          PIC S9(5).
           03  QTY-AMT-PL-2-6         PIC S9(8)V99.
           03  QTY-O2-PL-2-6          PIC S9(8)V99.
           03  QTY-INT-PL-2-6         PIC S9(8)V99.
           03  QTY-NO-PL-2-7          PIC S9(5).
           03  QTY-AMT-PL-2-7         PIC S9(8)V99.
           03  QTY-O2-PL-2-7          PIC S9(8)V99.
           03  QTY-INT-PL-2-7         PIC S9(8)V99.
           03  QTY-NO-PL-2-8          PIC S9(5).
           03  QTY-AMT-PL-2-8         PIC S9(8)V99.
           03  QTY-O2-PL-2-8          PIC S9(8)V99.
           03  QTY-INT-PL-2-8         PIC S9(8)V99.
           03  QTY-NO-PL-2-9          PIC S9(5).
           03  QTY-AMT-PL-2-9         PIC S9(8)V99.
           03  QTY-O2-PL-2-9          PIC S9(8)V99.
           03  QTY-INT-PL-2-9         PIC S9(8)V99.
           03  QTY-NO-PL-2-10         PIC S9(5).
           03  QTY-AMT-PL-2-10        PIC S9(8)V99.
           03  QTY-O2-PL-2-10         PIC S9(8)V99.
           03  QTY-INT-PL-2-10        PIC S9(8)V99.
           03  QTY-DLRVPRIN-1-1         PIC S9(8)V99.
           03  QTY-DLRVPRIN-1-2         PIC S9(8)V99.
           03  QTY-DLRVPRIN-1-3         PIC S9(8)V99.
           03  QTY-DLRVCHGS-1-1         PIC S9(8)V99.
           03  QTY-DLRVCHGS-1-2         PIC S9(8)V99.
           03  QTY-DLRVCHGS-1-3         PIC S9(8)V99.
           03  QTY-DLPARVHELD-1         PIC S9(8)V99.
           03  QTY-DLRVPRIN-2-1         PIC S9(8)V99.
           03  QTY-DLRVPRIN-2-2         PIC S9(8)V99.
           03  QTY-DLRVPRIN-2-3         PIC S9(8)V99.
           03  QTY-DLRVCHGS-2-1         PIC S9(8)V99.
           03  QTY-DLRVCHGS-2-2         PIC S9(8)V99.
           03  QTY-DLRVCHGS-2-3         PIC S9(8)V99.
           03  QTY-DLPARVHELD-2         PIC S9(8)V99.
           03  QTY-PL-PRINCOL-1      PIC S9(8)V99.
           03  QTY-PL-INTCOL-1       PIC S9(8)V99.
           03  QTY-PL-LATECOL-1      PIC S9(8)V99.
           03  QTY-PL-O2COL-1        PIC S9(8)V99.
           03  QTY-PL-PRINCOL-2      PIC S9(8)V99.
           03  QTY-PL-INTCOL-2       PIC S9(8)V99.
           03  QTY-PL-LATECOL-2      PIC S9(8)V99.
           03  QTY-PL-O2COL-2        PIC S9(8)V99.
           03  QTY-PL-PRINCOL-3      PIC S9(8)V99.
           03  QTY-PL-INTCOL-3       PIC S9(8)V99.
           03  QTY-PL-LATECOL-3      PIC S9(8)V99.
           03  QTY-PL-O2COL-3        PIC S9(8)V99.
           03  QTY-PL-PRINCOL-4      PIC S9(8)V99.
           03  QTY-PL-INTCOL-4       PIC S9(8)V99.
           03  QTY-PL-LATECOL-4      PIC S9(8)V99.
           03  QTY-PL-O2COL-4        PIC S9(8)V99.
           03  QTY-PL-PRINCOL-5      PIC S9(8)V99.
           03  QTY-PL-INTCOL-5       PIC S9(8)V99.
           03  QTY-PL-LATECOL-5      PIC S9(8)V99.
           03  QTY-PL-O2COL-5        PIC S9(8)V99.
           03  QTY-AMT-SOLD            PIC S9(8)V99.
           03  QTY-AMT-TRANS           PIC S9(8)V99.
           03  QTY-AMT-PURCH           PIC S9(8)V99.
           03  QTY-NO-SOLD             PIC S9(5).
           03  QTY-NO-TRANS            PIC S9(5).
           03  QTY-NO-PURCH            PIC S9(5).
           03  QTY-OTHCOL              PIC S9(8)V99.
           03  QTY-OT2COL              PIC S9(8)V99.
           03  QTY-INTCOL              PIC S9(8)V99.
           03  QTY-LATECOL             PIC S9(8)V99.
           03  QTY-PRINCOL             PIC S9(8)V99.
           03  QTY-DEFCOL              PIC S9(8)V99.
           03  QTY-RNPRIN              PIC S9(8)V99.
           03  QTY-INTREB              PIC S9(8)V99.
           03  QTY-CLREB1              PIC S9(8)V99.
           03  QTY-CLREB2              PIC S9(8)V99.
           03  QTY-CLREB3              PIC S9(8)V99.
           03  QTY-CLREB4              PIC S9(8)V99.
           03  QTY-AHREB               PIC S9(8)V99.
           03  QTY-PPREB               PIC S9(8)V99.
           03  QTY-O1REB               PIC S9(8)V99.
           03  QTY-O2REB               PIC S9(8)V99.
           03  QTY-O3REB               PIC S9(8)V99.
           03  QTY-O4REB               PIC S9(8)V99.
           03  QTY-O5REB               PIC S9(8)V99.
           03  QTY-O6REB               PIC S9(8)V99.
           03  QTY-O7REB               PIC S9(8)V99.
           03  QTY-SCREB               PIC S9(8)V99.
           03  QTY-MFREB               PIC S9(8)V99.
           03  QTY-DFREB               PIC S9(8)V99.
           03  QTY-UN7-REB             PIC S9(8)V99.
           03  QTY-UN8-REB             PIC S9(8)V99.
           03  QTY-UN9-REB             PIC S9(8)V99.
           03  QTY-UN10-REB            PIC S9(8)V99.
           03  QTY-PART-CHGOFF         PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-1       PIC S9(6).
           03  QTY-INS-NO-WROTE-1      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-1   PIC S9(6).
           03  QTY-INS-AMT-WROTE-1     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-2       PIC S9(6).
           03  QTY-INS-NO-WROTE-2      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-2   PIC S9(6).
           03  QTY-INS-AMT-WROTE-2     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-3       PIC S9(6).
           03  QTY-INS-NO-WROTE-3      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-3   PIC S9(6).
           03  QTY-INS-AMT-WROTE-3     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-4       PIC S9(6).
           03  QTY-INS-NO-WROTE-4      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-4   PIC S9(6).
           03  QTY-INS-AMT-WROTE-4     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-5       PIC S9(6).
           03  QTY-INS-NO-WROTE-5      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-5   PIC S9(6).
           03  QTY-INS-AMT-WROTE-5     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-6       PIC S9(6).
           03  QTY-INS-NO-WROTE-6      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-6   PIC S9(6).
           03  QTY-INS-AMT-WROTE-6     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-7       PIC S9(6).
           03  QTY-INS-NO-WROTE-7      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-7   PIC S9(6).
           03  QTY-INS-AMT-WROTE-7     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-8       PIC S9(6).
           03  QTY-INS-NO-WROTE-8      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-8   PIC S9(6).
           03  QTY-INS-AMT-WROTE-8     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-9       PIC S9(6).
           03  QTY-INS-NO-WROTE-9      PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-9   PIC S9(6).
           03  QTY-INS-AMT-WROTE-9     PIC S9(8)V99.
           03  QTY-INS-NO-ELIG-10      PIC S9(6).
           03  QTY-INS-NO-WROTE-10     PIC S9(6).
           03  QTY-INS-NO-NOTWROTE-10  PIC S9(6).
           03  QTY-INS-AMT-WROTE-10    PIC S9(8)V99.
           03  QTY-FEE-NO-ELIG-1       PIC S9(6).
           03  QTY-FEE-NO-WROTE-1      PIC S9(6).
           03  QTY-FEE-NO-NOTWROTE-1   PIC S9(6).
           03  QTY-FEE-AMT-WROTE-1     PIC S9(8)V99.
           03  QTY-FEE-NO-ELIG-2       PIC S9(6).
           03  QTY-FEE-NO-WROTE-2      PIC S9(6).
           03  QTY-FEE-NO-NOTWROTE-2   PIC S9(6).
           03  QTY-FEE-AMT-WROTE-2     PIC S9(8)V99.
           03  QTY-FEE-NO-ELIG-3       PIC S9(6).
           03  QTY-FEE-NO-WROTE-3      PIC S9(6).
           03  QTY-FEE-NO-NOTWROTE-3   PIC S9(6).
           03  QTY-FEE-AMT-WROTE-3     PIC S9(8)V99.
           03  QTY-OTH-NO-COL          PIC S9(6).
           03  QTY-OT2-NO-COL          PIC S9(6).
           03  QTY-INT-NO-COL          PIC S9(6).
           03  QTY-LATE-NO-COL         PIC S9(6).
           03  QTY-OTH-NO-WAIVED       PIC S9(6).
           03  QTY-OT2-NO-WAIVED       PIC S9(6).
           03  QTY-INT-NO-WAIVED       PIC S9(6).
           03  QTY-LATE-NO-WAIVED      PIC S9(6).
           03  QTY-OTH-AMT-WAIVED      PIC S9(8)V99.
           03  QTY-OT2-AMT-WAIVED      PIC S9(8)V99.
           03  QTY-INT-AMT-WAIVED      PIC S9(8)V99.
           03  QTY-LATE-AMT-WAIVED     PIC S9(8)V99.
           03  QTY-CKWRITTEN-1         PIC S9(7)V99.
           03  QTY-CKWRITTEN-2         PIC S9(7)V99.
           03  QTY-CKWRITTEN-3         PIC S9(7)V99.
           03  QTY-CKWRITTEN-4         PIC S9(7)V99.
           03  QTY-CKWRITTEN-5         PIC S9(7)V99.
           03  QTY-CKWRITTEN-6         PIC S9(7)V99.
           03  QTY-CKWRITTEN-7         PIC S9(7)V99.
           03  QTY-CKWRITTEN-8         PIC S9(7)V99.
           03  QTY-CKWRITTEN-9         PIC S9(7)V99.
           03  QTY-CKWRITTEN-10        PIC S9(7)V99.
           03  QTY-CKWRITTEN-11        PIC S9(7)V99.
           03  QTY-CKWRITTEN-12        PIC S9(7)V99.
           03  QTY-CKWRITTEN-13        PIC S9(7)V99.
           03  QTY-CKWRITTEN-14        PIC S9(7)V99.
           03  QTY-CKWRITTEN-15        PIC S9(7)V99.
           03  QTY-CKWRITTEN-16        PIC S9(7)V99.
           03  QTY-UNITS-1-1           PIC S9(7).
           03  QTY-OUTBAL-1-1          PIC S9(9)V99.
           03  QTY-UNITS-1-2           PIC S9(7).
           03  QTY-OUTBAL-1-2          PIC S9(9)V99.
           03  QTY-UNITS-1-3           PIC S9(7).
           03  QTY-OUTBAL-1-3          PIC S9(9)V99.
           03  QTY-UNITS-1-4           PIC S9(7).
           03  QTY-OUTBAL-1-4          PIC S9(9)V99.
           03  QTY-UNITS-1-5           PIC S9(7).
           03  QTY-OUTBAL-1-5          PIC S9(9)V99.
           03  QTY-UNITS-1-6           PIC S9(7).
           03  QTY-OUTBAL-1-6          PIC S9(9)V99.
           03  QTY-UNITS-1-7           PIC S9(7).
           03  QTY-OUTBAL-1-7          PIC S9(9)V99.
           03  QTY-UNITS-1-8           PIC S9(7).
           03  QTY-OUTBAL-1-8          PIC S9(9)V99.
           03  QTY-UNITS-1-9           PIC S9(7).
           03  QTY-OUTBAL-1-9          PIC S9(9)V99.
           03  QTY-UNITS-1-10          PIC S9(7).
           03  QTY-OUTBAL-1-10         PIC S9(9)V99.
           03  QTY-UNITS-2-1           PIC S9(7).
           03  QTY-OUTBAL-2-1          PIC S9(9)V99.
           03  QTY-UNITS-2-2           PIC S9(7).
           03  QTY-OUTBAL-2-2          PIC S9(9)V99.
           03  QTY-UNITS-2-3           PIC S9(7).
           03  QTY-OUTBAL-2-3          PIC S9(9)V99.
           03  QTY-UNITS-2-4           PIC S9(7).
           03  QTY-OUTBAL-2-4          PIC S9(9)V99.
           03  QTY-UNITS-2-5           PIC S9(7).
           03  QTY-OUTBAL-2-5          PIC S9(9)V99.
           03  QTY-UNITS-2-6           PIC S9(7).
           03  QTY-OUTBAL-2-6          PIC S9(9)V99.
           03  QTY-UNITS-2-7           PIC S9(7).
           03  QTY-OUTBAL-2-7          PIC S9(9)V99.
           03  QTY-UNITS-2-8           PIC S9(7).
           03  QTY-OUTBAL-2-8          PIC S9(9)V99.
           03  QTY-UNITS-2-9           PIC S9(7).
           03  QTY-OUTBAL-2-9          PIC S9(9)V99.
           03  QTY-UNITS-2-10          PIC S9(7).
           03  QTY-OUTBAL-2-10         PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-1           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-1          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-2           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-2          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-3           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-3          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-4           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-4          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-5           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-5          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-6           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-6          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-7           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-7          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-8           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-8          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-9           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-9          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-1-10          PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-1-10         PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-1           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-1          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-2           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-2          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-3           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-3          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-4           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-4          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-5           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-5          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-6           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-6          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-7           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-7          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-8           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-8          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-9           PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-9          PIC S9(9)V99.
           03  QTY-UNITS-BNKRPT-2-10          PIC S9(7).
           03  QTY-OUTBAL-BNKRPT-2-10         PIC S9(9)V99.
           03  QTY-SUMWGTTM                PIC S9(8).
           03  QTY-SUMWGTAV                PIC S9(9)V99.
           03  QTY-SUMWGTTA                PIC S9(11)V99.
           03  QTY-ALLOTMENTS              PIC S9(7)V99.
           03  QTY-BRFG                    PIC X.
           03  QTY-DLDISC                  PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-1     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-2     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-3     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-4     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-5     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-6     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-7     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-8     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-9     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-1-10    PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-1     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-2     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-3     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-4     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-5     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-6     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-7     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-8     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-9     PIC S9(8)V99.
           03  QTY-UNEARNED-AMT-2-10    PIC S9(8)V99.
           03  QTY-PROCEEDS                 PIC S9(8)V99.
           03  QTY-LOCKBOX                  PIC S9(7)V99.

       EXEC SQL END DECLARE SECTION END-EXEC.
