      * COPYMEMBER: LIBLP/LP01BY_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL - BRANCH STATISTICS FILE
      *
      *=================================================================
      * REV:
      * AMM 2021-0430 ***NEW***
      *
      ******************************************************************
      *- - -{STANDARD CURSOR FOR START & READ-NEXT}
       01  BYA1-CURSOR-STAT             PIC X(2) VALUE SPACES.
           88  BYA1-CURSOR-STAT-GOOD             VALUE "00".
           88  BYA1-CURSOR-STAT-BAD              VALUE "  " THRU "//"
                                                      "01" THRU "~~".

      *- - -{STANDARD CURSOR FOR START & READ-NEXT}
       01  BYB1-CURSOR-STAT             PIC X(2) VALUE SPACES.
           88  BYB1-CURSOR-STAT-GOOD             VALUE "00".
           88  BYB1-CURSOR-STAT-BAD              VALUE "  " THRU "//"
                                                       "01" THRU "~~".

       EXEC SQL BEGIN DECLARE SECTION END-EXEC.

       01  BY1-RETURN-CODE               PIC S9(4)   COMP-5.

       01  QBY1-WHERE-BEG-KEY.
           03  QBY1-WBEG-DATE-CCYYMM     PIC 9(6).
           03  QBY1-WBEG-BRNO            PIC 9(4).
           03  QBY1-WBEG-CLASS           PIC 9(3).
 
       01  QBY1-WHERE-END-KEY.
           03  QBY1-WEND-DATE-CCYYMM     PIC 9(6).
           03  QBY1-WEND-BRNO            PIC 9(4).
           03  QBY1-WEND-CLASS           PIC 9(3).
 
       01  QBYA-REC.
           03  QBYA-DATE-CCYYMM     PIC 9(6).
           03  QBYA-BRNO            PIC 9(4).
           03  QBYA-CLASS           PIC 9(3).
           03  QBYA-LTOUCH-DATE     PIC X(10).
           03  QBYA-NO-1-1-1        PIC S9(7).
           03  QBYA-AMT-1-1-1       PIC S9(9)V99.
           03  QBYA-O2-1-1-1        PIC S9(9)V99.
           03  QBYA-INT-1-1-1       PIC S9(9)V99.
           03  QBYA-NO-1-1-2        PIC S9(7).
           03  QBYA-AMT-1-1-2       PIC S9(9)V99.
           03  QBYA-O2-1-1-2        PIC S9(9)V99.
           03  QBYA-INT-1-1-2       PIC S9(9)V99.
           03  QBYA-NO-1-1-3        PIC S9(7).
           03  QBYA-AMT-1-1-3       PIC S9(9)V99.
           03  QBYA-O2-1-1-3        PIC S9(9)V99.
           03  QBYA-INT-1-1-3       PIC S9(9)V99.
           03  QBYA-NO-1-1-4        PIC S9(7).
           03  QBYA-AMT-1-1-4       PIC S9(9)V99.
           03  QBYA-O2-1-1-4        PIC S9(9)V99.
           03  QBYA-INT-1-1-4       PIC S9(9)V99.
           03  QBYA-NO-1-1-5        PIC S9(7).
           03  QBYA-AMT-1-1-5       PIC S9(9)V99.
           03  QBYA-O2-1-1-5        PIC S9(9)V99.
           03  QBYA-INT-1-1-5       PIC S9(9)V99.
           03  QBYA-NO-1-1-6        PIC S9(7).
           03  QBYA-AMT-1-1-6       PIC S9(9)V99.
           03  QBYA-O2-1-1-6        PIC S9(9)V99.
           03  QBYA-INT-1-1-6       PIC S9(9)V99.
           03  QBYA-NO-1-1-7        PIC S9(7).
           03  QBYA-AMT-1-1-7       PIC S9(9)V99.
           03  QBYA-O2-1-1-7        PIC S9(9)V99.
           03  QBYA-INT-1-1-7       PIC S9(9)V99.
           03  QBYA-NO-1-1-8        PIC S9(7).
           03  QBYA-AMT-1-1-8       PIC S9(9)V99.
           03  QBYA-O2-1-1-8        PIC S9(9)V99.
           03  QBYA-INT-1-1-8       PIC S9(9)V99.
           03  QBYA-NO-1-1-9        PIC S9(7).
           03  QBYA-AMT-1-1-9       PIC S9(9)V99.
           03  QBYA-O2-1-1-9        PIC S9(9)V99.
           03  QBYA-INT-1-1-9       PIC S9(9)V99.
           03  QBYA-NO-1-1-10       PIC S9(7).
           03  QBYA-AMT-1-1-10      PIC S9(9)V99.
           03  QBYA-O2-1-1-10       PIC S9(9)V99.
           03  QBYA-INT-1-1-10      PIC S9(9)V99.
           03  QBYA-NO-1-1-11       PIC S9(7).
           03  QBYA-AMT-1-1-11      PIC S9(9)V99.
           03  QBYA-O2-1-1-11       PIC S9(9)V99.
           03  QBYA-INT-1-1-11      PIC S9(9)V99.
           03  QBYA-NO-1-2-1        PIC S9(7).
           03  QBYA-AMT-1-2-1       PIC S9(9)V99.
           03  QBYA-O2-1-2-1        PIC S9(9)V99.
           03  QBYA-INT-1-2-1       PIC S9(9)V99.
           03  QBYA-NO-1-2-2        PIC S9(7).
           03  QBYA-AMT-1-2-2       PIC S9(9)V99.
           03  QBYA-O2-1-2-2        PIC S9(9)V99.
           03  QBYA-INT-1-2-2       PIC S9(9)V99.
           03  QBYA-NO-1-2-3        PIC S9(7).
           03  QBYA-AMT-1-2-3       PIC S9(9)V99.
           03  QBYA-O2-1-2-3        PIC S9(9)V99.
           03  QBYA-INT-1-2-3       PIC S9(9)V99.
           03  QBYA-NO-1-2-4        PIC S9(7).
           03  QBYA-AMT-1-2-4       PIC S9(9)V99.
           03  QBYA-O2-1-2-4        PIC S9(9)V99.
           03  QBYA-INT-1-2-4       PIC S9(9)V99.
           03  QBYA-NO-1-2-5        PIC S9(7).
           03  QBYA-AMT-1-2-5       PIC S9(9)V99.
           03  QBYA-O2-1-2-5        PIC S9(9)V99.
           03  QBYA-INT-1-2-5       PIC S9(9)V99.
           03  QBYA-NO-1-2-6        PIC S9(7).
           03  QBYA-AMT-1-2-6       PIC S9(9)V99.
           03  QBYA-O2-1-2-6        PIC S9(9)V99.
           03  QBYA-INT-1-2-6       PIC S9(9)V99.
           03  QBYA-NO-1-2-7        PIC S9(7).
           03  QBYA-AMT-1-2-7       PIC S9(9)V99.
           03  QBYA-O2-1-2-7        PIC S9(9)V99.
           03  QBYA-INT-1-2-7       PIC S9(9)V99.
           03  QBYA-NO-1-2-8        PIC S9(7).
           03  QBYA-AMT-1-2-8       PIC S9(9)V99.
           03  QBYA-O2-1-2-8        PIC S9(9)V99.
           03  QBYA-INT-1-2-8       PIC S9(9)V99.
           03  QBYA-NO-1-2-9        PIC S9(7).
           03  QBYA-AMT-1-2-9       PIC S9(9)V99.
           03  QBYA-O2-1-2-9        PIC S9(9)V99.
           03  QBYA-INT-1-2-9       PIC S9(9)V99.
           03  QBYA-NO-1-2-10       PIC S9(7).
           03  QBYA-AMT-1-2-10      PIC S9(9)V99.
           03  QBYA-O2-1-2-10       PIC S9(9)V99.
           03  QBYA-INT-1-2-10      PIC S9(9)V99.
           03  QBYA-NO-1-2-11       PIC S9(7).
           03  QBYA-AMT-1-2-11      PIC S9(9)V99.
           03  QBYA-O2-1-2-11       PIC S9(9)V99.
           03  QBYA-INT-1-2-11      PIC S9(9)V99.
           03  QBYA-NO-2-1-1        PIC S9(7).
           03  QBYA-AMT-2-1-1       PIC S9(9)V99.
           03  QBYA-O2-2-1-1        PIC S9(9)V99.
           03  QBYA-INT-2-1-1       PIC S9(9)V99.
           03  QBYA-NO-2-1-2        PIC S9(7).
           03  QBYA-AMT-2-1-2       PIC S9(9)V99.
           03  QBYA-O2-2-1-2        PIC S9(9)V99.
           03  QBYA-INT-2-1-2       PIC S9(9)V99.
           03  QBYA-NO-2-1-3        PIC S9(7).
           03  QBYA-AMT-2-1-3       PIC S9(9)V99.
           03  QBYA-O2-2-1-3        PIC S9(9)V99.
           03  QBYA-INT-2-1-3       PIC S9(9)V99.
           03  QBYA-NO-2-1-4        PIC S9(7).
           03  QBYA-AMT-2-1-4       PIC S9(9)V99.
           03  QBYA-O2-2-1-4        PIC S9(9)V99.
           03  QBYA-INT-2-1-4       PIC S9(9)V99.
           03  QBYA-NO-2-1-5        PIC S9(7).
           03  QBYA-AMT-2-1-5       PIC S9(9)V99.
           03  QBYA-O2-2-1-5        PIC S9(9)V99.
           03  QBYA-INT-2-1-5       PIC S9(9)V99.
           03  QBYA-NO-2-1-6        PIC S9(7).
           03  QBYA-AMT-2-1-6       PIC S9(9)V99.
           03  QBYA-O2-2-1-6        PIC S9(9)V99.
           03  QBYA-INT-2-1-6       PIC S9(9)V99.
           03  QBYA-NO-2-1-7        PIC S9(7).
           03  QBYA-AMT-2-1-7       PIC S9(9)V99.
           03  QBYA-O2-2-1-7        PIC S9(9)V99.
           03  QBYA-INT-2-1-7       PIC S9(9)V99.
           03  QBYA-NO-2-1-8        PIC S9(7).
           03  QBYA-AMT-2-1-8       PIC S9(9)V99.
           03  QBYA-O2-2-1-8        PIC S9(9)V99.
           03  QBYA-INT-2-1-8       PIC S9(9)V99.
           03  QBYA-NO-2-1-9        PIC S9(7).
           03  QBYA-AMT-2-1-9       PIC S9(9)V99.
           03  QBYA-O2-2-1-9        PIC S9(9)V99.
           03  QBYA-INT-2-1-9       PIC S9(9)V99.
           03  QBYA-NO-2-1-10       PIC S9(7).
           03  QBYA-AMT-2-1-10      PIC S9(9)V99.
           03  QBYA-O2-2-1-10       PIC S9(9)V99.
           03  QBYA-INT-2-1-10      PIC S9(9)V99.
           03  QBYA-NO-2-1-11       PIC S9(7).
           03  QBYA-AMT-2-1-11      PIC S9(9)V99.
           03  QBYA-O2-2-1-11       PIC S9(9)V99.
           03  QBYA-INT-2-1-11      PIC S9(9)V99.
           03  QBYA-NO-2-2-1        PIC S9(7).
           03  QBYA-AMT-2-2-1       PIC S9(9)V99.
           03  QBYA-O2-2-2-1        PIC S9(9)V99.
           03  QBYA-INT-2-2-1       PIC S9(9)V99.
           03  QBYA-NO-2-2-2        PIC S9(7).
           03  QBYA-AMT-2-2-2       PIC S9(9)V99.
           03  QBYA-O2-2-2-2        PIC S9(9)V99.
           03  QBYA-INT-2-2-2       PIC S9(9)V99.
           03  QBYA-NO-2-2-3        PIC S9(7).
           03  QBYA-AMT-2-2-3       PIC S9(9)V99.
           03  QBYA-O2-2-2-3        PIC S9(9)V99.
           03  QBYA-INT-2-2-3       PIC S9(9)V99.
           03  QBYA-NO-2-2-4        PIC S9(7).
           03  QBYA-AMT-2-2-4       PIC S9(9)V99.
           03  QBYA-O2-2-2-4        PIC S9(9)V99.
           03  QBYA-INT-2-2-4       PIC S9(9)V99.
           03  QBYA-NO-2-2-5        PIC S9(7).
           03  QBYA-AMT-2-2-5       PIC S9(9)V99.
           03  QBYA-O2-2-2-5        PIC S9(9)V99.
           03  QBYA-INT-2-2-5       PIC S9(9)V99.
           03  QBYA-NO-2-2-6        PIC S9(7).
           03  QBYA-AMT-2-2-6       PIC S9(9)V99.
           03  QBYA-O2-2-2-6        PIC S9(9)V99.
           03  QBYA-INT-2-2-6       PIC S9(9)V99.
           03  QBYA-NO-2-2-7        PIC S9(7).
           03  QBYA-AMT-2-2-7       PIC S9(9)V99.
           03  QBYA-O2-2-2-7        PIC S9(9)V99.
           03  QBYA-INT-2-2-7       PIC S9(9)V99.
           03  QBYA-NO-2-2-8        PIC S9(7).
           03  QBYA-AMT-2-2-8       PIC S9(9)V99.
           03  QBYA-O2-2-2-8        PIC S9(9)V99.
           03  QBYA-INT-2-2-8       PIC S9(9)V99.
           03  QBYA-NO-2-2-9        PIC S9(7).
           03  QBYA-AMT-2-2-9       PIC S9(9)V99.
           03  QBYA-O2-2-2-9        PIC S9(9)V99.
           03  QBYA-INT-2-2-9       PIC S9(9)V99.
           03  QBYA-NO-2-2-10       PIC S9(7).
           03  QBYA-AMT-2-2-10      PIC S9(9)V99.
           03  QBYA-O2-2-2-10       PIC S9(9)V99.
           03  QBYA-INT-2-2-10      PIC S9(9)V99.
           03  QBYA-NO-2-2-11       PIC S9(7).
           03  QBYA-AMT-2-2-11      PIC S9(9)V99.
           03  QBYA-O2-2-2-11       PIC S9(9)V99.
           03  QBYA-INT-2-2-11      PIC S9(9)V99.
           03  QBYA-NO-3-1-1        PIC S9(7).
           03  QBYA-AMT-3-1-1       PIC S9(9)V99.
           03  QBYA-O2-3-1-1        PIC S9(9)V99.
           03  QBYA-INT-3-1-1       PIC S9(9)V99.
           03  QBYA-NO-3-1-2        PIC S9(7).
           03  QBYA-AMT-3-1-2       PIC S9(9)V99.
           03  QBYA-O2-3-1-2        PIC S9(9)V99.
           03  QBYA-INT-3-1-2       PIC S9(9)V99.
           03  QBYA-NO-3-1-3        PIC S9(7).
           03  QBYA-AMT-3-1-3       PIC S9(9)V99.
           03  QBYA-O2-3-1-3        PIC S9(9)V99.
           03  QBYA-INT-3-1-3       PIC S9(9)V99.
           03  QBYA-NO-3-1-4        PIC S9(7).
           03  QBYA-AMT-3-1-4       PIC S9(9)V99.
           03  QBYA-O2-3-1-4        PIC S9(9)V99.
           03  QBYA-INT-3-1-4       PIC S9(9)V99.
           03  QBYA-NO-3-1-5        PIC S9(7).
           03  QBYA-AMT-3-1-5       PIC S9(9)V99.
           03  QBYA-O2-3-1-5        PIC S9(9)V99.
           03  QBYA-INT-3-1-5       PIC S9(9)V99.
           03  QBYA-NO-3-1-6        PIC S9(7).
           03  QBYA-AMT-3-1-6       PIC S9(9)V99.
           03  QBYA-O2-3-1-6        PIC S9(9)V99.
           03  QBYA-INT-3-1-6       PIC S9(9)V99.
           03  QBYA-NO-3-1-7        PIC S9(7).
           03  QBYA-AMT-3-1-7       PIC S9(9)V99.
           03  QBYA-O2-3-1-7        PIC S9(9)V99.
           03  QBYA-INT-3-1-7       PIC S9(9)V99.
           03  QBYA-NO-3-1-8        PIC S9(7).
           03  QBYA-AMT-3-1-8       PIC S9(9)V99.
           03  QBYA-O2-3-1-8        PIC S9(9)V99.
           03  QBYA-INT-3-1-8       PIC S9(9)V99.
           03  QBYA-NO-3-1-9        PIC S9(7).
           03  QBYA-AMT-3-1-9       PIC S9(9)V99.
           03  QBYA-O2-3-1-9        PIC S9(9)V99.
           03  QBYA-INT-3-1-9       PIC S9(9)V99.
           03  QBYA-NO-3-1-10       PIC S9(7).
           03  QBYA-AMT-3-1-10      PIC S9(9)V99.
           03  QBYA-O2-3-1-10       PIC S9(9)V99.
           03  QBYA-INT-3-1-10      PIC S9(9)V99.
           03  QBYA-NO-3-1-11       PIC S9(7).
           03  QBYA-AMT-3-1-11      PIC S9(9)V99.
           03  QBYA-O2-3-1-11       PIC S9(9)V99.
           03  QBYA-INT-3-1-11      PIC S9(9)V99.
           03  QBYA-NO-3-2-1        PIC S9(7).
           03  QBYA-AMT-3-2-1       PIC S9(9)V99.
           03  QBYA-O2-3-2-1        PIC S9(9)V99.
           03  QBYA-INT-3-2-1       PIC S9(9)V99.
           03  QBYA-NO-3-2-2        PIC S9(7).
           03  QBYA-AMT-3-2-2       PIC S9(9)V99.
           03  QBYA-O2-3-2-2        PIC S9(9)V99.
           03  QBYA-INT-3-2-2       PIC S9(9)V99.
           03  QBYA-NO-3-2-3        PIC S9(7).
           03  QBYA-AMT-3-2-3       PIC S9(9)V99.
           03  QBYA-O2-3-2-3        PIC S9(9)V99.
           03  QBYA-INT-3-2-3       PIC S9(9)V99.
           03  QBYA-NO-3-2-4        PIC S9(7).
           03  QBYA-AMT-3-2-4       PIC S9(9)V99.
           03  QBYA-O2-3-2-4        PIC S9(9)V99.
           03  QBYA-INT-3-2-4       PIC S9(9)V99.
           03  QBYA-NO-3-2-5        PIC S9(7).
           03  QBYA-AMT-3-2-5       PIC S9(9)V99.
           03  QBYA-O2-3-2-5        PIC S9(9)V99.
           03  QBYA-INT-3-2-5       PIC S9(9)V99.
           03  QBYA-NO-3-2-6        PIC S9(7).
           03  QBYA-AMT-3-2-6       PIC S9(9)V99.
           03  QBYA-O2-3-2-6        PIC S9(9)V99.
           03  QBYA-INT-3-2-6       PIC S9(9)V99.
           03  QBYA-NO-3-2-7        PIC S9(7).
           03  QBYA-AMT-3-2-7       PIC S9(9)V99.
           03  QBYA-O2-3-2-7        PIC S9(9)V99.
           03  QBYA-INT-3-2-7       PIC S9(9)V99.
           03  QBYA-NO-3-2-8        PIC S9(7).
           03  QBYA-AMT-3-2-8       PIC S9(9)V99.
           03  QBYA-O2-3-2-8        PIC S9(9)V99.
           03  QBYA-INT-3-2-8       PIC S9(9)V99.
           03  QBYA-NO-3-2-9        PIC S9(7).
           03  QBYA-AMT-3-2-9       PIC S9(9)V99.
           03  QBYA-O2-3-2-9        PIC S9(9)V99.
           03  QBYA-INT-3-2-9       PIC S9(9)V99.
           03  QBYA-NO-3-2-10       PIC S9(7).
           03  QBYA-AMT-3-2-10      PIC S9(9)V99.
           03  QBYA-O2-3-2-10       PIC S9(9)V99.
           03  QBYA-INT-3-2-10      PIC S9(9)V99.
           03  QBYA-NO-3-2-11       PIC S9(7).
           03  QBYA-AMT-3-2-11      PIC S9(9)V99.
           03  QBYA-O2-3-2-11       PIC S9(9)V99.
           03  QBYA-INT-3-2-11      PIC S9(9)V99.
           03  QBYA-NO-REPO-1-1-1     PIC S9(7).
           03  QBYA-AMT-REPO-1-1-1    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-1-1     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-1-1    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-1-2     PIC S9(7).
           03  QBYA-AMT-REPO-1-1-2    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-1-2     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-1-2    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-1-3     PIC S9(7).
           03  QBYA-AMT-REPO-1-1-3    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-1-3     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-1-3    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-1-4     PIC S9(7).
           03  QBYA-AMT-REPO-1-1-4    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-1-4     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-1-4    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-1-5     PIC S9(7).
           03  QBYA-AMT-REPO-1-1-5    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-1-5     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-1-5    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-2-1     PIC S9(7).
           03  QBYA-AMT-REPO-1-2-1    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-2-1     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-2-1    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-2-2     PIC S9(7).
           03  QBYA-AMT-REPO-1-2-2    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-2-2     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-2-2    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-2-3     PIC S9(7).
           03  QBYA-AMT-REPO-1-2-3    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-2-3     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-2-3    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-2-4     PIC S9(7).
           03  QBYA-AMT-REPO-1-2-4    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-2-4     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-2-4    PIC S9(9)V99.
           03  QBYA-NO-REPO-1-2-5     PIC S9(7).
           03  QBYA-AMT-REPO-1-2-5    PIC S9(9)V99.
           03  QBYA-O2-REPO-1-2-5     PIC S9(9)V99.
           03  QBYA-INT-REPO-1-2-5    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-1-1     PIC S9(7).
           03  QBYA-AMT-REPO-2-1-1    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-1-1     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-1-1    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-1-2     PIC S9(7).
           03  QBYA-AMT-REPO-2-1-2    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-1-2     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-1-2    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-1-3     PIC S9(7).
           03  QBYA-AMT-REPO-2-1-3    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-1-3     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-1-3    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-1-4     PIC S9(7).
           03  QBYA-AMT-REPO-2-1-4    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-1-4     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-1-4    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-1-5     PIC S9(7).
           03  QBYA-AMT-REPO-2-1-5    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-1-5     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-1-5    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-2-1     PIC S9(7).
           03  QBYA-AMT-REPO-2-2-1    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-2-1     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-2-1    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-2-2     PIC S9(7).
           03  QBYA-AMT-REPO-2-2-2    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-2-2     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-2-2    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-2-3     PIC S9(7).
           03  QBYA-AMT-REPO-2-2-3    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-2-3     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-2-3    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-2-4     PIC S9(7).
           03  QBYA-AMT-REPO-2-2-4    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-2-4     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-2-4    PIC S9(9)V99.
           03  QBYA-NO-REPO-2-2-5     PIC S9(7).
           03  QBYA-AMT-REPO-2-2-5    PIC S9(9)V99.
           03  QBYA-O2-REPO-2-2-5     PIC S9(9)V99.
           03  QBYA-INT-REPO-2-2-5    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-1-1     PIC S9(7).
           03  QBYA-AMT-REPO-3-1-1    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-1-1     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-1-1    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-1-2     PIC S9(7).
           03  QBYA-AMT-REPO-3-1-2    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-1-2     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-1-2    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-1-3     PIC S9(7).
           03  QBYA-AMT-REPO-3-1-3    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-1-3     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-1-3    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-1-4     PIC S9(7).
           03  QBYA-AMT-REPO-3-1-4    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-1-4     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-1-4    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-1-5     PIC S9(7).
           03  QBYA-AMT-REPO-3-1-5    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-1-5     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-1-5    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-2-1     PIC S9(7).
           03  QBYA-AMT-REPO-3-2-1    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-2-1     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-2-1    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-2-2     PIC S9(7).
           03  QBYA-AMT-REPO-3-2-2    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-2-2     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-2-2    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-2-3     PIC S9(7).
           03  QBYA-AMT-REPO-3-2-3    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-2-3     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-2-3    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-2-4     PIC S9(7).
           03  QBYA-AMT-REPO-3-2-4    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-2-4     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-2-4    PIC S9(9)V99.
           03  QBYA-NO-REPO-3-2-5     PIC S9(7).
           03  QBYA-AMT-REPO-3-2-5    PIC S9(9)V99.
           03  QBYA-O2-REPO-3-2-5     PIC S9(9)V99.
           03  QBYA-INT-REPO-3-2-5    PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-1          PIC S9(7).
           03  QBYA-AMT-PL-1-1-1         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-1          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-1         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-2          PIC S9(7).
           03  QBYA-AMT-PL-1-1-2         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-2          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-2         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-3          PIC S9(7).
           03  QBYA-AMT-PL-1-1-3         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-3          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-3         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-4          PIC S9(7).
           03  QBYA-AMT-PL-1-1-4         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-4          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-4         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-5          PIC S9(7).
           03  QBYA-AMT-PL-1-1-5         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-5          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-5         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-6          PIC S9(7).
           03  QBYA-AMT-PL-1-1-6         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-6          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-6         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-7          PIC S9(7).
           03  QBYA-AMT-PL-1-1-7         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-7          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-7         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-8          PIC S9(7).
           03  QBYA-AMT-PL-1-1-8         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-8          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-8         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-9          PIC S9(7).
           03  QBYA-AMT-PL-1-1-9         PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-9          PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-9         PIC S9(9)V99.
           03  QBYA-NO-PL-1-1-10         PIC S9(7).
           03  QBYA-AMT-PL-1-1-10        PIC S9(9)V99.
           03  QBYA-O2-PL-1-1-10         PIC S9(9)V99.
           03  QBYA-INT-PL-1-1-10        PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-1          PIC S9(7).
           03  QBYA-AMT-PL-1-2-1         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-1          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-1         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-2          PIC S9(7).
           03  QBYA-AMT-PL-1-2-2         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-2          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-2         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-3          PIC S9(7).
           03  QBYA-AMT-PL-1-2-3         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-3          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-3         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-4          PIC S9(7).
           03  QBYA-AMT-PL-1-2-4         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-4          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-4         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-5          PIC S9(7).
           03  QBYA-AMT-PL-1-2-5         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-5          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-5         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-6          PIC S9(7).
           03  QBYA-AMT-PL-1-2-6         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-6          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-6         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-7          PIC S9(7).
           03  QBYA-AMT-PL-1-2-7         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-7          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-7         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-8          PIC S9(7).
           03  QBYA-AMT-PL-1-2-8         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-8          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-8         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-9          PIC S9(7).
           03  QBYA-AMT-PL-1-2-9         PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-9          PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-9         PIC S9(9)V99.
           03  QBYA-NO-PL-1-2-10         PIC S9(7).
           03  QBYA-AMT-PL-1-2-10        PIC S9(9)V99.
           03  QBYA-O2-PL-1-2-10         PIC S9(9)V99.
           03  QBYA-INT-PL-1-2-10        PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-1          PIC S9(7).
           03  QBYA-AMT-PL-2-1-1         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-1          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-1         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-2          PIC S9(7).
           03  QBYA-AMT-PL-2-1-2         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-2          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-2         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-3          PIC S9(7).
           03  QBYA-AMT-PL-2-1-3         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-3          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-3         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-4          PIC S9(7).
           03  QBYA-AMT-PL-2-1-4         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-4          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-4         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-5          PIC S9(7).
           03  QBYA-AMT-PL-2-1-5         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-5          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-5         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-6          PIC S9(7).
           03  QBYA-AMT-PL-2-1-6         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-6          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-6         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-7          PIC S9(7).
           03  QBYA-AMT-PL-2-1-7         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-7          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-7         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-8          PIC S9(7).
           03  QBYA-AMT-PL-2-1-8         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-8          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-8         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-9          PIC S9(7).
           03  QBYA-AMT-PL-2-1-9         PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-9          PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-9         PIC S9(9)V99.
           03  QBYA-NO-PL-2-1-10         PIC S9(7).
           03  QBYA-AMT-PL-2-1-10        PIC S9(9)V99.
           03  QBYA-O2-PL-2-1-10         PIC S9(9)V99.
           03  QBYA-INT-PL-2-1-10        PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-1          PIC S9(7).
           03  QBYA-AMT-PL-2-2-1         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-1          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-1         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-2          PIC S9(7).
           03  QBYA-AMT-PL-2-2-2         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-2          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-2         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-3          PIC S9(7).
           03  QBYA-AMT-PL-2-2-3         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-3          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-3         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-4          PIC S9(7).
           03  QBYA-AMT-PL-2-2-4         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-4          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-4         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-5          PIC S9(7).
           03  QBYA-AMT-PL-2-2-5         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-5          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-5         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-6          PIC S9(7).
           03  QBYA-AMT-PL-2-2-6         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-6          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-6         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-7          PIC S9(7).
           03  QBYA-AMT-PL-2-2-7         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-7          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-7         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-8          PIC S9(7).
           03  QBYA-AMT-PL-2-2-8         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-8          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-8         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-9          PIC S9(7).
           03  QBYA-AMT-PL-2-2-9         PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-9          PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-9         PIC S9(9)V99.
           03  QBYA-NO-PL-2-2-10         PIC S9(7).
           03  QBYA-AMT-PL-2-2-10        PIC S9(9)V99.
           03  QBYA-O2-PL-2-2-10         PIC S9(9)V99.
           03  QBYA-INT-PL-2-2-10        PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-1          PIC S9(7).
           03  QBYA-AMT-PL-3-1-1         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-1          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-1         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-2          PIC S9(7).
           03  QBYA-AMT-PL-3-1-2         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-2          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-2         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-3          PIC S9(7).
           03  QBYA-AMT-PL-3-1-3         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-3          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-3         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-4          PIC S9(7).
           03  QBYA-AMT-PL-3-1-4         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-4          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-4         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-5          PIC S9(7).
           03  QBYA-AMT-PL-3-1-5         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-5          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-5         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-6          PIC S9(7).
           03  QBYA-AMT-PL-3-1-6         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-6          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-6         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-7          PIC S9(7).
           03  QBYA-AMT-PL-3-1-7         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-7          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-7         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-8          PIC S9(7).
           03  QBYA-AMT-PL-3-1-8         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-8          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-8         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-9          PIC S9(7).
           03  QBYA-AMT-PL-3-1-9         PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-9          PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-9         PIC S9(9)V99.
           03  QBYA-NO-PL-3-1-10         PIC S9(7).
           03  QBYA-AMT-PL-3-1-10        PIC S9(9)V99.
           03  QBYA-O2-PL-3-1-10         PIC S9(9)V99.
           03  QBYA-INT-PL-3-1-10        PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-1          PIC S9(7).
           03  QBYA-AMT-PL-3-2-1         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-1          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-1         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-2          PIC S9(7).
           03  QBYA-AMT-PL-3-2-2         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-2          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-2         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-3          PIC S9(7).
           03  QBYA-AMT-PL-3-2-3         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-3          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-3         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-4          PIC S9(7).
           03  QBYA-AMT-PL-3-2-4         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-4          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-4         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-5          PIC S9(7).
           03  QBYA-AMT-PL-3-2-5         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-5          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-5         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-6          PIC S9(7).
           03  QBYA-AMT-PL-3-2-6         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-6          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-6         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-7          PIC S9(7).
           03  QBYA-AMT-PL-3-2-7         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-7          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-7         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-8          PIC S9(7).
           03  QBYA-AMT-PL-3-2-8         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-8          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-8         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-9          PIC S9(7).
           03  QBYA-AMT-PL-3-2-9         PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-9          PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-9         PIC S9(9)V99.
           03  QBYA-NO-PL-3-2-10         PIC S9(7).
           03  QBYA-AMT-PL-3-2-10        PIC S9(9)V99.
           03  QBYA-O2-PL-3-2-10         PIC S9(9)V99.
           03  QBYA-INT-PL-3-2-10        PIC S9(9)V99.
           03  QBYA-DLRVPRIN-1-1-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-1-1-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-1-1-3     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-1-1-1     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-1-1-2     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-1-1-3     PIC S9(9)V99.
           03  QBYA-DLPARVHELD-1-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-1-2-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-1-2-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-1-2-3     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-1-2-1     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-1-2-2     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-1-2-3     PIC S9(9)V99.
           03  QBYA-DLPARVHELD-1-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-2-1-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-2-1-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-2-1-3     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-2-1-1     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-2-1-2     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-2-1-3     PIC S9(9)V99.
           03  QBYA-DLPARVHELD-2-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-2-2-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-2-2-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-2-2-3     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-2-2-1     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-2-2-2     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-2-2-3     PIC S9(9)V99.
           03  QBYA-DLPARVHELD-2-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-3-1-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-3-1-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-3-1-3     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-3-1-1     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-3-1-2     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-3-1-3     PIC S9(9)V99.
           03  QBYA-DLPARVHELD-3-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-3-2-1     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-3-2-2     PIC S9(9)V99.
           03  QBYA-DLRVPRIN-3-2-3     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-3-2-1     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-3-2-2     PIC S9(9)V99.
           03  QBYA-DLRVCHGS-3-2-3     PIC S9(9)V99.
           03  QBYA-DLPARVHELD-3-2     PIC S9(9)V99.

       01  QBYB-REC.
           03  QBYB-DATE-CCYYMM        PIC 9(6).
           03  QBYB-BRNO               PIC 9(4).
           03  QBYB-CLASS              PIC 9(3).
           03  QBYB-PL-PRINCOL-1-1     PIC S9(9)V99.
           03  QBYB-PL-INTCOL-1-1      PIC S9(9)V99.
           03  QBYB-PL-LATECOL-1-1     PIC S9(9)V99.
           03  QBYB-PL-O2COL-1-1       PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-1-2     PIC S9(9)V99.
           03  QBYB-PL-INTCOL-1-2      PIC S9(9)V99.
           03  QBYB-PL-LATECOL-1-2     PIC S9(9)V99.
           03  QBYB-PL-O2COL-1-2       PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-1-3     PIC S9(9)V99.
           03  QBYB-PL-INTCOL-1-3      PIC S9(9)V99.
           03  QBYB-PL-LATECOL-1-3     PIC S9(9)V99.
           03  QBYB-PL-O2COL-1-3       PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-1-4     PIC S9(9)V99.
           03  QBYB-PL-INTCOL-1-4      PIC S9(9)V99.
           03  QBYB-PL-LATECOL-1-4     PIC S9(9)V99.
           03  QBYB-PL-O2COL-1-4       PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-1-5     PIC S9(9)V99.
           03  QBYB-PL-INTCOL-1-5      PIC S9(9)V99.
           03  QBYB-PL-LATECOL-1-5     PIC S9(9)V99.
           03  QBYB-PL-O2COL-1-5       PIC S9(9)V99.
           03  QBYB-AMT-SOLD-1         PIC S9(9)V99.
           03  QBYB-AMT-TRANS-1        PIC S9(9)V99.
           03  QBYB-AMT-PURCH-1        PIC S9(9)V99.
           03  QBYB-NO-SOLD-1          PIC S9(7).
           03  QBYB-NO-TRANS-1         PIC S9(7).
           03  QBYB-NO-PURCH-1         PIC S9(7).
           03  QBYB-OTHCOL-1           PIC S9(9)V99.
           03  QBYB-OT2COL-1           PIC S9(9)V99.
           03  QBYB-INTCOL-1           PIC S9(9)V99.
           03  QBYB-LATECOL-1          PIC S9(9)V99.
           03  QBYB-PRINCOL-1          PIC S9(9)V99.
           03  QBYB-DEFCOL-1            PIC S9(9)V99.
           03  QBYB-RNPRIN-1            PIC S9(9)V99.
           03  QBYB-INTREB-1            PIC S9(9)V99.
           03  QBYB-CLREB1-1            PIC S9(9)V99.
           03  QBYB-CLREB2-1            PIC S9(9)V99.
           03  QBYB-CLREB3-1            PIC S9(9)V99.
           03  QBYB-CLREB4-1            PIC S9(9)V99.
           03  QBYB-AHREB-1             PIC S9(9)V99.
           03  QBYB-PPREB-1             PIC S9(9)V99.
           03  QBYB-O1REB-1             PIC S9(9)V99.
           03  QBYB-O2REB-1             PIC S9(9)V99.
           03  QBYB-O3REB-1             PIC S9(9)V99.
           03  QBYB-O4REB-1             PIC S9(9)V99.
           03  QBYB-O5REB-1             PIC S9(9)V99.
           03  QBYB-O6REB-1             PIC S9(9)V99.
           03  QBYB-O7REB-1             PIC S9(9)V99.
           03  QBYB-SCREB-1             PIC S9(9)V99.
           03  QBYB-MFREB-1             PIC S9(9)V99.
           03  QBYB-DFREB-1             PIC S9(9)V99.
           03  QBYB-UN7-REB-1           PIC S9(9)V99.
           03  QBYB-UN8-REB-1           PIC S9(9)V99.
           03  QBYB-UN9-REB-1           PIC S9(9)V99.
           03  QBYB-UN10-REB-1          PIC S9(9)V99.
           03  QBYB-PART-CHGOFF-1       PIC S9(9)V99.
           03  QBYB-ALLOTMENTS-1        PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-1     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-1    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-1 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-1   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-2     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-2    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-2 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-2   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-3     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-3    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-3 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-3   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-4     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-4    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-4 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-4   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-5     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-5    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-5 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-5   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-6     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-6    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-6 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-6   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-7     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-7    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-7 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-7   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-8     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-8    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-8 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-8   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-9     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-9    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-9 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-9   PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-1-10     PIC S9(7).
           03  QBYB-INS-NO-WROTE-1-10    PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-1-10 PIC S9(7).
           03  QBYB-INS-AMT-WROTE-1-10   PIC S9(9)V99.
           03  QBYB-FEE-NO-ELIG-1-1     PIC S9(7).
           03  QBYB-FEE-NO-WROTE-1-1    PIC S9(7).
           03  QBYB-FEE-NO-NOTWROTE-1-1 PIC S9(7).
           03  QBYB-FEE-AMT-WROTE-1-1   PIC S9(9)V99.
           03  QBYB-FEE-NO-ELIG-1-2     PIC S9(7).
           03  QBYB-FEE-NO-WROTE-1-2    PIC S9(7).
           03  QBYB-FEE-NO-NOTWROTE-1-2 PIC S9(7).
           03  QBYB-FEE-AMT-WROTE-1-2   PIC S9(9)V99.
           03  QBYB-FEE-NO-ELIG-1-3     PIC S9(7).
           03  QBYB-FEE-NO-WROTE-1-3    PIC S9(7).
           03  QBYB-FEE-NO-NOTWROTE-1-3 PIC S9(7).
           03  QBYB-FEE-AMT-WROTE-1-3   PIC S9(9)V99.
           03  QBYB-OTH-NO-COL-1          PIC S9(7).
           03  QBYB-OT2-NO-COL-1          PIC S9(7).
           03  QBYB-INT-NO-COL-1          PIC S9(7).
           03  QBYB-LATE-NO-COL-1         PIC S9(7).
           03  QBYB-OTH-NO-WAIVED-1       PIC S9(7).
           03  QBYB-OT2-NO-WAIVED-1       PIC S9(7).
           03  QBYB-INT-NO-WAIVED-1       PIC S9(7).
           03  QBYB-LATE-NO-WAIVED-1      PIC S9(7).
           03  QBYB-OTH-AMT-WAIVED-1      PIC S9(9)V99.
           03  QBYB-OT2-AMT-WAIVED-1      PIC S9(9)V99.
           03  QBYB-INT-AMT-WAIVED-1      PIC S9(9)V99.
           03  QBYB-LATE-AMT-WAIVED-1     PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-2-1        PIC S9(9)V99.
           03  QBYB-PL-INTCOL-2-1         PIC S9(9)V99.
           03  QBYB-PL-LATECOL-2-1        PIC S9(9)V99.
           03  QBYB-PL-O2COL-2-1          PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-2-2        PIC S9(9)V99.
           03  QBYB-PL-INTCOL-2-2         PIC S9(9)V99.
           03  QBYB-PL-LATECOL-2-2        PIC S9(9)V99.
           03  QBYB-PL-O2COL-2-2          PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-2-3        PIC S9(9)V99.
           03  QBYB-PL-INTCOL-2-3         PIC S9(9)V99.
           03  QBYB-PL-LATECOL-2-3        PIC S9(9)V99.
           03  QBYB-PL-O2COL-2-3          PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-2-4        PIC S9(9)V99.
           03  QBYB-PL-INTCOL-2-4         PIC S9(9)V99.
           03  QBYB-PL-LATECOL-2-4        PIC S9(9)V99.
           03  QBYB-PL-O2COL-2-4          PIC S9(9)V99.
           03  QBYB-PL-PRINCOL-2-5        PIC S9(9)V99.
           03  QBYB-PL-INTCOL-2-5         PIC S9(9)V99.
           03  QBYB-PL-LATECOL-2-5        PIC S9(9)V99.
           03  QBYB-PL-O2COL-2-5          PIC S9(9)V99.
           03  QBYB-AMT-SOLD-2            PIC S9(9)V99.
           03  QBYB-AMT-TRANS-2           PIC S9(9)V99.
           03  QBYB-AMT-PURCH-2           PIC S9(9)V99.
           03  QBYB-NO-SOLD-2             PIC S9(7).
           03  QBYB-NO-TRANS-2            PIC S9(7).
           03  QBYB-NO-PURCH-2            PIC S9(7).
           03  QBYB-OTHCOL-2              PIC S9(9)V99.
           03  QBYB-OT2COL-2              PIC S9(9)V99.
           03  QBYB-INTCOL-2              PIC S9(9)V99.
           03  QBYB-LATECOL-2             PIC S9(9)V99.
           03  QBYB-PRINCOL-2             PIC S9(9)V99.
           03  QBYB-DEFCOL-2              PIC S9(9)V99.
           03  QBYB-RNPRIN-2              PIC S9(9)V99.
           03  QBYB-INTREB-2              PIC S9(9)V99.
           03  QBYB-CLREB1-2              PIC S9(9)V99.
           03  QBYB-CLREB2-2              PIC S9(9)V99.
           03  QBYB-CLREB3-2              PIC S9(9)V99.
           03  QBYB-CLREB4-2              PIC S9(9)V99.
           03  QBYB-AHREB-2               PIC S9(9)V99.
           03  QBYB-PPREB-2               PIC S9(9)V99.
           03  QBYB-O1REB-2               PIC S9(9)V99.
           03  QBYB-O2REB-2               PIC S9(9)V99.
           03  QBYB-O3REB-2               PIC S9(9)V99.
           03  QBYB-O4REB-2               PIC S9(9)V99.
           03  QBYB-O5REB-2               PIC S9(9)V99.
           03  QBYB-O6REB-2               PIC S9(9)V99.
           03  QBYB-O7REB-2               PIC S9(9)V99.
           03  QBYB-SCREB-2               PIC S9(9)V99.
           03  QBYB-MFREB-2               PIC S9(9)V99.
           03  QBYB-DFREB-2               PIC S9(9)V99.
           03  QBYB-UN7-REB-2             PIC S9(9)V99.
           03  QBYB-UN8-REB-2             PIC S9(9)V99.
           03  QBYB-UN9-REB-2             PIC S9(9)V99.
           03  QBYB-UN10-REB-2            PIC S9(9)V99.
           03  QBYB-PART-CHGOFF-2         PIC S9(9)V99.
           03  QBYB-ALLOTMENTS-2          PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-1       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-1      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-1   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-1     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-2       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-2      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-2   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-2     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-3       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-3      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-3   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-3     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-4       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-4      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-4   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-4     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-5       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-5      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-5   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-5     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-6       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-6      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-6   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-6     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-7       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-7      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-7   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-7     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-8       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-8      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-8   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-8     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-9       PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-9      PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-9   PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-9     PIC S9(9)V99.
           03  QBYB-INS-NO-ELIG-2-10      PIC S9(7).
           03  QBYB-INS-NO-WROTE-2-10     PIC S9(7).
           03  QBYB-INS-NO-NOTWROTE-2-10  PIC S9(7).
           03  QBYB-INS-AMT-WROTE-2-10    PIC S9(9)V99.
           03  QBYB-FEE-NO-ELIG-2-1       PIC S9(7).
           03  QBYB-FEE-NO-WROTE-2-1      PIC S9(7).
           03  QBYB-FEE-NO-NOTWROTE-2-1   PIC S9(7).
           03  QBYB-FEE-AMT-WROTE-2-1     PIC S9(9)V99.
           03  QBYB-FEE-NO-ELIG-2-2       PIC S9(7).
           03  QBYB-FEE-NO-WROTE-2-2      PIC S9(7).
           03  QBYB-FEE-NO-NOTWROTE-2-2   PIC S9(7).
           03  QBYB-FEE-AMT-WROTE-2-2     PIC S9(9)V99.
           03  QBYB-FEE-NO-ELIG-2-3       PIC S9(7).
           03  QBYB-FEE-NO-WROTE-2-3      PIC S9(7).
           03  QBYB-FEE-NO-NOTWROTE-2-3   PIC S9(7).
           03  QBYB-FEE-AMT-WROTE-2-3     PIC S9(9)V99.
           03  QBYB-OTH-NO-COL-2          PIC S9(7).
           03  QBYB-OT2-NO-COL-2          PIC S9(7).
           03  QBYB-INT-NO-COL-2          PIC S9(7).
           03  QBYB-LATE-NO-COL-2         PIC S9(7).
           03  QBYB-OTH-NO-WAIVED-2       PIC S9(7).
           03  QBYB-OT2-NO-WAIVED-2       PIC S9(7).
           03  QBYB-INT-NO-WAIVED-2       PIC S9(7).
           03  QBYB-LATE-NO-WAIVED-2      PIC S9(7).
           03  QBYB-OTH-AMT-WAIVED-2      PIC S9(9)V99.
           03  QBYB-OT2-AMT-WAIVED-2      PIC S9(9)V99.
           03  QBYB-INT-AMT-WAIVED-2      PIC S9(9)V99.
           03  QBYB-LATE-AMT-WAIVED-2     PIC S9(9)V99.
           03  QBYB-UNITS-1-1-1           PIC S9(7).
           03  QBYB-OUTBAL-1-1-1          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-2           PIC S9(7).
           03  QBYB-OUTBAL-1-1-2          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-3           PIC S9(7).
           03  QBYB-OUTBAL-1-1-3          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-4           PIC S9(7).
           03  QBYB-OUTBAL-1-1-4          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-5           PIC S9(7).
           03  QBYB-OUTBAL-1-1-5          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-6           PIC S9(7).
           03  QBYB-OUTBAL-1-1-6          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-7           PIC S9(7).
           03  QBYB-OUTBAL-1-1-7          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-8           PIC S9(7).
           03  QBYB-OUTBAL-1-1-8          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-9           PIC S9(7).
           03  QBYB-OUTBAL-1-1-9          PIC S9(9)V99.
           03  QBYB-UNITS-1-1-10          PIC S9(7).
           03  QBYB-OUTBAL-1-1-10         PIC S9(9)V99.
           03  QBYB-UNITS-1-2-1           PIC S9(7).
           03  QBYB-OUTBAL-1-2-1          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-2           PIC S9(7).
           03  QBYB-OUTBAL-1-2-2          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-3           PIC S9(7).
           03  QBYB-OUTBAL-1-2-3          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-4           PIC S9(7).
           03  QBYB-OUTBAL-1-2-4          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-5           PIC S9(7).
           03  QBYB-OUTBAL-1-2-5          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-6           PIC S9(7).
           03  QBYB-OUTBAL-1-2-6          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-7           PIC S9(7).
           03  QBYB-OUTBAL-1-2-7          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-8           PIC S9(7).
           03  QBYB-OUTBAL-1-2-8          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-9           PIC S9(7).
           03  QBYB-OUTBAL-1-2-9          PIC S9(9)V99.
           03  QBYB-UNITS-1-2-10          PIC S9(7).
           03  QBYB-OUTBAL-1-2-10         PIC S9(9)V99.
           03  QBYB-UNITS-2-1-1           PIC S9(7).
           03  QBYB-OUTBAL-2-1-1          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-2           PIC S9(7).
           03  QBYB-OUTBAL-2-1-2          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-3           PIC S9(7).
           03  QBYB-OUTBAL-2-1-3          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-4           PIC S9(7).
           03  QBYB-OUTBAL-2-1-4          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-5           PIC S9(7).
           03  QBYB-OUTBAL-2-1-5          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-6           PIC S9(7).
           03  QBYB-OUTBAL-2-1-6          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-7           PIC S9(7).
           03  QBYB-OUTBAL-2-1-7          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-8           PIC S9(7).
           03  QBYB-OUTBAL-2-1-8          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-9           PIC S9(7).
           03  QBYB-OUTBAL-2-1-9          PIC S9(9)V99.
           03  QBYB-UNITS-2-1-10          PIC S9(7).
           03  QBYB-OUTBAL-2-1-10         PIC S9(9)V99.
           03  QBYB-UNITS-2-2-1           PIC S9(7).
           03  QBYB-OUTBAL-2-2-1          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-2           PIC S9(7).
           03  QBYB-OUTBAL-2-2-2          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-3           PIC S9(7).
           03  QBYB-OUTBAL-2-2-3          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-4           PIC S9(7).
           03  QBYB-OUTBAL-2-2-4          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-5           PIC S9(7).
           03  QBYB-OUTBAL-2-2-5          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-6           PIC S9(7).
           03  QBYB-OUTBAL-2-2-6          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-7           PIC S9(7).
           03  QBYB-OUTBAL-2-2-7          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-8           PIC S9(7).
           03  QBYB-OUTBAL-2-2-8          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-9           PIC S9(7).
           03  QBYB-OUTBAL-2-2-9          PIC S9(9)V99.
           03  QBYB-UNITS-2-2-10          PIC S9(7).
           03  QBYB-OUTBAL-2-2-10         PIC S9(9)V99.
           03  QBYB-UNITS-3-1-1           PIC S9(7).
           03  QBYB-OUTBAL-3-1-1          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-2           PIC S9(7).
           03  QBYB-OUTBAL-3-1-2          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-3           PIC S9(7).
           03  QBYB-OUTBAL-3-1-3          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-4           PIC S9(7).
           03  QBYB-OUTBAL-3-1-4          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-5           PIC S9(7).
           03  QBYB-OUTBAL-3-1-5          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-6           PIC S9(7).
           03  QBYB-OUTBAL-3-1-6          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-7           PIC S9(7).
           03  QBYB-OUTBAL-3-1-7          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-8           PIC S9(7).
           03  QBYB-OUTBAL-3-1-8          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-9           PIC S9(7).
           03  QBYB-OUTBAL-3-1-9          PIC S9(9)V99.
           03  QBYB-UNITS-3-1-10          PIC S9(7).
           03  QBYB-OUTBAL-3-1-10         PIC S9(9)V99.
           03  QBYB-UNITS-3-2-1           PIC S9(7).
           03  QBYB-OUTBAL-3-2-1          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-2           PIC S9(7).
           03  QBYB-OUTBAL-3-2-2          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-3           PIC S9(7).
           03  QBYB-OUTBAL-3-2-3          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-4           PIC S9(7).
           03  QBYB-OUTBAL-3-2-4          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-5           PIC S9(7).
           03  QBYB-OUTBAL-3-2-5          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-6           PIC S9(7).
           03  QBYB-OUTBAL-3-2-6          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-7           PIC S9(7).
           03  QBYB-OUTBAL-3-2-7          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-8           PIC S9(7).
           03  QBYB-OUTBAL-3-2-8          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-9           PIC S9(7).
           03  QBYB-OUTBAL-3-2-9          PIC S9(9)V99.
           03  QBYB-UNITS-3-2-10          PIC S9(7).
           03  QBYB-OUTBAL-3-2-10         PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-1    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-1   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-2    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-2   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-3    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-3   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-4    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-4   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-5    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-5   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-6    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-6   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-7    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-7   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-8    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-8   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-9    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-9   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-1-10   PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-1-10  PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-1    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-1   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-2    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-2   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-3    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-3   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-4    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-4   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-5    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-5   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-6    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-6   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-7    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-7   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-8    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-8   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-9    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-9   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-1-2-10   PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-1-2-10  PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-1    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-1   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-2    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-2   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-3    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-3   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-4    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-4   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-5    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-5   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-6    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-6   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-7    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-7   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-8    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-8   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-9    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-9   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-1-10   PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-1-10  PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-1    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-1   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-2    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-2   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-3    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-3   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-4    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-4   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-5    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-5   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-6    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-6   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-7    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-7   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-8    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-8   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-9    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-9   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-2-2-10   PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-2-2-10  PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-1    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-1   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-2    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-2   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-3    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-3   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-4    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-4   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-5    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-5   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-6    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-6   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-7    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-7   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-8    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-8   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-9    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-9   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-1-10   PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-1-10  PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-1    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-1   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-2    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-2   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-3    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-3   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-4    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-4   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-5    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-5   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-6    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-6   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-7    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-7   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-8    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-8   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-9    PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-9   PIC S9(9)V99.
           03  QBYB-UNITS-BNKRPT-3-2-10   PIC S9(7).
           03  QBYB-OUTBAL-BNKRPT-3-2-10  PIC S9(9)V99.
           03  QBYB-SUMWGTTM              PIC S9(8).
           03  QBYB-SUMWGTAV              PIC S9(9)V99.
           03  QBYB-SUMWGTTA              PIC S9(11)V99.
           03  QBYB-IB-ACCRUED            PIC S9(7)V99.
           03  QBYB-DLDISC-1              PIC S9(9)V99.
           03  QBYB-DLDISC-2              PIC S9(9)V99.
           03  QBYB-DLDISC-3              PIC S9(9)V99.
           03  QBYB-STD-POS               PIC S9(7).
           03  QBYB-30-DAY-MOVED          PIC S9(7).
           03  QBYB-PROJ-INCREASE         PIC S9(7).
           03  QBYB-PROJ-PROFIT           PIC S9(7).
           03  QBYB-PROCEEDS-1            PIC S9(9)V99.
           03  QBYB-PROCEEDS-2            PIC S9(9)V99.
           03  QBYB-LOCKBOX-1             PIC S9(9)V99.
           03  QBYB-LOCKBOX-2             PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-1    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-2    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-3    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-4    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-5    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-6    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-7    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-8    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-9    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-1-10   PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-1    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-2    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-3    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-4    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-5    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-6    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-7    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-8    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-9    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-1-2-10   PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-1    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-2    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-3    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-4    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-5    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-6    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-7    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-8    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-9    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-1-10   PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-1    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-2    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-3    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-4    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-5    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-6    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-7    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-8    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-9    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-2-2-10   PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-1    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-2    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-3    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-4    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-5    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-6    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-7    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-8    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-9    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-1-10   PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-1    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-2    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-3    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-4    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-5    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-6    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-7    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-8    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-9    PIC S9(9)V99.
           03  QBYB-UNEARNED-AMT-3-2-10   PIC S9(9)V99.

       EXEC SQL END DECLARE SECTION END-EXEC.
