      * COPYMEMBER: LIBLP/LPBWGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - BWFILE
      *
      *=================================================================
      * REV:
      * JKC 2021-0521 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD BW-REC FROM QBW-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-BW-FIELDS.
           MOVE QBW-OWNBR TO BW-OWNBR.
           MOVE QBW-SSNO TO BW-SSNO.
           MOVE QBW-LNAME TO BW-LNAME.
           MOVE QBW-FNAME TO BW-FNAME.
           MOVE QBW-MNAME TO BW-MNAME.
           MOVE QBW-NICKNAME TO BW-NICKNAME.
           MOVE QBW-GENERATION TO BW-GENERATION.
           MOVE QBW-ADR1 TO BW-ADR1.
           MOVE QBW-ADR2 TO BW-ADR2.
           MOVE QBW-CITY TO BW-CITY.
           MOVE QBW-STATE TO BW-STATE.
           MOVE QBW-ZIP TO BW-ZIP.

           IF ( QBW-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-LTOUCH-DATE
           ELSE
              MOVE QBW-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-LTOUCH-DATE.


           IF ( QBW-REFDATE = "1900-01-01" )
              MOVE ZEROES TO BW-REFDATE
           ELSE
              MOVE QBW-REFDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-REFDATE.


           IF ( QBW-BDATE = "1900-01-01" )
              MOVE ZEROES TO BW-BDATE
           ELSE
              MOVE QBW-BDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-BDATE.

           MOVE QBW-PHONE TO BW-PHONE.
           MOVE QBW-CELL-PHONE TO BW-CELL-PHONE.
           MOVE QBW-NATIONALITY TO BW-NATIONALITY.
           MOVE QBW-GENDER TO BW-GENDER.
           MOVE QBW-DEPEND TO BW-DEPEND.
           MOVE QBW-RENTCD TO BW-RENTCD.
           MOVE QBW-TIMEADDR TO BW-TIMEADDR.
           MOVE QBW-CREDITCD TO BW-CREDITCD.
           MOVE QBW-STRTGCD TO BW-STRTGCD.
           MOVE QBW-DWELLCD TO BW-DWELLCD.
           MOVE QBW-COUNTY TO BW-COUNTY.
           MOVE QBW-ORIGIN TO BW-ORIGIN.
           MOVE QBW-CENSUSCD TO BW-CENSUSCD.
           MOVE QBW-ORGSLSMN TO BW-ORGSLSMN.
           MOVE QBW-REPCODE TO BW-REPCODE.
           MOVE QBW-SPSSNO TO BW-SPSSNO.
           MOVE QBW-SPLNAME TO BW-SPLNAME.
           MOVE QBW-SPFNAME TO BW-SPFNAME.

           IF ( QBW-SP-BDATE = "1900-01-01" )
              MOVE ZEROES TO BW-SP-BDATE
           ELSE
              MOVE QBW-SP-BDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-SP-BDATE.

           MOVE QBW-EMPLOYER TO BW-EMPLOYER.
           MOVE QBW-EMPLPOS TO BW-EMPLPOS.
           MOVE QBW-EMPPHONE TO BW-EMPPHONE.
           MOVE QBW-EMPEXT TO BW-EMPEXT.
           MOVE QBW-EMPYEARS TO BW-EMPYEARS.
           MOVE QBW-EMPPAY TO BW-EMPPAY.
           MOVE QBW-EMPPAYOT TO BW-EMPPAYOT.
           MOVE QBW-EMPPAYSR TO BW-EMPPAYSR.
           MOVE QBW-EMPADDR1 TO BW-EMPADDR1.
           MOVE QBW-EMPADDR2 TO BW-EMPADDR2.
           MOVE QBW-EMPCITY TO BW-EMPCITY.
           MOVE QBW-EMPSTATE TO BW-EMPSTATE.
           MOVE QBW-EMPZIP TO BW-EMPZIP.
           MOVE QBW-WORKHRS TO BW-WORKHRS.
           MOVE QBW-LOANS TO BW-LOANS.
           MOVE QBW-INTYTD TO BW-INTYTD.
           MOVE QBW-INTLYR TO BW-INTLYR.
           MOVE QBW-LIASMLN TO BW-LIASMLN.
           MOVE QBW-LIAOTH TO BW-LIAOTH.

           IF ( QBW-LASTPODATE = "1900-01-01" )
              MOVE ZEROES TO BW-LASTPODATE
           ELSE
              MOVE QBW-LASTPODATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-LASTPODATE.

           MOVE QBW-PRLOANS TO BW-PRLOANS.
           MOVE QBW-RE-INTYTD TO BW-RE-INTYTD.
           MOVE QBW-RE-INTLYR TO BW-RE-INTLYR.
           MOVE QBW-CREDIT-LIMIT TO BW-CREDIT-LIMIT.
           MOVE QBW-CREDIT-SCORE TO BW-CREDIT-SCORE.
           MOVE QBW-CRED-SCORE-1 TO BW-CRED-SCORE(1).
           MOVE QBW-CRED-SCORE-2 TO BW-CRED-SCORE(2).
           MOVE QBW-CRED-SCORE-3 TO BW-CRED-SCORE(3).
           MOVE QBW-CRED-SCORE-4 TO BW-CRED-SCORE(4).
           MOVE QBW-BNKRPT-SCORE-1 TO BW-BNKRPT-SCORE(1).
           MOVE QBW-BNKRPT-SCORE-2 TO BW-BNKRPT-SCORE(2).
           MOVE QBW-BNKRPT-SCORE-3 TO BW-BNKRPT-SCORE(3).
           MOVE QBW-BNKRPT-SCORE-4 TO BW-BNKRPT-SCORE(4).
           MOVE QBW-LAST-FORM-NO TO BW-LAST-FORM-NO.

           IF ( QBW-LAST-FORM-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-LAST-FORM-DATE
           ELSE
              MOVE QBW-LAST-FORM-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-LAST-FORM-DATE.


           IF ( QBW-PRIOR-RN-FOR10-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-PRIOR-RN-FOR10-DATE
           ELSE
              MOVE QBW-PRIOR-RN-FOR10-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-PRIOR-RN-FOR10-DATE.


           IF ( QBW-LAST-RN-FOR10-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-LAST-RN-FOR10-DATE
           ELSE
              MOVE QBW-LAST-RN-FOR10-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-LAST-RN-FOR10-DATE.


           IF ( QBW-ADR-PHONE-CHG-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-ADR-PHONE-CHG-DATE
           ELSE
              MOVE QBW-ADR-PHONE-CHG-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-ADR-PHONE-CHG-DATE.

           MOVE QBW-BAD-ADR-FG TO BW-BAD-ADR-FG.
           MOVE QBW-BAD-PHONE-FG TO BW-BAD-PHONE-FG.
           MOVE QBW-BAD-EMPPHONE-FG TO BW-BAD-EMPPHONE-FG.
           MOVE QBW-BAD-MISC-PHONE1-FG TO BW-BAD-MISC-PHONE1-FG.
           MOVE QBW-BAD-MISC-PHONE2-FG TO BW-BAD-MISC-PHONE2-FG.
           MOVE QBW-BAD-CELL-FG TO BW-BAD-CELL-FG.
           MOVE QBW-MISC-PHONE-1 TO BW-MISC-PHONE(1).
           MOVE QBW-MISC-EXT-1 TO BW-MISC-EXT(1).
           MOVE QBW-MISC-PHONE-CD-1 TO BW-MISC-PHONE-CD(1).
           MOVE QBW-MISC-PHONE-2 TO BW-MISC-PHONE(2).
           MOVE QBW-MISC-EXT-2 TO BW-MISC-EXT(2).
           MOVE QBW-MISC-PHONE-CD-2 TO BW-MISC-PHONE-CD(2).
           MOVE QBW-MISC-PHONE-3 TO BW-MISC-PHONE(3).
           MOVE QBW-MISC-EXT-3 TO BW-MISC-EXT(3).
           MOVE QBW-MISC-PHONE-CD-3 TO BW-MISC-PHONE-CD(3).
           MOVE QBW-MISC-PHONE-4 TO BW-MISC-PHONE(4).
           MOVE QBW-MISC-EXT-4 TO BW-MISC-EXT(4).
           MOVE QBW-MISC-PHONE-CD-4 TO BW-MISC-PHONE-CD(4).
           MOVE QBW-MISC-PHONE-5 TO BW-MISC-PHONE(5).
           MOVE QBW-MISC-EXT-5 TO BW-MISC-EXT(5).
           MOVE QBW-MISC-PHONE-CD-5 TO BW-MISC-PHONE-CD(5).
           MOVE QBW-MISC-PHONE-6 TO BW-MISC-PHONE(6).
           MOVE QBW-MISC-EXT-6 TO BW-MISC-EXT(6).
           MOVE QBW-MISC-PHONE-CD-6 TO BW-MISC-PHONE-CD(6).
           MOVE QBW-CONTACT-DESC-1 TO BW-CONTACT-DESC(1).
           MOVE QBW-CONTACT-PHONE-1 TO BW-CONTACT-PHONE(1).
           MOVE QBW-CONTACT-EXT-1 TO BW-CONTACT-EXT(1).
           MOVE QBW-CONTACT-RELATION-1 TO BW-CONTACT-RELATION(1).
           MOVE QBW-CONTACT-DESC-2 TO BW-CONTACT-DESC(2).
           MOVE QBW-CONTACT-PHONE-2 TO BW-CONTACT-PHONE(2).
           MOVE QBW-CONTACT-EXT-2 TO BW-CONTACT-EXT(2).
           MOVE QBW-CONTACT-RELATION-2 TO BW-CONTACT-RELATION(2).
           MOVE QBW-CONTACT-DESC-3 TO BW-CONTACT-DESC(3).
           MOVE QBW-CONTACT-PHONE-3 TO BW-CONTACT-PHONE(3).
           MOVE QBW-CONTACT-EXT-3 TO BW-CONTACT-EXT(3).
           MOVE QBW-CONTACT-RELATION-3 TO BW-CONTACT-RELATION(3).
           MOVE QBW-CONTACT-DESC-4 TO BW-CONTACT-DESC(4).
           MOVE QBW-CONTACT-PHONE-4 TO BW-CONTACT-PHONE(4).
           MOVE QBW-CONTACT-EXT-4 TO BW-CONTACT-EXT(4).
           MOVE QBW-CONTACT-RELATION-4 TO BW-CONTACT-RELATION(4).
           MOVE QBW-CONTACT-DESC-5 TO BW-CONTACT-DESC(5).
           MOVE QBW-CONTACT-PHONE-5 TO BW-CONTACT-PHONE(5).
           MOVE QBW-CONTACT-EXT-5 TO BW-CONTACT-EXT(5).
           MOVE QBW-CONTACT-RELATION-5 TO BW-CONTACT-RELATION(5).
           MOVE QBW-CONTACT-DESC-6 TO BW-CONTACT-DESC(6).
           MOVE QBW-CONTACT-PHONE-6 TO BW-CONTACT-PHONE(6).
           MOVE QBW-CONTACT-EXT-6 TO BW-CONTACT-EXT(6).
           MOVE QBW-CONTACT-RELATION-6 TO BW-CONTACT-RELATION(6).
           MOVE QBW-CONTACT-DESC-7 TO BW-CONTACT-DESC(7).
           MOVE QBW-CONTACT-PHONE-7 TO BW-CONTACT-PHONE(7).
           MOVE QBW-CONTACT-EXT-7 TO BW-CONTACT-EXT(7).
           MOVE QBW-CONTACT-RELATION-7 TO BW-CONTACT-RELATION(7).
           MOVE QBW-CONTACT-DESC-8 TO BW-CONTACT-DESC(8).
           MOVE QBW-CONTACT-PHONE-8 TO BW-CONTACT-PHONE(8).
           MOVE QBW-CONTACT-EXT-8 TO BW-CONTACT-EXT(8).
           MOVE QBW-CONTACT-RELATION-8 TO BW-CONTACT-RELATION(8).
           MOVE QBW-CONTACT-DESC-9 TO BW-CONTACT-DESC(9).
           MOVE QBW-CONTACT-PHONE-9 TO BW-CONTACT-PHONE(9).
           MOVE QBW-CONTACT-EXT-9 TO BW-CONTACT-EXT(9).
           MOVE QBW-CONTACT-RELATION-9 TO BW-CONTACT-RELATION(9).
           MOVE QBW-CONTACT-DESC-10 TO BW-CONTACT-DESC(10).
           MOVE QBW-CONTACT-PHONE-10 TO BW-CONTACT-PHONE(10).
           MOVE QBW-CONTACT-EXT-10 TO BW-CONTACT-EXT(10).
           MOVE QBW-CONTACT-RELATION-10 TO BW-CONTACT-RELATION(10).
           MOVE QBW-SRCD TO BW-SRCD.
           MOVE QBW-CALL-ON-SUNDAY TO BW-CALL-ON-SUNDAY.
           MOVE QBW-SOLICIT TO BW-SOLICIT.
           MOVE QBW-CONFIDENTIAL TO BW-CONFIDENTIAL.
           MOVE QBW-PRIVACY-OPT-OUT TO BW-PRIVACY-OPT-OUT.
           MOVE QBW-OPT-IN-EMAIL TO BW-OPT-IN-EMAIL.
           MOVE QBW-OPT-IN-TEXT TO BW-OPT-IN-TEXT.
           MOVE QBW-CITY-TAX-CD TO BW-CITY-TAX-CD.

           IF ( QBW-DEALTRACK-CHG-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-DEALTRACK-CHG-DATE
           ELSE
              MOVE QBW-DEALTRACK-CHG-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-DEALTRACK-CHG-DATE.

           MOVE QBW-DECEASED TO BW-DECEASED.

           IF ( QBW-DECEASED-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-DECEASED-DATE
           ELSE
              MOVE QBW-DECEASED-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-DECEASED-DATE.

           MOVE QBW-EMAIL TO BW-EMAIL.
           MOVE QBW-IDENT-NO TO BW-IDENT-NO.
           MOVE QBW-IDENT-TYPE TO BW-IDENT-TYPE.
           MOVE QBW-IDENT-STATE   TO BW-IDENT-STATE.
           MOVE QBW-MILITARY-FLAG TO BW-MILITARY-FLAG.
           MOVE QBW-ORGBR         TO BW-ORGBR.
           IF ( QBW-CEASE-DESIST-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-CEASE-DESIST-DATE
           ELSE
              MOVE QBW-CEASE-DESIST-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-CEASE-DESIST-DATE.
           MOVE QBW-CEASE-DESIST-TYPE TO BW-CEASE-DESIST-TYPE.
           IF ( QBW-UMC-EXPIRE-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-UMC-EXPIRE-DATE
           ELSE
              MOVE QBW-UMC-EXPIRE-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-UMC-EXPIRE-DATE.
           IF ( QBW-UMC-PR-EXPIRE-DATE = "1900-01-01" )
              MOVE ZEROES TO BW-UMC-PR-EXPIRE-DATE
           ELSE
              MOVE QBW-UMC-PR-EXPIRE-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO BW-UMC-PR-EXPIRE-DATE.
      *    MOVE QBW-VISION-KEY1   TO BW-VISION-KEY1.
      *    MOVE QBW-VISION-KEY2   TO BW-VISION-KEY2.
      *    MOVE QBW-VISION-KEY3   TO BW-VISION-KEY3.
      *    MOVE QBW-VISION-KEY4   TO BW-VISION-KEY4.
 
      *-----------------------------------------------------------------
      *    LOAD QBW-REC FROM BW-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-BW-FIELDS.
           MOVE BW-OWNBR TO QBW-OWNBR.
           MOVE BW-SSNO TO QBW-SSNO.
           MOVE BW-LNAME TO QBW-LNAME.
           MOVE BW-FNAME TO QBW-FNAME.
           MOVE BW-MNAME TO QBW-MNAME.
           MOVE BW-NICKNAME TO QBW-NICKNAME.
           MOVE BW-GENERATION TO QBW-GENERATION.
           MOVE BW-ADR1 TO QBW-ADR1.
           MOVE BW-ADR2 TO QBW-ADR2.
           MOVE BW-CITY TO QBW-CITY.
           MOVE BW-STATE TO QBW-STATE.
           MOVE BW-ZIP TO QBW-ZIP.

           IF ( BW-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-LTOUCH-DATE
           ELSE
              MOVE BW-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-LTOUCH-DATE.


           IF ( BW-REFDATE = ZEROES )
              MOVE "1900-01-01" TO QBW-REFDATE
           ELSE
              MOVE BW-REFDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-REFDATE.


           IF ( BW-BDATE = ZEROES )
              MOVE "1900-01-01" TO QBW-BDATE
           ELSE
              MOVE BW-BDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-BDATE.

           MOVE BW-PHONE TO QBW-PHONE.
           MOVE BW-CELL-PHONE TO QBW-CELL-PHONE.
           MOVE BW-NATIONALITY TO QBW-NATIONALITY.
           MOVE BW-GENDER TO QBW-GENDER.
           MOVE BW-DEPEND TO QBW-DEPEND.
           MOVE BW-RENTCD TO QBW-RENTCD.
           MOVE BW-TIMEADDR TO QBW-TIMEADDR.
           MOVE BW-CREDITCD TO QBW-CREDITCD.
           MOVE BW-STRTGCD TO QBW-STRTGCD.
           MOVE BW-DWELLCD TO QBW-DWELLCD.
           MOVE BW-COUNTY TO QBW-COUNTY.
           MOVE BW-ORIGIN TO QBW-ORIGIN.
           MOVE BW-CENSUSCD TO QBW-CENSUSCD.
           MOVE BW-ORGSLSMN TO QBW-ORGSLSMN.
           MOVE BW-REPCODE TO QBW-REPCODE.
           MOVE BW-SPSSNO TO QBW-SPSSNO.
           MOVE BW-SPLNAME TO QBW-SPLNAME.
           MOVE BW-SPFNAME TO QBW-SPFNAME.

           IF ( BW-SP-BDATE = ZEROES )
              MOVE "1900-01-01" TO QBW-SP-BDATE
           ELSE
              MOVE BW-SP-BDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-SP-BDATE.

           MOVE BW-EMPLOYER TO QBW-EMPLOYER.
           MOVE BW-EMPLPOS TO QBW-EMPLPOS.
           MOVE BW-EMPPHONE TO QBW-EMPPHONE.
           MOVE BW-EMPEXT TO QBW-EMPEXT.
           MOVE BW-EMPYEARS TO QBW-EMPYEARS.
           MOVE BW-EMPPAY TO QBW-EMPPAY.
           MOVE BW-EMPPAYOT TO QBW-EMPPAYOT.
           MOVE BW-EMPPAYSR TO QBW-EMPPAYSR.
           MOVE BW-EMPADDR1 TO QBW-EMPADDR1.
           MOVE BW-EMPADDR2 TO QBW-EMPADDR2.
           MOVE BW-EMPCITY TO QBW-EMPCITY.
           MOVE BW-EMPSTATE TO QBW-EMPSTATE.
           MOVE BW-EMPZIP TO QBW-EMPZIP.
           MOVE BW-WORKHRS TO QBW-WORKHRS.
           MOVE BW-LOANS TO QBW-LOANS.
           MOVE BW-INTYTD TO QBW-INTYTD.
           MOVE BW-INTLYR TO QBW-INTLYR.
           MOVE BW-LIASMLN TO QBW-LIASMLN.
           MOVE BW-LIAOTH TO QBW-LIAOTH.

           IF ( BW-LASTPODATE = ZEROES )
              MOVE "1900-01-01" TO QBW-LASTPODATE
           ELSE
              MOVE BW-LASTPODATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-LASTPODATE.

           MOVE BW-PRLOANS TO QBW-PRLOANS.
           MOVE BW-RE-INTYTD TO QBW-RE-INTYTD.
           MOVE BW-RE-INTLYR TO QBW-RE-INTLYR.
           MOVE BW-CREDIT-LIMIT TO QBW-CREDIT-LIMIT.
           MOVE BW-CREDIT-SCORE TO QBW-CREDIT-SCORE.
           MOVE BW-CRED-SCORE(1) TO QBW-CRED-SCORE-1.
           MOVE BW-CRED-SCORE(2) TO QBW-CRED-SCORE-2.
           MOVE BW-CRED-SCORE(3) TO QBW-CRED-SCORE-3.
           MOVE BW-CRED-SCORE(4) TO QBW-CRED-SCORE-4.
           MOVE BW-BNKRPT-SCORE(1) TO QBW-BNKRPT-SCORE-1.
           MOVE BW-BNKRPT-SCORE(2) TO QBW-BNKRPT-SCORE-2.
           MOVE BW-BNKRPT-SCORE(3) TO QBW-BNKRPT-SCORE-3.
           MOVE BW-BNKRPT-SCORE(4) TO QBW-BNKRPT-SCORE-4.
           MOVE BW-LAST-FORM-NO TO QBW-LAST-FORM-NO.

           IF ( BW-LAST-FORM-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-LAST-FORM-DATE
           ELSE
              MOVE BW-LAST-FORM-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-LAST-FORM-DATE.


           IF ( BW-PRIOR-RN-FOR10-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-PRIOR-RN-FOR10-DATE
           ELSE
              MOVE BW-PRIOR-RN-FOR10-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-PRIOR-RN-FOR10-DATE.


           IF ( BW-LAST-RN-FOR10-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-LAST-RN-FOR10-DATE
           ELSE
              MOVE BW-LAST-RN-FOR10-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-LAST-RN-FOR10-DATE.


           IF ( BW-ADR-PHONE-CHG-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-ADR-PHONE-CHG-DATE
           ELSE
              MOVE BW-ADR-PHONE-CHG-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-ADR-PHONE-CHG-DATE.

           MOVE BW-BAD-ADR-FG TO QBW-BAD-ADR-FG.
           MOVE BW-BAD-PHONE-FG TO QBW-BAD-PHONE-FG.
           MOVE BW-BAD-EMPPHONE-FG TO QBW-BAD-EMPPHONE-FG.
           MOVE BW-BAD-MISC-PHONE1-FG TO QBW-BAD-MISC-PHONE1-FG.
           MOVE BW-BAD-MISC-PHONE2-FG TO QBW-BAD-MISC-PHONE2-FG.
           MOVE BW-BAD-CELL-FG TO QBW-BAD-CELL-FG.
           MOVE BW-MISC-PHONE(1) TO QBW-MISC-PHONE-1.
           MOVE BW-MISC-EXT(1) TO QBW-MISC-EXT-1.
           MOVE BW-MISC-PHONE-CD(1) TO QBW-MISC-PHONE-CD-1.
           MOVE BW-MISC-PHONE(2) TO QBW-MISC-PHONE-2.
           MOVE BW-MISC-EXT(2) TO QBW-MISC-EXT-2.
           MOVE BW-MISC-PHONE-CD(2) TO QBW-MISC-PHONE-CD-2.
           MOVE BW-MISC-PHONE(3) TO QBW-MISC-PHONE-3.
           MOVE BW-MISC-EXT(3) TO QBW-MISC-EXT-3.
           MOVE BW-MISC-PHONE-CD(3) TO QBW-MISC-PHONE-CD-3.
           MOVE BW-MISC-PHONE(4) TO QBW-MISC-PHONE-4.
           MOVE BW-MISC-EXT(4) TO QBW-MISC-EXT-4.
           MOVE BW-MISC-PHONE-CD(4) TO QBW-MISC-PHONE-CD-4.
           MOVE BW-MISC-PHONE(5) TO QBW-MISC-PHONE-5.
           MOVE BW-MISC-EXT(5) TO QBW-MISC-EXT-5.
           MOVE BW-MISC-PHONE-CD(5) TO QBW-MISC-PHONE-CD-5.
           MOVE BW-MISC-PHONE(6) TO QBW-MISC-PHONE-6.
           MOVE BW-MISC-EXT(6) TO QBW-MISC-EXT-6.
           MOVE BW-MISC-PHONE-CD(6) TO QBW-MISC-PHONE-CD-6.
           MOVE BW-CONTACT-DESC(1) TO QBW-CONTACT-DESC-1.
           MOVE BW-CONTACT-PHONE(1) TO QBW-CONTACT-PHONE-1.
           MOVE BW-CONTACT-EXT(1) TO QBW-CONTACT-EXT-1.
           MOVE BW-CONTACT-RELATION(1) TO QBW-CONTACT-RELATION-1.
           MOVE BW-CONTACT-DESC(2) TO QBW-CONTACT-DESC-2.
           MOVE BW-CONTACT-PHONE(2) TO QBW-CONTACT-PHONE-2.
           MOVE BW-CONTACT-EXT(2) TO QBW-CONTACT-EXT-2.
           MOVE BW-CONTACT-RELATION(2) TO QBW-CONTACT-RELATION-2.
           MOVE BW-CONTACT-DESC(3) TO QBW-CONTACT-DESC-3.
           MOVE BW-CONTACT-PHONE(3) TO QBW-CONTACT-PHONE-3.
           MOVE BW-CONTACT-EXT(3) TO QBW-CONTACT-EXT-3.
           MOVE BW-CONTACT-RELATION(3) TO QBW-CONTACT-RELATION-3.
           MOVE BW-CONTACT-DESC(4) TO QBW-CONTACT-DESC-4.
           MOVE BW-CONTACT-PHONE(4) TO QBW-CONTACT-PHONE-4.
           MOVE BW-CONTACT-EXT(4) TO QBW-CONTACT-EXT-4.
           MOVE BW-CONTACT-RELATION(4) TO QBW-CONTACT-RELATION-4.
           MOVE BW-CONTACT-DESC(5) TO QBW-CONTACT-DESC-5.
           MOVE BW-CONTACT-PHONE(5) TO QBW-CONTACT-PHONE-5.
           MOVE BW-CONTACT-EXT(5) TO QBW-CONTACT-EXT-5.
           MOVE BW-CONTACT-RELATION(5) TO QBW-CONTACT-RELATION-5.
           MOVE BW-CONTACT-DESC(6) TO QBW-CONTACT-DESC-6.
           MOVE BW-CONTACT-PHONE(6) TO QBW-CONTACT-PHONE-6.
           MOVE BW-CONTACT-EXT(6) TO QBW-CONTACT-EXT-6.
           MOVE BW-CONTACT-RELATION(6) TO QBW-CONTACT-RELATION-6.
           MOVE BW-CONTACT-DESC(7) TO QBW-CONTACT-DESC-7.
           MOVE BW-CONTACT-PHONE(7) TO QBW-CONTACT-PHONE-7.
           MOVE BW-CONTACT-EXT(7) TO QBW-CONTACT-EXT-7.
           MOVE BW-CONTACT-RELATION(7) TO QBW-CONTACT-RELATION-7.
           MOVE BW-CONTACT-DESC(8) TO QBW-CONTACT-DESC-8.
           MOVE BW-CONTACT-PHONE(8) TO QBW-CONTACT-PHONE-8.
           MOVE BW-CONTACT-EXT(8) TO QBW-CONTACT-EXT-8.
           MOVE BW-CONTACT-RELATION(8) TO QBW-CONTACT-RELATION-8.
           MOVE BW-CONTACT-DESC(9) TO QBW-CONTACT-DESC-9.
           MOVE BW-CONTACT-PHONE(9) TO QBW-CONTACT-PHONE-9.
           MOVE BW-CONTACT-EXT(9) TO QBW-CONTACT-EXT-9.
           MOVE BW-CONTACT-RELATION(9) TO QBW-CONTACT-RELATION-9.
           MOVE BW-CONTACT-DESC(10) TO QBW-CONTACT-DESC-10.
           MOVE BW-CONTACT-PHONE(10) TO QBW-CONTACT-PHONE-10.
           MOVE BW-CONTACT-EXT(10) TO QBW-CONTACT-EXT-10.
           MOVE BW-CONTACT-RELATION(10) TO QBW-CONTACT-RELATION-10.
           MOVE BW-SRCD TO QBW-SRCD.
           MOVE BW-CALL-ON-SUNDAY TO QBW-CALL-ON-SUNDAY.
           MOVE BW-SOLICIT TO QBW-SOLICIT.
           MOVE BW-CONFIDENTIAL TO QBW-CONFIDENTIAL.
           MOVE BW-PRIVACY-OPT-OUT TO QBW-PRIVACY-OPT-OUT.
           MOVE BW-OPT-IN-EMAIL TO QBW-OPT-IN-EMAIL.
           MOVE BW-OPT-IN-TEXT TO QBW-OPT-IN-TEXT.
           MOVE BW-CITY-TAX-CD TO QBW-CITY-TAX-CD.

           IF ( BW-DEALTRACK-CHG-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-DEALTRACK-CHG-DATE
           ELSE
              MOVE BW-DEALTRACK-CHG-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-DEALTRACK-CHG-DATE.

           MOVE BW-DECEASED TO QBW-DECEASED.

           IF ( BW-DECEASED-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-DECEASED-DATE
           ELSE
              MOVE BW-DECEASED-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-DECEASED-DATE.

           MOVE BW-EMAIL         TO QBW-EMAIL.
           MOVE BW-IDENT-NO      TO QBW-IDENT-NO.
           MOVE BW-IDENT-TYPE    TO QBW-IDENT-TYPE.
           MOVE BW-IDENT-STATE   TO QBW-IDENT-STATE.
           MOVE BW-MILITARY-FLAG TO QBW-MILITARY-FLAG.
           MOVE BW-ORGBR         TO QBW-ORGBR.
           IF ( BW-CEASE-DESIST-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-CEASE-DESIST-DATE
           ELSE
              MOVE BW-CEASE-DESIST-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-CEASE-DESIST-DATE.
           MOVE BW-CEASE-DESIST-TYPE TO QBW-CEASE-DESIST-TYPE.
           IF ( BW-UMC-EXPIRE-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-UMC-EXPIRE-DATE
           ELSE
              MOVE BW-UMC-EXPIRE-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-UMC-EXPIRE-DATE.
           IF ( BW-UMC-PR-EXPIRE-DATE = ZEROES )
              MOVE "1900-01-01" TO QBW-UMC-PR-EXPIRE-DATE
           ELSE
              MOVE BW-UMC-PR-EXPIRE-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QBW-UMC-PR-EXPIRE-DATE.
 
      *    MOVE BW-VISION-KEY1   TO QBW-VISION-KEY1.
      *    MOVE BW-VISION-KEY2   TO QBW-VISION-KEY2.
      *    MOVE BW-VISION-KEY3   TO QBW-VISION-KEY3.
      *    MOVE BW-VISION-KEY4   TO QBW-VISION-KEY4.
