      * COPYMEMBER: LIBLP/LPBYCLW
      *************************************************************
      *    LPBYCLW          BYFILE CLEAR WORKERS
      * REV:
      *  JTG 031097 ADDED BYONH, BYRED & BYSOL
      *************************************************************
      * SUBSCRIPT VALUES:
      * BY-ACTIVITY  NET     TABLE SUBSTRIPT VALUES:
       78  BYCUR             VALUE 1.
       78  BYELM             VALUE 2.
       78  BYELY             VALUE 3.
       78  BYNET             VALUE 1.

      * BY-ACTIVITY  VOLUME  TABLE SUBSTRIPT VALUES:
       78  BYMTD             VALUE 1.
       78  BYYTD             VALUE 2.
       78  BYLYR             VALUE 3.
       78  BYVOL             VALUE 2.

      * BY-MTD-YTD           TABLE SUBSCRIPT VALUES:
      *78  BYMTD             VALUE 1.
      *78  BYYTD             VALUE 2.

      * BY-NOW-BMO-LME       TABLE SUBSCRIPT VALUES:
       78  BYNOW             VALUE 1.
       78  BYBMO             VALUE 2.
       78  BYLME             VALUE 3.
       78  BYREC             VALUE 1.
       78  BYCON             VALUE 2.

      * BY REPO TABLE SUBSTRIPT VALUES:
       78  BYONH             VALUE 1.
       78  BYRED             VALUE 2.
       78  BYSOL             VALUE 3.

      * SUBSCRIPTS:
       01  BYSUB1            PIC 9(3)  COMP.
       01  BYSUB2            PIC 9(3)  COMP.
       01  BYSUB3            PIC 9(3)  COMP.

