      * COPYMEMBER: LIBLP/LPDS1IN
       LOAD-DS1-FILE.
      *- - - -{ SET OVERRIDE TO A "Y" TO NOT TOUCH THE PATH AT ALL  }- -
           IF ( DS-PATH-OVERRIDE = "Y" ) 
              NEXT SENTENCE
           ELSE
      *- - - -{ SPACES IS THE DEFAULT, NO CROSSING BRANCHES }- - - - - -
           IF ( DS-PATH-OVERRIDE = SPACES ) 
              MOVE EXT-FILPATH-BASE        TO DS-ALL-BASE
              MOVE EXT-FILPATH-MACHINE     TO DS-ALL-MACHINE
              MOVE EXT-FILPATH-DATA        TO DS-ALL-DATA
              MOVE DS-ALL-PATH             TO DS-PATH
           ELSE
      *- - - -{ USE BRANCH VALUES }- - - - - - - - - - - - - - - - - - -
           IF ( DS-PATH-OVERRIDE = "B" ) 
              MOVE FILPATH-BASE            TO DS-ALL-BASE
              MOVE FILPATH-MACHINE         TO DS-ALL-MACHINE
              MOVE FILPATH-DATA            TO DS-ALL-DATA
              MOVE DS-ALL-PATH             TO DS-PATH.

      *-----------------------------------------------------------------
       OPEN-DS1-FILE.
           PERFORM LOAD-DS1-FILE.
           PERFORM OPEN-IT.
           MOVE DS-PATH-SQL TO E-FILE.

      *    IF ( SQL-CONNECT-STAT-BAD )
      *       PERFORM SQL-CONNECT.

      *-----------------------------------------------------------------
       START-DS1-FILE.
           PERFORM START-IT.
           MOVE DS-PATH-OWNBR  TO DS-BRANCH.
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.

           IF ( DS1-CURSOR-STAT-GOOD )
              PERFORM CLOSE-DS1-FILE.

           IF ( QDS1-WEND-CLASS = ZEROES    ) OR
              ( QDS1-WEND-CLASS NOT NUMERIC )
              MOVE DS-PATH-OWNBR        TO QDS1-WBEG-BRANCH
              MOVE DS-PATH-OWNBR        TO QDS1-WEND-BRANCH
              MOVE DS-DATE-CCYYMM       TO QDS1-WBEG-DATE-CCYYMM
              MOVE ALL "9"              TO QDS1-WEND-DATE-CCYYMM
                                           QDS1-WEND-NUM
                                           QDS1-WEND-CLASS
              MOVE DS-NUM               TO QDS1-WBEG-NUM
              MOVE DS-CLASS             TO QDS1-WBEG-CLASS.


           EXEC SQL
            DECLARE DS1_CURSOR CURSOR FOR
            SELECT DSFILE.DS_DATE_CCYYMM,
                   DSFILE.DS_BRANCH,
                   DSFILE.DS_NUM,
                   DSFILE.DS_CLASS,
                   DSFILE.DS_DLRVPRIN_1,
                   DSFILE.DS_DLRVPRIN_2,
                   DSFILE.DS_DLRVPRIN_3,
                   DSFILE.DS_DLRVCHGS_1,
                   DSFILE.DS_DLRVCHGS_2,
                   DSFILE.DS_DLRVCHGS_3,
                   DSFILE.DS_DLPARVHELD,
                   DSFILE.DS_UNPAIDCK,
                   DSFILE.DS_DLDISC,
                   DSFILE.DS_DLPARVPAID,
                   DSFILE.DS_SUMWGTTM,
                   DSFILE.DS_SUMWGTAV,
                   DSFILE.DS_SUMWGTTA,
                   DSFILE.DS_RCOURSE_UNITS_1,
                   DSFILE.DS_RCOURSE_UNITS_2,
                   DSFILE.DS_RCOURSE_UNITS_3,
                   DSFILE.DS_RCOURSE_AMT_1,
                   DSFILE.DS_RCOURSE_AMT_2,
                   DSFILE.DS_RCOURSE_AMT_3,
                   DSFILE.DS_NPURUNIT_1,
                   DSFILE.DS_NPURUNIT_2,
                   DSFILE.DS_NPURUNIT_3,
                   DSFILE.DS_NPURAMT_1,
                   DSFILE.DS_NPURAMT_2,
                   DSFILE.DS_NPURAMT_3,
                   DSFILE.DS_OPURUNIT_1,
                   DSFILE.DS_OPURUNIT_2,
                   DSFILE.DS_OPURUNIT_3,
                   DSFILE.DS_OPURAMT_1,
                   DSFILE.DS_OPURAMT_2,
                   DSFILE.DS_OPURAMT_3,
                   DSFILE.DS_RNEWUNIT_1,
                   DSFILE.DS_RNEWUNIT_2,
                   DSFILE.DS_RNEWUNIT_3,
                   DSFILE.DS_RNEWAMT_1,
                   DSFILE.DS_RNEWAMT_2,
                   DSFILE.DS_RNEWAMT_3,
                   DSFILE.DS_PAIDUNIT_1,
                   DSFILE.DS_PAIDUNIT_2,
                   DSFILE.DS_PAIDUNIT_3,
                   DSFILE.DS_PAIDAMT_1,
                   DSFILE.DS_PAIDAMT_2,
                   DSFILE.DS_PAIDAMT_3,
                   DSFILE.DS_TODLUNIT_1,
                   DSFILE.DS_TODLUNIT_2,
                   DSFILE.DS_TODLUNIT_3,
                   DSFILE.DS_TODLAMT_1,
                   DSFILE.DS_TODLAMT_2,
                   DSFILE.DS_TODLAMT_3,
                   DSFILE.DS_OUTSUNIT_1,
                   DSFILE.DS_OUTSUNIT_2,
                   DSFILE.DS_OUTSUNIT_3,
                   DSFILE.DS_OUTSAMT_1,
                   DSFILE.DS_OUTSAMT_2,
                   DSFILE.DS_OUTSAMT_3,
                   DSFILE.DS_PLOSUNIT_1,
                   DSFILE.DS_PLOSUNIT_2,
                   DSFILE.DS_PLOSUNIT_3,
                   DSFILE.DS_PLOSAMT_1,
                   DSFILE.DS_PLOSAMT_2,
                   DSFILE.DS_PLOSAMT_3,
                   DSFILE.DS_RCPLUNIT_1,
                   DSFILE.DS_RCPLUNIT_2,
                   DSFILE.DS_RCPLUNIT_3,
                   DSFILE.DS_RCPLAMT_1,
                   DSFILE.DS_RCPLAMT_2,
                   DSFILE.DS_RCPLAMT_3,
                   DSFILE.DS_JDOSUNIT_1,
                   DSFILE.DS_JDOSUNIT_2,
                   DSFILE.DS_JDOSUNIT_3,
                   DSFILE.DS_JDOSAMT_1,
                   DSFILE.DS_JDOSAMT_2,
                   DSFILE.DS_JDOSAMT_3,
                   CAST(DSFILE.DS_DELUNEARN_DATE
                                                  AS VARCHAR(10)),
                   DSFILE.DS_PROCEEDS_1,
                   DSFILE.DS_PROCEEDS_2,
                   DSFILE.DS_NO_REPO_1_1_1,
                   DSFILE.DS_AMT_REPO_1_1_1,
                   DSFILE.DS_NO_REPO_1_1_2,
                   DSFILE.DS_AMT_REPO_1_1_2,
                   DSFILE.DS_NO_REPO_1_1_3,
                   DSFILE.DS_AMT_REPO_1_1_3,
                   DSFILE.DS_NO_REPO_1_1_4,
                   DSFILE.DS_AMT_REPO_1_1_4,
                   DSFILE.DS_NO_REPO_1_1_5,
                   DSFILE.DS_AMT_REPO_1_1_5,
                   DSFILE.DS_NO_REPO_1_2_1,
                   DSFILE.DS_AMT_REPO_1_2_1,
                   DSFILE.DS_NO_REPO_1_2_2,
                   DSFILE.DS_AMT_REPO_1_2_2,
                   DSFILE.DS_NO_REPO_1_2_3,
                   DSFILE.DS_AMT_REPO_1_2_3,
                   DSFILE.DS_NO_REPO_1_2_4,
                   DSFILE.DS_AMT_REPO_1_2_4,
                   DSFILE.DS_NO_REPO_1_2_5,
                   DSFILE.DS_AMT_REPO_1_2_5,
                   DSFILE.DS_NO_REPO_2_1_1,
                   DSFILE.DS_AMT_REPO_2_1_1,
                   DSFILE.DS_NO_REPO_2_1_2,
                   DSFILE.DS_AMT_REPO_2_1_2,
                   DSFILE.DS_NO_REPO_2_1_3,
                   DSFILE.DS_AMT_REPO_2_1_3,
                   DSFILE.DS_NO_REPO_2_1_4,
                   DSFILE.DS_AMT_REPO_2_1_4,
                   DSFILE.DS_NO_REPO_2_1_5,
                   DSFILE.DS_AMT_REPO_2_1_5,
                   DSFILE.DS_NO_REPO_2_2_1,
                   DSFILE.DS_AMT_REPO_2_2_1,
                   DSFILE.DS_NO_REPO_2_2_2,
                   DSFILE.DS_AMT_REPO_2_2_2,
                   DSFILE.DS_NO_REPO_2_2_3,
                   DSFILE.DS_AMT_REPO_2_2_3,
                   DSFILE.DS_NO_REPO_2_2_4,
                   DSFILE.DS_AMT_REPO_2_2_4,
                   DSFILE.DS_NO_REPO_2_2_5,
                   DSFILE.DS_AMT_REPO_2_2_5,
                   DSFILE.DS_NO_REPO_3_1_1,
                   DSFILE.DS_AMT_REPO_3_1_1,
                   DSFILE.DS_NO_REPO_3_1_2,
                   DSFILE.DS_AMT_REPO_3_1_2,
                   DSFILE.DS_NO_REPO_3_1_3,
                   DSFILE.DS_AMT_REPO_3_1_3,
                   DSFILE.DS_NO_REPO_3_1_4,
                   DSFILE.DS_AMT_REPO_3_1_4,
                   DSFILE.DS_NO_REPO_3_1_5,
                   DSFILE.DS_AMT_REPO_3_1_5,
                   DSFILE.DS_NO_REPO_3_2_1,
                   DSFILE.DS_AMT_REPO_3_2_1,
                   DSFILE.DS_NO_REPO_3_2_2,
                   DSFILE.DS_AMT_REPO_3_2_2,
                   DSFILE.DS_NO_REPO_3_2_3,
                   DSFILE.DS_AMT_REPO_3_2_3,
                   DSFILE.DS_NO_REPO_3_2_4,
                   DSFILE.DS_AMT_REPO_3_2_4,
                   DSFILE.DS_NO_REPO_3_2_5,
                   DSFILE.DS_AMT_REPO_3_2_5,
                   DSFILE.DS_UNITS_1_1_1,
                   DSFILE.DS_OUTBAL_1_1_1,
                   DSFILE.DS_UNITS_1_1_2,
                   DSFILE.DS_OUTBAL_1_1_2,
                   DSFILE.DS_UNITS_1_1_3,
                   DSFILE.DS_OUTBAL_1_1_3,
                   DSFILE.DS_UNITS_1_1_4,
                   DSFILE.DS_OUTBAL_1_1_4,
                   DSFILE.DS_UNITS_1_1_5,
                   DSFILE.DS_OUTBAL_1_1_5,
                   DSFILE.DS_UNITS_1_1_6,
                   DSFILE.DS_OUTBAL_1_1_6,
                   DSFILE.DS_UNITS_1_1_7,
                   DSFILE.DS_OUTBAL_1_1_7,
                   DSFILE.DS_UNITS_1_1_8,
                   DSFILE.DS_OUTBAL_1_1_8,
                   DSFILE.DS_UNITS_1_1_9,
                   DSFILE.DS_OUTBAL_1_1_9,
                   DSFILE.DS_UNITS_1_1_10,
                   DSFILE.DS_OUTBAL_1_1_10,
                   DSFILE.DS_UNITS_1_2_1,
                   DSFILE.DS_OUTBAL_1_2_1,
                   DSFILE.DS_UNITS_1_2_2,
                   DSFILE.DS_OUTBAL_1_2_2,
                   DSFILE.DS_UNITS_1_2_3,
                   DSFILE.DS_OUTBAL_1_2_3,
                   DSFILE.DS_UNITS_1_2_4,
                   DSFILE.DS_OUTBAL_1_2_4,
                   DSFILE.DS_UNITS_1_2_5,
                   DSFILE.DS_OUTBAL_1_2_5,
                   DSFILE.DS_UNITS_1_2_6,
                   DSFILE.DS_OUTBAL_1_2_6,
                   DSFILE.DS_UNITS_1_2_7,
                   DSFILE.DS_OUTBAL_1_2_7,
                   DSFILE.DS_UNITS_1_2_8,
                   DSFILE.DS_OUTBAL_1_2_8,
                   DSFILE.DS_UNITS_1_2_9,
                   DSFILE.DS_OUTBAL_1_2_9,
                   DSFILE.DS_UNITS_1_2_10,
                   DSFILE.DS_OUTBAL_1_2_10,
                   DSFILE.DS_UNITS_2_1_1,
                   DSFILE.DS_OUTBAL_2_1_1,
                   DSFILE.DS_UNITS_2_1_2,
                   DSFILE.DS_OUTBAL_2_1_2,
                   DSFILE.DS_UNITS_2_1_3,
                   DSFILE.DS_OUTBAL_2_1_3,
                   DSFILE.DS_UNITS_2_1_4,
                   DSFILE.DS_OUTBAL_2_1_4,
                   DSFILE.DS_UNITS_2_1_5,
                   DSFILE.DS_OUTBAL_2_1_5,
                   DSFILE.DS_UNITS_2_1_6,
                   DSFILE.DS_OUTBAL_2_1_6,
                   DSFILE.DS_UNITS_2_1_7,
                   DSFILE.DS_OUTBAL_2_1_7,
                   DSFILE.DS_UNITS_2_1_8,
                   DSFILE.DS_OUTBAL_2_1_8,
                   DSFILE.DS_UNITS_2_1_9,
                   DSFILE.DS_OUTBAL_2_1_9,
                   DSFILE.DS_UNITS_2_1_10,
                   DSFILE.DS_OUTBAL_2_1_10,
                   DSFILE.DS_UNITS_2_2_1,
                   DSFILE.DS_OUTBAL_2_2_1,
                   DSFILE.DS_UNITS_2_2_2,
                   DSFILE.DS_OUTBAL_2_2_2,
                   DSFILE.DS_UNITS_2_2_3,
                   DSFILE.DS_OUTBAL_2_2_3,
                   DSFILE.DS_UNITS_2_2_4,
                   DSFILE.DS_OUTBAL_2_2_4,
                   DSFILE.DS_UNITS_2_2_5,
                   DSFILE.DS_OUTBAL_2_2_5,
                   DSFILE.DS_UNITS_2_2_6,
                   DSFILE.DS_OUTBAL_2_2_6,
                   DSFILE.DS_UNITS_2_2_7,
                   DSFILE.DS_OUTBAL_2_2_7,
                   DSFILE.DS_UNITS_2_2_8,
                   DSFILE.DS_OUTBAL_2_2_8,
                   DSFILE.DS_UNITS_2_2_9,
                   DSFILE.DS_OUTBAL_2_2_9,
                   DSFILE.DS_UNITS_2_2_10,
                   DSFILE.DS_OUTBAL_2_2_10,
                   DSFILE.DS_UNITS_3_1_1,
                   DSFILE.DS_OUTBAL_3_1_1,
                   DSFILE.DS_UNITS_3_1_2,
                   DSFILE.DS_OUTBAL_3_1_2,
                   DSFILE.DS_UNITS_3_1_3,
                   DSFILE.DS_OUTBAL_3_1_3,
                   DSFILE.DS_UNITS_3_1_4,
                   DSFILE.DS_OUTBAL_3_1_4,
                   DSFILE.DS_UNITS_3_1_5,
                   DSFILE.DS_OUTBAL_3_1_5,
                   DSFILE.DS_UNITS_3_1_6,
                   DSFILE.DS_OUTBAL_3_1_6,
                   DSFILE.DS_UNITS_3_1_7,
                   DSFILE.DS_OUTBAL_3_1_7,
                   DSFILE.DS_UNITS_3_1_8,
                   DSFILE.DS_OUTBAL_3_1_8,
                   DSFILE.DS_UNITS_3_1_9,
                   DSFILE.DS_OUTBAL_3_1_9,
                   DSFILE.DS_UNITS_3_1_10,
                   DSFILE.DS_OUTBAL_3_1_10,
                   DSFILE.DS_UNITS_3_2_1,
                   DSFILE.DS_OUTBAL_3_2_1,
                   DSFILE.DS_UNITS_3_2_2,
                   DSFILE.DS_OUTBAL_3_2_2,
                   DSFILE.DS_UNITS_3_2_3,
                   DSFILE.DS_OUTBAL_3_2_3,
                   DSFILE.DS_UNITS_3_2_4,
                   DSFILE.DS_OUTBAL_3_2_4,
                   DSFILE.DS_UNITS_3_2_5,
                   DSFILE.DS_OUTBAL_3_2_5,
                   DSFILE.DS_UNITS_3_2_6,
                   DSFILE.DS_OUTBAL_3_2_6,
                   DSFILE.DS_UNITS_3_2_7,
                   DSFILE.DS_OUTBAL_3_2_7,
                   DSFILE.DS_UNITS_3_2_8,
                   DSFILE.DS_OUTBAL_3_2_8,
                   DSFILE.DS_UNITS_3_2_9,
                   DSFILE.DS_OUTBAL_3_2_9,
                   DSFILE.DS_UNITS_3_2_10,
                   DSFILE.DS_OUTBAL_3_2_10,
                   DSFILE.DS_UNITS_BNKRPT_1_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_1,
                   DSFILE.DS_UNITS_BNKRPT_1_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_2,
                   DSFILE.DS_UNITS_BNKRPT_1_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_3,
                   DSFILE.DS_UNITS_BNKRPT_1_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_4,
                   DSFILE.DS_UNITS_BNKRPT_1_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_5,
                   DSFILE.DS_UNITS_BNKRPT_1_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_6,
                   DSFILE.DS_UNITS_BNKRPT_1_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_7,
                   DSFILE.DS_UNITS_BNKRPT_1_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_8,
                   DSFILE.DS_UNITS_BNKRPT_1_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_9,
                   DSFILE.DS_UNITS_BNKRPT_1_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_10,
                   DSFILE.DS_UNITS_BNKRPT_1_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_1,
                   DSFILE.DS_UNITS_BNKRPT_1_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_2,
                   DSFILE.DS_UNITS_BNKRPT_1_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_3,
                   DSFILE.DS_UNITS_BNKRPT_1_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_4,
                   DSFILE.DS_UNITS_BNKRPT_1_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_5,
                   DSFILE.DS_UNITS_BNKRPT_1_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_6,
                   DSFILE.DS_UNITS_BNKRPT_1_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_7,
                   DSFILE.DS_UNITS_BNKRPT_1_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_8,
                   DSFILE.DS_UNITS_BNKRPT_1_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_9,
                   DSFILE.DS_UNITS_BNKRPT_1_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_10,
                   DSFILE.DS_UNITS_BNKRPT_2_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_1,
                   DSFILE.DS_UNITS_BNKRPT_2_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_2,
                   DSFILE.DS_UNITS_BNKRPT_2_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_3,
                   DSFILE.DS_UNITS_BNKRPT_2_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_4,
                   DSFILE.DS_UNITS_BNKRPT_2_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_5,
                   DSFILE.DS_UNITS_BNKRPT_2_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_6,
                   DSFILE.DS_UNITS_BNKRPT_2_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_7,
                   DSFILE.DS_UNITS_BNKRPT_2_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_8,
                   DSFILE.DS_UNITS_BNKRPT_2_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_9,
                   DSFILE.DS_UNITS_BNKRPT_2_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_10,
                   DSFILE.DS_UNITS_BNKRPT_2_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_1,
                   DSFILE.DS_UNITS_BNKRPT_2_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_2,
                   DSFILE.DS_UNITS_BNKRPT_2_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_3,
                   DSFILE.DS_UNITS_BNKRPT_2_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_4,
                   DSFILE.DS_UNITS_BNKRPT_2_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_5,
                   DSFILE.DS_UNITS_BNKRPT_2_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_6,
                   DSFILE.DS_UNITS_BNKRPT_2_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_7,
                   DSFILE.DS_UNITS_BNKRPT_2_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_8,
                   DSFILE.DS_UNITS_BNKRPT_2_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_9,
                   DSFILE.DS_UNITS_BNKRPT_2_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_10,
                   DSFILE.DS_UNITS_BNKRPT_3_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_1,
                   DSFILE.DS_UNITS_BNKRPT_3_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_2,
                   DSFILE.DS_UNITS_BNKRPT_3_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_3,
                   DSFILE.DS_UNITS_BNKRPT_3_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_4,
                   DSFILE.DS_UNITS_BNKRPT_3_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_5,
                   DSFILE.DS_UNITS_BNKRPT_3_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_6,
                   DSFILE.DS_UNITS_BNKRPT_3_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_7,
                   DSFILE.DS_UNITS_BNKRPT_3_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_8,
                   DSFILE.DS_UNITS_BNKRPT_3_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_9,
                   DSFILE.DS_UNITS_BNKRPT_3_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_10,
                   DSFILE.DS_UNITS_BNKRPT_3_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_1,
                   DSFILE.DS_UNITS_BNKRPT_3_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_2,
                   DSFILE.DS_UNITS_BNKRPT_3_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_3,
                   DSFILE.DS_UNITS_BNKRPT_3_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_4,
                   DSFILE.DS_UNITS_BNKRPT_3_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_5,
                   DSFILE.DS_UNITS_BNKRPT_3_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_6,
                   DSFILE.DS_UNITS_BNKRPT_3_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_7,
                   DSFILE.DS_UNITS_BNKRPT_3_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_8,
                   DSFILE.DS_UNITS_BNKRPT_3_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_9,
                   DSFILE.DS_UNITS_BNKRPT_3_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_10,
                   DSFILE.DS_UNEARNED_AMT_1_1_1,
                   DSFILE.DS_UNEARNED_AMT_1_1_2,
                   DSFILE.DS_UNEARNED_AMT_1_1_3,
                   DSFILE.DS_UNEARNED_AMT_1_1_4,
                   DSFILE.DS_UNEARNED_AMT_1_1_5,
                   DSFILE.DS_UNEARNED_AMT_1_1_6,
                   DSFILE.DS_UNEARNED_AMT_1_1_7,
                   DSFILE.DS_UNEARNED_AMT_1_1_8,
                   DSFILE.DS_UNEARNED_AMT_1_1_9,
                   DSFILE.DS_UNEARNED_AMT_1_1_10,
                   DSFILE.DS_UNEARNED_AMT_1_2_1,
                   DSFILE.DS_UNEARNED_AMT_1_2_2,
                   DSFILE.DS_UNEARNED_AMT_1_2_3,
                   DSFILE.DS_UNEARNED_AMT_1_2_4,
                   DSFILE.DS_UNEARNED_AMT_1_2_5,
                   DSFILE.DS_UNEARNED_AMT_1_2_6,
                   DSFILE.DS_UNEARNED_AMT_1_2_7,
                   DSFILE.DS_UNEARNED_AMT_1_2_8,
                   DSFILE.DS_UNEARNED_AMT_1_2_9,
                   DSFILE.DS_UNEARNED_AMT_1_2_10,
                   DSFILE.DS_UNEARNED_AMT_2_1_1,
                   DSFILE.DS_UNEARNED_AMT_2_1_2,
                   DSFILE.DS_UNEARNED_AMT_2_1_3,
                   DSFILE.DS_UNEARNED_AMT_2_1_4,
                   DSFILE.DS_UNEARNED_AMT_2_1_5,
                   DSFILE.DS_UNEARNED_AMT_2_1_6,
                   DSFILE.DS_UNEARNED_AMT_2_1_7,
                   DSFILE.DS_UNEARNED_AMT_2_1_8,
                   DSFILE.DS_UNEARNED_AMT_2_1_9,
                   DSFILE.DS_UNEARNED_AMT_2_1_10,
                   DSFILE.DS_UNEARNED_AMT_2_2_1,
                   DSFILE.DS_UNEARNED_AMT_2_2_2,
                   DSFILE.DS_UNEARNED_AMT_2_2_3,
                   DSFILE.DS_UNEARNED_AMT_2_2_4,
                   DSFILE.DS_UNEARNED_AMT_2_2_5,
                   DSFILE.DS_UNEARNED_AMT_2_2_6,
                   DSFILE.DS_UNEARNED_AMT_2_2_7,
                   DSFILE.DS_UNEARNED_AMT_2_2_8,
                   DSFILE.DS_UNEARNED_AMT_2_2_9,
                   DSFILE.DS_UNEARNED_AMT_2_2_10,
                   DSFILE.DS_UNEARNED_AMT_3_1_1,
                   DSFILE.DS_UNEARNED_AMT_3_1_2,
                   DSFILE.DS_UNEARNED_AMT_3_1_3,
                   DSFILE.DS_UNEARNED_AMT_3_1_4,
                   DSFILE.DS_UNEARNED_AMT_3_1_5,
                   DSFILE.DS_UNEARNED_AMT_3_1_6,
                   DSFILE.DS_UNEARNED_AMT_3_1_7,
                   DSFILE.DS_UNEARNED_AMT_3_1_8,
                   DSFILE.DS_UNEARNED_AMT_3_1_9,
                   DSFILE.DS_UNEARNED_AMT_3_1_10,
                   DSFILE.DS_UNEARNED_AMT_3_2_1,
                   DSFILE.DS_UNEARNED_AMT_3_2_2,
                   DSFILE.DS_UNEARNED_AMT_3_2_3,
                   DSFILE.DS_UNEARNED_AMT_3_2_4,
                   DSFILE.DS_UNEARNED_AMT_3_2_5,
                   DSFILE.DS_UNEARNED_AMT_3_2_6,
                   DSFILE.DS_UNEARNED_AMT_3_2_7,
                   DSFILE.DS_UNEARNED_AMT_3_2_8,
                   DSFILE.DS_UNEARNED_AMT_3_2_9,
                   DSFILE.DS_UNEARNED_AMT_3_2_10,
                   DSFILE.DS_DLDISC_VOL_1,
                   DSFILE.DS_DLDISC_VOL_2,
                   DSFILE.DS_DLDISC_VOL_3,
                   DSFILE.DS_AFPDUEDL_MEMO,
                   DSFILE.DS_UNPAID_MANUAL,
                   CAST(DSFILE.DS_LTOUCH_DATE
                                                  AS VARCHAR(10))
            FROM DBO.DSFILE
            WHERE DSFILE.DS_DATE_CCYYMM >= :QDS1-WBEG-DATE-CCYYMM
              AND DSFILE.DS_DATE_CCYYMM <= :QDS1-WEND-DATE-CCYYMM
              AND DSFILE.DS_BRANCH = :QDS1-WBEG-BRANCH
              AND DSFILE.DS_NUM >= :QDS1-WBEG-NUM
              AND DSFILE.DS_NUM <= :QDS1-WEND-NUM
              AND DSFILE.DS_CLASS >= :QDS1-WBEG-CLASS
              AND DSFILE.DS_CLASS <= :QDS1-WEND-CLASS
            ORDER BY DSFILE.DS_DATE_CCYYMM,
                     DSFILE.DS_BRANCH,
                     DSFILE.DS_NUM,
                     DSFILE.DS_CLASS
           END-EXEC.

           EXEC SQL
               OPEN DS1_CURSOR
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           MOVE ZEROES TO QDS1-WBEG-BRANCH 
                          QDS1-WEND-BRANCH
                          QDS1-WBEG-DATE-CCYYMM
                          QDS1-WEND-DATE-CCYYMM
                          QDS1-WBEG-NUM
                          QDS1-WEND-NUM
                          QDS1-WBEG-CLASS
                          QDS1-WEND-CLASS.
 
           MOVE STAT---GOOD TO DS1-CURSOR-STAT.

      *-----------------------------------------------------------------
       READ-DS1-FILE.
           PERFORM READ-IT.
           MOVE DS-PATH-OWNBR  TO DS-BRANCH. 
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.
           INITIALIZE QDS-REC.  

           MOVE DS-DATE-CCYYMM  TO QDS-DATE-CCYYMM.
           MOVE DS-BRANCH       TO QDS-BRANCH.
           MOVE DS-NUM          TO QDS-NUM.
           MOVE DS-CLASS        TO QDS-CLASS.

           EXEC SQL
            SELECT DSFILE.DS_DATE_CCYYMM,
                   DSFILE.DS_BRANCH,
                   DSFILE.DS_NUM,
                   DSFILE.DS_CLASS,
                   DSFILE.DS_DLRVPRIN_1,
                   DSFILE.DS_DLRVPRIN_2,
                   DSFILE.DS_DLRVPRIN_3,
                   DSFILE.DS_DLRVCHGS_1,
                   DSFILE.DS_DLRVCHGS_2,
                   DSFILE.DS_DLRVCHGS_3,
                   DSFILE.DS_DLPARVHELD,
                   DSFILE.DS_UNPAIDCK,
                   DSFILE.DS_DLDISC,
                   DSFILE.DS_DLPARVPAID,
                   DSFILE.DS_SUMWGTTM,
                   DSFILE.DS_SUMWGTAV,
                   DSFILE.DS_SUMWGTTA,
                   DSFILE.DS_RCOURSE_UNITS_1,
                   DSFILE.DS_RCOURSE_UNITS_2,
                   DSFILE.DS_RCOURSE_UNITS_3,
                   DSFILE.DS_RCOURSE_AMT_1,
                   DSFILE.DS_RCOURSE_AMT_2,
                   DSFILE.DS_RCOURSE_AMT_3,
                   DSFILE.DS_NPURUNIT_1,
                   DSFILE.DS_NPURUNIT_2,
                   DSFILE.DS_NPURUNIT_3,
                   DSFILE.DS_NPURAMT_1,
                   DSFILE.DS_NPURAMT_2,
                   DSFILE.DS_NPURAMT_3,
                   DSFILE.DS_OPURUNIT_1,
                   DSFILE.DS_OPURUNIT_2,
                   DSFILE.DS_OPURUNIT_3,
                   DSFILE.DS_OPURAMT_1,
                   DSFILE.DS_OPURAMT_2,
                   DSFILE.DS_OPURAMT_3,
                   DSFILE.DS_RNEWUNIT_1,
                   DSFILE.DS_RNEWUNIT_2,
                   DSFILE.DS_RNEWUNIT_3,
                   DSFILE.DS_RNEWAMT_1,
                   DSFILE.DS_RNEWAMT_2,
                   DSFILE.DS_RNEWAMT_3,
                   DSFILE.DS_PAIDUNIT_1,
                   DSFILE.DS_PAIDUNIT_2,
                   DSFILE.DS_PAIDUNIT_3,
                   DSFILE.DS_PAIDAMT_1,
                   DSFILE.DS_PAIDAMT_2,
                   DSFILE.DS_PAIDAMT_3,
                   DSFILE.DS_TODLUNIT_1,
                   DSFILE.DS_TODLUNIT_2,
                   DSFILE.DS_TODLUNIT_3,
                   DSFILE.DS_TODLAMT_1,
                   DSFILE.DS_TODLAMT_2,
                   DSFILE.DS_TODLAMT_3,
                   DSFILE.DS_OUTSUNIT_1,
                   DSFILE.DS_OUTSUNIT_2,
                   DSFILE.DS_OUTSUNIT_3,
                   DSFILE.DS_OUTSAMT_1,
                   DSFILE.DS_OUTSAMT_2,
                   DSFILE.DS_OUTSAMT_3,
                   DSFILE.DS_PLOSUNIT_1,
                   DSFILE.DS_PLOSUNIT_2,
                   DSFILE.DS_PLOSUNIT_3,
                   DSFILE.DS_PLOSAMT_1,
                   DSFILE.DS_PLOSAMT_2,
                   DSFILE.DS_PLOSAMT_3,
                   DSFILE.DS_RCPLUNIT_1,
                   DSFILE.DS_RCPLUNIT_2,
                   DSFILE.DS_RCPLUNIT_3,
                   DSFILE.DS_RCPLAMT_1,
                   DSFILE.DS_RCPLAMT_2,
                   DSFILE.DS_RCPLAMT_3,
                   DSFILE.DS_JDOSUNIT_1,
                   DSFILE.DS_JDOSUNIT_2,
                   DSFILE.DS_JDOSUNIT_3,
                   DSFILE.DS_JDOSAMT_1,
                   DSFILE.DS_JDOSAMT_2,
                   DSFILE.DS_JDOSAMT_3,
                   CAST(DSFILE.DS_DELUNEARN_DATE
                                                  AS VARCHAR(10)),
                   DSFILE.DS_PROCEEDS_1,
                   DSFILE.DS_PROCEEDS_2,
                   DSFILE.DS_NO_REPO_1_1_1,
                   DSFILE.DS_AMT_REPO_1_1_1,
                   DSFILE.DS_NO_REPO_1_1_2,
                   DSFILE.DS_AMT_REPO_1_1_2,
                   DSFILE.DS_NO_REPO_1_1_3,
                   DSFILE.DS_AMT_REPO_1_1_3,
                   DSFILE.DS_NO_REPO_1_1_4,
                   DSFILE.DS_AMT_REPO_1_1_4,
                   DSFILE.DS_NO_REPO_1_1_5,
                   DSFILE.DS_AMT_REPO_1_1_5,
                   DSFILE.DS_NO_REPO_1_2_1,
                   DSFILE.DS_AMT_REPO_1_2_1,
                   DSFILE.DS_NO_REPO_1_2_2,
                   DSFILE.DS_AMT_REPO_1_2_2,
                   DSFILE.DS_NO_REPO_1_2_3,
                   DSFILE.DS_AMT_REPO_1_2_3,
                   DSFILE.DS_NO_REPO_1_2_4,
                   DSFILE.DS_AMT_REPO_1_2_4,
                   DSFILE.DS_NO_REPO_1_2_5,
                   DSFILE.DS_AMT_REPO_1_2_5,
                   DSFILE.DS_NO_REPO_2_1_1,
                   DSFILE.DS_AMT_REPO_2_1_1,
                   DSFILE.DS_NO_REPO_2_1_2,
                   DSFILE.DS_AMT_REPO_2_1_2,
                   DSFILE.DS_NO_REPO_2_1_3,
                   DSFILE.DS_AMT_REPO_2_1_3,
                   DSFILE.DS_NO_REPO_2_1_4,
                   DSFILE.DS_AMT_REPO_2_1_4,
                   DSFILE.DS_NO_REPO_2_1_5,
                   DSFILE.DS_AMT_REPO_2_1_5,
                   DSFILE.DS_NO_REPO_2_2_1,
                   DSFILE.DS_AMT_REPO_2_2_1,
                   DSFILE.DS_NO_REPO_2_2_2,
                   DSFILE.DS_AMT_REPO_2_2_2,
                   DSFILE.DS_NO_REPO_2_2_3,
                   DSFILE.DS_AMT_REPO_2_2_3,
                   DSFILE.DS_NO_REPO_2_2_4,
                   DSFILE.DS_AMT_REPO_2_2_4,
                   DSFILE.DS_NO_REPO_2_2_5,
                   DSFILE.DS_AMT_REPO_2_2_5,
                   DSFILE.DS_NO_REPO_3_1_1,
                   DSFILE.DS_AMT_REPO_3_1_1,
                   DSFILE.DS_NO_REPO_3_1_2,
                   DSFILE.DS_AMT_REPO_3_1_2,
                   DSFILE.DS_NO_REPO_3_1_3,
                   DSFILE.DS_AMT_REPO_3_1_3,
                   DSFILE.DS_NO_REPO_3_1_4,
                   DSFILE.DS_AMT_REPO_3_1_4,
                   DSFILE.DS_NO_REPO_3_1_5,
                   DSFILE.DS_AMT_REPO_3_1_5,
                   DSFILE.DS_NO_REPO_3_2_1,
                   DSFILE.DS_AMT_REPO_3_2_1,
                   DSFILE.DS_NO_REPO_3_2_2,
                   DSFILE.DS_AMT_REPO_3_2_2,
                   DSFILE.DS_NO_REPO_3_2_3,
                   DSFILE.DS_AMT_REPO_3_2_3,
                   DSFILE.DS_NO_REPO_3_2_4,
                   DSFILE.DS_AMT_REPO_3_2_4,
                   DSFILE.DS_NO_REPO_3_2_5,
                   DSFILE.DS_AMT_REPO_3_2_5,
                   DSFILE.DS_UNITS_1_1_1,
                   DSFILE.DS_OUTBAL_1_1_1,
                   DSFILE.DS_UNITS_1_1_2,
                   DSFILE.DS_OUTBAL_1_1_2,
                   DSFILE.DS_UNITS_1_1_3,
                   DSFILE.DS_OUTBAL_1_1_3,
                   DSFILE.DS_UNITS_1_1_4,
                   DSFILE.DS_OUTBAL_1_1_4,
                   DSFILE.DS_UNITS_1_1_5,
                   DSFILE.DS_OUTBAL_1_1_5,
                   DSFILE.DS_UNITS_1_1_6,
                   DSFILE.DS_OUTBAL_1_1_6,
                   DSFILE.DS_UNITS_1_1_7,
                   DSFILE.DS_OUTBAL_1_1_7,
                   DSFILE.DS_UNITS_1_1_8,
                   DSFILE.DS_OUTBAL_1_1_8,
                   DSFILE.DS_UNITS_1_1_9,
                   DSFILE.DS_OUTBAL_1_1_9,
                   DSFILE.DS_UNITS_1_1_10,
                   DSFILE.DS_OUTBAL_1_1_10,
                   DSFILE.DS_UNITS_1_2_1,
                   DSFILE.DS_OUTBAL_1_2_1,
                   DSFILE.DS_UNITS_1_2_2,
                   DSFILE.DS_OUTBAL_1_2_2,
                   DSFILE.DS_UNITS_1_2_3,
                   DSFILE.DS_OUTBAL_1_2_3,
                   DSFILE.DS_UNITS_1_2_4,
                   DSFILE.DS_OUTBAL_1_2_4,
                   DSFILE.DS_UNITS_1_2_5,
                   DSFILE.DS_OUTBAL_1_2_5,
                   DSFILE.DS_UNITS_1_2_6,
                   DSFILE.DS_OUTBAL_1_2_6,
                   DSFILE.DS_UNITS_1_2_7,
                   DSFILE.DS_OUTBAL_1_2_7,
                   DSFILE.DS_UNITS_1_2_8,
                   DSFILE.DS_OUTBAL_1_2_8,
                   DSFILE.DS_UNITS_1_2_9,
                   DSFILE.DS_OUTBAL_1_2_9,
                   DSFILE.DS_UNITS_1_2_10,
                   DSFILE.DS_OUTBAL_1_2_10,
                   DSFILE.DS_UNITS_2_1_1,
                   DSFILE.DS_OUTBAL_2_1_1,
                   DSFILE.DS_UNITS_2_1_2,
                   DSFILE.DS_OUTBAL_2_1_2,
                   DSFILE.DS_UNITS_2_1_3,
                   DSFILE.DS_OUTBAL_2_1_3,
                   DSFILE.DS_UNITS_2_1_4,
                   DSFILE.DS_OUTBAL_2_1_4,
                   DSFILE.DS_UNITS_2_1_5,
                   DSFILE.DS_OUTBAL_2_1_5,
                   DSFILE.DS_UNITS_2_1_6,
                   DSFILE.DS_OUTBAL_2_1_6,
                   DSFILE.DS_UNITS_2_1_7,
                   DSFILE.DS_OUTBAL_2_1_7,
                   DSFILE.DS_UNITS_2_1_8,
                   DSFILE.DS_OUTBAL_2_1_8,
                   DSFILE.DS_UNITS_2_1_9,
                   DSFILE.DS_OUTBAL_2_1_9,
                   DSFILE.DS_UNITS_2_1_10,
                   DSFILE.DS_OUTBAL_2_1_10,
                   DSFILE.DS_UNITS_2_2_1,
                   DSFILE.DS_OUTBAL_2_2_1,
                   DSFILE.DS_UNITS_2_2_2,
                   DSFILE.DS_OUTBAL_2_2_2,
                   DSFILE.DS_UNITS_2_2_3,
                   DSFILE.DS_OUTBAL_2_2_3,
                   DSFILE.DS_UNITS_2_2_4,
                   DSFILE.DS_OUTBAL_2_2_4,
                   DSFILE.DS_UNITS_2_2_5,
                   DSFILE.DS_OUTBAL_2_2_5,
                   DSFILE.DS_UNITS_2_2_6,
                   DSFILE.DS_OUTBAL_2_2_6,
                   DSFILE.DS_UNITS_2_2_7,
                   DSFILE.DS_OUTBAL_2_2_7,
                   DSFILE.DS_UNITS_2_2_8,
                   DSFILE.DS_OUTBAL_2_2_8,
                   DSFILE.DS_UNITS_2_2_9,
                   DSFILE.DS_OUTBAL_2_2_9,
                   DSFILE.DS_UNITS_2_2_10,
                   DSFILE.DS_OUTBAL_2_2_10,
                   DSFILE.DS_UNITS_3_1_1,
                   DSFILE.DS_OUTBAL_3_1_1,
                   DSFILE.DS_UNITS_3_1_2,
                   DSFILE.DS_OUTBAL_3_1_2,
                   DSFILE.DS_UNITS_3_1_3,
                   DSFILE.DS_OUTBAL_3_1_3,
                   DSFILE.DS_UNITS_3_1_4,
                   DSFILE.DS_OUTBAL_3_1_4,
                   DSFILE.DS_UNITS_3_1_5,
                   DSFILE.DS_OUTBAL_3_1_5,
                   DSFILE.DS_UNITS_3_1_6,
                   DSFILE.DS_OUTBAL_3_1_6,
                   DSFILE.DS_UNITS_3_1_7,
                   DSFILE.DS_OUTBAL_3_1_7,
                   DSFILE.DS_UNITS_3_1_8,
                   DSFILE.DS_OUTBAL_3_1_8,
                   DSFILE.DS_UNITS_3_1_9,
                   DSFILE.DS_OUTBAL_3_1_9,
                   DSFILE.DS_UNITS_3_1_10,
                   DSFILE.DS_OUTBAL_3_1_10,
                   DSFILE.DS_UNITS_3_2_1,
                   DSFILE.DS_OUTBAL_3_2_1,
                   DSFILE.DS_UNITS_3_2_2,
                   DSFILE.DS_OUTBAL_3_2_2,
                   DSFILE.DS_UNITS_3_2_3,
                   DSFILE.DS_OUTBAL_3_2_3,
                   DSFILE.DS_UNITS_3_2_4,
                   DSFILE.DS_OUTBAL_3_2_4,
                   DSFILE.DS_UNITS_3_2_5,
                   DSFILE.DS_OUTBAL_3_2_5,
                   DSFILE.DS_UNITS_3_2_6,
                   DSFILE.DS_OUTBAL_3_2_6,
                   DSFILE.DS_UNITS_3_2_7,
                   DSFILE.DS_OUTBAL_3_2_7,
                   DSFILE.DS_UNITS_3_2_8,
                   DSFILE.DS_OUTBAL_3_2_8,
                   DSFILE.DS_UNITS_3_2_9,
                   DSFILE.DS_OUTBAL_3_2_9,
                   DSFILE.DS_UNITS_3_2_10,
                   DSFILE.DS_OUTBAL_3_2_10,
                   DSFILE.DS_UNITS_BNKRPT_1_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_1,
                   DSFILE.DS_UNITS_BNKRPT_1_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_2,
                   DSFILE.DS_UNITS_BNKRPT_1_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_3,
                   DSFILE.DS_UNITS_BNKRPT_1_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_4,
                   DSFILE.DS_UNITS_BNKRPT_1_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_5,
                   DSFILE.DS_UNITS_BNKRPT_1_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_6,
                   DSFILE.DS_UNITS_BNKRPT_1_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_7,
                   DSFILE.DS_UNITS_BNKRPT_1_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_8,
                   DSFILE.DS_UNITS_BNKRPT_1_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_9,
                   DSFILE.DS_UNITS_BNKRPT_1_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_10,
                   DSFILE.DS_UNITS_BNKRPT_1_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_1,
                   DSFILE.DS_UNITS_BNKRPT_1_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_2,
                   DSFILE.DS_UNITS_BNKRPT_1_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_3,
                   DSFILE.DS_UNITS_BNKRPT_1_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_4,
                   DSFILE.DS_UNITS_BNKRPT_1_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_5,
                   DSFILE.DS_UNITS_BNKRPT_1_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_6,
                   DSFILE.DS_UNITS_BNKRPT_1_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_7,
                   DSFILE.DS_UNITS_BNKRPT_1_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_8,
                   DSFILE.DS_UNITS_BNKRPT_1_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_9,
                   DSFILE.DS_UNITS_BNKRPT_1_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_10,
                   DSFILE.DS_UNITS_BNKRPT_2_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_1,
                   DSFILE.DS_UNITS_BNKRPT_2_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_2,
                   DSFILE.DS_UNITS_BNKRPT_2_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_3,
                   DSFILE.DS_UNITS_BNKRPT_2_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_4,
                   DSFILE.DS_UNITS_BNKRPT_2_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_5,
                   DSFILE.DS_UNITS_BNKRPT_2_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_6,
                   DSFILE.DS_UNITS_BNKRPT_2_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_7,
                   DSFILE.DS_UNITS_BNKRPT_2_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_8,
                   DSFILE.DS_UNITS_BNKRPT_2_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_9,
                   DSFILE.DS_UNITS_BNKRPT_2_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_10,
                   DSFILE.DS_UNITS_BNKRPT_2_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_1,
                   DSFILE.DS_UNITS_BNKRPT_2_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_2,
                   DSFILE.DS_UNITS_BNKRPT_2_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_3,
                   DSFILE.DS_UNITS_BNKRPT_2_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_4,
                   DSFILE.DS_UNITS_BNKRPT_2_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_5,
                   DSFILE.DS_UNITS_BNKRPT_2_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_6,
                   DSFILE.DS_UNITS_BNKRPT_2_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_7,
                   DSFILE.DS_UNITS_BNKRPT_2_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_8,
                   DSFILE.DS_UNITS_BNKRPT_2_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_9,
                   DSFILE.DS_UNITS_BNKRPT_2_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_10,
                   DSFILE.DS_UNITS_BNKRPT_3_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_1,
                   DSFILE.DS_UNITS_BNKRPT_3_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_2,
                   DSFILE.DS_UNITS_BNKRPT_3_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_3,
                   DSFILE.DS_UNITS_BNKRPT_3_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_4,
                   DSFILE.DS_UNITS_BNKRPT_3_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_5,
                   DSFILE.DS_UNITS_BNKRPT_3_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_6,
                   DSFILE.DS_UNITS_BNKRPT_3_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_7,
                   DSFILE.DS_UNITS_BNKRPT_3_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_8,
                   DSFILE.DS_UNITS_BNKRPT_3_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_9,
                   DSFILE.DS_UNITS_BNKRPT_3_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_10,
                   DSFILE.DS_UNITS_BNKRPT_3_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_1,
                   DSFILE.DS_UNITS_BNKRPT_3_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_2,
                   DSFILE.DS_UNITS_BNKRPT_3_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_3,
                   DSFILE.DS_UNITS_BNKRPT_3_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_4,
                   DSFILE.DS_UNITS_BNKRPT_3_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_5,
                   DSFILE.DS_UNITS_BNKRPT_3_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_6,
                   DSFILE.DS_UNITS_BNKRPT_3_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_7,
                   DSFILE.DS_UNITS_BNKRPT_3_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_8,
                   DSFILE.DS_UNITS_BNKRPT_3_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_9,
                   DSFILE.DS_UNITS_BNKRPT_3_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_10,
                   DSFILE.DS_UNEARNED_AMT_1_1_1,
                   DSFILE.DS_UNEARNED_AMT_1_1_2,
                   DSFILE.DS_UNEARNED_AMT_1_1_3,
                   DSFILE.DS_UNEARNED_AMT_1_1_4,
                   DSFILE.DS_UNEARNED_AMT_1_1_5,
                   DSFILE.DS_UNEARNED_AMT_1_1_6,
                   DSFILE.DS_UNEARNED_AMT_1_1_7,
                   DSFILE.DS_UNEARNED_AMT_1_1_8,
                   DSFILE.DS_UNEARNED_AMT_1_1_9,
                   DSFILE.DS_UNEARNED_AMT_1_1_10,
                   DSFILE.DS_UNEARNED_AMT_1_2_1,
                   DSFILE.DS_UNEARNED_AMT_1_2_2,
                   DSFILE.DS_UNEARNED_AMT_1_2_3,
                   DSFILE.DS_UNEARNED_AMT_1_2_4,
                   DSFILE.DS_UNEARNED_AMT_1_2_5,
                   DSFILE.DS_UNEARNED_AMT_1_2_6,
                   DSFILE.DS_UNEARNED_AMT_1_2_7,
                   DSFILE.DS_UNEARNED_AMT_1_2_8,
                   DSFILE.DS_UNEARNED_AMT_1_2_9,
                   DSFILE.DS_UNEARNED_AMT_1_2_10,
                   DSFILE.DS_UNEARNED_AMT_2_1_1,
                   DSFILE.DS_UNEARNED_AMT_2_1_2,
                   DSFILE.DS_UNEARNED_AMT_2_1_3,
                   DSFILE.DS_UNEARNED_AMT_2_1_4,
                   DSFILE.DS_UNEARNED_AMT_2_1_5,
                   DSFILE.DS_UNEARNED_AMT_2_1_6,
                   DSFILE.DS_UNEARNED_AMT_2_1_7,
                   DSFILE.DS_UNEARNED_AMT_2_1_8,
                   DSFILE.DS_UNEARNED_AMT_2_1_9,
                   DSFILE.DS_UNEARNED_AMT_2_1_10,
                   DSFILE.DS_UNEARNED_AMT_2_2_1,
                   DSFILE.DS_UNEARNED_AMT_2_2_2,
                   DSFILE.DS_UNEARNED_AMT_2_2_3,
                   DSFILE.DS_UNEARNED_AMT_2_2_4,
                   DSFILE.DS_UNEARNED_AMT_2_2_5,
                   DSFILE.DS_UNEARNED_AMT_2_2_6,
                   DSFILE.DS_UNEARNED_AMT_2_2_7,
                   DSFILE.DS_UNEARNED_AMT_2_2_8,
                   DSFILE.DS_UNEARNED_AMT_2_2_9,
                   DSFILE.DS_UNEARNED_AMT_2_2_10,
                   DSFILE.DS_UNEARNED_AMT_3_1_1,
                   DSFILE.DS_UNEARNED_AMT_3_1_2,
                   DSFILE.DS_UNEARNED_AMT_3_1_3,
                   DSFILE.DS_UNEARNED_AMT_3_1_4,
                   DSFILE.DS_UNEARNED_AMT_3_1_5,
                   DSFILE.DS_UNEARNED_AMT_3_1_6,
                   DSFILE.DS_UNEARNED_AMT_3_1_7,
                   DSFILE.DS_UNEARNED_AMT_3_1_8,
                   DSFILE.DS_UNEARNED_AMT_3_1_9,
                   DSFILE.DS_UNEARNED_AMT_3_1_10,
                   DSFILE.DS_UNEARNED_AMT_3_2_1,
                   DSFILE.DS_UNEARNED_AMT_3_2_2,
                   DSFILE.DS_UNEARNED_AMT_3_2_3,
                   DSFILE.DS_UNEARNED_AMT_3_2_4,
                   DSFILE.DS_UNEARNED_AMT_3_2_5,
                   DSFILE.DS_UNEARNED_AMT_3_2_6,
                   DSFILE.DS_UNEARNED_AMT_3_2_7,
                   DSFILE.DS_UNEARNED_AMT_3_2_8,
                   DSFILE.DS_UNEARNED_AMT_3_2_9,
                   DSFILE.DS_UNEARNED_AMT_3_2_10,
                   DSFILE.DS_DLDISC_VOL_1,
                   DSFILE.DS_DLDISC_VOL_2,
                   DSFILE.DS_DLDISC_VOL_3,
                   DSFILE.DS_AFPDUEDL_MEMO,
                   DSFILE.DS_UNPAID_MANUAL,
                   CAST(DSFILE.DS_LTOUCH_DATE
                                                  AS VARCHAR(10))
            INTO :QDS-REC
            FROM DBO.DSFILE
            WHERE DSFILE.DS_DATE_CCYYMM = :QDS-DATE-CCYYMM
              AND DSFILE.DS_BRANCH = :QDS-BRANCH
              AND DSFILE.DS_NUM = :QDS-NUM
              AND DSFILE.DS_CLASS = :QDS-CLASS
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-DS1-FILE.

           IF ( IO-FG = 0 )
              PERFORM GET-DS-FIELDS.

      *-----------------------------------------------------------------
       READ-DS1-FILE-NEXT.
           PERFORM READ-IT.
           MOVE DS-PATH-OWNBR  TO DS-BRANCH.
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.
           INITIALIZE QDS-REC.

           IF ( DS1-CURSOR-STAT-GOOD )
              EXEC SQL
                   FETCH DS1_CURSOR INTO :QDS-REC
              END-EXEC
           ELSE
              MOVE 9        TO SQLCODE
              MOVE "RDNXCR" TO SQLSTATE.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-DS1-FILE-NEXT.

           IF ( IO-FG = 0 )
              PERFORM GET-DS-FIELDS.

      *-----------------------------------------------------------------
       WRITE-DS1-FILE.

           MOVE DS-PATH-OWNBR  TO DS-BRANCH.
           ACCEPT DS-LTOUCH-DATE FROM CENTURY-DATE.
           PERFORM WRITE-IT.
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.
           PERFORM SET-DS-FIELDS.

           EXEC SQL
            INSERT INTO DBO.DSFILE
             (DSFILE.DS_DATE_CCYYMM,
              DSFILE.DS_BRANCH,
              DSFILE.DS_NUM,
              DSFILE.DS_CLASS,
              DSFILE.DS_DLRVPRIN_1,
              DSFILE.DS_DLRVPRIN_2,
              DSFILE.DS_DLRVPRIN_3,
              DSFILE.DS_DLRVCHGS_1,
              DSFILE.DS_DLRVCHGS_2,
              DSFILE.DS_DLRVCHGS_3,
              DSFILE.DS_DLPARVHELD,
              DSFILE.DS_UNPAIDCK,
              DSFILE.DS_DLDISC,
              DSFILE.DS_DLPARVPAID,
              DSFILE.DS_SUMWGTTM,
              DSFILE.DS_SUMWGTAV,
              DSFILE.DS_SUMWGTTA,
              DSFILE.DS_RCOURSE_UNITS_1,
              DSFILE.DS_RCOURSE_UNITS_2,
              DSFILE.DS_RCOURSE_UNITS_3,
              DSFILE.DS_RCOURSE_AMT_1,
              DSFILE.DS_RCOURSE_AMT_2,
              DSFILE.DS_RCOURSE_AMT_3,
              DSFILE.DS_NPURUNIT_1,
              DSFILE.DS_NPURUNIT_2,
              DSFILE.DS_NPURUNIT_3,
              DSFILE.DS_NPURAMT_1,
              DSFILE.DS_NPURAMT_2,
              DSFILE.DS_NPURAMT_3,
              DSFILE.DS_OPURUNIT_1,
              DSFILE.DS_OPURUNIT_2,
              DSFILE.DS_OPURUNIT_3,
              DSFILE.DS_OPURAMT_1,
              DSFILE.DS_OPURAMT_2,
              DSFILE.DS_OPURAMT_3,
              DSFILE.DS_RNEWUNIT_1,
              DSFILE.DS_RNEWUNIT_2,
              DSFILE.DS_RNEWUNIT_3,
              DSFILE.DS_RNEWAMT_1,
              DSFILE.DS_RNEWAMT_2,
              DSFILE.DS_RNEWAMT_3,
              DSFILE.DS_PAIDUNIT_1,
              DSFILE.DS_PAIDUNIT_2,
              DSFILE.DS_PAIDUNIT_3,
              DSFILE.DS_PAIDAMT_1,
              DSFILE.DS_PAIDAMT_2,
              DSFILE.DS_PAIDAMT_3,
              DSFILE.DS_TODLUNIT_1,
              DSFILE.DS_TODLUNIT_2,
              DSFILE.DS_TODLUNIT_3,
              DSFILE.DS_TODLAMT_1,
              DSFILE.DS_TODLAMT_2,
              DSFILE.DS_TODLAMT_3,
              DSFILE.DS_OUTSUNIT_1,
              DSFILE.DS_OUTSUNIT_2,
              DSFILE.DS_OUTSUNIT_3,
              DSFILE.DS_OUTSAMT_1,
              DSFILE.DS_OUTSAMT_2,
              DSFILE.DS_OUTSAMT_3,
              DSFILE.DS_PLOSUNIT_1,
              DSFILE.DS_PLOSUNIT_2,
              DSFILE.DS_PLOSUNIT_3,
              DSFILE.DS_PLOSAMT_1,
              DSFILE.DS_PLOSAMT_2,
              DSFILE.DS_PLOSAMT_3,
              DSFILE.DS_RCPLUNIT_1,
              DSFILE.DS_RCPLUNIT_2,
              DSFILE.DS_RCPLUNIT_3,
              DSFILE.DS_RCPLAMT_1,
              DSFILE.DS_RCPLAMT_2,
              DSFILE.DS_RCPLAMT_3,
              DSFILE.DS_JDOSUNIT_1,
              DSFILE.DS_JDOSUNIT_2,
              DSFILE.DS_JDOSUNIT_3,
              DSFILE.DS_JDOSAMT_1,
              DSFILE.DS_JDOSAMT_2,
              DSFILE.DS_JDOSAMT_3,
              DSFILE.DS_DELUNEARN_DATE,
              DSFILE.DS_PROCEEDS_1,
              DSFILE.DS_PROCEEDS_2,
              DSFILE.DS_NO_REPO_1_1_1,
              DSFILE.DS_AMT_REPO_1_1_1,
              DSFILE.DS_NO_REPO_1_1_2,
              DSFILE.DS_AMT_REPO_1_1_2,
              DSFILE.DS_NO_REPO_1_1_3,
              DSFILE.DS_AMT_REPO_1_1_3,
              DSFILE.DS_NO_REPO_1_1_4,
              DSFILE.DS_AMT_REPO_1_1_4,
              DSFILE.DS_NO_REPO_1_1_5,
              DSFILE.DS_AMT_REPO_1_1_5,
              DSFILE.DS_NO_REPO_1_2_1,
              DSFILE.DS_AMT_REPO_1_2_1,
              DSFILE.DS_NO_REPO_1_2_2,
              DSFILE.DS_AMT_REPO_1_2_2,
              DSFILE.DS_NO_REPO_1_2_3,
              DSFILE.DS_AMT_REPO_1_2_3,
              DSFILE.DS_NO_REPO_1_2_4,
              DSFILE.DS_AMT_REPO_1_2_4,
              DSFILE.DS_NO_REPO_1_2_5,
              DSFILE.DS_AMT_REPO_1_2_5,
              DSFILE.DS_NO_REPO_2_1_1,
              DSFILE.DS_AMT_REPO_2_1_1,
              DSFILE.DS_NO_REPO_2_1_2,
              DSFILE.DS_AMT_REPO_2_1_2,
              DSFILE.DS_NO_REPO_2_1_3,
              DSFILE.DS_AMT_REPO_2_1_3,
              DSFILE.DS_NO_REPO_2_1_4,
              DSFILE.DS_AMT_REPO_2_1_4,
              DSFILE.DS_NO_REPO_2_1_5,
              DSFILE.DS_AMT_REPO_2_1_5,
              DSFILE.DS_NO_REPO_2_2_1,
              DSFILE.DS_AMT_REPO_2_2_1,
              DSFILE.DS_NO_REPO_2_2_2,
              DSFILE.DS_AMT_REPO_2_2_2,
              DSFILE.DS_NO_REPO_2_2_3,
              DSFILE.DS_AMT_REPO_2_2_3,
              DSFILE.DS_NO_REPO_2_2_4,
              DSFILE.DS_AMT_REPO_2_2_4,
              DSFILE.DS_NO_REPO_2_2_5,
              DSFILE.DS_AMT_REPO_2_2_5,
              DSFILE.DS_NO_REPO_3_1_1,
              DSFILE.DS_AMT_REPO_3_1_1,
              DSFILE.DS_NO_REPO_3_1_2,
              DSFILE.DS_AMT_REPO_3_1_2,
              DSFILE.DS_NO_REPO_3_1_3,
              DSFILE.DS_AMT_REPO_3_1_3,
              DSFILE.DS_NO_REPO_3_1_4,
              DSFILE.DS_AMT_REPO_3_1_4,
              DSFILE.DS_NO_REPO_3_1_5,
              DSFILE.DS_AMT_REPO_3_1_5,
              DSFILE.DS_NO_REPO_3_2_1,
              DSFILE.DS_AMT_REPO_3_2_1,
              DSFILE.DS_NO_REPO_3_2_2,
              DSFILE.DS_AMT_REPO_3_2_2,
              DSFILE.DS_NO_REPO_3_2_3,
              DSFILE.DS_AMT_REPO_3_2_3,
              DSFILE.DS_NO_REPO_3_2_4,
              DSFILE.DS_AMT_REPO_3_2_4,
              DSFILE.DS_NO_REPO_3_2_5,
              DSFILE.DS_AMT_REPO_3_2_5,
              DSFILE.DS_UNITS_1_1_1,
              DSFILE.DS_OUTBAL_1_1_1,
              DSFILE.DS_UNITS_1_1_2,
              DSFILE.DS_OUTBAL_1_1_2,
              DSFILE.DS_UNITS_1_1_3,
              DSFILE.DS_OUTBAL_1_1_3,
              DSFILE.DS_UNITS_1_1_4,
              DSFILE.DS_OUTBAL_1_1_4,
              DSFILE.DS_UNITS_1_1_5,
              DSFILE.DS_OUTBAL_1_1_5,
              DSFILE.DS_UNITS_1_1_6,
              DSFILE.DS_OUTBAL_1_1_6,
              DSFILE.DS_UNITS_1_1_7,
              DSFILE.DS_OUTBAL_1_1_7,
              DSFILE.DS_UNITS_1_1_8,
              DSFILE.DS_OUTBAL_1_1_8,
              DSFILE.DS_UNITS_1_1_9,
              DSFILE.DS_OUTBAL_1_1_9,
              DSFILE.DS_UNITS_1_1_10,
              DSFILE.DS_OUTBAL_1_1_10,
              DSFILE.DS_UNITS_1_2_1,
              DSFILE.DS_OUTBAL_1_2_1,
              DSFILE.DS_UNITS_1_2_2,
              DSFILE.DS_OUTBAL_1_2_2,
              DSFILE.DS_UNITS_1_2_3,
              DSFILE.DS_OUTBAL_1_2_3,
              DSFILE.DS_UNITS_1_2_4,
              DSFILE.DS_OUTBAL_1_2_4,
              DSFILE.DS_UNITS_1_2_5,
              DSFILE.DS_OUTBAL_1_2_5,
              DSFILE.DS_UNITS_1_2_6,
              DSFILE.DS_OUTBAL_1_2_6,
              DSFILE.DS_UNITS_1_2_7,
              DSFILE.DS_OUTBAL_1_2_7,
              DSFILE.DS_UNITS_1_2_8,
              DSFILE.DS_OUTBAL_1_2_8,
              DSFILE.DS_UNITS_1_2_9,
              DSFILE.DS_OUTBAL_1_2_9,
              DSFILE.DS_UNITS_1_2_10,
              DSFILE.DS_OUTBAL_1_2_10,
              DSFILE.DS_UNITS_2_1_1,
              DSFILE.DS_OUTBAL_2_1_1,
              DSFILE.DS_UNITS_2_1_2,
              DSFILE.DS_OUTBAL_2_1_2,
              DSFILE.DS_UNITS_2_1_3,
              DSFILE.DS_OUTBAL_2_1_3,
              DSFILE.DS_UNITS_2_1_4,
              DSFILE.DS_OUTBAL_2_1_4,
              DSFILE.DS_UNITS_2_1_5,
              DSFILE.DS_OUTBAL_2_1_5,
              DSFILE.DS_UNITS_2_1_6,
              DSFILE.DS_OUTBAL_2_1_6,
              DSFILE.DS_UNITS_2_1_7,
              DSFILE.DS_OUTBAL_2_1_7,
              DSFILE.DS_UNITS_2_1_8,
              DSFILE.DS_OUTBAL_2_1_8,
              DSFILE.DS_UNITS_2_1_9,
              DSFILE.DS_OUTBAL_2_1_9,
              DSFILE.DS_UNITS_2_1_10,
              DSFILE.DS_OUTBAL_2_1_10,
              DSFILE.DS_UNITS_2_2_1,
              DSFILE.DS_OUTBAL_2_2_1,
              DSFILE.DS_UNITS_2_2_2,
              DSFILE.DS_OUTBAL_2_2_2,
              DSFILE.DS_UNITS_2_2_3,
              DSFILE.DS_OUTBAL_2_2_3,
              DSFILE.DS_UNITS_2_2_4,
              DSFILE.DS_OUTBAL_2_2_4,
              DSFILE.DS_UNITS_2_2_5,
              DSFILE.DS_OUTBAL_2_2_5,
              DSFILE.DS_UNITS_2_2_6,
              DSFILE.DS_OUTBAL_2_2_6,
              DSFILE.DS_UNITS_2_2_7,
              DSFILE.DS_OUTBAL_2_2_7,
              DSFILE.DS_UNITS_2_2_8,
              DSFILE.DS_OUTBAL_2_2_8,
              DSFILE.DS_UNITS_2_2_9,
              DSFILE.DS_OUTBAL_2_2_9,
              DSFILE.DS_UNITS_2_2_10,
              DSFILE.DS_OUTBAL_2_2_10,
              DSFILE.DS_UNITS_3_1_1,
              DSFILE.DS_OUTBAL_3_1_1,
              DSFILE.DS_UNITS_3_1_2,
              DSFILE.DS_OUTBAL_3_1_2,
              DSFILE.DS_UNITS_3_1_3,
              DSFILE.DS_OUTBAL_3_1_3,
              DSFILE.DS_UNITS_3_1_4,
              DSFILE.DS_OUTBAL_3_1_4,
              DSFILE.DS_UNITS_3_1_5,
              DSFILE.DS_OUTBAL_3_1_5,
              DSFILE.DS_UNITS_3_1_6,
              DSFILE.DS_OUTBAL_3_1_6,
              DSFILE.DS_UNITS_3_1_7,
              DSFILE.DS_OUTBAL_3_1_7,
              DSFILE.DS_UNITS_3_1_8,
              DSFILE.DS_OUTBAL_3_1_8,
              DSFILE.DS_UNITS_3_1_9,
              DSFILE.DS_OUTBAL_3_1_9,
              DSFILE.DS_UNITS_3_1_10,
              DSFILE.DS_OUTBAL_3_1_10,
              DSFILE.DS_UNITS_3_2_1,
              DSFILE.DS_OUTBAL_3_2_1,
              DSFILE.DS_UNITS_3_2_2,
              DSFILE.DS_OUTBAL_3_2_2,
              DSFILE.DS_UNITS_3_2_3,
              DSFILE.DS_OUTBAL_3_2_3,
              DSFILE.DS_UNITS_3_2_4,
              DSFILE.DS_OUTBAL_3_2_4,
              DSFILE.DS_UNITS_3_2_5,
              DSFILE.DS_OUTBAL_3_2_5,
              DSFILE.DS_UNITS_3_2_6,
              DSFILE.DS_OUTBAL_3_2_6,
              DSFILE.DS_UNITS_3_2_7,
              DSFILE.DS_OUTBAL_3_2_7,
              DSFILE.DS_UNITS_3_2_8,
              DSFILE.DS_OUTBAL_3_2_8,
              DSFILE.DS_UNITS_3_2_9,
              DSFILE.DS_OUTBAL_3_2_9,
              DSFILE.DS_UNITS_3_2_10,
              DSFILE.DS_OUTBAL_3_2_10,
              DSFILE.DS_UNITS_BNKRPT_1_1_1,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_1,
              DSFILE.DS_UNITS_BNKRPT_1_1_2,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_2,
              DSFILE.DS_UNITS_BNKRPT_1_1_3,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_3,
              DSFILE.DS_UNITS_BNKRPT_1_1_4,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_4,
              DSFILE.DS_UNITS_BNKRPT_1_1_5,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_5,
              DSFILE.DS_UNITS_BNKRPT_1_1_6,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_6,
              DSFILE.DS_UNITS_BNKRPT_1_1_7,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_7,
              DSFILE.DS_UNITS_BNKRPT_1_1_8,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_8,
              DSFILE.DS_UNITS_BNKRPT_1_1_9,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_9,
              DSFILE.DS_UNITS_BNKRPT_1_1_10,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_10,
              DSFILE.DS_UNITS_BNKRPT_1_2_1,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_1,
              DSFILE.DS_UNITS_BNKRPT_1_2_2,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_2,
              DSFILE.DS_UNITS_BNKRPT_1_2_3,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_3,
              DSFILE.DS_UNITS_BNKRPT_1_2_4,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_4,
              DSFILE.DS_UNITS_BNKRPT_1_2_5,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_5,
              DSFILE.DS_UNITS_BNKRPT_1_2_6,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_6,
              DSFILE.DS_UNITS_BNKRPT_1_2_7,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_7,
              DSFILE.DS_UNITS_BNKRPT_1_2_8,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_8,
              DSFILE.DS_UNITS_BNKRPT_1_2_9,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_9,
              DSFILE.DS_UNITS_BNKRPT_1_2_10,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_10,
              DSFILE.DS_UNITS_BNKRPT_2_1_1,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_1,
              DSFILE.DS_UNITS_BNKRPT_2_1_2,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_2,
              DSFILE.DS_UNITS_BNKRPT_2_1_3,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_3,
              DSFILE.DS_UNITS_BNKRPT_2_1_4,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_4,
              DSFILE.DS_UNITS_BNKRPT_2_1_5,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_5,
              DSFILE.DS_UNITS_BNKRPT_2_1_6,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_6,
              DSFILE.DS_UNITS_BNKRPT_2_1_7,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_7,
              DSFILE.DS_UNITS_BNKRPT_2_1_8,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_8,
              DSFILE.DS_UNITS_BNKRPT_2_1_9,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_9,
              DSFILE.DS_UNITS_BNKRPT_2_1_10,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_10,
              DSFILE.DS_UNITS_BNKRPT_2_2_1,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_1,
              DSFILE.DS_UNITS_BNKRPT_2_2_2,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_2,
              DSFILE.DS_UNITS_BNKRPT_2_2_3,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_3,
              DSFILE.DS_UNITS_BNKRPT_2_2_4,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_4,
              DSFILE.DS_UNITS_BNKRPT_2_2_5,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_5,
              DSFILE.DS_UNITS_BNKRPT_2_2_6,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_6,
              DSFILE.DS_UNITS_BNKRPT_2_2_7,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_7,
              DSFILE.DS_UNITS_BNKRPT_2_2_8,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_8,
              DSFILE.DS_UNITS_BNKRPT_2_2_9,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_9,
              DSFILE.DS_UNITS_BNKRPT_2_2_10,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_10,
              DSFILE.DS_UNITS_BNKRPT_3_1_1,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_1,
              DSFILE.DS_UNITS_BNKRPT_3_1_2,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_2,
              DSFILE.DS_UNITS_BNKRPT_3_1_3,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_3,
              DSFILE.DS_UNITS_BNKRPT_3_1_4,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_4,
              DSFILE.DS_UNITS_BNKRPT_3_1_5,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_5,
              DSFILE.DS_UNITS_BNKRPT_3_1_6,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_6,
              DSFILE.DS_UNITS_BNKRPT_3_1_7,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_7,
              DSFILE.DS_UNITS_BNKRPT_3_1_8,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_8,
              DSFILE.DS_UNITS_BNKRPT_3_1_9,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_9,
              DSFILE.DS_UNITS_BNKRPT_3_1_10,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_10,
              DSFILE.DS_UNITS_BNKRPT_3_2_1,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_1,
              DSFILE.DS_UNITS_BNKRPT_3_2_2,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_2,
              DSFILE.DS_UNITS_BNKRPT_3_2_3,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_3,
              DSFILE.DS_UNITS_BNKRPT_3_2_4,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_4,
              DSFILE.DS_UNITS_BNKRPT_3_2_5,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_5,
              DSFILE.DS_UNITS_BNKRPT_3_2_6,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_6,
              DSFILE.DS_UNITS_BNKRPT_3_2_7,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_7,
              DSFILE.DS_UNITS_BNKRPT_3_2_8,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_8,
              DSFILE.DS_UNITS_BNKRPT_3_2_9,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_9,
              DSFILE.DS_UNITS_BNKRPT_3_2_10,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_10,
              DSFILE.DS_UNEARNED_AMT_1_1_1,
              DSFILE.DS_UNEARNED_AMT_1_1_2,
              DSFILE.DS_UNEARNED_AMT_1_1_3,
              DSFILE.DS_UNEARNED_AMT_1_1_4,
              DSFILE.DS_UNEARNED_AMT_1_1_5,
              DSFILE.DS_UNEARNED_AMT_1_1_6,
              DSFILE.DS_UNEARNED_AMT_1_1_7,
              DSFILE.DS_UNEARNED_AMT_1_1_8,
              DSFILE.DS_UNEARNED_AMT_1_1_9,
              DSFILE.DS_UNEARNED_AMT_1_1_10,
              DSFILE.DS_UNEARNED_AMT_1_2_1,
              DSFILE.DS_UNEARNED_AMT_1_2_2,
              DSFILE.DS_UNEARNED_AMT_1_2_3,
              DSFILE.DS_UNEARNED_AMT_1_2_4,
              DSFILE.DS_UNEARNED_AMT_1_2_5,
              DSFILE.DS_UNEARNED_AMT_1_2_6,
              DSFILE.DS_UNEARNED_AMT_1_2_7,
              DSFILE.DS_UNEARNED_AMT_1_2_8,
              DSFILE.DS_UNEARNED_AMT_1_2_9,
              DSFILE.DS_UNEARNED_AMT_1_2_10,
              DSFILE.DS_UNEARNED_AMT_2_1_1,
              DSFILE.DS_UNEARNED_AMT_2_1_2,
              DSFILE.DS_UNEARNED_AMT_2_1_3,
              DSFILE.DS_UNEARNED_AMT_2_1_4,
              DSFILE.DS_UNEARNED_AMT_2_1_5,
              DSFILE.DS_UNEARNED_AMT_2_1_6,
              DSFILE.DS_UNEARNED_AMT_2_1_7,
              DSFILE.DS_UNEARNED_AMT_2_1_8,
              DSFILE.DS_UNEARNED_AMT_2_1_9,
              DSFILE.DS_UNEARNED_AMT_2_1_10,
              DSFILE.DS_UNEARNED_AMT_2_2_1,
              DSFILE.DS_UNEARNED_AMT_2_2_2,
              DSFILE.DS_UNEARNED_AMT_2_2_3,
              DSFILE.DS_UNEARNED_AMT_2_2_4,
              DSFILE.DS_UNEARNED_AMT_2_2_5,
              DSFILE.DS_UNEARNED_AMT_2_2_6,
              DSFILE.DS_UNEARNED_AMT_2_2_7,
              DSFILE.DS_UNEARNED_AMT_2_2_8,
              DSFILE.DS_UNEARNED_AMT_2_2_9,
              DSFILE.DS_UNEARNED_AMT_2_2_10,
              DSFILE.DS_UNEARNED_AMT_3_1_1,
              DSFILE.DS_UNEARNED_AMT_3_1_2,
              DSFILE.DS_UNEARNED_AMT_3_1_3,
              DSFILE.DS_UNEARNED_AMT_3_1_4,
              DSFILE.DS_UNEARNED_AMT_3_1_5,
              DSFILE.DS_UNEARNED_AMT_3_1_6,
              DSFILE.DS_UNEARNED_AMT_3_1_7,
              DSFILE.DS_UNEARNED_AMT_3_1_8,
              DSFILE.DS_UNEARNED_AMT_3_1_9,
              DSFILE.DS_UNEARNED_AMT_3_1_10,
              DSFILE.DS_UNEARNED_AMT_3_2_1,
              DSFILE.DS_UNEARNED_AMT_3_2_2,
              DSFILE.DS_UNEARNED_AMT_3_2_3,
              DSFILE.DS_UNEARNED_AMT_3_2_4,
              DSFILE.DS_UNEARNED_AMT_3_2_5,
              DSFILE.DS_UNEARNED_AMT_3_2_6,
              DSFILE.DS_UNEARNED_AMT_3_2_7,
              DSFILE.DS_UNEARNED_AMT_3_2_8,
              DSFILE.DS_UNEARNED_AMT_3_2_9,
              DSFILE.DS_UNEARNED_AMT_3_2_10,
              DSFILE.DS_DLDISC_VOL_1,
              DSFILE.DS_DLDISC_VOL_2,
              DSFILE.DS_DLDISC_VOL_3,
              DSFILE.DS_AFPDUEDL_MEMO,
              DSFILE.DS_UNPAID_MANUAL,
              DSFILE.DS_LTOUCH_DATE)
            VALUES
             (:QDS-DATE-CCYYMM,
              :QDS-BRANCH,
              :QDS-NUM,
              :QDS-CLASS,
              :QDS-DLRVPRIN-1,
              :QDS-DLRVPRIN-2,
              :QDS-DLRVPRIN-3,
              :QDS-DLRVCHGS-1,
              :QDS-DLRVCHGS-2,
              :QDS-DLRVCHGS-3,
              :QDS-DLPARVHELD,
              :QDS-UNPAIDCK,
              :QDS-DLDISC,
              :QDS-DLPARVPAID,
              :QDS-SUMWGTTM,
              :QDS-SUMWGTAV,
              :QDS-SUMWGTTA,
              :QDS-RCOURSE-UNITS-1,
              :QDS-RCOURSE-UNITS-2,
              :QDS-RCOURSE-UNITS-3,
              :QDS-RCOURSE-AMT-1,
              :QDS-RCOURSE-AMT-2,
              :QDS-RCOURSE-AMT-3,
              :QDS-NPURUNIT-1,
              :QDS-NPURUNIT-2,
              :QDS-NPURUNIT-3,
              :QDS-NPURAMT-1,
              :QDS-NPURAMT-2,
              :QDS-NPURAMT-3,
              :QDS-OPURUNIT-1,
              :QDS-OPURUNIT-2,
              :QDS-OPURUNIT-3,
              :QDS-OPURAMT-1,
              :QDS-OPURAMT-2,
              :QDS-OPURAMT-3,
              :QDS-RNEWUNIT-1,
              :QDS-RNEWUNIT-2,
              :QDS-RNEWUNIT-3,
              :QDS-RNEWAMT-1,
              :QDS-RNEWAMT-2,
              :QDS-RNEWAMT-3,
              :QDS-PAIDUNIT-1,
              :QDS-PAIDUNIT-2,
              :QDS-PAIDUNIT-3,
              :QDS-PAIDAMT-1,
              :QDS-PAIDAMT-2,
              :QDS-PAIDAMT-3,
              :QDS-TODLUNIT-1,
              :QDS-TODLUNIT-2,
              :QDS-TODLUNIT-3,
              :QDS-TODLAMT-1,
              :QDS-TODLAMT-2,
              :QDS-TODLAMT-3,
              :QDS-OUTSUNIT-1,
              :QDS-OUTSUNIT-2,
              :QDS-OUTSUNIT-3,
              :QDS-OUTSAMT-1,
              :QDS-OUTSAMT-2,
              :QDS-OUTSAMT-3,
              :QDS-PLOSUNIT-1,
              :QDS-PLOSUNIT-2,
              :QDS-PLOSUNIT-3,
              :QDS-PLOSAMT-1,
              :QDS-PLOSAMT-2,
              :QDS-PLOSAMT-3,
              :QDS-RCPLUNIT-1,
              :QDS-RCPLUNIT-2,
              :QDS-RCPLUNIT-3,
              :QDS-RCPLAMT-1,
              :QDS-RCPLAMT-2,
              :QDS-RCPLAMT-3,
              :QDS-JDOSUNIT-1,
              :QDS-JDOSUNIT-2,
              :QDS-JDOSUNIT-3,
              :QDS-JDOSAMT-1,
              :QDS-JDOSAMT-2,
              :QDS-JDOSAMT-3,
              :QDS-DELUNEARN-DATE,
              :QDS-PROCEEDS-1,
              :QDS-PROCEEDS-2,
              :QDS-NO-REPO-1-1-1,
              :QDS-AMT-REPO-1-1-1,
              :QDS-NO-REPO-1-1-2,
              :QDS-AMT-REPO-1-1-2,
              :QDS-NO-REPO-1-1-3,
              :QDS-AMT-REPO-1-1-3,
              :QDS-NO-REPO-1-1-4,
              :QDS-AMT-REPO-1-1-4,
              :QDS-NO-REPO-1-1-5,
              :QDS-AMT-REPO-1-1-5,
              :QDS-NO-REPO-1-2-1,
              :QDS-AMT-REPO-1-2-1,
              :QDS-NO-REPO-1-2-2,
              :QDS-AMT-REPO-1-2-2,
              :QDS-NO-REPO-1-2-3,
              :QDS-AMT-REPO-1-2-3,
              :QDS-NO-REPO-1-2-4,
              :QDS-AMT-REPO-1-2-4,
              :QDS-NO-REPO-1-2-5,
              :QDS-AMT-REPO-1-2-5,
              :QDS-NO-REPO-2-1-1,
              :QDS-AMT-REPO-2-1-1,
              :QDS-NO-REPO-2-1-2,
              :QDS-AMT-REPO-2-1-2,
              :QDS-NO-REPO-2-1-3,
              :QDS-AMT-REPO-2-1-3,
              :QDS-NO-REPO-2-1-4,
              :QDS-AMT-REPO-2-1-4,
              :QDS-NO-REPO-2-1-5,
              :QDS-AMT-REPO-2-1-5,
              :QDS-NO-REPO-2-2-1,
              :QDS-AMT-REPO-2-2-1,
              :QDS-NO-REPO-2-2-2,
              :QDS-AMT-REPO-2-2-2,
              :QDS-NO-REPO-2-2-3,
              :QDS-AMT-REPO-2-2-3,
              :QDS-NO-REPO-2-2-4,
              :QDS-AMT-REPO-2-2-4,
              :QDS-NO-REPO-2-2-5,
              :QDS-AMT-REPO-2-2-5,
              :QDS-NO-REPO-3-1-1,
              :QDS-AMT-REPO-3-1-1,
              :QDS-NO-REPO-3-1-2,
              :QDS-AMT-REPO-3-1-2,
              :QDS-NO-REPO-3-1-3,
              :QDS-AMT-REPO-3-1-3,
              :QDS-NO-REPO-3-1-4,
              :QDS-AMT-REPO-3-1-4,
              :QDS-NO-REPO-3-1-5,
              :QDS-AMT-REPO-3-1-5,
              :QDS-NO-REPO-3-2-1,
              :QDS-AMT-REPO-3-2-1,
              :QDS-NO-REPO-3-2-2,
              :QDS-AMT-REPO-3-2-2,
              :QDS-NO-REPO-3-2-3,
              :QDS-AMT-REPO-3-2-3,
              :QDS-NO-REPO-3-2-4,
              :QDS-AMT-REPO-3-2-4,
              :QDS-NO-REPO-3-2-5,
              :QDS-AMT-REPO-3-2-5,
              :QDS-UNITS-1-1-1,
              :QDS-OUTBAL-1-1-1,
              :QDS-UNITS-1-1-2,
              :QDS-OUTBAL-1-1-2,
              :QDS-UNITS-1-1-3,
              :QDS-OUTBAL-1-1-3,
              :QDS-UNITS-1-1-4,
              :QDS-OUTBAL-1-1-4,
              :QDS-UNITS-1-1-5,
              :QDS-OUTBAL-1-1-5,
              :QDS-UNITS-1-1-6,
              :QDS-OUTBAL-1-1-6,
              :QDS-UNITS-1-1-7,
              :QDS-OUTBAL-1-1-7,
              :QDS-UNITS-1-1-8,
              :QDS-OUTBAL-1-1-8,
              :QDS-UNITS-1-1-9,
              :QDS-OUTBAL-1-1-9,
              :QDS-UNITS-1-1-10,
              :QDS-OUTBAL-1-1-10,
              :QDS-UNITS-1-2-1,
              :QDS-OUTBAL-1-2-1,
              :QDS-UNITS-1-2-2,
              :QDS-OUTBAL-1-2-2,
              :QDS-UNITS-1-2-3,
              :QDS-OUTBAL-1-2-3,
              :QDS-UNITS-1-2-4,
              :QDS-OUTBAL-1-2-4,
              :QDS-UNITS-1-2-5,
              :QDS-OUTBAL-1-2-5,
              :QDS-UNITS-1-2-6,
              :QDS-OUTBAL-1-2-6,
              :QDS-UNITS-1-2-7,
              :QDS-OUTBAL-1-2-7,
              :QDS-UNITS-1-2-8,
              :QDS-OUTBAL-1-2-8,
              :QDS-UNITS-1-2-9,
              :QDS-OUTBAL-1-2-9,
              :QDS-UNITS-1-2-10,
              :QDS-OUTBAL-1-2-10,
              :QDS-UNITS-2-1-1,
              :QDS-OUTBAL-2-1-1,
              :QDS-UNITS-2-1-2,
              :QDS-OUTBAL-2-1-2,
              :QDS-UNITS-2-1-3,
              :QDS-OUTBAL-2-1-3,
              :QDS-UNITS-2-1-4,
              :QDS-OUTBAL-2-1-4,
              :QDS-UNITS-2-1-5,
              :QDS-OUTBAL-2-1-5,
              :QDS-UNITS-2-1-6,
              :QDS-OUTBAL-2-1-6,
              :QDS-UNITS-2-1-7,
              :QDS-OUTBAL-2-1-7,
              :QDS-UNITS-2-1-8,
              :QDS-OUTBAL-2-1-8,
              :QDS-UNITS-2-1-9,
              :QDS-OUTBAL-2-1-9,
              :QDS-UNITS-2-1-10,
              :QDS-OUTBAL-2-1-10,
              :QDS-UNITS-2-2-1,
              :QDS-OUTBAL-2-2-1,
              :QDS-UNITS-2-2-2,
              :QDS-OUTBAL-2-2-2,
              :QDS-UNITS-2-2-3,
              :QDS-OUTBAL-2-2-3,
              :QDS-UNITS-2-2-4,
              :QDS-OUTBAL-2-2-4,
              :QDS-UNITS-2-2-5,
              :QDS-OUTBAL-2-2-5,
              :QDS-UNITS-2-2-6,
              :QDS-OUTBAL-2-2-6,
              :QDS-UNITS-2-2-7,
              :QDS-OUTBAL-2-2-7,
              :QDS-UNITS-2-2-8,
              :QDS-OUTBAL-2-2-8,
              :QDS-UNITS-2-2-9,
              :QDS-OUTBAL-2-2-9,
              :QDS-UNITS-2-2-10,
              :QDS-OUTBAL-2-2-10,
              :QDS-UNITS-3-1-1,
              :QDS-OUTBAL-3-1-1,
              :QDS-UNITS-3-1-2,
              :QDS-OUTBAL-3-1-2,
              :QDS-UNITS-3-1-3,
              :QDS-OUTBAL-3-1-3,
              :QDS-UNITS-3-1-4,
              :QDS-OUTBAL-3-1-4,
              :QDS-UNITS-3-1-5,
              :QDS-OUTBAL-3-1-5,
              :QDS-UNITS-3-1-6,
              :QDS-OUTBAL-3-1-6,
              :QDS-UNITS-3-1-7,
              :QDS-OUTBAL-3-1-7,
              :QDS-UNITS-3-1-8,
              :QDS-OUTBAL-3-1-8,
              :QDS-UNITS-3-1-9,
              :QDS-OUTBAL-3-1-9,
              :QDS-UNITS-3-1-10,
              :QDS-OUTBAL-3-1-10,
              :QDS-UNITS-3-2-1,
              :QDS-OUTBAL-3-2-1,
              :QDS-UNITS-3-2-2,
              :QDS-OUTBAL-3-2-2,
              :QDS-UNITS-3-2-3,
              :QDS-OUTBAL-3-2-3,
              :QDS-UNITS-3-2-4,
              :QDS-OUTBAL-3-2-4,
              :QDS-UNITS-3-2-5,
              :QDS-OUTBAL-3-2-5,
              :QDS-UNITS-3-2-6,
              :QDS-OUTBAL-3-2-6,
              :QDS-UNITS-3-2-7,
              :QDS-OUTBAL-3-2-7,
              :QDS-UNITS-3-2-8,
              :QDS-OUTBAL-3-2-8,
              :QDS-UNITS-3-2-9,
              :QDS-OUTBAL-3-2-9,
              :QDS-UNITS-3-2-10,
              :QDS-OUTBAL-3-2-10,
              :QDS-UNITS-BNKRPT-1-1-1,
              :QDS-OUTBAL-BNKRPT-1-1-1,
              :QDS-UNITS-BNKRPT-1-1-2,
              :QDS-OUTBAL-BNKRPT-1-1-2,
              :QDS-UNITS-BNKRPT-1-1-3,
              :QDS-OUTBAL-BNKRPT-1-1-3,
              :QDS-UNITS-BNKRPT-1-1-4,
              :QDS-OUTBAL-BNKRPT-1-1-4,
              :QDS-UNITS-BNKRPT-1-1-5,
              :QDS-OUTBAL-BNKRPT-1-1-5,
              :QDS-UNITS-BNKRPT-1-1-6,
              :QDS-OUTBAL-BNKRPT-1-1-6,
              :QDS-UNITS-BNKRPT-1-1-7,
              :QDS-OUTBAL-BNKRPT-1-1-7,
              :QDS-UNITS-BNKRPT-1-1-8,
              :QDS-OUTBAL-BNKRPT-1-1-8,
              :QDS-UNITS-BNKRPT-1-1-9,
              :QDS-OUTBAL-BNKRPT-1-1-9,
              :QDS-UNITS-BNKRPT-1-1-10,
              :QDS-OUTBAL-BNKRPT-1-1-10,
              :QDS-UNITS-BNKRPT-1-2-1,
              :QDS-OUTBAL-BNKRPT-1-2-1,
              :QDS-UNITS-BNKRPT-1-2-2,
              :QDS-OUTBAL-BNKRPT-1-2-2,
              :QDS-UNITS-BNKRPT-1-2-3,
              :QDS-OUTBAL-BNKRPT-1-2-3,
              :QDS-UNITS-BNKRPT-1-2-4,
              :QDS-OUTBAL-BNKRPT-1-2-4,
              :QDS-UNITS-BNKRPT-1-2-5,
              :QDS-OUTBAL-BNKRPT-1-2-5,
              :QDS-UNITS-BNKRPT-1-2-6,
              :QDS-OUTBAL-BNKRPT-1-2-6,
              :QDS-UNITS-BNKRPT-1-2-7,
              :QDS-OUTBAL-BNKRPT-1-2-7,
              :QDS-UNITS-BNKRPT-1-2-8,
              :QDS-OUTBAL-BNKRPT-1-2-8,
              :QDS-UNITS-BNKRPT-1-2-9,
              :QDS-OUTBAL-BNKRPT-1-2-9,
              :QDS-UNITS-BNKRPT-1-2-10,
              :QDS-OUTBAL-BNKRPT-1-2-10,
              :QDS-UNITS-BNKRPT-2-1-1,
              :QDS-OUTBAL-BNKRPT-2-1-1,
              :QDS-UNITS-BNKRPT-2-1-2,
              :QDS-OUTBAL-BNKRPT-2-1-2,
              :QDS-UNITS-BNKRPT-2-1-3,
              :QDS-OUTBAL-BNKRPT-2-1-3,
              :QDS-UNITS-BNKRPT-2-1-4,
              :QDS-OUTBAL-BNKRPT-2-1-4,
              :QDS-UNITS-BNKRPT-2-1-5,
              :QDS-OUTBAL-BNKRPT-2-1-5,
              :QDS-UNITS-BNKRPT-2-1-6,
              :QDS-OUTBAL-BNKRPT-2-1-6,
              :QDS-UNITS-BNKRPT-2-1-7,
              :QDS-OUTBAL-BNKRPT-2-1-7,
              :QDS-UNITS-BNKRPT-2-1-8,
              :QDS-OUTBAL-BNKRPT-2-1-8,
              :QDS-UNITS-BNKRPT-2-1-9,
              :QDS-OUTBAL-BNKRPT-2-1-9,
              :QDS-UNITS-BNKRPT-2-1-10,
              :QDS-OUTBAL-BNKRPT-2-1-10,
              :QDS-UNITS-BNKRPT-2-2-1,
              :QDS-OUTBAL-BNKRPT-2-2-1,
              :QDS-UNITS-BNKRPT-2-2-2,
              :QDS-OUTBAL-BNKRPT-2-2-2,
              :QDS-UNITS-BNKRPT-2-2-3,
              :QDS-OUTBAL-BNKRPT-2-2-3,
              :QDS-UNITS-BNKRPT-2-2-4,
              :QDS-OUTBAL-BNKRPT-2-2-4,
              :QDS-UNITS-BNKRPT-2-2-5,
              :QDS-OUTBAL-BNKRPT-2-2-5,
              :QDS-UNITS-BNKRPT-2-2-6,
              :QDS-OUTBAL-BNKRPT-2-2-6,
              :QDS-UNITS-BNKRPT-2-2-7,
              :QDS-OUTBAL-BNKRPT-2-2-7,
              :QDS-UNITS-BNKRPT-2-2-8,
              :QDS-OUTBAL-BNKRPT-2-2-8,
              :QDS-UNITS-BNKRPT-2-2-9,
              :QDS-OUTBAL-BNKRPT-2-2-9,
              :QDS-UNITS-BNKRPT-2-2-10,
              :QDS-OUTBAL-BNKRPT-2-2-10,
              :QDS-UNITS-BNKRPT-3-1-1,
              :QDS-OUTBAL-BNKRPT-3-1-1,
              :QDS-UNITS-BNKRPT-3-1-2,
              :QDS-OUTBAL-BNKRPT-3-1-2,
              :QDS-UNITS-BNKRPT-3-1-3,
              :QDS-OUTBAL-BNKRPT-3-1-3,
              :QDS-UNITS-BNKRPT-3-1-4,
              :QDS-OUTBAL-BNKRPT-3-1-4,
              :QDS-UNITS-BNKRPT-3-1-5,
              :QDS-OUTBAL-BNKRPT-3-1-5,
              :QDS-UNITS-BNKRPT-3-1-6,
              :QDS-OUTBAL-BNKRPT-3-1-6,
              :QDS-UNITS-BNKRPT-3-1-7,
              :QDS-OUTBAL-BNKRPT-3-1-7,
              :QDS-UNITS-BNKRPT-3-1-8,
              :QDS-OUTBAL-BNKRPT-3-1-8,
              :QDS-UNITS-BNKRPT-3-1-9,
              :QDS-OUTBAL-BNKRPT-3-1-9,
              :QDS-UNITS-BNKRPT-3-1-10,
              :QDS-OUTBAL-BNKRPT-3-1-10,
              :QDS-UNITS-BNKRPT-3-2-1,
              :QDS-OUTBAL-BNKRPT-3-2-1,
              :QDS-UNITS-BNKRPT-3-2-2,
              :QDS-OUTBAL-BNKRPT-3-2-2,
              :QDS-UNITS-BNKRPT-3-2-3,
              :QDS-OUTBAL-BNKRPT-3-2-3,
              :QDS-UNITS-BNKRPT-3-2-4,
              :QDS-OUTBAL-BNKRPT-3-2-4,
              :QDS-UNITS-BNKRPT-3-2-5,
              :QDS-OUTBAL-BNKRPT-3-2-5,
              :QDS-UNITS-BNKRPT-3-2-6,
              :QDS-OUTBAL-BNKRPT-3-2-6,
              :QDS-UNITS-BNKRPT-3-2-7,
              :QDS-OUTBAL-BNKRPT-3-2-7,
              :QDS-UNITS-BNKRPT-3-2-8,
              :QDS-OUTBAL-BNKRPT-3-2-8,
              :QDS-UNITS-BNKRPT-3-2-9,
              :QDS-OUTBAL-BNKRPT-3-2-9,
              :QDS-UNITS-BNKRPT-3-2-10,
              :QDS-OUTBAL-BNKRPT-3-2-10,
              :QDS-UNEARNED-AMT-1-1-1,
              :QDS-UNEARNED-AMT-1-1-2,
              :QDS-UNEARNED-AMT-1-1-3,
              :QDS-UNEARNED-AMT-1-1-4,
              :QDS-UNEARNED-AMT-1-1-5,
              :QDS-UNEARNED-AMT-1-1-6,
              :QDS-UNEARNED-AMT-1-1-7,
              :QDS-UNEARNED-AMT-1-1-8,
              :QDS-UNEARNED-AMT-1-1-9,
              :QDS-UNEARNED-AMT-1-1-10,
              :QDS-UNEARNED-AMT-1-2-1,
              :QDS-UNEARNED-AMT-1-2-2,
              :QDS-UNEARNED-AMT-1-2-3,
              :QDS-UNEARNED-AMT-1-2-4,
              :QDS-UNEARNED-AMT-1-2-5,
              :QDS-UNEARNED-AMT-1-2-6,
              :QDS-UNEARNED-AMT-1-2-7,
              :QDS-UNEARNED-AMT-1-2-8,
              :QDS-UNEARNED-AMT-1-2-9,
              :QDS-UNEARNED-AMT-1-2-10,
              :QDS-UNEARNED-AMT-2-1-1,
              :QDS-UNEARNED-AMT-2-1-2,
              :QDS-UNEARNED-AMT-2-1-3,
              :QDS-UNEARNED-AMT-2-1-4,
              :QDS-UNEARNED-AMT-2-1-5,
              :QDS-UNEARNED-AMT-2-1-6,
              :QDS-UNEARNED-AMT-2-1-7,
              :QDS-UNEARNED-AMT-2-1-8,
              :QDS-UNEARNED-AMT-2-1-9,
              :QDS-UNEARNED-AMT-2-1-10,
              :QDS-UNEARNED-AMT-2-2-1,
              :QDS-UNEARNED-AMT-2-2-2,
              :QDS-UNEARNED-AMT-2-2-3,
              :QDS-UNEARNED-AMT-2-2-4,
              :QDS-UNEARNED-AMT-2-2-5,
              :QDS-UNEARNED-AMT-2-2-6,
              :QDS-UNEARNED-AMT-2-2-7,
              :QDS-UNEARNED-AMT-2-2-8,
              :QDS-UNEARNED-AMT-2-2-9,
              :QDS-UNEARNED-AMT-2-2-10,
              :QDS-UNEARNED-AMT-3-1-1,
              :QDS-UNEARNED-AMT-3-1-2,
              :QDS-UNEARNED-AMT-3-1-3,
              :QDS-UNEARNED-AMT-3-1-4,
              :QDS-UNEARNED-AMT-3-1-5,
              :QDS-UNEARNED-AMT-3-1-6,
              :QDS-UNEARNED-AMT-3-1-7,
              :QDS-UNEARNED-AMT-3-1-8,
              :QDS-UNEARNED-AMT-3-1-9,
              :QDS-UNEARNED-AMT-3-1-10,
              :QDS-UNEARNED-AMT-3-2-1,
              :QDS-UNEARNED-AMT-3-2-2,
              :QDS-UNEARNED-AMT-3-2-3,
              :QDS-UNEARNED-AMT-3-2-4,
              :QDS-UNEARNED-AMT-3-2-5,
              :QDS-UNEARNED-AMT-3-2-6,
              :QDS-UNEARNED-AMT-3-2-7,
              :QDS-UNEARNED-AMT-3-2-8,
              :QDS-UNEARNED-AMT-3-2-9,
              :QDS-UNEARNED-AMT-3-2-10,
              :QDS-DLDISC-VOL-1,
              :QDS-DLDISC-VOL-2,
              :QDS-DLDISC-VOL-3,
              :QDS-AFPDUEDL-MEMO,
              :QDS-UNPAID-MANUAL,
              :QDS-LTOUCH-DATE)
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO WRITE-DS1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-----------------------------------------------------------------
       REWRITE-DS1-FILE.

           MOVE DS-PATH-OWNBR  TO DS-BRANCH.
           ACCEPT DS-LTOUCH-DATE FROM CENTURY-DATE.
           PERFORM REWRITE-IT.
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.
           PERFORM SET-DS-FIELDS.

           EXEC SQL
            UPDATE DBO.DSFILE
             SET
              DSFILE.DS_DATE_CCYYMM = :QDS-DATE-CCYYMM,
              DSFILE.DS_BRANCH = :QDS-BRANCH,
              DSFILE.DS_NUM = :QDS-NUM,
              DSFILE.DS_CLASS = :QDS-CLASS,
              DSFILE.DS_DLRVPRIN_1 = :QDS-DLRVPRIN-1,
              DSFILE.DS_DLRVPRIN_2 = :QDS-DLRVPRIN-2,
              DSFILE.DS_DLRVPRIN_3 = :QDS-DLRVPRIN-3,
              DSFILE.DS_DLRVCHGS_1 = :QDS-DLRVCHGS-1,
              DSFILE.DS_DLRVCHGS_2 = :QDS-DLRVCHGS-2,
              DSFILE.DS_DLRVCHGS_3 = :QDS-DLRVCHGS-3,
              DSFILE.DS_DLPARVHELD = :QDS-DLPARVHELD,
              DSFILE.DS_UNPAIDCK = :QDS-UNPAIDCK,
              DSFILE.DS_DLDISC = :QDS-DLDISC,
              DSFILE.DS_DLPARVPAID = :QDS-DLPARVPAID,
              DSFILE.DS_SUMWGTTM = :QDS-SUMWGTTM,
              DSFILE.DS_SUMWGTAV = :QDS-SUMWGTAV,
              DSFILE.DS_SUMWGTTA = :QDS-SUMWGTTA,
              DSFILE.DS_RCOURSE_UNITS_1 = :QDS-RCOURSE-UNITS-1,
              DSFILE.DS_RCOURSE_UNITS_2 = :QDS-RCOURSE-UNITS-2,
              DSFILE.DS_RCOURSE_UNITS_3 = :QDS-RCOURSE-UNITS-3,
              DSFILE.DS_RCOURSE_AMT_1 = :QDS-RCOURSE-AMT-1,
              DSFILE.DS_RCOURSE_AMT_2 = :QDS-RCOURSE-AMT-2,
              DSFILE.DS_RCOURSE_AMT_3 = :QDS-RCOURSE-AMT-3,
              DSFILE.DS_NPURUNIT_1 = :QDS-NPURUNIT-1,
              DSFILE.DS_NPURUNIT_2 = :QDS-NPURUNIT-2,
              DSFILE.DS_NPURUNIT_3 = :QDS-NPURUNIT-3,
              DSFILE.DS_NPURAMT_1 = :QDS-NPURAMT-1,
              DSFILE.DS_NPURAMT_2 = :QDS-NPURAMT-2,
              DSFILE.DS_NPURAMT_3 = :QDS-NPURAMT-3,
              DSFILE.DS_OPURUNIT_1 = :QDS-OPURUNIT-1,
              DSFILE.DS_OPURUNIT_2 = :QDS-OPURUNIT-2,
              DSFILE.DS_OPURUNIT_3 = :QDS-OPURUNIT-3,
              DSFILE.DS_OPURAMT_1 = :QDS-OPURAMT-1,
              DSFILE.DS_OPURAMT_2 = :QDS-OPURAMT-2,
              DSFILE.DS_OPURAMT_3 = :QDS-OPURAMT-3,
              DSFILE.DS_RNEWUNIT_1 = :QDS-RNEWUNIT-1,
              DSFILE.DS_RNEWUNIT_2 = :QDS-RNEWUNIT-2,
              DSFILE.DS_RNEWUNIT_3 = :QDS-RNEWUNIT-3,
              DSFILE.DS_RNEWAMT_1 = :QDS-RNEWAMT-1,
              DSFILE.DS_RNEWAMT_2 = :QDS-RNEWAMT-2,
              DSFILE.DS_RNEWAMT_3 = :QDS-RNEWAMT-3,
              DSFILE.DS_PAIDUNIT_1 = :QDS-PAIDUNIT-1,
              DSFILE.DS_PAIDUNIT_2 = :QDS-PAIDUNIT-2,
              DSFILE.DS_PAIDUNIT_3 = :QDS-PAIDUNIT-3,
              DSFILE.DS_PAIDAMT_1 = :QDS-PAIDAMT-1,
              DSFILE.DS_PAIDAMT_2 = :QDS-PAIDAMT-2,
              DSFILE.DS_PAIDAMT_3 = :QDS-PAIDAMT-3,
              DSFILE.DS_TODLUNIT_1 = :QDS-TODLUNIT-1,
              DSFILE.DS_TODLUNIT_2 = :QDS-TODLUNIT-2,
              DSFILE.DS_TODLUNIT_3 = :QDS-TODLUNIT-3,
              DSFILE.DS_TODLAMT_1 = :QDS-TODLAMT-1,
              DSFILE.DS_TODLAMT_2 = :QDS-TODLAMT-2,
              DSFILE.DS_TODLAMT_3 = :QDS-TODLAMT-3,
              DSFILE.DS_OUTSUNIT_1 = :QDS-OUTSUNIT-1,
              DSFILE.DS_OUTSUNIT_2 = :QDS-OUTSUNIT-2,
              DSFILE.DS_OUTSUNIT_3 = :QDS-OUTSUNIT-3,
              DSFILE.DS_OUTSAMT_1 = :QDS-OUTSAMT-1,
              DSFILE.DS_OUTSAMT_2 = :QDS-OUTSAMT-2,
              DSFILE.DS_OUTSAMT_3 = :QDS-OUTSAMT-3,
              DSFILE.DS_PLOSUNIT_1 = :QDS-PLOSUNIT-1,
              DSFILE.DS_PLOSUNIT_2 = :QDS-PLOSUNIT-2,
              DSFILE.DS_PLOSUNIT_3 = :QDS-PLOSUNIT-3,
              DSFILE.DS_PLOSAMT_1 = :QDS-PLOSAMT-1,
              DSFILE.DS_PLOSAMT_2 = :QDS-PLOSAMT-2,
              DSFILE.DS_PLOSAMT_3 = :QDS-PLOSAMT-3,
              DSFILE.DS_RCPLUNIT_1 = :QDS-RCPLUNIT-1,
              DSFILE.DS_RCPLUNIT_2 = :QDS-RCPLUNIT-2,
              DSFILE.DS_RCPLUNIT_3 = :QDS-RCPLUNIT-3,
              DSFILE.DS_RCPLAMT_1 = :QDS-RCPLAMT-1,
              DSFILE.DS_RCPLAMT_2 = :QDS-RCPLAMT-2,
              DSFILE.DS_RCPLAMT_3 = :QDS-RCPLAMT-3,
              DSFILE.DS_JDOSUNIT_1 = :QDS-JDOSUNIT-1,
              DSFILE.DS_JDOSUNIT_2 = :QDS-JDOSUNIT-2,
              DSFILE.DS_JDOSUNIT_3 = :QDS-JDOSUNIT-3,
              DSFILE.DS_JDOSAMT_1 = :QDS-JDOSAMT-1,
              DSFILE.DS_JDOSAMT_2 = :QDS-JDOSAMT-2,
              DSFILE.DS_JDOSAMT_3 = :QDS-JDOSAMT-3,
              DSFILE.DS_DELUNEARN_DATE =
                 :QDS-DELUNEARN-DATE,
              DSFILE.DS_PROCEEDS_1 = :QDS-PROCEEDS-1,
              DSFILE.DS_PROCEEDS_2 = :QDS-PROCEEDS-2,
              DSFILE.DS_NO_REPO_1_1_1 = :QDS-NO-REPO-1-1-1,
              DSFILE.DS_AMT_REPO_1_1_1 = :QDS-AMT-REPO-1-1-1,
              DSFILE.DS_NO_REPO_1_1_2 = :QDS-NO-REPO-1-1-2,
              DSFILE.DS_AMT_REPO_1_1_2 = :QDS-AMT-REPO-1-1-2,
              DSFILE.DS_NO_REPO_1_1_3 = :QDS-NO-REPO-1-1-3,
              DSFILE.DS_AMT_REPO_1_1_3 = :QDS-AMT-REPO-1-1-3,
              DSFILE.DS_NO_REPO_1_1_4 = :QDS-NO-REPO-1-1-4,
              DSFILE.DS_AMT_REPO_1_1_4 = :QDS-AMT-REPO-1-1-4,
              DSFILE.DS_NO_REPO_1_1_5 = :QDS-NO-REPO-1-1-5,
              DSFILE.DS_AMT_REPO_1_1_5 = :QDS-AMT-REPO-1-1-5,
              DSFILE.DS_NO_REPO_1_2_1 = :QDS-NO-REPO-1-2-1,
              DSFILE.DS_AMT_REPO_1_2_1 = :QDS-AMT-REPO-1-2-1,
              DSFILE.DS_NO_REPO_1_2_2 = :QDS-NO-REPO-1-2-2,
              DSFILE.DS_AMT_REPO_1_2_2 = :QDS-AMT-REPO-1-2-2,
              DSFILE.DS_NO_REPO_1_2_3 = :QDS-NO-REPO-1-2-3,
              DSFILE.DS_AMT_REPO_1_2_3 = :QDS-AMT-REPO-1-2-3,
              DSFILE.DS_NO_REPO_1_2_4 = :QDS-NO-REPO-1-2-4,
              DSFILE.DS_AMT_REPO_1_2_4 = :QDS-AMT-REPO-1-2-4,
              DSFILE.DS_NO_REPO_1_2_5 = :QDS-NO-REPO-1-2-5,
              DSFILE.DS_AMT_REPO_1_2_5 = :QDS-AMT-REPO-1-2-5,
              DSFILE.DS_NO_REPO_2_1_1 = :QDS-NO-REPO-2-1-1,
              DSFILE.DS_AMT_REPO_2_1_1 = :QDS-AMT-REPO-2-1-1,
              DSFILE.DS_NO_REPO_2_1_2 = :QDS-NO-REPO-2-1-2,
              DSFILE.DS_AMT_REPO_2_1_2 = :QDS-AMT-REPO-2-1-2,
              DSFILE.DS_NO_REPO_2_1_3 = :QDS-NO-REPO-2-1-3,
              DSFILE.DS_AMT_REPO_2_1_3 = :QDS-AMT-REPO-2-1-3,
              DSFILE.DS_NO_REPO_2_1_4 = :QDS-NO-REPO-2-1-4,
              DSFILE.DS_AMT_REPO_2_1_4 = :QDS-AMT-REPO-2-1-4,
              DSFILE.DS_NO_REPO_2_1_5 = :QDS-NO-REPO-2-1-5,
              DSFILE.DS_AMT_REPO_2_1_5 = :QDS-AMT-REPO-2-1-5,
              DSFILE.DS_NO_REPO_2_2_1 = :QDS-NO-REPO-2-2-1,
              DSFILE.DS_AMT_REPO_2_2_1 = :QDS-AMT-REPO-2-2-1,
              DSFILE.DS_NO_REPO_2_2_2 = :QDS-NO-REPO-2-2-2,
              DSFILE.DS_AMT_REPO_2_2_2 = :QDS-AMT-REPO-2-2-2,
              DSFILE.DS_NO_REPO_2_2_3 = :QDS-NO-REPO-2-2-3,
              DSFILE.DS_AMT_REPO_2_2_3 = :QDS-AMT-REPO-2-2-3,
              DSFILE.DS_NO_REPO_2_2_4 = :QDS-NO-REPO-2-2-4,
              DSFILE.DS_AMT_REPO_2_2_4 = :QDS-AMT-REPO-2-2-4,
              DSFILE.DS_NO_REPO_2_2_5 = :QDS-NO-REPO-2-2-5,
              DSFILE.DS_AMT_REPO_2_2_5 = :QDS-AMT-REPO-2-2-5,
              DSFILE.DS_NO_REPO_3_1_1 = :QDS-NO-REPO-3-1-1,
              DSFILE.DS_AMT_REPO_3_1_1 = :QDS-AMT-REPO-3-1-1,
              DSFILE.DS_NO_REPO_3_1_2 = :QDS-NO-REPO-3-1-2,
              DSFILE.DS_AMT_REPO_3_1_2 = :QDS-AMT-REPO-3-1-2,
              DSFILE.DS_NO_REPO_3_1_3 = :QDS-NO-REPO-3-1-3,
              DSFILE.DS_AMT_REPO_3_1_3 = :QDS-AMT-REPO-3-1-3,
              DSFILE.DS_NO_REPO_3_1_4 = :QDS-NO-REPO-3-1-4,
              DSFILE.DS_AMT_REPO_3_1_4 = :QDS-AMT-REPO-3-1-4,
              DSFILE.DS_NO_REPO_3_1_5 = :QDS-NO-REPO-3-1-5,
              DSFILE.DS_AMT_REPO_3_1_5 = :QDS-AMT-REPO-3-1-5,
              DSFILE.DS_NO_REPO_3_2_1 = :QDS-NO-REPO-3-2-1,
              DSFILE.DS_AMT_REPO_3_2_1 = :QDS-AMT-REPO-3-2-1,
              DSFILE.DS_NO_REPO_3_2_2 = :QDS-NO-REPO-3-2-2,
              DSFILE.DS_AMT_REPO_3_2_2 = :QDS-AMT-REPO-3-2-2,
              DSFILE.DS_NO_REPO_3_2_3 = :QDS-NO-REPO-3-2-3,
              DSFILE.DS_AMT_REPO_3_2_3 = :QDS-AMT-REPO-3-2-3,
              DSFILE.DS_NO_REPO_3_2_4 = :QDS-NO-REPO-3-2-4,
              DSFILE.DS_AMT_REPO_3_2_4 = :QDS-AMT-REPO-3-2-4,
              DSFILE.DS_NO_REPO_3_2_5 = :QDS-NO-REPO-3-2-5,
              DSFILE.DS_AMT_REPO_3_2_5 = :QDS-AMT-REPO-3-2-5,
              DSFILE.DS_UNITS_1_1_1 = :QDS-UNITS-1-1-1,
              DSFILE.DS_OUTBAL_1_1_1 = :QDS-OUTBAL-1-1-1,
              DSFILE.DS_UNITS_1_1_2 = :QDS-UNITS-1-1-2,
              DSFILE.DS_OUTBAL_1_1_2 = :QDS-OUTBAL-1-1-2,
              DSFILE.DS_UNITS_1_1_3 = :QDS-UNITS-1-1-3,
              DSFILE.DS_OUTBAL_1_1_3 = :QDS-OUTBAL-1-1-3,
              DSFILE.DS_UNITS_1_1_4 = :QDS-UNITS-1-1-4,
              DSFILE.DS_OUTBAL_1_1_4 = :QDS-OUTBAL-1-1-4,
              DSFILE.DS_UNITS_1_1_5 = :QDS-UNITS-1-1-5,
              DSFILE.DS_OUTBAL_1_1_5 = :QDS-OUTBAL-1-1-5,
              DSFILE.DS_UNITS_1_1_6 = :QDS-UNITS-1-1-6,
              DSFILE.DS_OUTBAL_1_1_6 = :QDS-OUTBAL-1-1-6,
              DSFILE.DS_UNITS_1_1_7 = :QDS-UNITS-1-1-7,
              DSFILE.DS_OUTBAL_1_1_7 = :QDS-OUTBAL-1-1-7,
              DSFILE.DS_UNITS_1_1_8 = :QDS-UNITS-1-1-8,
              DSFILE.DS_OUTBAL_1_1_8 = :QDS-OUTBAL-1-1-8,
              DSFILE.DS_UNITS_1_1_9 = :QDS-UNITS-1-1-9,
              DSFILE.DS_OUTBAL_1_1_9 = :QDS-OUTBAL-1-1-9,
              DSFILE.DS_UNITS_1_1_10 = :QDS-UNITS-1-1-10,
              DSFILE.DS_OUTBAL_1_1_10 = :QDS-OUTBAL-1-1-10,
              DSFILE.DS_UNITS_1_2_1 = :QDS-UNITS-1-2-1,
              DSFILE.DS_OUTBAL_1_2_1 = :QDS-OUTBAL-1-2-1,
              DSFILE.DS_UNITS_1_2_2 = :QDS-UNITS-1-2-2,
              DSFILE.DS_OUTBAL_1_2_2 = :QDS-OUTBAL-1-2-2,
              DSFILE.DS_UNITS_1_2_3 = :QDS-UNITS-1-2-3,
              DSFILE.DS_OUTBAL_1_2_3 = :QDS-OUTBAL-1-2-3,
              DSFILE.DS_UNITS_1_2_4 = :QDS-UNITS-1-2-4,
              DSFILE.DS_OUTBAL_1_2_4 = :QDS-OUTBAL-1-2-4,
              DSFILE.DS_UNITS_1_2_5 = :QDS-UNITS-1-2-5,
              DSFILE.DS_OUTBAL_1_2_5 = :QDS-OUTBAL-1-2-5,
              DSFILE.DS_UNITS_1_2_6 = :QDS-UNITS-1-2-6,
              DSFILE.DS_OUTBAL_1_2_6 = :QDS-OUTBAL-1-2-6,
              DSFILE.DS_UNITS_1_2_7 = :QDS-UNITS-1-2-7,
              DSFILE.DS_OUTBAL_1_2_7 = :QDS-OUTBAL-1-2-7,
              DSFILE.DS_UNITS_1_2_8 = :QDS-UNITS-1-2-8,
              DSFILE.DS_OUTBAL_1_2_8 = :QDS-OUTBAL-1-2-8,
              DSFILE.DS_UNITS_1_2_9 = :QDS-UNITS-1-2-9,
              DSFILE.DS_OUTBAL_1_2_9 = :QDS-OUTBAL-1-2-9,
              DSFILE.DS_UNITS_1_2_10 = :QDS-UNITS-1-2-10,
              DSFILE.DS_OUTBAL_1_2_10 = :QDS-OUTBAL-1-2-10,
              DSFILE.DS_UNITS_2_1_1 = :QDS-UNITS-2-1-1,
              DSFILE.DS_OUTBAL_2_1_1 = :QDS-OUTBAL-2-1-1,
              DSFILE.DS_UNITS_2_1_2 = :QDS-UNITS-2-1-2,
              DSFILE.DS_OUTBAL_2_1_2 = :QDS-OUTBAL-2-1-2,
              DSFILE.DS_UNITS_2_1_3 = :QDS-UNITS-2-1-3,
              DSFILE.DS_OUTBAL_2_1_3 = :QDS-OUTBAL-2-1-3,
              DSFILE.DS_UNITS_2_1_4 = :QDS-UNITS-2-1-4,
              DSFILE.DS_OUTBAL_2_1_4 = :QDS-OUTBAL-2-1-4,
              DSFILE.DS_UNITS_2_1_5 = :QDS-UNITS-2-1-5,
              DSFILE.DS_OUTBAL_2_1_5 = :QDS-OUTBAL-2-1-5,
              DSFILE.DS_UNITS_2_1_6 = :QDS-UNITS-2-1-6,
              DSFILE.DS_OUTBAL_2_1_6 = :QDS-OUTBAL-2-1-6,
              DSFILE.DS_UNITS_2_1_7 = :QDS-UNITS-2-1-7,
              DSFILE.DS_OUTBAL_2_1_7 = :QDS-OUTBAL-2-1-7,
              DSFILE.DS_UNITS_2_1_8 = :QDS-UNITS-2-1-8,
              DSFILE.DS_OUTBAL_2_1_8 = :QDS-OUTBAL-2-1-8,
              DSFILE.DS_UNITS_2_1_9 = :QDS-UNITS-2-1-9,
              DSFILE.DS_OUTBAL_2_1_9 = :QDS-OUTBAL-2-1-9,
              DSFILE.DS_UNITS_2_1_10 = :QDS-UNITS-2-1-10,
              DSFILE.DS_OUTBAL_2_1_10 = :QDS-OUTBAL-2-1-10,
              DSFILE.DS_UNITS_2_2_1 = :QDS-UNITS-2-2-1,
              DSFILE.DS_OUTBAL_2_2_1 = :QDS-OUTBAL-2-2-1,
              DSFILE.DS_UNITS_2_2_2 = :QDS-UNITS-2-2-2,
              DSFILE.DS_OUTBAL_2_2_2 = :QDS-OUTBAL-2-2-2,
              DSFILE.DS_UNITS_2_2_3 = :QDS-UNITS-2-2-3,
              DSFILE.DS_OUTBAL_2_2_3 = :QDS-OUTBAL-2-2-3,
              DSFILE.DS_UNITS_2_2_4 = :QDS-UNITS-2-2-4,
              DSFILE.DS_OUTBAL_2_2_4 = :QDS-OUTBAL-2-2-4,
              DSFILE.DS_UNITS_2_2_5 = :QDS-UNITS-2-2-5,
              DSFILE.DS_OUTBAL_2_2_5 = :QDS-OUTBAL-2-2-5,
              DSFILE.DS_UNITS_2_2_6 = :QDS-UNITS-2-2-6,
              DSFILE.DS_OUTBAL_2_2_6 = :QDS-OUTBAL-2-2-6,
              DSFILE.DS_UNITS_2_2_7 = :QDS-UNITS-2-2-7,
              DSFILE.DS_OUTBAL_2_2_7 = :QDS-OUTBAL-2-2-7,
              DSFILE.DS_UNITS_2_2_8 = :QDS-UNITS-2-2-8,
              DSFILE.DS_OUTBAL_2_2_8 = :QDS-OUTBAL-2-2-8,
              DSFILE.DS_UNITS_2_2_9 = :QDS-UNITS-2-2-9,
              DSFILE.DS_OUTBAL_2_2_9 = :QDS-OUTBAL-2-2-9,
              DSFILE.DS_UNITS_2_2_10 = :QDS-UNITS-2-2-10,
              DSFILE.DS_OUTBAL_2_2_10 = :QDS-OUTBAL-2-2-10,
              DSFILE.DS_UNITS_3_1_1 = :QDS-UNITS-3-1-1,
              DSFILE.DS_OUTBAL_3_1_1 = :QDS-OUTBAL-3-1-1,
              DSFILE.DS_UNITS_3_1_2 = :QDS-UNITS-3-1-2,
              DSFILE.DS_OUTBAL_3_1_2 = :QDS-OUTBAL-3-1-2,
              DSFILE.DS_UNITS_3_1_3 = :QDS-UNITS-3-1-3,
              DSFILE.DS_OUTBAL_3_1_3 = :QDS-OUTBAL-3-1-3,
              DSFILE.DS_UNITS_3_1_4 = :QDS-UNITS-3-1-4,
              DSFILE.DS_OUTBAL_3_1_4 = :QDS-OUTBAL-3-1-4,
              DSFILE.DS_UNITS_3_1_5 = :QDS-UNITS-3-1-5,
              DSFILE.DS_OUTBAL_3_1_5 = :QDS-OUTBAL-3-1-5,
              DSFILE.DS_UNITS_3_1_6 = :QDS-UNITS-3-1-6,
              DSFILE.DS_OUTBAL_3_1_6 = :QDS-OUTBAL-3-1-6,
              DSFILE.DS_UNITS_3_1_7 = :QDS-UNITS-3-1-7,
              DSFILE.DS_OUTBAL_3_1_7 = :QDS-OUTBAL-3-1-7,
              DSFILE.DS_UNITS_3_1_8 = :QDS-UNITS-3-1-8,
              DSFILE.DS_OUTBAL_3_1_8 = :QDS-OUTBAL-3-1-8,
              DSFILE.DS_UNITS_3_1_9 = :QDS-UNITS-3-1-9,
              DSFILE.DS_OUTBAL_3_1_9 = :QDS-OUTBAL-3-1-9,
              DSFILE.DS_UNITS_3_1_10 = :QDS-UNITS-3-1-10,
              DSFILE.DS_OUTBAL_3_1_10 = :QDS-OUTBAL-3-1-10,
              DSFILE.DS_UNITS_3_2_1 = :QDS-UNITS-3-2-1,
              DSFILE.DS_OUTBAL_3_2_1 = :QDS-OUTBAL-3-2-1,
              DSFILE.DS_UNITS_3_2_2 = :QDS-UNITS-3-2-2,
              DSFILE.DS_OUTBAL_3_2_2 = :QDS-OUTBAL-3-2-2,
              DSFILE.DS_UNITS_3_2_3 = :QDS-UNITS-3-2-3,
              DSFILE.DS_OUTBAL_3_2_3 = :QDS-OUTBAL-3-2-3,
              DSFILE.DS_UNITS_3_2_4 = :QDS-UNITS-3-2-4,
              DSFILE.DS_OUTBAL_3_2_4 = :QDS-OUTBAL-3-2-4,
              DSFILE.DS_UNITS_3_2_5 = :QDS-UNITS-3-2-5,
              DSFILE.DS_OUTBAL_3_2_5 = :QDS-OUTBAL-3-2-5,
              DSFILE.DS_UNITS_3_2_6 = :QDS-UNITS-3-2-6,
              DSFILE.DS_OUTBAL_3_2_6 = :QDS-OUTBAL-3-2-6,
              DSFILE.DS_UNITS_3_2_7 = :QDS-UNITS-3-2-7,
              DSFILE.DS_OUTBAL_3_2_7 = :QDS-OUTBAL-3-2-7,
              DSFILE.DS_UNITS_3_2_8 = :QDS-UNITS-3-2-8,
              DSFILE.DS_OUTBAL_3_2_8 = :QDS-OUTBAL-3-2-8,
              DSFILE.DS_UNITS_3_2_9 = :QDS-UNITS-3-2-9,
              DSFILE.DS_OUTBAL_3_2_9 = :QDS-OUTBAL-3-2-9,
              DSFILE.DS_UNITS_3_2_10 = :QDS-UNITS-3-2-10,
              DSFILE.DS_OUTBAL_3_2_10 = :QDS-OUTBAL-3-2-10,
              DSFILE.DS_UNITS_BNKRPT_1_1_1 =
                   :QDS-UNITS-BNKRPT-1-1-1,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_1 =
                   :QDS-OUTBAL-BNKRPT-1-1-1,
              DSFILE.DS_UNITS_BNKRPT_1_1_2 =
                   :QDS-UNITS-BNKRPT-1-1-2,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_2 =
                   :QDS-OUTBAL-BNKRPT-1-1-2,
              DSFILE.DS_UNITS_BNKRPT_1_1_3 =
                   :QDS-UNITS-BNKRPT-1-1-3,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_3 =
                   :QDS-OUTBAL-BNKRPT-1-1-3,
              DSFILE.DS_UNITS_BNKRPT_1_1_4 =
                   :QDS-UNITS-BNKRPT-1-1-4,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_4 =
                   :QDS-OUTBAL-BNKRPT-1-1-4,
              DSFILE.DS_UNITS_BNKRPT_1_1_5 =
                   :QDS-UNITS-BNKRPT-1-1-5,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_5 =
                   :QDS-OUTBAL-BNKRPT-1-1-5,
              DSFILE.DS_UNITS_BNKRPT_1_1_6 =
                   :QDS-UNITS-BNKRPT-1-1-6,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_6 =
                   :QDS-OUTBAL-BNKRPT-1-1-6,
              DSFILE.DS_UNITS_BNKRPT_1_1_7 =
                   :QDS-UNITS-BNKRPT-1-1-7,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_7 =
                   :QDS-OUTBAL-BNKRPT-1-1-7,
              DSFILE.DS_UNITS_BNKRPT_1_1_8 =
                   :QDS-UNITS-BNKRPT-1-1-8,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_8 =
                   :QDS-OUTBAL-BNKRPT-1-1-8,
              DSFILE.DS_UNITS_BNKRPT_1_1_9 =
                   :QDS-UNITS-BNKRPT-1-1-9,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_9 =
                   :QDS-OUTBAL-BNKRPT-1-1-9,
              DSFILE.DS_UNITS_BNKRPT_1_1_10 =
                   :QDS-UNITS-BNKRPT-1-1-10,
              DSFILE.DS_OUTBAL_BNKRPT_1_1_10 =
                   :QDS-OUTBAL-BNKRPT-1-1-10,
              DSFILE.DS_UNITS_BNKRPT_1_2_1 =
                   :QDS-UNITS-BNKRPT-1-2-1,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_1 =
                   :QDS-OUTBAL-BNKRPT-1-2-1,
              DSFILE.DS_UNITS_BNKRPT_1_2_2 =
                   :QDS-UNITS-BNKRPT-1-2-2,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_2 =
                   :QDS-OUTBAL-BNKRPT-1-2-2,
              DSFILE.DS_UNITS_BNKRPT_1_2_3 =
                   :QDS-UNITS-BNKRPT-1-2-3,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_3 =
                   :QDS-OUTBAL-BNKRPT-1-2-3,
              DSFILE.DS_UNITS_BNKRPT_1_2_4 =
                   :QDS-UNITS-BNKRPT-1-2-4,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_4 =
                   :QDS-OUTBAL-BNKRPT-1-2-4,
              DSFILE.DS_UNITS_BNKRPT_1_2_5 =
                   :QDS-UNITS-BNKRPT-1-2-5,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_5 =
                   :QDS-OUTBAL-BNKRPT-1-2-5,
              DSFILE.DS_UNITS_BNKRPT_1_2_6 =
                   :QDS-UNITS-BNKRPT-1-2-6,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_6 =
                   :QDS-OUTBAL-BNKRPT-1-2-6,
              DSFILE.DS_UNITS_BNKRPT_1_2_7 =
                   :QDS-UNITS-BNKRPT-1-2-7,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_7 =
                   :QDS-OUTBAL-BNKRPT-1-2-7,
              DSFILE.DS_UNITS_BNKRPT_1_2_8 =
                   :QDS-UNITS-BNKRPT-1-2-8,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_8 =
                   :QDS-OUTBAL-BNKRPT-1-2-8,
              DSFILE.DS_UNITS_BNKRPT_1_2_9 =
                   :QDS-UNITS-BNKRPT-1-2-9,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_9 =
                   :QDS-OUTBAL-BNKRPT-1-2-9,
              DSFILE.DS_UNITS_BNKRPT_1_2_10 =
                   :QDS-UNITS-BNKRPT-1-2-10,
              DSFILE.DS_OUTBAL_BNKRPT_1_2_10 =
                   :QDS-OUTBAL-BNKRPT-1-2-10,
              DSFILE.DS_UNITS_BNKRPT_2_1_1 =
                   :QDS-UNITS-BNKRPT-2-1-1,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_1 =
                   :QDS-OUTBAL-BNKRPT-2-1-1,
              DSFILE.DS_UNITS_BNKRPT_2_1_2 =
                   :QDS-UNITS-BNKRPT-2-1-2,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_2 =
                   :QDS-OUTBAL-BNKRPT-2-1-2,
              DSFILE.DS_UNITS_BNKRPT_2_1_3 =
                   :QDS-UNITS-BNKRPT-2-1-3,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_3 =
                   :QDS-OUTBAL-BNKRPT-2-1-3,
              DSFILE.DS_UNITS_BNKRPT_2_1_4 =
                   :QDS-UNITS-BNKRPT-2-1-4,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_4 =
                   :QDS-OUTBAL-BNKRPT-2-1-4,
              DSFILE.DS_UNITS_BNKRPT_2_1_5 =
                   :QDS-UNITS-BNKRPT-2-1-5,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_5 =
                   :QDS-OUTBAL-BNKRPT-2-1-5,
              DSFILE.DS_UNITS_BNKRPT_2_1_6 =
                   :QDS-UNITS-BNKRPT-2-1-6,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_6 =
                   :QDS-OUTBAL-BNKRPT-2-1-6,
              DSFILE.DS_UNITS_BNKRPT_2_1_7 =
                   :QDS-UNITS-BNKRPT-2-1-7,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_7 =
                   :QDS-OUTBAL-BNKRPT-2-1-7,
              DSFILE.DS_UNITS_BNKRPT_2_1_8 =
                   :QDS-UNITS-BNKRPT-2-1-8,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_8 =
                   :QDS-OUTBAL-BNKRPT-2-1-8,
              DSFILE.DS_UNITS_BNKRPT_2_1_9 =
                   :QDS-UNITS-BNKRPT-2-1-9,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_9 =
                   :QDS-OUTBAL-BNKRPT-2-1-9,
              DSFILE.DS_UNITS_BNKRPT_2_1_10 =
                   :QDS-UNITS-BNKRPT-2-1-10,
              DSFILE.DS_OUTBAL_BNKRPT_2_1_10 =
                   :QDS-OUTBAL-BNKRPT-2-1-10,
              DSFILE.DS_UNITS_BNKRPT_2_2_1 =
                   :QDS-UNITS-BNKRPT-2-2-1,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_1 =
                   :QDS-OUTBAL-BNKRPT-2-2-1,
              DSFILE.DS_UNITS_BNKRPT_2_2_2 =
                   :QDS-UNITS-BNKRPT-2-2-2,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_2 =
                   :QDS-OUTBAL-BNKRPT-2-2-2,
              DSFILE.DS_UNITS_BNKRPT_2_2_3 =
                   :QDS-UNITS-BNKRPT-2-2-3,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_3 =
                   :QDS-OUTBAL-BNKRPT-2-2-3,
              DSFILE.DS_UNITS_BNKRPT_2_2_4 =
                   :QDS-UNITS-BNKRPT-2-2-4,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_4 =
                   :QDS-OUTBAL-BNKRPT-2-2-4,
              DSFILE.DS_UNITS_BNKRPT_2_2_5 =
                   :QDS-UNITS-BNKRPT-2-2-5,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_5 =
                   :QDS-OUTBAL-BNKRPT-2-2-5,
              DSFILE.DS_UNITS_BNKRPT_2_2_6 =
                   :QDS-UNITS-BNKRPT-2-2-6,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_6 =
                   :QDS-OUTBAL-BNKRPT-2-2-6,
              DSFILE.DS_UNITS_BNKRPT_2_2_7 =
                   :QDS-UNITS-BNKRPT-2-2-7,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_7 =
                   :QDS-OUTBAL-BNKRPT-2-2-7,
              DSFILE.DS_UNITS_BNKRPT_2_2_8 =
                   :QDS-UNITS-BNKRPT-2-2-8,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_8 =
                   :QDS-OUTBAL-BNKRPT-2-2-8,
              DSFILE.DS_UNITS_BNKRPT_2_2_9 =
                   :QDS-UNITS-BNKRPT-2-2-9,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_9 =
                   :QDS-OUTBAL-BNKRPT-2-2-9,
              DSFILE.DS_UNITS_BNKRPT_2_2_10 =
                   :QDS-UNITS-BNKRPT-2-2-10,
              DSFILE.DS_OUTBAL_BNKRPT_2_2_10 =
                   :QDS-OUTBAL-BNKRPT-2-2-10,
              DSFILE.DS_UNITS_BNKRPT_3_1_1 =
                   :QDS-UNITS-BNKRPT-3-1-1,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_1 =
                   :QDS-OUTBAL-BNKRPT-3-1-1,
              DSFILE.DS_UNITS_BNKRPT_3_1_2 =
                   :QDS-UNITS-BNKRPT-3-1-2,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_2 =
                   :QDS-OUTBAL-BNKRPT-3-1-2,
              DSFILE.DS_UNITS_BNKRPT_3_1_3 =
                   :QDS-UNITS-BNKRPT-3-1-3,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_3 =
                   :QDS-OUTBAL-BNKRPT-3-1-3,
              DSFILE.DS_UNITS_BNKRPT_3_1_4 =
                   :QDS-UNITS-BNKRPT-3-1-4,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_4 =
                   :QDS-OUTBAL-BNKRPT-3-1-4,
              DSFILE.DS_UNITS_BNKRPT_3_1_5 =
                   :QDS-UNITS-BNKRPT-3-1-5,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_5 =
                   :QDS-OUTBAL-BNKRPT-3-1-5,
              DSFILE.DS_UNITS_BNKRPT_3_1_6 =
                   :QDS-UNITS-BNKRPT-3-1-6,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_6 =
                   :QDS-OUTBAL-BNKRPT-3-1-6,
              DSFILE.DS_UNITS_BNKRPT_3_1_7 =
                   :QDS-UNITS-BNKRPT-3-1-7,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_7 =
                   :QDS-OUTBAL-BNKRPT-3-1-7,
              DSFILE.DS_UNITS_BNKRPT_3_1_8 =
                   :QDS-UNITS-BNKRPT-3-1-8,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_8 =
                   :QDS-OUTBAL-BNKRPT-3-1-8,
              DSFILE.DS_UNITS_BNKRPT_3_1_9 =
                   :QDS-UNITS-BNKRPT-3-1-9,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_9 =
                   :QDS-OUTBAL-BNKRPT-3-1-9,
              DSFILE.DS_UNITS_BNKRPT_3_1_10 =
                   :QDS-UNITS-BNKRPT-3-1-10,
              DSFILE.DS_OUTBAL_BNKRPT_3_1_10 =
                   :QDS-OUTBAL-BNKRPT-3-1-10,
              DSFILE.DS_UNITS_BNKRPT_3_2_1 =
                   :QDS-UNITS-BNKRPT-3-2-1,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_1 =
                   :QDS-OUTBAL-BNKRPT-3-2-1,
              DSFILE.DS_UNITS_BNKRPT_3_2_2 =
                   :QDS-UNITS-BNKRPT-3-2-2,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_2 =
                   :QDS-OUTBAL-BNKRPT-3-2-2,
              DSFILE.DS_UNITS_BNKRPT_3_2_3 =
                   :QDS-UNITS-BNKRPT-3-2-3,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_3 =
                   :QDS-OUTBAL-BNKRPT-3-2-3,
              DSFILE.DS_UNITS_BNKRPT_3_2_4 =
                   :QDS-UNITS-BNKRPT-3-2-4,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_4 =
                   :QDS-OUTBAL-BNKRPT-3-2-4,
              DSFILE.DS_UNITS_BNKRPT_3_2_5 =
                   :QDS-UNITS-BNKRPT-3-2-5,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_5 =
                   :QDS-OUTBAL-BNKRPT-3-2-5,
              DSFILE.DS_UNITS_BNKRPT_3_2_6 =
                   :QDS-UNITS-BNKRPT-3-2-6,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_6 =
                   :QDS-OUTBAL-BNKRPT-3-2-6,
              DSFILE.DS_UNITS_BNKRPT_3_2_7 =
                   :QDS-UNITS-BNKRPT-3-2-7,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_7 =
                   :QDS-OUTBAL-BNKRPT-3-2-7,
              DSFILE.DS_UNITS_BNKRPT_3_2_8 =
                   :QDS-UNITS-BNKRPT-3-2-8,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_8 =
                   :QDS-OUTBAL-BNKRPT-3-2-8,
              DSFILE.DS_UNITS_BNKRPT_3_2_9 =
                   :QDS-UNITS-BNKRPT-3-2-9,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_9 =
                   :QDS-OUTBAL-BNKRPT-3-2-9,
              DSFILE.DS_UNITS_BNKRPT_3_2_10 =
                   :QDS-UNITS-BNKRPT-3-2-10,
              DSFILE.DS_OUTBAL_BNKRPT_3_2_10 =
                   :QDS-OUTBAL-BNKRPT-3-2-10,
              DSFILE.DS_UNEARNED_AMT_1_1_1 =
                   :QDS-UNEARNED-AMT-1-1-1,
              DSFILE.DS_UNEARNED_AMT_1_1_2 =
                   :QDS-UNEARNED-AMT-1-1-2,
              DSFILE.DS_UNEARNED_AMT_1_1_3 =
                   :QDS-UNEARNED-AMT-1-1-3,
              DSFILE.DS_UNEARNED_AMT_1_1_4 =
                   :QDS-UNEARNED-AMT-1-1-4,
              DSFILE.DS_UNEARNED_AMT_1_1_5 =
                   :QDS-UNEARNED-AMT-1-1-5,
              DSFILE.DS_UNEARNED_AMT_1_1_6 =
                   :QDS-UNEARNED-AMT-1-1-6,
              DSFILE.DS_UNEARNED_AMT_1_1_7 =
                   :QDS-UNEARNED-AMT-1-1-7,
              DSFILE.DS_UNEARNED_AMT_1_1_8 =
                   :QDS-UNEARNED-AMT-1-1-8,
              DSFILE.DS_UNEARNED_AMT_1_1_9 =
                   :QDS-UNEARNED-AMT-1-1-9,
              DSFILE.DS_UNEARNED_AMT_1_1_10 =
                   :QDS-UNEARNED-AMT-1-1-10,
              DSFILE.DS_UNEARNED_AMT_1_2_1 =
                   :QDS-UNEARNED-AMT-1-2-1,
              DSFILE.DS_UNEARNED_AMT_1_2_2 =
                   :QDS-UNEARNED-AMT-1-2-2,
              DSFILE.DS_UNEARNED_AMT_1_2_3 =
                   :QDS-UNEARNED-AMT-1-2-3,
              DSFILE.DS_UNEARNED_AMT_1_2_4 =
                   :QDS-UNEARNED-AMT-1-2-4,
              DSFILE.DS_UNEARNED_AMT_1_2_5 =
                   :QDS-UNEARNED-AMT-1-2-5,
              DSFILE.DS_UNEARNED_AMT_1_2_6 =
                   :QDS-UNEARNED-AMT-1-2-6,
              DSFILE.DS_UNEARNED_AMT_1_2_7 =
                   :QDS-UNEARNED-AMT-1-2-7,
              DSFILE.DS_UNEARNED_AMT_1_2_8 =
                   :QDS-UNEARNED-AMT-1-2-8,
              DSFILE.DS_UNEARNED_AMT_1_2_9 =
                   :QDS-UNEARNED-AMT-1-2-9,
              DSFILE.DS_UNEARNED_AMT_1_2_10 =
                   :QDS-UNEARNED-AMT-1-2-10,
              DSFILE.DS_UNEARNED_AMT_2_1_1 =
                   :QDS-UNEARNED-AMT-2-1-1,
              DSFILE.DS_UNEARNED_AMT_2_1_2 =
                   :QDS-UNEARNED-AMT-2-1-2,
              DSFILE.DS_UNEARNED_AMT_2_1_3 =
                   :QDS-UNEARNED-AMT-2-1-3,
              DSFILE.DS_UNEARNED_AMT_2_1_4 =
                   :QDS-UNEARNED-AMT-2-1-4,
              DSFILE.DS_UNEARNED_AMT_2_1_5 =
                   :QDS-UNEARNED-AMT-2-1-5,
              DSFILE.DS_UNEARNED_AMT_2_1_6 =
                   :QDS-UNEARNED-AMT-2-1-6,
              DSFILE.DS_UNEARNED_AMT_2_1_7 =
                   :QDS-UNEARNED-AMT-2-1-7,
              DSFILE.DS_UNEARNED_AMT_2_1_8 =
                   :QDS-UNEARNED-AMT-2-1-8,
              DSFILE.DS_UNEARNED_AMT_2_1_9 =
                   :QDS-UNEARNED-AMT-2-1-9,
              DSFILE.DS_UNEARNED_AMT_2_1_10 =
                   :QDS-UNEARNED-AMT-2-1-10,
              DSFILE.DS_UNEARNED_AMT_2_2_1 =
                   :QDS-UNEARNED-AMT-2-2-1,
              DSFILE.DS_UNEARNED_AMT_2_2_2 =
                   :QDS-UNEARNED-AMT-2-2-2,
              DSFILE.DS_UNEARNED_AMT_2_2_3 =
                   :QDS-UNEARNED-AMT-2-2-3,
              DSFILE.DS_UNEARNED_AMT_2_2_4 =
                   :QDS-UNEARNED-AMT-2-2-4,
              DSFILE.DS_UNEARNED_AMT_2_2_5 =
                   :QDS-UNEARNED-AMT-2-2-5,
              DSFILE.DS_UNEARNED_AMT_2_2_6 =
                   :QDS-UNEARNED-AMT-2-2-6,
              DSFILE.DS_UNEARNED_AMT_2_2_7 =
                   :QDS-UNEARNED-AMT-2-2-7,
              DSFILE.DS_UNEARNED_AMT_2_2_8 =
                   :QDS-UNEARNED-AMT-2-2-8,
              DSFILE.DS_UNEARNED_AMT_2_2_9 =
                   :QDS-UNEARNED-AMT-2-2-9,
              DSFILE.DS_UNEARNED_AMT_2_2_10 =
                   :QDS-UNEARNED-AMT-2-2-10,
              DSFILE.DS_UNEARNED_AMT_3_1_1 =
                   :QDS-UNEARNED-AMT-3-1-1,
              DSFILE.DS_UNEARNED_AMT_3_1_2 =
                   :QDS-UNEARNED-AMT-3-1-2,
              DSFILE.DS_UNEARNED_AMT_3_1_3 =
                   :QDS-UNEARNED-AMT-3-1-3,
              DSFILE.DS_UNEARNED_AMT_3_1_4 =
                   :QDS-UNEARNED-AMT-3-1-4,
              DSFILE.DS_UNEARNED_AMT_3_1_5 =
                   :QDS-UNEARNED-AMT-3-1-5,
              DSFILE.DS_UNEARNED_AMT_3_1_6 =
                   :QDS-UNEARNED-AMT-3-1-6,
              DSFILE.DS_UNEARNED_AMT_3_1_7 =
                   :QDS-UNEARNED-AMT-3-1-7,
              DSFILE.DS_UNEARNED_AMT_3_1_8 =
                   :QDS-UNEARNED-AMT-3-1-8,
              DSFILE.DS_UNEARNED_AMT_3_1_9 =
                   :QDS-UNEARNED-AMT-3-1-9,
              DSFILE.DS_UNEARNED_AMT_3_1_10 =
                   :QDS-UNEARNED-AMT-3-1-10,
              DSFILE.DS_UNEARNED_AMT_3_2_1 =
                   :QDS-UNEARNED-AMT-3-2-1,
              DSFILE.DS_UNEARNED_AMT_3_2_2 =
                   :QDS-UNEARNED-AMT-3-2-2,
              DSFILE.DS_UNEARNED_AMT_3_2_3 =
                   :QDS-UNEARNED-AMT-3-2-3,
              DSFILE.DS_UNEARNED_AMT_3_2_4 =
                   :QDS-UNEARNED-AMT-3-2-4,
              DSFILE.DS_UNEARNED_AMT_3_2_5 =
                   :QDS-UNEARNED-AMT-3-2-5,
              DSFILE.DS_UNEARNED_AMT_3_2_6 =
                   :QDS-UNEARNED-AMT-3-2-6,
              DSFILE.DS_UNEARNED_AMT_3_2_7 =
                   :QDS-UNEARNED-AMT-3-2-7,
              DSFILE.DS_UNEARNED_AMT_3_2_8 =
                   :QDS-UNEARNED-AMT-3-2-8,
              DSFILE.DS_UNEARNED_AMT_3_2_9 =
                   :QDS-UNEARNED-AMT-3-2-9,
              DSFILE.DS_UNEARNED_AMT_3_2_10 =
                   :QDS-UNEARNED-AMT-3-2-10,
              DSFILE.DS_DLDISC_VOL_1 = :QDS-DLDISC-VOL-1,
              DSFILE.DS_DLDISC_VOL_2 = :QDS-DLDISC-VOL-2,
              DSFILE.DS_DLDISC_VOL_3 = :QDS-DLDISC-VOL-3,
              DSFILE.DS_AFPDUEDL_MEMO = :QDS-AFPDUEDL-MEMO,
              DSFILE.DS_UNPAID_MANUAL = :QDS-UNPAID-MANUAL,
              DSFILE.DS_LTOUCH_DATE = :QDS-LTOUCH-DATE
             WHERE DSFILE.DS_DATE_CCYYMM = :QDS-DATE-CCYYMM
               AND DSFILE.DS_BRANCH = :QDS-BRANCH
               AND DSFILE.DS_NUM = :QDS-NUM
               AND DSFILE.DS_CLASS = :QDS-CLASS
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO REWRITE-DS1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-----------------------------------------------------------------
       DELETE-DS1-FILE.

           MOVE DS-PATH-OWNBR  TO DS-BRANCH.
           PERFORM DELETE-IT.
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.
           PERFORM SET-DS-FIELDS.

           EXEC SQL
            DELETE FROM DBO.DSFILE
             WHERE DSFILE.DS_DATE_CCYYMM = :QDS-DATE-CCYYMM
               AND DSFILE.DS_BRANCH = :QDS-BRANCH
               AND DSFILE.DS_NUM = :QDS-NUM
               AND DSFILE.DS_CLASS = :QDS-CLASS
           END-EXEC.
           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO DELETE-DS1-FILE.

      *-----------------------------------------------------------------
       CLOSE-DS1-FILE.

           PERFORM CLOSE-IT.

           IF ( DS1-CURSOR-STAT-GOOD )
              EXEC SQL
                   CLOSE DS1_CURSOR
              END-EXEC
              MOVE STAT---BAD TO DS1-CURSOR-STAT.

