      * COPYMEMBER: LIBLP/LPDSCL

      ******************************************************************
      *    LPDSCL    DEALER STATISTICS FILE CLEAR ROUTINE
      *
      *    REQUIRES DSSUB1, DSSUB2, DSSUB3 IN WORKING STORAGE.
      * REV:
      *  KEC 043096 ADDED DS-AFPDUEDL-MEMO.
      *  KEC 030697 REVISED FOR LOAN APPLICATIONS.
      *  KEC 051297 ADDED DS-NO-MADE.
      *  MJD 070297 ADDED DS-DLDISC-VOL(1-3)
      *  MJD 100997 CHANGED DEL TABLE FROM OCCURS 18 TO OCCURS 10
      *  MJD 051898 ADDED DS-UNITS-BNKRPT AND DS-OUTBAL-BNKRPT.
      *             REMOVED DS-PASTDUE
      *  JTG 062998 CHANGED DS-CNVT.... TO DS-RNEW....
      *                     DS-SVOS.... TO DS-TODL....
      *  JTG 063098 EXPANDED DS-APP-TYPE-TBL TO 3 LEVELS
      *  MJD 000322 REMOVED DS-CNEARN, DS-EARNTAKN, DS-EARNDUE,
      *             DS-CNUNEARN, AND DS-ERNOTTAK. ADDED DS-UNEARNED-AMT
      *             AND DS-UNEARNED-AMT2.
      *  MJD 000330 ADDED DS-PROCEEDS() (MERC PR#223).
      *             REMOVED PERFORMS OF PARAGRAPHS AND REPLACES WITH
      *             INLINE PERFORM VARYING LOGIC.
      *  GLB 001016 ADD DS-UNPAID-MANUAL TO CLEAR
      *  BLM 160428 FIX FOR EXPANSION & CONSOLIDATION OF UNEARNED TABLE
      *
      * KEC 2017.0103 {PR#00000} PARADATA <A30> [JAY CISZEWSKI]
      *          CHANGED DS-DATE TO DS-DATE-CCYYMM FOR CONSISTENCY
      *          WITH THE DATE FIELDS IN BY & UD FILE.
      *  CS 190423 COMMENT CLEAR OF DS APP STATS, APPS NOT USED
      *  CS 190424 CLEAR FUTURE FIELDS.
      * AMM 20210429 REMOVED FUTURE FIELDS, RESIZED FILE
      ******************************************************************
       CLEAR-DS-FILE SECTION.
           MOVE " " TO DS-REC.
           MOVE 0 TO DS-DATE-CCYYMM.
           MOVE 0 TO DS-DLPARVHELD DS-UNPAIDCK DS-DLDISC DS-DLPARVPAID
                     DS-SUMWGTTM DS-SUMWGTAV DS-SUMWGTTA
                     DS-AFPDUEDL-MEMO DS-DELUNEARN-DATE
                     DS-PROCEEDS(1) DS-PROCEEDS(2)
                     DS-UNPAID-MANUAL.

      * MTD-YTD-LYR BUCKETS:
           PERFORM VARYING DSSUB1 FROM 1 BY 1 UNTIL DSSUB1 > 3
              MOVE 0 TO DS-DLRVPRIN(DSSUB1)      DS-DLRVCHGS(DSSUB1)
                        DS-RCOURSE-UNITS(DSSUB1) DS-RCOURSE-AMT(DSSUB1)
                        DS-NPURUNIT(DSSUB1)      DS-NPURAMT(DSSUB1)
                        DS-OPURUNIT(DSSUB1)      DS-OPURAMT(DSSUB1)
                        DS-RNEWUNIT(DSSUB1)      DS-RNEWAMT(DSSUB1)
                        DS-PAIDUNIT(DSSUB1)      DS-PAIDAMT(DSSUB1)
                        DS-TODLUNIT(DSSUB1)      DS-TODLAMT(DSSUB1)
                        DS-OUTSUNIT(DSSUB1)      DS-OUTSAMT(DSSUB1)
                        DS-PLOSUNIT(DSSUB1)      DS-PLOSAMT(DSSUB1)
                        DS-RCPLUNIT(DSSUB1)      DS-RCPLAMT(DSSUB1)
                        DS-JDOSUNIT(DSSUB1)      DS-JDOSAMT(DSSUB1)
                        DS-DLDISC-VOL(DSSUB1)
           END-PERFORM.

      * DS UNEARNED BUCKETS:
           PERFORM VARYING DSSUB3 FROM 1 BY 1 UNTIL DSSUB3 > 10
                     AFTER DSSUB2 FROM 1 BY 1 UNTIL DSSUB2 > 2
                     AFTER DSSUB1 FROM 1 BY 1 UNTIL DSSUB1 > 3
              MOVE 0 TO DS-UNEARNED-AMT(DSSUB1 DSSUB2 DSSUB3)
           END-PERFORM.

      * DS-DEL-BUCKETS:
           PERFORM VARYING DSSUB3 FROM 1 BY 1 UNTIL DSSUB3 > 10
                     AFTER DSSUB2 FROM 1 BY 1 UNTIL DSSUB2 > 2
                     AFTER DSSUB1 FROM 1 BY 1 UNTIL DSSUB1 > 3
              MOVE 0 TO DS-UNITS(DSSUB1 DSSUB2 DSSUB3)
                        DS-OUTBAL(DSSUB1 DSSUB2 DSSUB3)
                        DS-UNITS-BNKRPT(DSSUB1 DSSUB2 DSSUB3)
                        DS-OUTBAL-BNKRPT(DSSUB1 DSSUB2 DSSUB3)
           END-PERFORM.

      * DS-REPO-ACTIVITY-TBL:
           PERFORM VARYING DSSUB3 FROM 1 BY 1 UNTIL DSSUB3 > 5
                     AFTER DSSUB2 FROM 1 BY 1 UNTIL DSSUB2 > 2
                     AFTER DSSUB1 FROM 1 BY 1 UNTIL DSSUB1 > 3
              MOVE 0 TO DS-NO-REPO(DSSUB1 DSSUB2 DSSUB3)
                        DS-AMT-REPO(DSSUB1 DSSUB2 DSSUB3)
           END-PERFORM.

      * DS-APP-PERIOD-TBL:
      *    PERFORM VARYING DSSUB3 FROM 1 BY 1 UNTIL DSSUB3 > 3
      *              AFTER DSSUB2 FROM 1 BY 1 UNTIL DSSUB2 > 2
      *              AFTER DSSUB1 FROM 1 BY 1 UNTIL DSSUB1 > 3
      *    MOVE 0 TO DS-NO-PENDING(DSSUB1 DSSUB2 DSSUB3)
      *              DS-NO-COND-APP(DSSUB1 DSSUB2 DSSUB3)
      *              DS-NO-APPROVED(DSSUB1 DSSUB2 DSSUB3)
      *              DS-NO-MADE(DSSUB1 DSSUB2 DSSUB3)
      *              DS-NO-TURNDOWN(DSSUB1 DSSUB2 DSSUB3)
      *              DS-NO-TURNUSDOWN(DSSUB1 DSSUB2 DSSUB3)
      *    END-PERFORM.

       EXIT-CLEAR-DS-FILE.
           EXIT.

