      * COPYMEMBER: LIBLP/LPDSGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - DSFILE
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD DS-REC FROM QDS-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-DS-FIELDS.
           MOVE QDS-DATE-CCYYMM TO DS-DATE-CCYYMM.
           MOVE QDS-BRANCH TO DS-BRANCH.
           MOVE QDS-NUM TO DS-NUM.
           MOVE QDS-CLASS TO DS-CLASS.
           MOVE QDS-DLRVPRIN-1 TO DS-DLRVPRIN(1).
           MOVE QDS-DLRVPRIN-2 TO DS-DLRVPRIN(2).
           MOVE QDS-DLRVPRIN-3 TO DS-DLRVPRIN(3).
           MOVE QDS-DLRVCHGS-1 TO DS-DLRVCHGS(1).
           MOVE QDS-DLRVCHGS-2 TO DS-DLRVCHGS(2).
           MOVE QDS-DLRVCHGS-3 TO DS-DLRVCHGS(3).
           MOVE QDS-DLPARVHELD TO DS-DLPARVHELD.
           MOVE QDS-UNPAIDCK TO DS-UNPAIDCK.
           MOVE QDS-DLDISC TO DS-DLDISC.
           MOVE QDS-DLPARVPAID TO DS-DLPARVPAID.
           MOVE QDS-SUMWGTTM TO DS-SUMWGTTM.
           MOVE QDS-SUMWGTAV TO DS-SUMWGTAV.
           MOVE QDS-SUMWGTTA TO DS-SUMWGTTA.
           MOVE QDS-RCOURSE-UNITS-1 TO DS-RCOURSE-UNITS(1).
           MOVE QDS-RCOURSE-UNITS-2 TO DS-RCOURSE-UNITS(2).
           MOVE QDS-RCOURSE-UNITS-3 TO DS-RCOURSE-UNITS(3).
           MOVE QDS-RCOURSE-AMT-1 TO DS-RCOURSE-AMT(1).
           MOVE QDS-RCOURSE-AMT-2 TO DS-RCOURSE-AMT(2).
           MOVE QDS-RCOURSE-AMT-3 TO DS-RCOURSE-AMT(3).
           MOVE QDS-NPURUNIT-1 TO DS-NPURUNIT(1).
           MOVE QDS-NPURUNIT-2 TO DS-NPURUNIT(2).
           MOVE QDS-NPURUNIT-3 TO DS-NPURUNIT(3).
           MOVE QDS-NPURAMT-1 TO DS-NPURAMT(1).
           MOVE QDS-NPURAMT-2 TO DS-NPURAMT(2).
           MOVE QDS-NPURAMT-3 TO DS-NPURAMT(3).
           MOVE QDS-OPURUNIT-1 TO DS-OPURUNIT(1).
           MOVE QDS-OPURUNIT-2 TO DS-OPURUNIT(2).
           MOVE QDS-OPURUNIT-3 TO DS-OPURUNIT(3).
           MOVE QDS-OPURAMT-1 TO DS-OPURAMT(1).
           MOVE QDS-OPURAMT-2 TO DS-OPURAMT(2).
           MOVE QDS-OPURAMT-3 TO DS-OPURAMT(3).
           MOVE QDS-RNEWUNIT-1 TO DS-RNEWUNIT(1).
           MOVE QDS-RNEWUNIT-2 TO DS-RNEWUNIT(2).
           MOVE QDS-RNEWUNIT-3 TO DS-RNEWUNIT(3).
           MOVE QDS-RNEWAMT-1 TO DS-RNEWAMT(1).
           MOVE QDS-RNEWAMT-2 TO DS-RNEWAMT(2).
           MOVE QDS-RNEWAMT-3 TO DS-RNEWAMT(3).
           MOVE QDS-PAIDUNIT-1 TO DS-PAIDUNIT(1).
           MOVE QDS-PAIDUNIT-2 TO DS-PAIDUNIT(2).
           MOVE QDS-PAIDUNIT-3 TO DS-PAIDUNIT(3).
           MOVE QDS-PAIDAMT-1 TO DS-PAIDAMT(1).
           MOVE QDS-PAIDAMT-2 TO DS-PAIDAMT(2).
           MOVE QDS-PAIDAMT-3 TO DS-PAIDAMT(3).
           MOVE QDS-TODLUNIT-1 TO DS-TODLUNIT(1).
           MOVE QDS-TODLUNIT-2 TO DS-TODLUNIT(2).
           MOVE QDS-TODLUNIT-3 TO DS-TODLUNIT(3).
           MOVE QDS-TODLAMT-1 TO DS-TODLAMT(1).
           MOVE QDS-TODLAMT-2 TO DS-TODLAMT(2).
           MOVE QDS-TODLAMT-3 TO DS-TODLAMT(3).
           MOVE QDS-OUTSUNIT-1 TO DS-OUTSUNIT(1).
           MOVE QDS-OUTSUNIT-2 TO DS-OUTSUNIT(2).
           MOVE QDS-OUTSUNIT-3 TO DS-OUTSUNIT(3).
           MOVE QDS-OUTSAMT-1 TO DS-OUTSAMT(1).
           MOVE QDS-OUTSAMT-2 TO DS-OUTSAMT(2).
           MOVE QDS-OUTSAMT-3 TO DS-OUTSAMT(3).
           MOVE QDS-PLOSUNIT-1 TO DS-PLOSUNIT(1).
           MOVE QDS-PLOSUNIT-2 TO DS-PLOSUNIT(2).
           MOVE QDS-PLOSUNIT-3 TO DS-PLOSUNIT(3).
           MOVE QDS-PLOSAMT-1 TO DS-PLOSAMT(1).
           MOVE QDS-PLOSAMT-2 TO DS-PLOSAMT(2).
           MOVE QDS-PLOSAMT-3 TO DS-PLOSAMT(3).
           MOVE QDS-RCPLUNIT-1 TO DS-RCPLUNIT(1).
           MOVE QDS-RCPLUNIT-2 TO DS-RCPLUNIT(2).
           MOVE QDS-RCPLUNIT-3 TO DS-RCPLUNIT(3).
           MOVE QDS-RCPLAMT-1 TO DS-RCPLAMT(1).
           MOVE QDS-RCPLAMT-2 TO DS-RCPLAMT(2).
           MOVE QDS-RCPLAMT-3 TO DS-RCPLAMT(3).
           MOVE QDS-JDOSUNIT-1 TO DS-JDOSUNIT(1).
           MOVE QDS-JDOSUNIT-2 TO DS-JDOSUNIT(2).
           MOVE QDS-JDOSUNIT-3 TO DS-JDOSUNIT(3).
           MOVE QDS-JDOSAMT-1 TO DS-JDOSAMT(1).
           MOVE QDS-JDOSAMT-2 TO DS-JDOSAMT(2).
           MOVE QDS-JDOSAMT-3 TO DS-JDOSAMT(3).

           IF ( QDS-DELUNEARN-DATE = "1900-01-01" )
              MOVE ZEROES TO DS-DELUNEARN-DATE
           ELSE
              MOVE QDS-DELUNEARN-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO DS-DELUNEARN-DATE.

           MOVE QDS-PROCEEDS-1 TO DS-PROCEEDS(1).
           MOVE QDS-PROCEEDS-2 TO DS-PROCEEDS(2).
           MOVE QDS-NO-REPO-1-1-1 TO DS-NO-REPO(1 1 1).
           MOVE QDS-AMT-REPO-1-1-1 TO DS-AMT-REPO(1 1 1).
           MOVE QDS-NO-REPO-1-1-2 TO DS-NO-REPO(1 1 2).
           MOVE QDS-AMT-REPO-1-1-2 TO DS-AMT-REPO(1 1 2).
           MOVE QDS-NO-REPO-1-1-3 TO DS-NO-REPO(1 1 3).
           MOVE QDS-AMT-REPO-1-1-3 TO DS-AMT-REPO(1 1 3).
           MOVE QDS-NO-REPO-1-1-4 TO DS-NO-REPO(1 1 4).
           MOVE QDS-AMT-REPO-1-1-4 TO DS-AMT-REPO(1 1 4).
           MOVE QDS-NO-REPO-1-1-5 TO DS-NO-REPO(1 1 5).
           MOVE QDS-AMT-REPO-1-1-5 TO DS-AMT-REPO(1 1 5).
           MOVE QDS-NO-REPO-1-2-1 TO DS-NO-REPO(1 2 1).
           MOVE QDS-AMT-REPO-1-2-1 TO DS-AMT-REPO(1 2 1).
           MOVE QDS-NO-REPO-1-2-2 TO DS-NO-REPO(1 2 2).
           MOVE QDS-AMT-REPO-1-2-2 TO DS-AMT-REPO(1 2 2).
           MOVE QDS-NO-REPO-1-2-3 TO DS-NO-REPO(1 2 3).
           MOVE QDS-AMT-REPO-1-2-3 TO DS-AMT-REPO(1 2 3).
           MOVE QDS-NO-REPO-1-2-4 TO DS-NO-REPO(1 2 4).
           MOVE QDS-AMT-REPO-1-2-4 TO DS-AMT-REPO(1 2 4).
           MOVE QDS-NO-REPO-1-2-5 TO DS-NO-REPO(1 2 5).
           MOVE QDS-AMT-REPO-1-2-5 TO DS-AMT-REPO(1 2 5).
           MOVE QDS-NO-REPO-2-1-1 TO DS-NO-REPO(2 1 1).
           MOVE QDS-AMT-REPO-2-1-1 TO DS-AMT-REPO(2 1 1).
           MOVE QDS-NO-REPO-2-1-2 TO DS-NO-REPO(2 1 2).
           MOVE QDS-AMT-REPO-2-1-2 TO DS-AMT-REPO(2 1 2).
           MOVE QDS-NO-REPO-2-1-3 TO DS-NO-REPO(2 1 3).
           MOVE QDS-AMT-REPO-2-1-3 TO DS-AMT-REPO(2 1 3).
           MOVE QDS-NO-REPO-2-1-4 TO DS-NO-REPO(2 1 4).
           MOVE QDS-AMT-REPO-2-1-4 TO DS-AMT-REPO(2 1 4).
           MOVE QDS-NO-REPO-2-1-5 TO DS-NO-REPO(2 1 5).
           MOVE QDS-AMT-REPO-2-1-5 TO DS-AMT-REPO(2 1 5).
           MOVE QDS-NO-REPO-2-2-1 TO DS-NO-REPO(2 2 1).
           MOVE QDS-AMT-REPO-2-2-1 TO DS-AMT-REPO(2 2 1).
           MOVE QDS-NO-REPO-2-2-2 TO DS-NO-REPO(2 2 2).
           MOVE QDS-AMT-REPO-2-2-2 TO DS-AMT-REPO(2 2 2).
           MOVE QDS-NO-REPO-2-2-3 TO DS-NO-REPO(2 2 3).
           MOVE QDS-AMT-REPO-2-2-3 TO DS-AMT-REPO(2 2 3).
           MOVE QDS-NO-REPO-2-2-4 TO DS-NO-REPO(2 2 4).
           MOVE QDS-AMT-REPO-2-2-4 TO DS-AMT-REPO(2 2 4).
           MOVE QDS-NO-REPO-2-2-5 TO DS-NO-REPO(2 2 5).
           MOVE QDS-AMT-REPO-2-2-5 TO DS-AMT-REPO(2 2 5).
           MOVE QDS-NO-REPO-3-1-1 TO DS-NO-REPO(3 1 1).
           MOVE QDS-AMT-REPO-3-1-1 TO DS-AMT-REPO(3 1 1).
           MOVE QDS-NO-REPO-3-1-2 TO DS-NO-REPO(3 1 2).
           MOVE QDS-AMT-REPO-3-1-2 TO DS-AMT-REPO(3 1 2).
           MOVE QDS-NO-REPO-3-1-3 TO DS-NO-REPO(3 1 3).
           MOVE QDS-AMT-REPO-3-1-3 TO DS-AMT-REPO(3 1 3).
           MOVE QDS-NO-REPO-3-1-4 TO DS-NO-REPO(3 1 4).
           MOVE QDS-AMT-REPO-3-1-4 TO DS-AMT-REPO(3 1 4).
           MOVE QDS-NO-REPO-3-1-5 TO DS-NO-REPO(3 1 5).
           MOVE QDS-AMT-REPO-3-1-5 TO DS-AMT-REPO(3 1 5).
           MOVE QDS-NO-REPO-3-2-1 TO DS-NO-REPO(3 2 1).
           MOVE QDS-AMT-REPO-3-2-1 TO DS-AMT-REPO(3 2 1).
           MOVE QDS-NO-REPO-3-2-2 TO DS-NO-REPO(3 2 2).
           MOVE QDS-AMT-REPO-3-2-2 TO DS-AMT-REPO(3 2 2).
           MOVE QDS-NO-REPO-3-2-3 TO DS-NO-REPO(3 2 3).
           MOVE QDS-AMT-REPO-3-2-3 TO DS-AMT-REPO(3 2 3).
           MOVE QDS-NO-REPO-3-2-4 TO DS-NO-REPO(3 2 4).
           MOVE QDS-AMT-REPO-3-2-4 TO DS-AMT-REPO(3 2 4).
           MOVE QDS-NO-REPO-3-2-5 TO DS-NO-REPO(3 2 5).
           MOVE QDS-AMT-REPO-3-2-5 TO DS-AMT-REPO(3 2 5).
           MOVE QDS-UNITS-1-1-1 TO DS-UNITS(1 1 1).
           MOVE QDS-OUTBAL-1-1-1 TO DS-OUTBAL(1 1 1).
           MOVE QDS-UNITS-1-1-2 TO DS-UNITS(1 1 2).
           MOVE QDS-OUTBAL-1-1-2 TO DS-OUTBAL(1 1 2).
           MOVE QDS-UNITS-1-1-3 TO DS-UNITS(1 1 3).
           MOVE QDS-OUTBAL-1-1-3 TO DS-OUTBAL(1 1 3).
           MOVE QDS-UNITS-1-1-4 TO DS-UNITS(1 1 4).
           MOVE QDS-OUTBAL-1-1-4 TO DS-OUTBAL(1 1 4).
           MOVE QDS-UNITS-1-1-5 TO DS-UNITS(1 1 5).
           MOVE QDS-OUTBAL-1-1-5 TO DS-OUTBAL(1 1 5).
           MOVE QDS-UNITS-1-1-6 TO DS-UNITS(1 1 6).
           MOVE QDS-OUTBAL-1-1-6 TO DS-OUTBAL(1 1 6).
           MOVE QDS-UNITS-1-1-7 TO DS-UNITS(1 1 7).
           MOVE QDS-OUTBAL-1-1-7 TO DS-OUTBAL(1 1 7).
           MOVE QDS-UNITS-1-1-8 TO DS-UNITS(1 1 8).
           MOVE QDS-OUTBAL-1-1-8 TO DS-OUTBAL(1 1 8).
           MOVE QDS-UNITS-1-1-9 TO DS-UNITS(1 1 9).
           MOVE QDS-OUTBAL-1-1-9 TO DS-OUTBAL(1 1 9).
           MOVE QDS-UNITS-1-1-10 TO DS-UNITS(1 1 10).
           MOVE QDS-OUTBAL-1-1-10 TO DS-OUTBAL(1 1 10).
           MOVE QDS-UNITS-1-2-1 TO DS-UNITS(1 2 1).
           MOVE QDS-OUTBAL-1-2-1 TO DS-OUTBAL(1 2 1).
           MOVE QDS-UNITS-1-2-2 TO DS-UNITS(1 2 2).
           MOVE QDS-OUTBAL-1-2-2 TO DS-OUTBAL(1 2 2).
           MOVE QDS-UNITS-1-2-3 TO DS-UNITS(1 2 3).
           MOVE QDS-OUTBAL-1-2-3 TO DS-OUTBAL(1 2 3).
           MOVE QDS-UNITS-1-2-4 TO DS-UNITS(1 2 4).
           MOVE QDS-OUTBAL-1-2-4 TO DS-OUTBAL(1 2 4).
           MOVE QDS-UNITS-1-2-5 TO DS-UNITS(1 2 5).
           MOVE QDS-OUTBAL-1-2-5 TO DS-OUTBAL(1 2 5).
           MOVE QDS-UNITS-1-2-6 TO DS-UNITS(1 2 6).
           MOVE QDS-OUTBAL-1-2-6 TO DS-OUTBAL(1 2 6).
           MOVE QDS-UNITS-1-2-7 TO DS-UNITS(1 2 7).
           MOVE QDS-OUTBAL-1-2-7 TO DS-OUTBAL(1 2 7).
           MOVE QDS-UNITS-1-2-8 TO DS-UNITS(1 2 8).
           MOVE QDS-OUTBAL-1-2-8 TO DS-OUTBAL(1 2 8).
           MOVE QDS-UNITS-1-2-9 TO DS-UNITS(1 2 9).
           MOVE QDS-OUTBAL-1-2-9 TO DS-OUTBAL(1 2 9).
           MOVE QDS-UNITS-1-2-10 TO DS-UNITS(1 2 10).
           MOVE QDS-OUTBAL-1-2-10 TO DS-OUTBAL(1 2 10).
           MOVE QDS-UNITS-2-1-1 TO DS-UNITS(2 1 1).
           MOVE QDS-OUTBAL-2-1-1 TO DS-OUTBAL(2 1 1).
           MOVE QDS-UNITS-2-1-2 TO DS-UNITS(2 1 2).
           MOVE QDS-OUTBAL-2-1-2 TO DS-OUTBAL(2 1 2).
           MOVE QDS-UNITS-2-1-3 TO DS-UNITS(2 1 3).
           MOVE QDS-OUTBAL-2-1-3 TO DS-OUTBAL(2 1 3).
           MOVE QDS-UNITS-2-1-4 TO DS-UNITS(2 1 4).
           MOVE QDS-OUTBAL-2-1-4 TO DS-OUTBAL(2 1 4).
           MOVE QDS-UNITS-2-1-5 TO DS-UNITS(2 1 5).
           MOVE QDS-OUTBAL-2-1-5 TO DS-OUTBAL(2 1 5).
           MOVE QDS-UNITS-2-1-6 TO DS-UNITS(2 1 6).
           MOVE QDS-OUTBAL-2-1-6 TO DS-OUTBAL(2 1 6).
           MOVE QDS-UNITS-2-1-7 TO DS-UNITS(2 1 7).
           MOVE QDS-OUTBAL-2-1-7 TO DS-OUTBAL(2 1 7).
           MOVE QDS-UNITS-2-1-8 TO DS-UNITS(2 1 8).
           MOVE QDS-OUTBAL-2-1-8 TO DS-OUTBAL(2 1 8).
           MOVE QDS-UNITS-2-1-9 TO DS-UNITS(2 1 9).
           MOVE QDS-OUTBAL-2-1-9 TO DS-OUTBAL(2 1 9).
           MOVE QDS-UNITS-2-1-10 TO DS-UNITS(2 1 10).
           MOVE QDS-OUTBAL-2-1-10 TO DS-OUTBAL(2 1 10).
           MOVE QDS-UNITS-2-2-1 TO DS-UNITS(2 2 1).
           MOVE QDS-OUTBAL-2-2-1 TO DS-OUTBAL(2 2 1).
           MOVE QDS-UNITS-2-2-2 TO DS-UNITS(2 2 2).
           MOVE QDS-OUTBAL-2-2-2 TO DS-OUTBAL(2 2 2).
           MOVE QDS-UNITS-2-2-3 TO DS-UNITS(2 2 3).
           MOVE QDS-OUTBAL-2-2-3 TO DS-OUTBAL(2 2 3).
           MOVE QDS-UNITS-2-2-4 TO DS-UNITS(2 2 4).
           MOVE QDS-OUTBAL-2-2-4 TO DS-OUTBAL(2 2 4).
           MOVE QDS-UNITS-2-2-5 TO DS-UNITS(2 2 5).
           MOVE QDS-OUTBAL-2-2-5 TO DS-OUTBAL(2 2 5).
           MOVE QDS-UNITS-2-2-6 TO DS-UNITS(2 2 6).
           MOVE QDS-OUTBAL-2-2-6 TO DS-OUTBAL(2 2 6).
           MOVE QDS-UNITS-2-2-7 TO DS-UNITS(2 2 7).
           MOVE QDS-OUTBAL-2-2-7 TO DS-OUTBAL(2 2 7).
           MOVE QDS-UNITS-2-2-8 TO DS-UNITS(2 2 8).
           MOVE QDS-OUTBAL-2-2-8 TO DS-OUTBAL(2 2 8).
           MOVE QDS-UNITS-2-2-9 TO DS-UNITS(2 2 9).
           MOVE QDS-OUTBAL-2-2-9 TO DS-OUTBAL(2 2 9).
           MOVE QDS-UNITS-2-2-10 TO DS-UNITS(2 2 10).
           MOVE QDS-OUTBAL-2-2-10 TO DS-OUTBAL(2 2 10).
           MOVE QDS-UNITS-3-1-1 TO DS-UNITS(3 1 1).
           MOVE QDS-OUTBAL-3-1-1 TO DS-OUTBAL(3 1 1).
           MOVE QDS-UNITS-3-1-2 TO DS-UNITS(3 1 2).
           MOVE QDS-OUTBAL-3-1-2 TO DS-OUTBAL(3 1 2).
           MOVE QDS-UNITS-3-1-3 TO DS-UNITS(3 1 3).
           MOVE QDS-OUTBAL-3-1-3 TO DS-OUTBAL(3 1 3).
           MOVE QDS-UNITS-3-1-4 TO DS-UNITS(3 1 4).
           MOVE QDS-OUTBAL-3-1-4 TO DS-OUTBAL(3 1 4).
           MOVE QDS-UNITS-3-1-5 TO DS-UNITS(3 1 5).
           MOVE QDS-OUTBAL-3-1-5 TO DS-OUTBAL(3 1 5).
           MOVE QDS-UNITS-3-1-6 TO DS-UNITS(3 1 6).
           MOVE QDS-OUTBAL-3-1-6 TO DS-OUTBAL(3 1 6).
           MOVE QDS-UNITS-3-1-7 TO DS-UNITS(3 1 7).
           MOVE QDS-OUTBAL-3-1-7 TO DS-OUTBAL(3 1 7).
           MOVE QDS-UNITS-3-1-8 TO DS-UNITS(3 1 8).
           MOVE QDS-OUTBAL-3-1-8 TO DS-OUTBAL(3 1 8).
           MOVE QDS-UNITS-3-1-9 TO DS-UNITS(3 1 9).
           MOVE QDS-OUTBAL-3-1-9 TO DS-OUTBAL(3 1 9).
           MOVE QDS-UNITS-3-1-10 TO DS-UNITS(3 1 10).
           MOVE QDS-OUTBAL-3-1-10 TO DS-OUTBAL(3 1 10).
           MOVE QDS-UNITS-3-2-1 TO DS-UNITS(3 2 1).
           MOVE QDS-OUTBAL-3-2-1 TO DS-OUTBAL(3 2 1).
           MOVE QDS-UNITS-3-2-2 TO DS-UNITS(3 2 2).
           MOVE QDS-OUTBAL-3-2-2 TO DS-OUTBAL(3 2 2).
           MOVE QDS-UNITS-3-2-3 TO DS-UNITS(3 2 3).
           MOVE QDS-OUTBAL-3-2-3 TO DS-OUTBAL(3 2 3).
           MOVE QDS-UNITS-3-2-4 TO DS-UNITS(3 2 4).
           MOVE QDS-OUTBAL-3-2-4 TO DS-OUTBAL(3 2 4).
           MOVE QDS-UNITS-3-2-5 TO DS-UNITS(3 2 5).
           MOVE QDS-OUTBAL-3-2-5 TO DS-OUTBAL(3 2 5).
           MOVE QDS-UNITS-3-2-6 TO DS-UNITS(3 2 6).
           MOVE QDS-OUTBAL-3-2-6 TO DS-OUTBAL(3 2 6).
           MOVE QDS-UNITS-3-2-7 TO DS-UNITS(3 2 7).
           MOVE QDS-OUTBAL-3-2-7 TO DS-OUTBAL(3 2 7).
           MOVE QDS-UNITS-3-2-8 TO DS-UNITS(3 2 8).
           MOVE QDS-OUTBAL-3-2-8 TO DS-OUTBAL(3 2 8).
           MOVE QDS-UNITS-3-2-9 TO DS-UNITS(3 2 9).
           MOVE QDS-OUTBAL-3-2-9 TO DS-OUTBAL(3 2 9).
           MOVE QDS-UNITS-3-2-10 TO DS-UNITS(3 2 10).
           MOVE QDS-OUTBAL-3-2-10 TO DS-OUTBAL(3 2 10).
           MOVE QDS-UNITS-BNKRPT-1-1-1 TO DS-UNITS-BNKRPT(1 1 1).
           MOVE QDS-OUTBAL-BNKRPT-1-1-1 TO DS-OUTBAL-BNKRPT(1 1 1).
           MOVE QDS-UNITS-BNKRPT-1-1-2 TO DS-UNITS-BNKRPT(1 1 2).
           MOVE QDS-OUTBAL-BNKRPT-1-1-2 TO DS-OUTBAL-BNKRPT(1 1 2).
           MOVE QDS-UNITS-BNKRPT-1-1-3 TO DS-UNITS-BNKRPT(1 1 3).
           MOVE QDS-OUTBAL-BNKRPT-1-1-3 TO DS-OUTBAL-BNKRPT(1 1 3).
           MOVE QDS-UNITS-BNKRPT-1-1-4 TO DS-UNITS-BNKRPT(1 1 4).
           MOVE QDS-OUTBAL-BNKRPT-1-1-4 TO DS-OUTBAL-BNKRPT(1 1 4).
           MOVE QDS-UNITS-BNKRPT-1-1-5 TO DS-UNITS-BNKRPT(1 1 5).
           MOVE QDS-OUTBAL-BNKRPT-1-1-5 TO DS-OUTBAL-BNKRPT(1 1 5).
           MOVE QDS-UNITS-BNKRPT-1-1-6 TO DS-UNITS-BNKRPT(1 1 6).
           MOVE QDS-OUTBAL-BNKRPT-1-1-6 TO DS-OUTBAL-BNKRPT(1 1 6).
           MOVE QDS-UNITS-BNKRPT-1-1-7 TO DS-UNITS-BNKRPT(1 1 7).
           MOVE QDS-OUTBAL-BNKRPT-1-1-7 TO DS-OUTBAL-BNKRPT(1 1 7).
           MOVE QDS-UNITS-BNKRPT-1-1-8 TO DS-UNITS-BNKRPT(1 1 8).
           MOVE QDS-OUTBAL-BNKRPT-1-1-8 TO DS-OUTBAL-BNKRPT(1 1 8).
           MOVE QDS-UNITS-BNKRPT-1-1-9 TO DS-UNITS-BNKRPT(1 1 9).
           MOVE QDS-OUTBAL-BNKRPT-1-1-9 TO DS-OUTBAL-BNKRPT(1 1 9).
           MOVE QDS-UNITS-BNKRPT-1-1-10 TO DS-UNITS-BNKRPT(1 1 10).
           MOVE QDS-OUTBAL-BNKRPT-1-1-10 TO DS-OUTBAL-BNKRPT(1 1 10).
           MOVE QDS-UNITS-BNKRPT-1-2-1 TO DS-UNITS-BNKRPT(1 2 1).
           MOVE QDS-OUTBAL-BNKRPT-1-2-1 TO DS-OUTBAL-BNKRPT(1 2 1).
           MOVE QDS-UNITS-BNKRPT-1-2-2 TO DS-UNITS-BNKRPT(1 2 2).
           MOVE QDS-OUTBAL-BNKRPT-1-2-2 TO DS-OUTBAL-BNKRPT(1 2 2).
           MOVE QDS-UNITS-BNKRPT-1-2-3 TO DS-UNITS-BNKRPT(1 2 3).
           MOVE QDS-OUTBAL-BNKRPT-1-2-3 TO DS-OUTBAL-BNKRPT(1 2 3).
           MOVE QDS-UNITS-BNKRPT-1-2-4 TO DS-UNITS-BNKRPT(1 2 4).
           MOVE QDS-OUTBAL-BNKRPT-1-2-4 TO DS-OUTBAL-BNKRPT(1 2 4).
           MOVE QDS-UNITS-BNKRPT-1-2-5 TO DS-UNITS-BNKRPT(1 2 5).
           MOVE QDS-OUTBAL-BNKRPT-1-2-5 TO DS-OUTBAL-BNKRPT(1 2 5).
           MOVE QDS-UNITS-BNKRPT-1-2-6 TO DS-UNITS-BNKRPT(1 2 6).
           MOVE QDS-OUTBAL-BNKRPT-1-2-6 TO DS-OUTBAL-BNKRPT(1 2 6).
           MOVE QDS-UNITS-BNKRPT-1-2-7 TO DS-UNITS-BNKRPT(1 2 7).
           MOVE QDS-OUTBAL-BNKRPT-1-2-7 TO DS-OUTBAL-BNKRPT(1 2 7).
           MOVE QDS-UNITS-BNKRPT-1-2-8 TO DS-UNITS-BNKRPT(1 2 8).
           MOVE QDS-OUTBAL-BNKRPT-1-2-8 TO DS-OUTBAL-BNKRPT(1 2 8).
           MOVE QDS-UNITS-BNKRPT-1-2-9 TO DS-UNITS-BNKRPT(1 2 9).
           MOVE QDS-OUTBAL-BNKRPT-1-2-9 TO DS-OUTBAL-BNKRPT(1 2 9).
           MOVE QDS-UNITS-BNKRPT-1-2-10 TO DS-UNITS-BNKRPT(1 2 10).
           MOVE QDS-OUTBAL-BNKRPT-1-2-10 TO DS-OUTBAL-BNKRPT(1 2 10).
           MOVE QDS-UNITS-BNKRPT-2-1-1 TO DS-UNITS-BNKRPT(2 1 1).
           MOVE QDS-OUTBAL-BNKRPT-2-1-1 TO DS-OUTBAL-BNKRPT(2 1 1).
           MOVE QDS-UNITS-BNKRPT-2-1-2 TO DS-UNITS-BNKRPT(2 1 2).
           MOVE QDS-OUTBAL-BNKRPT-2-1-2 TO DS-OUTBAL-BNKRPT(2 1 2).
           MOVE QDS-UNITS-BNKRPT-2-1-3 TO DS-UNITS-BNKRPT(2 1 3).
           MOVE QDS-OUTBAL-BNKRPT-2-1-3 TO DS-OUTBAL-BNKRPT(2 1 3).
           MOVE QDS-UNITS-BNKRPT-2-1-4 TO DS-UNITS-BNKRPT(2 1 4).
           MOVE QDS-OUTBAL-BNKRPT-2-1-4 TO DS-OUTBAL-BNKRPT(2 1 4).
           MOVE QDS-UNITS-BNKRPT-2-1-5 TO DS-UNITS-BNKRPT(2 1 5).
           MOVE QDS-OUTBAL-BNKRPT-2-1-5 TO DS-OUTBAL-BNKRPT(2 1 5).
           MOVE QDS-UNITS-BNKRPT-2-1-6 TO DS-UNITS-BNKRPT(2 1 6).
           MOVE QDS-OUTBAL-BNKRPT-2-1-6 TO DS-OUTBAL-BNKRPT(2 1 6).
           MOVE QDS-UNITS-BNKRPT-2-1-7 TO DS-UNITS-BNKRPT(2 1 7).
           MOVE QDS-OUTBAL-BNKRPT-2-1-7 TO DS-OUTBAL-BNKRPT(2 1 7).
           MOVE QDS-UNITS-BNKRPT-2-1-8 TO DS-UNITS-BNKRPT(2 1 8).
           MOVE QDS-OUTBAL-BNKRPT-2-1-8 TO DS-OUTBAL-BNKRPT(2 1 8).
           MOVE QDS-UNITS-BNKRPT-2-1-9 TO DS-UNITS-BNKRPT(2 1 9).
           MOVE QDS-OUTBAL-BNKRPT-2-1-9 TO DS-OUTBAL-BNKRPT(2 1 9).
           MOVE QDS-UNITS-BNKRPT-2-1-10 TO DS-UNITS-BNKRPT(2 1 10).
           MOVE QDS-OUTBAL-BNKRPT-2-1-10 TO DS-OUTBAL-BNKRPT(2 1 10).
           MOVE QDS-UNITS-BNKRPT-2-2-1 TO DS-UNITS-BNKRPT(2 2 1).
           MOVE QDS-OUTBAL-BNKRPT-2-2-1 TO DS-OUTBAL-BNKRPT(2 2 1).
           MOVE QDS-UNITS-BNKRPT-2-2-2 TO DS-UNITS-BNKRPT(2 2 2).
           MOVE QDS-OUTBAL-BNKRPT-2-2-2 TO DS-OUTBAL-BNKRPT(2 2 2).
           MOVE QDS-UNITS-BNKRPT-2-2-3 TO DS-UNITS-BNKRPT(2 2 3).
           MOVE QDS-OUTBAL-BNKRPT-2-2-3 TO DS-OUTBAL-BNKRPT(2 2 3).
           MOVE QDS-UNITS-BNKRPT-2-2-4 TO DS-UNITS-BNKRPT(2 2 4).
           MOVE QDS-OUTBAL-BNKRPT-2-2-4 TO DS-OUTBAL-BNKRPT(2 2 4).
           MOVE QDS-UNITS-BNKRPT-2-2-5 TO DS-UNITS-BNKRPT(2 2 5).
           MOVE QDS-OUTBAL-BNKRPT-2-2-5 TO DS-OUTBAL-BNKRPT(2 2 5).
           MOVE QDS-UNITS-BNKRPT-2-2-6 TO DS-UNITS-BNKRPT(2 2 6).
           MOVE QDS-OUTBAL-BNKRPT-2-2-6 TO DS-OUTBAL-BNKRPT(2 2 6).
           MOVE QDS-UNITS-BNKRPT-2-2-7 TO DS-UNITS-BNKRPT(2 2 7).
           MOVE QDS-OUTBAL-BNKRPT-2-2-7 TO DS-OUTBAL-BNKRPT(2 2 7).
           MOVE QDS-UNITS-BNKRPT-2-2-8 TO DS-UNITS-BNKRPT(2 2 8).
           MOVE QDS-OUTBAL-BNKRPT-2-2-8 TO DS-OUTBAL-BNKRPT(2 2 8).
           MOVE QDS-UNITS-BNKRPT-2-2-9 TO DS-UNITS-BNKRPT(2 2 9).
           MOVE QDS-OUTBAL-BNKRPT-2-2-9 TO DS-OUTBAL-BNKRPT(2 2 9).
           MOVE QDS-UNITS-BNKRPT-2-2-10 TO DS-UNITS-BNKRPT(2 2 10).
           MOVE QDS-OUTBAL-BNKRPT-2-2-10 TO DS-OUTBAL-BNKRPT(2 2 10).
           MOVE QDS-UNITS-BNKRPT-3-1-1 TO DS-UNITS-BNKRPT(3 1 1).
           MOVE QDS-OUTBAL-BNKRPT-3-1-1 TO DS-OUTBAL-BNKRPT(3 1 1).
           MOVE QDS-UNITS-BNKRPT-3-1-2 TO DS-UNITS-BNKRPT(3 1 2).
           MOVE QDS-OUTBAL-BNKRPT-3-1-2 TO DS-OUTBAL-BNKRPT(3 1 2).
           MOVE QDS-UNITS-BNKRPT-3-1-3 TO DS-UNITS-BNKRPT(3 1 3).
           MOVE QDS-OUTBAL-BNKRPT-3-1-3 TO DS-OUTBAL-BNKRPT(3 1 3).
           MOVE QDS-UNITS-BNKRPT-3-1-4 TO DS-UNITS-BNKRPT(3 1 4).
           MOVE QDS-OUTBAL-BNKRPT-3-1-4 TO DS-OUTBAL-BNKRPT(3 1 4).
           MOVE QDS-UNITS-BNKRPT-3-1-5 TO DS-UNITS-BNKRPT(3 1 5).
           MOVE QDS-OUTBAL-BNKRPT-3-1-5 TO DS-OUTBAL-BNKRPT(3 1 5).
           MOVE QDS-UNITS-BNKRPT-3-1-6 TO DS-UNITS-BNKRPT(3 1 6).
           MOVE QDS-OUTBAL-BNKRPT-3-1-6 TO DS-OUTBAL-BNKRPT(3 1 6).
           MOVE QDS-UNITS-BNKRPT-3-1-7 TO DS-UNITS-BNKRPT(3 1 7).
           MOVE QDS-OUTBAL-BNKRPT-3-1-7 TO DS-OUTBAL-BNKRPT(3 1 7).
           MOVE QDS-UNITS-BNKRPT-3-1-8 TO DS-UNITS-BNKRPT(3 1 8).
           MOVE QDS-OUTBAL-BNKRPT-3-1-8 TO DS-OUTBAL-BNKRPT(3 1 8).
           MOVE QDS-UNITS-BNKRPT-3-1-9 TO DS-UNITS-BNKRPT(3 1 9).
           MOVE QDS-OUTBAL-BNKRPT-3-1-9 TO DS-OUTBAL-BNKRPT(3 1 9).
           MOVE QDS-UNITS-BNKRPT-3-1-10 TO DS-UNITS-BNKRPT(3 1 10).
           MOVE QDS-OUTBAL-BNKRPT-3-1-10 TO DS-OUTBAL-BNKRPT(3 1 10).
           MOVE QDS-UNITS-BNKRPT-3-2-1 TO DS-UNITS-BNKRPT(3 2 1).
           MOVE QDS-OUTBAL-BNKRPT-3-2-1 TO DS-OUTBAL-BNKRPT(3 2 1).
           MOVE QDS-UNITS-BNKRPT-3-2-2 TO DS-UNITS-BNKRPT(3 2 2).
           MOVE QDS-OUTBAL-BNKRPT-3-2-2 TO DS-OUTBAL-BNKRPT(3 2 2).
           MOVE QDS-UNITS-BNKRPT-3-2-3 TO DS-UNITS-BNKRPT(3 2 3).
           MOVE QDS-OUTBAL-BNKRPT-3-2-3 TO DS-OUTBAL-BNKRPT(3 2 3).
           MOVE QDS-UNITS-BNKRPT-3-2-4 TO DS-UNITS-BNKRPT(3 2 4).
           MOVE QDS-OUTBAL-BNKRPT-3-2-4 TO DS-OUTBAL-BNKRPT(3 2 4).
           MOVE QDS-UNITS-BNKRPT-3-2-5 TO DS-UNITS-BNKRPT(3 2 5).
           MOVE QDS-OUTBAL-BNKRPT-3-2-5 TO DS-OUTBAL-BNKRPT(3 2 5).
           MOVE QDS-UNITS-BNKRPT-3-2-6 TO DS-UNITS-BNKRPT(3 2 6).
           MOVE QDS-OUTBAL-BNKRPT-3-2-6 TO DS-OUTBAL-BNKRPT(3 2 6).
           MOVE QDS-UNITS-BNKRPT-3-2-7 TO DS-UNITS-BNKRPT(3 2 7).
           MOVE QDS-OUTBAL-BNKRPT-3-2-7 TO DS-OUTBAL-BNKRPT(3 2 7).
           MOVE QDS-UNITS-BNKRPT-3-2-8 TO DS-UNITS-BNKRPT(3 2 8).
           MOVE QDS-OUTBAL-BNKRPT-3-2-8 TO DS-OUTBAL-BNKRPT(3 2 8).
           MOVE QDS-UNITS-BNKRPT-3-2-9 TO DS-UNITS-BNKRPT(3 2 9).
           MOVE QDS-OUTBAL-BNKRPT-3-2-9 TO DS-OUTBAL-BNKRPT(3 2 9).
           MOVE QDS-UNITS-BNKRPT-3-2-10 TO DS-UNITS-BNKRPT(3 2 10).
           MOVE QDS-OUTBAL-BNKRPT-3-2-10 TO DS-OUTBAL-BNKRPT(3 2 10).
           MOVE QDS-UNEARNED-AMT-1-1-1 TO DS-UNEARNED-AMT(1 1 1).
           MOVE QDS-UNEARNED-AMT-1-1-2 TO DS-UNEARNED-AMT(1 1 2).
           MOVE QDS-UNEARNED-AMT-1-1-3 TO DS-UNEARNED-AMT(1 1 3).
           MOVE QDS-UNEARNED-AMT-1-1-4 TO DS-UNEARNED-AMT(1 1 4).
           MOVE QDS-UNEARNED-AMT-1-1-5 TO DS-UNEARNED-AMT(1 1 5).
           MOVE QDS-UNEARNED-AMT-1-1-6 TO DS-UNEARNED-AMT(1 1 6).
           MOVE QDS-UNEARNED-AMT-1-1-7 TO DS-UNEARNED-AMT(1 1 7).
           MOVE QDS-UNEARNED-AMT-1-1-8 TO DS-UNEARNED-AMT(1 1 8).
           MOVE QDS-UNEARNED-AMT-1-1-9 TO DS-UNEARNED-AMT(1 1 9).
           MOVE QDS-UNEARNED-AMT-1-1-10 TO DS-UNEARNED-AMT(1 1 10).
           MOVE QDS-UNEARNED-AMT-1-2-1 TO DS-UNEARNED-AMT(1 2 1).
           MOVE QDS-UNEARNED-AMT-1-2-2 TO DS-UNEARNED-AMT(1 2 2).
           MOVE QDS-UNEARNED-AMT-1-2-3 TO DS-UNEARNED-AMT(1 2 3).
           MOVE QDS-UNEARNED-AMT-1-2-4 TO DS-UNEARNED-AMT(1 2 4).
           MOVE QDS-UNEARNED-AMT-1-2-5 TO DS-UNEARNED-AMT(1 2 5).
           MOVE QDS-UNEARNED-AMT-1-2-6 TO DS-UNEARNED-AMT(1 2 6).
           MOVE QDS-UNEARNED-AMT-1-2-7 TO DS-UNEARNED-AMT(1 2 7).
           MOVE QDS-UNEARNED-AMT-1-2-8 TO DS-UNEARNED-AMT(1 2 8).
           MOVE QDS-UNEARNED-AMT-1-2-9 TO DS-UNEARNED-AMT(1 2 9).
           MOVE QDS-UNEARNED-AMT-1-2-10 TO DS-UNEARNED-AMT(1 2 10).
           MOVE QDS-UNEARNED-AMT-2-1-1 TO DS-UNEARNED-AMT(2 1 1).
           MOVE QDS-UNEARNED-AMT-2-1-2 TO DS-UNEARNED-AMT(2 1 2).
           MOVE QDS-UNEARNED-AMT-2-1-3 TO DS-UNEARNED-AMT(2 1 3).
           MOVE QDS-UNEARNED-AMT-2-1-4 TO DS-UNEARNED-AMT(2 1 4).
           MOVE QDS-UNEARNED-AMT-2-1-5 TO DS-UNEARNED-AMT(2 1 5).
           MOVE QDS-UNEARNED-AMT-2-1-6 TO DS-UNEARNED-AMT(2 1 6).
           MOVE QDS-UNEARNED-AMT-2-1-7 TO DS-UNEARNED-AMT(2 1 7).
           MOVE QDS-UNEARNED-AMT-2-1-8 TO DS-UNEARNED-AMT(2 1 8).
           MOVE QDS-UNEARNED-AMT-2-1-9 TO DS-UNEARNED-AMT(2 1 9).
           MOVE QDS-UNEARNED-AMT-2-1-10 TO DS-UNEARNED-AMT(2 1 10).
           MOVE QDS-UNEARNED-AMT-2-2-1 TO DS-UNEARNED-AMT(2 2 1).
           MOVE QDS-UNEARNED-AMT-2-2-2 TO DS-UNEARNED-AMT(2 2 2).
           MOVE QDS-UNEARNED-AMT-2-2-3 TO DS-UNEARNED-AMT(2 2 3).
           MOVE QDS-UNEARNED-AMT-2-2-4 TO DS-UNEARNED-AMT(2 2 4).
           MOVE QDS-UNEARNED-AMT-2-2-5 TO DS-UNEARNED-AMT(2 2 5).
           MOVE QDS-UNEARNED-AMT-2-2-6 TO DS-UNEARNED-AMT(2 2 6).
           MOVE QDS-UNEARNED-AMT-2-2-7 TO DS-UNEARNED-AMT(2 2 7).
           MOVE QDS-UNEARNED-AMT-2-2-8 TO DS-UNEARNED-AMT(2 2 8).
           MOVE QDS-UNEARNED-AMT-2-2-9 TO DS-UNEARNED-AMT(2 2 9).
           MOVE QDS-UNEARNED-AMT-2-2-10 TO DS-UNEARNED-AMT(2 2 10).
           MOVE QDS-UNEARNED-AMT-3-1-1 TO DS-UNEARNED-AMT(3 1 1).
           MOVE QDS-UNEARNED-AMT-3-1-2 TO DS-UNEARNED-AMT(3 1 2).
           MOVE QDS-UNEARNED-AMT-3-1-3 TO DS-UNEARNED-AMT(3 1 3).
           MOVE QDS-UNEARNED-AMT-3-1-4 TO DS-UNEARNED-AMT(3 1 4).
           MOVE QDS-UNEARNED-AMT-3-1-5 TO DS-UNEARNED-AMT(3 1 5).
           MOVE QDS-UNEARNED-AMT-3-1-6 TO DS-UNEARNED-AMT(3 1 6).
           MOVE QDS-UNEARNED-AMT-3-1-7 TO DS-UNEARNED-AMT(3 1 7).
           MOVE QDS-UNEARNED-AMT-3-1-8 TO DS-UNEARNED-AMT(3 1 8).
           MOVE QDS-UNEARNED-AMT-3-1-9 TO DS-UNEARNED-AMT(3 1 9).
           MOVE QDS-UNEARNED-AMT-3-1-10 TO DS-UNEARNED-AMT(3 1 10).
           MOVE QDS-UNEARNED-AMT-3-2-1 TO DS-UNEARNED-AMT(3 2 1).
           MOVE QDS-UNEARNED-AMT-3-2-2 TO DS-UNEARNED-AMT(3 2 2).
           MOVE QDS-UNEARNED-AMT-3-2-3 TO DS-UNEARNED-AMT(3 2 3).
           MOVE QDS-UNEARNED-AMT-3-2-4 TO DS-UNEARNED-AMT(3 2 4).
           MOVE QDS-UNEARNED-AMT-3-2-5 TO DS-UNEARNED-AMT(3 2 5).
           MOVE QDS-UNEARNED-AMT-3-2-6 TO DS-UNEARNED-AMT(3 2 6).
           MOVE QDS-UNEARNED-AMT-3-2-7 TO DS-UNEARNED-AMT(3 2 7).
           MOVE QDS-UNEARNED-AMT-3-2-8 TO DS-UNEARNED-AMT(3 2 8).
           MOVE QDS-UNEARNED-AMT-3-2-9 TO DS-UNEARNED-AMT(3 2 9).
           MOVE QDS-UNEARNED-AMT-3-2-10 TO DS-UNEARNED-AMT(3 2 10).
           MOVE QDS-DLDISC-VOL-1 TO DS-DLDISC-VOL(1).
           MOVE QDS-DLDISC-VOL-2 TO DS-DLDISC-VOL(2).
           MOVE QDS-DLDISC-VOL-3 TO DS-DLDISC-VOL(3).
           MOVE QDS-AFPDUEDL-MEMO TO DS-AFPDUEDL-MEMO.
           MOVE QDS-UNPAID-MANUAL TO DS-UNPAID-MANUAL.

           IF ( QDS-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO DS-LTOUCH-DATE
           ELSE
              MOVE QDS-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO DS-LTOUCH-DATE.

 
      *-----------------------------------------------------------------
      *    LOAD QDS-REC FROM DS-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-DS-FIELDS.
           MOVE DS-DATE-CCYYMM TO QDS-DATE-CCYYMM.
           MOVE DS-BRANCH TO QDS-BRANCH.
           MOVE DS-NUM TO QDS-NUM.
           MOVE DS-CLASS TO QDS-CLASS.
           MOVE DS-DLRVPRIN(1) TO QDS-DLRVPRIN-1.
           MOVE DS-DLRVPRIN(2) TO QDS-DLRVPRIN-2.
           MOVE DS-DLRVPRIN(3) TO QDS-DLRVPRIN-3.
           MOVE DS-DLRVCHGS(1) TO QDS-DLRVCHGS-1.
           MOVE DS-DLRVCHGS(2) TO QDS-DLRVCHGS-2.
           MOVE DS-DLRVCHGS(3) TO QDS-DLRVCHGS-3.
           MOVE DS-DLPARVHELD TO QDS-DLPARVHELD.
           MOVE DS-UNPAIDCK TO QDS-UNPAIDCK.
           MOVE DS-DLDISC TO QDS-DLDISC.
           MOVE DS-DLPARVPAID TO QDS-DLPARVPAID.
           MOVE DS-SUMWGTTM TO QDS-SUMWGTTM.
           MOVE DS-SUMWGTAV TO QDS-SUMWGTAV.
           MOVE DS-SUMWGTTA TO QDS-SUMWGTTA.
           MOVE DS-RCOURSE-UNITS(1) TO QDS-RCOURSE-UNITS-1.
           MOVE DS-RCOURSE-UNITS(2) TO QDS-RCOURSE-UNITS-2.
           MOVE DS-RCOURSE-UNITS(3) TO QDS-RCOURSE-UNITS-3.
           MOVE DS-RCOURSE-AMT(1) TO QDS-RCOURSE-AMT-1.
           MOVE DS-RCOURSE-AMT(2) TO QDS-RCOURSE-AMT-2.
           MOVE DS-RCOURSE-AMT(3) TO QDS-RCOURSE-AMT-3.
           MOVE DS-NPURUNIT(1) TO QDS-NPURUNIT-1.
           MOVE DS-NPURUNIT(2) TO QDS-NPURUNIT-2.
           MOVE DS-NPURUNIT(3) TO QDS-NPURUNIT-3.
           MOVE DS-NPURAMT(1) TO QDS-NPURAMT-1.
           MOVE DS-NPURAMT(2) TO QDS-NPURAMT-2.
           MOVE DS-NPURAMT(3) TO QDS-NPURAMT-3.
           MOVE DS-OPURUNIT(1) TO QDS-OPURUNIT-1.
           MOVE DS-OPURUNIT(2) TO QDS-OPURUNIT-2.
           MOVE DS-OPURUNIT(3) TO QDS-OPURUNIT-3.
           MOVE DS-OPURAMT(1) TO QDS-OPURAMT-1.
           MOVE DS-OPURAMT(2) TO QDS-OPURAMT-2.
           MOVE DS-OPURAMT(3) TO QDS-OPURAMT-3.
           MOVE DS-RNEWUNIT(1) TO QDS-RNEWUNIT-1.
           MOVE DS-RNEWUNIT(2) TO QDS-RNEWUNIT-2.
           MOVE DS-RNEWUNIT(3) TO QDS-RNEWUNIT-3.
           MOVE DS-RNEWAMT(1) TO QDS-RNEWAMT-1.
           MOVE DS-RNEWAMT(2) TO QDS-RNEWAMT-2.
           MOVE DS-RNEWAMT(3) TO QDS-RNEWAMT-3.
           MOVE DS-PAIDUNIT(1) TO QDS-PAIDUNIT-1.
           MOVE DS-PAIDUNIT(2) TO QDS-PAIDUNIT-2.
           MOVE DS-PAIDUNIT(3) TO QDS-PAIDUNIT-3.
           MOVE DS-PAIDAMT(1) TO QDS-PAIDAMT-1.
           MOVE DS-PAIDAMT(2) TO QDS-PAIDAMT-2.
           MOVE DS-PAIDAMT(3) TO QDS-PAIDAMT-3.
           MOVE DS-TODLUNIT(1) TO QDS-TODLUNIT-1.
           MOVE DS-TODLUNIT(2) TO QDS-TODLUNIT-2.
           MOVE DS-TODLUNIT(3) TO QDS-TODLUNIT-3.
           MOVE DS-TODLAMT(1) TO QDS-TODLAMT-1.
           MOVE DS-TODLAMT(2) TO QDS-TODLAMT-2.
           MOVE DS-TODLAMT(3) TO QDS-TODLAMT-3.
           MOVE DS-OUTSUNIT(1) TO QDS-OUTSUNIT-1.
           MOVE DS-OUTSUNIT(2) TO QDS-OUTSUNIT-2.
           MOVE DS-OUTSUNIT(3) TO QDS-OUTSUNIT-3.
           MOVE DS-OUTSAMT(1) TO QDS-OUTSAMT-1.
           MOVE DS-OUTSAMT(2) TO QDS-OUTSAMT-2.
           MOVE DS-OUTSAMT(3) TO QDS-OUTSAMT-3.
           MOVE DS-PLOSUNIT(1) TO QDS-PLOSUNIT-1.
           MOVE DS-PLOSUNIT(2) TO QDS-PLOSUNIT-2.
           MOVE DS-PLOSUNIT(3) TO QDS-PLOSUNIT-3.
           MOVE DS-PLOSAMT(1) TO QDS-PLOSAMT-1.
           MOVE DS-PLOSAMT(2) TO QDS-PLOSAMT-2.
           MOVE DS-PLOSAMT(3) TO QDS-PLOSAMT-3.
           MOVE DS-RCPLUNIT(1) TO QDS-RCPLUNIT-1.
           MOVE DS-RCPLUNIT(2) TO QDS-RCPLUNIT-2.
           MOVE DS-RCPLUNIT(3) TO QDS-RCPLUNIT-3.
           MOVE DS-RCPLAMT(1) TO QDS-RCPLAMT-1.
           MOVE DS-RCPLAMT(2) TO QDS-RCPLAMT-2.
           MOVE DS-RCPLAMT(3) TO QDS-RCPLAMT-3.
           MOVE DS-JDOSUNIT(1) TO QDS-JDOSUNIT-1.
           MOVE DS-JDOSUNIT(2) TO QDS-JDOSUNIT-2.
           MOVE DS-JDOSUNIT(3) TO QDS-JDOSUNIT-3.
           MOVE DS-JDOSAMT(1) TO QDS-JDOSAMT-1.
           MOVE DS-JDOSAMT(2) TO QDS-JDOSAMT-2.
           MOVE DS-JDOSAMT(3) TO QDS-JDOSAMT-3.

           IF ( DS-DELUNEARN-DATE = ZEROES )
              MOVE "1900-01-01" TO QDS-DELUNEARN-DATE
           ELSE
              MOVE DS-DELUNEARN-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QDS-DELUNEARN-DATE.

           MOVE DS-PROCEEDS(1) TO QDS-PROCEEDS-1.
           MOVE DS-PROCEEDS(2) TO QDS-PROCEEDS-2.
           MOVE DS-NO-REPO(1 1 1) TO QDS-NO-REPO-1-1-1.
           MOVE DS-AMT-REPO(1 1 1) TO QDS-AMT-REPO-1-1-1.
           MOVE DS-NO-REPO(1 1 2) TO QDS-NO-REPO-1-1-2.
           MOVE DS-AMT-REPO(1 1 2) TO QDS-AMT-REPO-1-1-2.
           MOVE DS-NO-REPO(1 1 3) TO QDS-NO-REPO-1-1-3.
           MOVE DS-AMT-REPO(1 1 3) TO QDS-AMT-REPO-1-1-3.
           MOVE DS-NO-REPO(1 1 4) TO QDS-NO-REPO-1-1-4.
           MOVE DS-AMT-REPO(1 1 4) TO QDS-AMT-REPO-1-1-4.
           MOVE DS-NO-REPO(1 1 5) TO QDS-NO-REPO-1-1-5.
           MOVE DS-AMT-REPO(1 1 5) TO QDS-AMT-REPO-1-1-5.
           MOVE DS-NO-REPO(1 2 1) TO QDS-NO-REPO-1-2-1.
           MOVE DS-AMT-REPO(1 2 1) TO QDS-AMT-REPO-1-2-1.
           MOVE DS-NO-REPO(1 2 2) TO QDS-NO-REPO-1-2-2.
           MOVE DS-AMT-REPO(1 2 2) TO QDS-AMT-REPO-1-2-2.
           MOVE DS-NO-REPO(1 2 3) TO QDS-NO-REPO-1-2-3.
           MOVE DS-AMT-REPO(1 2 3) TO QDS-AMT-REPO-1-2-3.
           MOVE DS-NO-REPO(1 2 4) TO QDS-NO-REPO-1-2-4.
           MOVE DS-AMT-REPO(1 2 4) TO QDS-AMT-REPO-1-2-4.
           MOVE DS-NO-REPO(1 2 5) TO QDS-NO-REPO-1-2-5.
           MOVE DS-AMT-REPO(1 2 5) TO QDS-AMT-REPO-1-2-5.
           MOVE DS-NO-REPO(2 1 1) TO QDS-NO-REPO-2-1-1.
           MOVE DS-AMT-REPO(2 1 1) TO QDS-AMT-REPO-2-1-1.
           MOVE DS-NO-REPO(2 1 2) TO QDS-NO-REPO-2-1-2.
           MOVE DS-AMT-REPO(2 1 2) TO QDS-AMT-REPO-2-1-2.
           MOVE DS-NO-REPO(2 1 3) TO QDS-NO-REPO-2-1-3.
           MOVE DS-AMT-REPO(2 1 3) TO QDS-AMT-REPO-2-1-3.
           MOVE DS-NO-REPO(2 1 4) TO QDS-NO-REPO-2-1-4.
           MOVE DS-AMT-REPO(2 1 4) TO QDS-AMT-REPO-2-1-4.
           MOVE DS-NO-REPO(2 1 5) TO QDS-NO-REPO-2-1-5.
           MOVE DS-AMT-REPO(2 1 5) TO QDS-AMT-REPO-2-1-5.
           MOVE DS-NO-REPO(2 2 1) TO QDS-NO-REPO-2-2-1.
           MOVE DS-AMT-REPO(2 2 1) TO QDS-AMT-REPO-2-2-1.
           MOVE DS-NO-REPO(2 2 2) TO QDS-NO-REPO-2-2-2.
           MOVE DS-AMT-REPO(2 2 2) TO QDS-AMT-REPO-2-2-2.
           MOVE DS-NO-REPO(2 2 3) TO QDS-NO-REPO-2-2-3.
           MOVE DS-AMT-REPO(2 2 3) TO QDS-AMT-REPO-2-2-3.
           MOVE DS-NO-REPO(2 2 4) TO QDS-NO-REPO-2-2-4.
           MOVE DS-AMT-REPO(2 2 4) TO QDS-AMT-REPO-2-2-4.
           MOVE DS-NO-REPO(2 2 5) TO QDS-NO-REPO-2-2-5.
           MOVE DS-AMT-REPO(2 2 5) TO QDS-AMT-REPO-2-2-5.
           MOVE DS-NO-REPO(3 1 1) TO QDS-NO-REPO-3-1-1.
           MOVE DS-AMT-REPO(3 1 1) TO QDS-AMT-REPO-3-1-1.
           MOVE DS-NO-REPO(3 1 2) TO QDS-NO-REPO-3-1-2.
           MOVE DS-AMT-REPO(3 1 2) TO QDS-AMT-REPO-3-1-2.
           MOVE DS-NO-REPO(3 1 3) TO QDS-NO-REPO-3-1-3.
           MOVE DS-AMT-REPO(3 1 3) TO QDS-AMT-REPO-3-1-3.
           MOVE DS-NO-REPO(3 1 4) TO QDS-NO-REPO-3-1-4.
           MOVE DS-AMT-REPO(3 1 4) TO QDS-AMT-REPO-3-1-4.
           MOVE DS-NO-REPO(3 1 5) TO QDS-NO-REPO-3-1-5.
           MOVE DS-AMT-REPO(3 1 5) TO QDS-AMT-REPO-3-1-5.
           MOVE DS-NO-REPO(3 2 1) TO QDS-NO-REPO-3-2-1.
           MOVE DS-AMT-REPO(3 2 1) TO QDS-AMT-REPO-3-2-1.
           MOVE DS-NO-REPO(3 2 2) TO QDS-NO-REPO-3-2-2.
           MOVE DS-AMT-REPO(3 2 2) TO QDS-AMT-REPO-3-2-2.
           MOVE DS-NO-REPO(3 2 3) TO QDS-NO-REPO-3-2-3.
           MOVE DS-AMT-REPO(3 2 3) TO QDS-AMT-REPO-3-2-3.
           MOVE DS-NO-REPO(3 2 4) TO QDS-NO-REPO-3-2-4.
           MOVE DS-AMT-REPO(3 2 4) TO QDS-AMT-REPO-3-2-4.
           MOVE DS-NO-REPO(3 2 5) TO QDS-NO-REPO-3-2-5.
           MOVE DS-AMT-REPO(3 2 5) TO QDS-AMT-REPO-3-2-5.
           MOVE DS-UNITS(1 1 1) TO QDS-UNITS-1-1-1.
           MOVE DS-OUTBAL(1 1 1) TO QDS-OUTBAL-1-1-1.
           MOVE DS-UNITS(1 1 2) TO QDS-UNITS-1-1-2.
           MOVE DS-OUTBAL(1 1 2) TO QDS-OUTBAL-1-1-2.
           MOVE DS-UNITS(1 1 3) TO QDS-UNITS-1-1-3.
           MOVE DS-OUTBAL(1 1 3) TO QDS-OUTBAL-1-1-3.
           MOVE DS-UNITS(1 1 4) TO QDS-UNITS-1-1-4.
           MOVE DS-OUTBAL(1 1 4) TO QDS-OUTBAL-1-1-4.
           MOVE DS-UNITS(1 1 5) TO QDS-UNITS-1-1-5.
           MOVE DS-OUTBAL(1 1 5) TO QDS-OUTBAL-1-1-5.
           MOVE DS-UNITS(1 1 6) TO QDS-UNITS-1-1-6.
           MOVE DS-OUTBAL(1 1 6) TO QDS-OUTBAL-1-1-6.
           MOVE DS-UNITS(1 1 7) TO QDS-UNITS-1-1-7.
           MOVE DS-OUTBAL(1 1 7) TO QDS-OUTBAL-1-1-7.
           MOVE DS-UNITS(1 1 8) TO QDS-UNITS-1-1-8.
           MOVE DS-OUTBAL(1 1 8) TO QDS-OUTBAL-1-1-8.
           MOVE DS-UNITS(1 1 9) TO QDS-UNITS-1-1-9.
           MOVE DS-OUTBAL(1 1 9) TO QDS-OUTBAL-1-1-9.
           MOVE DS-UNITS(1 1 10) TO QDS-UNITS-1-1-10.
           MOVE DS-OUTBAL(1 1 10) TO QDS-OUTBAL-1-1-10.
           MOVE DS-UNITS(1 2 1) TO QDS-UNITS-1-2-1.
           MOVE DS-OUTBAL(1 2 1) TO QDS-OUTBAL-1-2-1.
           MOVE DS-UNITS(1 2 2) TO QDS-UNITS-1-2-2.
           MOVE DS-OUTBAL(1 2 2) TO QDS-OUTBAL-1-2-2.
           MOVE DS-UNITS(1 2 3) TO QDS-UNITS-1-2-3.
           MOVE DS-OUTBAL(1 2 3) TO QDS-OUTBAL-1-2-3.
           MOVE DS-UNITS(1 2 4) TO QDS-UNITS-1-2-4.
           MOVE DS-OUTBAL(1 2 4) TO QDS-OUTBAL-1-2-4.
           MOVE DS-UNITS(1 2 5) TO QDS-UNITS-1-2-5.
           MOVE DS-OUTBAL(1 2 5) TO QDS-OUTBAL-1-2-5.
           MOVE DS-UNITS(1 2 6) TO QDS-UNITS-1-2-6.
           MOVE DS-OUTBAL(1 2 6) TO QDS-OUTBAL-1-2-6.
           MOVE DS-UNITS(1 2 7) TO QDS-UNITS-1-2-7.
           MOVE DS-OUTBAL(1 2 7) TO QDS-OUTBAL-1-2-7.
           MOVE DS-UNITS(1 2 8) TO QDS-UNITS-1-2-8.
           MOVE DS-OUTBAL(1 2 8) TO QDS-OUTBAL-1-2-8.
           MOVE DS-UNITS(1 2 9) TO QDS-UNITS-1-2-9.
           MOVE DS-OUTBAL(1 2 9) TO QDS-OUTBAL-1-2-9.
           MOVE DS-UNITS(1 2 10) TO QDS-UNITS-1-2-10.
           MOVE DS-OUTBAL(1 2 10) TO QDS-OUTBAL-1-2-10.
           MOVE DS-UNITS(2 1 1) TO QDS-UNITS-2-1-1.
           MOVE DS-OUTBAL(2 1 1) TO QDS-OUTBAL-2-1-1.
           MOVE DS-UNITS(2 1 2) TO QDS-UNITS-2-1-2.
           MOVE DS-OUTBAL(2 1 2) TO QDS-OUTBAL-2-1-2.
           MOVE DS-UNITS(2 1 3) TO QDS-UNITS-2-1-3.
           MOVE DS-OUTBAL(2 1 3) TO QDS-OUTBAL-2-1-3.
           MOVE DS-UNITS(2 1 4) TO QDS-UNITS-2-1-4.
           MOVE DS-OUTBAL(2 1 4) TO QDS-OUTBAL-2-1-4.
           MOVE DS-UNITS(2 1 5) TO QDS-UNITS-2-1-5.
           MOVE DS-OUTBAL(2 1 5) TO QDS-OUTBAL-2-1-5.
           MOVE DS-UNITS(2 1 6) TO QDS-UNITS-2-1-6.
           MOVE DS-OUTBAL(2 1 6) TO QDS-OUTBAL-2-1-6.
           MOVE DS-UNITS(2 1 7) TO QDS-UNITS-2-1-7.
           MOVE DS-OUTBAL(2 1 7) TO QDS-OUTBAL-2-1-7.
           MOVE DS-UNITS(2 1 8) TO QDS-UNITS-2-1-8.
           MOVE DS-OUTBAL(2 1 8) TO QDS-OUTBAL-2-1-8.
           MOVE DS-UNITS(2 1 9) TO QDS-UNITS-2-1-9.
           MOVE DS-OUTBAL(2 1 9) TO QDS-OUTBAL-2-1-9.
           MOVE DS-UNITS(2 1 10) TO QDS-UNITS-2-1-10.
           MOVE DS-OUTBAL(2 1 10) TO QDS-OUTBAL-2-1-10.
           MOVE DS-UNITS(2 2 1) TO QDS-UNITS-2-2-1.
           MOVE DS-OUTBAL(2 2 1) TO QDS-OUTBAL-2-2-1.
           MOVE DS-UNITS(2 2 2) TO QDS-UNITS-2-2-2.
           MOVE DS-OUTBAL(2 2 2) TO QDS-OUTBAL-2-2-2.
           MOVE DS-UNITS(2 2 3) TO QDS-UNITS-2-2-3.
           MOVE DS-OUTBAL(2 2 3) TO QDS-OUTBAL-2-2-3.
           MOVE DS-UNITS(2 2 4) TO QDS-UNITS-2-2-4.
           MOVE DS-OUTBAL(2 2 4) TO QDS-OUTBAL-2-2-4.
           MOVE DS-UNITS(2 2 5) TO QDS-UNITS-2-2-5.
           MOVE DS-OUTBAL(2 2 5) TO QDS-OUTBAL-2-2-5.
           MOVE DS-UNITS(2 2 6) TO QDS-UNITS-2-2-6.
           MOVE DS-OUTBAL(2 2 6) TO QDS-OUTBAL-2-2-6.
           MOVE DS-UNITS(2 2 7) TO QDS-UNITS-2-2-7.
           MOVE DS-OUTBAL(2 2 7) TO QDS-OUTBAL-2-2-7.
           MOVE DS-UNITS(2 2 8) TO QDS-UNITS-2-2-8.
           MOVE DS-OUTBAL(2 2 8) TO QDS-OUTBAL-2-2-8.
           MOVE DS-UNITS(2 2 9) TO QDS-UNITS-2-2-9.
           MOVE DS-OUTBAL(2 2 9) TO QDS-OUTBAL-2-2-9.
           MOVE DS-UNITS(2 2 10) TO QDS-UNITS-2-2-10.
           MOVE DS-OUTBAL(2 2 10) TO QDS-OUTBAL-2-2-10.
           MOVE DS-UNITS(3 1 1) TO QDS-UNITS-3-1-1.
           MOVE DS-OUTBAL(3 1 1) TO QDS-OUTBAL-3-1-1.
           MOVE DS-UNITS(3 1 2) TO QDS-UNITS-3-1-2.
           MOVE DS-OUTBAL(3 1 2) TO QDS-OUTBAL-3-1-2.
           MOVE DS-UNITS(3 1 3) TO QDS-UNITS-3-1-3.
           MOVE DS-OUTBAL(3 1 3) TO QDS-OUTBAL-3-1-3.
           MOVE DS-UNITS(3 1 4) TO QDS-UNITS-3-1-4.
           MOVE DS-OUTBAL(3 1 4) TO QDS-OUTBAL-3-1-4.
           MOVE DS-UNITS(3 1 5) TO QDS-UNITS-3-1-5.
           MOVE DS-OUTBAL(3 1 5) TO QDS-OUTBAL-3-1-5.
           MOVE DS-UNITS(3 1 6) TO QDS-UNITS-3-1-6.
           MOVE DS-OUTBAL(3 1 6) TO QDS-OUTBAL-3-1-6.
           MOVE DS-UNITS(3 1 7) TO QDS-UNITS-3-1-7.
           MOVE DS-OUTBAL(3 1 7) TO QDS-OUTBAL-3-1-7.
           MOVE DS-UNITS(3 1 8) TO QDS-UNITS-3-1-8.
           MOVE DS-OUTBAL(3 1 8) TO QDS-OUTBAL-3-1-8.
           MOVE DS-UNITS(3 1 9) TO QDS-UNITS-3-1-9.
           MOVE DS-OUTBAL(3 1 9) TO QDS-OUTBAL-3-1-9.
           MOVE DS-UNITS(3 1 10) TO QDS-UNITS-3-1-10.
           MOVE DS-OUTBAL(3 1 10) TO QDS-OUTBAL-3-1-10.
           MOVE DS-UNITS(3 2 1) TO QDS-UNITS-3-2-1.
           MOVE DS-OUTBAL(3 2 1) TO QDS-OUTBAL-3-2-1.
           MOVE DS-UNITS(3 2 2) TO QDS-UNITS-3-2-2.
           MOVE DS-OUTBAL(3 2 2) TO QDS-OUTBAL-3-2-2.
           MOVE DS-UNITS(3 2 3) TO QDS-UNITS-3-2-3.
           MOVE DS-OUTBAL(3 2 3) TO QDS-OUTBAL-3-2-3.
           MOVE DS-UNITS(3 2 4) TO QDS-UNITS-3-2-4.
           MOVE DS-OUTBAL(3 2 4) TO QDS-OUTBAL-3-2-4.
           MOVE DS-UNITS(3 2 5) TO QDS-UNITS-3-2-5.
           MOVE DS-OUTBAL(3 2 5) TO QDS-OUTBAL-3-2-5.
           MOVE DS-UNITS(3 2 6) TO QDS-UNITS-3-2-6.
           MOVE DS-OUTBAL(3 2 6) TO QDS-OUTBAL-3-2-6.
           MOVE DS-UNITS(3 2 7) TO QDS-UNITS-3-2-7.
           MOVE DS-OUTBAL(3 2 7) TO QDS-OUTBAL-3-2-7.
           MOVE DS-UNITS(3 2 8) TO QDS-UNITS-3-2-8.
           MOVE DS-OUTBAL(3 2 8) TO QDS-OUTBAL-3-2-8.
           MOVE DS-UNITS(3 2 9) TO QDS-UNITS-3-2-9.
           MOVE DS-OUTBAL(3 2 9) TO QDS-OUTBAL-3-2-9.
           MOVE DS-UNITS(3 2 10) TO QDS-UNITS-3-2-10.
           MOVE DS-OUTBAL(3 2 10) TO QDS-OUTBAL-3-2-10.
           MOVE DS-UNITS-BNKRPT(1 1 1) TO QDS-UNITS-BNKRPT-1-1-1.
           MOVE DS-OUTBAL-BNKRPT(1 1 1) TO QDS-OUTBAL-BNKRPT-1-1-1.
           MOVE DS-UNITS-BNKRPT(1 1 2) TO QDS-UNITS-BNKRPT-1-1-2.
           MOVE DS-OUTBAL-BNKRPT(1 1 2) TO QDS-OUTBAL-BNKRPT-1-1-2.
           MOVE DS-UNITS-BNKRPT(1 1 3) TO QDS-UNITS-BNKRPT-1-1-3.
           MOVE DS-OUTBAL-BNKRPT(1 1 3) TO QDS-OUTBAL-BNKRPT-1-1-3.
           MOVE DS-UNITS-BNKRPT(1 1 4) TO QDS-UNITS-BNKRPT-1-1-4.
           MOVE DS-OUTBAL-BNKRPT(1 1 4) TO QDS-OUTBAL-BNKRPT-1-1-4.
           MOVE DS-UNITS-BNKRPT(1 1 5) TO QDS-UNITS-BNKRPT-1-1-5.
           MOVE DS-OUTBAL-BNKRPT(1 1 5) TO QDS-OUTBAL-BNKRPT-1-1-5.
           MOVE DS-UNITS-BNKRPT(1 1 6) TO QDS-UNITS-BNKRPT-1-1-6.
           MOVE DS-OUTBAL-BNKRPT(1 1 6) TO QDS-OUTBAL-BNKRPT-1-1-6.
           MOVE DS-UNITS-BNKRPT(1 1 7) TO QDS-UNITS-BNKRPT-1-1-7.
           MOVE DS-OUTBAL-BNKRPT(1 1 7) TO QDS-OUTBAL-BNKRPT-1-1-7.
           MOVE DS-UNITS-BNKRPT(1 1 8) TO QDS-UNITS-BNKRPT-1-1-8.
           MOVE DS-OUTBAL-BNKRPT(1 1 8) TO QDS-OUTBAL-BNKRPT-1-1-8.
           MOVE DS-UNITS-BNKRPT(1 1 9) TO QDS-UNITS-BNKRPT-1-1-9.
           MOVE DS-OUTBAL-BNKRPT(1 1 9) TO QDS-OUTBAL-BNKRPT-1-1-9.
           MOVE DS-UNITS-BNKRPT(1 1 10) TO QDS-UNITS-BNKRPT-1-1-10.
           MOVE DS-OUTBAL-BNKRPT(1 1 10) TO QDS-OUTBAL-BNKRPT-1-1-10.
           MOVE DS-UNITS-BNKRPT(1 2 1) TO QDS-UNITS-BNKRPT-1-2-1.
           MOVE DS-OUTBAL-BNKRPT(1 2 1) TO QDS-OUTBAL-BNKRPT-1-2-1.
           MOVE DS-UNITS-BNKRPT(1 2 2) TO QDS-UNITS-BNKRPT-1-2-2.
           MOVE DS-OUTBAL-BNKRPT(1 2 2) TO QDS-OUTBAL-BNKRPT-1-2-2.
           MOVE DS-UNITS-BNKRPT(1 2 3) TO QDS-UNITS-BNKRPT-1-2-3.
           MOVE DS-OUTBAL-BNKRPT(1 2 3) TO QDS-OUTBAL-BNKRPT-1-2-3.
           MOVE DS-UNITS-BNKRPT(1 2 4) TO QDS-UNITS-BNKRPT-1-2-4.
           MOVE DS-OUTBAL-BNKRPT(1 2 4) TO QDS-OUTBAL-BNKRPT-1-2-4.
           MOVE DS-UNITS-BNKRPT(1 2 5) TO QDS-UNITS-BNKRPT-1-2-5.
           MOVE DS-OUTBAL-BNKRPT(1 2 5) TO QDS-OUTBAL-BNKRPT-1-2-5.
           MOVE DS-UNITS-BNKRPT(1 2 6) TO QDS-UNITS-BNKRPT-1-2-6.
           MOVE DS-OUTBAL-BNKRPT(1 2 6) TO QDS-OUTBAL-BNKRPT-1-2-6.
           MOVE DS-UNITS-BNKRPT(1 2 7) TO QDS-UNITS-BNKRPT-1-2-7.
           MOVE DS-OUTBAL-BNKRPT(1 2 7) TO QDS-OUTBAL-BNKRPT-1-2-7.
           MOVE DS-UNITS-BNKRPT(1 2 8) TO QDS-UNITS-BNKRPT-1-2-8.
           MOVE DS-OUTBAL-BNKRPT(1 2 8) TO QDS-OUTBAL-BNKRPT-1-2-8.
           MOVE DS-UNITS-BNKRPT(1 2 9) TO QDS-UNITS-BNKRPT-1-2-9.
           MOVE DS-OUTBAL-BNKRPT(1 2 9) TO QDS-OUTBAL-BNKRPT-1-2-9.
           MOVE DS-UNITS-BNKRPT(1 2 10) TO QDS-UNITS-BNKRPT-1-2-10.
           MOVE DS-OUTBAL-BNKRPT(1 2 10) TO QDS-OUTBAL-BNKRPT-1-2-10.
           MOVE DS-UNITS-BNKRPT(2 1 1) TO QDS-UNITS-BNKRPT-2-1-1.
           MOVE DS-OUTBAL-BNKRPT(2 1 1) TO QDS-OUTBAL-BNKRPT-2-1-1.
           MOVE DS-UNITS-BNKRPT(2 1 2) TO QDS-UNITS-BNKRPT-2-1-2.
           MOVE DS-OUTBAL-BNKRPT(2 1 2) TO QDS-OUTBAL-BNKRPT-2-1-2.
           MOVE DS-UNITS-BNKRPT(2 1 3) TO QDS-UNITS-BNKRPT-2-1-3.
           MOVE DS-OUTBAL-BNKRPT(2 1 3) TO QDS-OUTBAL-BNKRPT-2-1-3.
           MOVE DS-UNITS-BNKRPT(2 1 4) TO QDS-UNITS-BNKRPT-2-1-4.
           MOVE DS-OUTBAL-BNKRPT(2 1 4) TO QDS-OUTBAL-BNKRPT-2-1-4.
           MOVE DS-UNITS-BNKRPT(2 1 5) TO QDS-UNITS-BNKRPT-2-1-5.
           MOVE DS-OUTBAL-BNKRPT(2 1 5) TO QDS-OUTBAL-BNKRPT-2-1-5.
           MOVE DS-UNITS-BNKRPT(2 1 6) TO QDS-UNITS-BNKRPT-2-1-6.
           MOVE DS-OUTBAL-BNKRPT(2 1 6) TO QDS-OUTBAL-BNKRPT-2-1-6.
           MOVE DS-UNITS-BNKRPT(2 1 7) TO QDS-UNITS-BNKRPT-2-1-7.
           MOVE DS-OUTBAL-BNKRPT(2 1 7) TO QDS-OUTBAL-BNKRPT-2-1-7.
           MOVE DS-UNITS-BNKRPT(2 1 8) TO QDS-UNITS-BNKRPT-2-1-8.
           MOVE DS-OUTBAL-BNKRPT(2 1 8) TO QDS-OUTBAL-BNKRPT-2-1-8.
           MOVE DS-UNITS-BNKRPT(2 1 9) TO QDS-UNITS-BNKRPT-2-1-9.
           MOVE DS-OUTBAL-BNKRPT(2 1 9) TO QDS-OUTBAL-BNKRPT-2-1-9.
           MOVE DS-UNITS-BNKRPT(2 1 10) TO QDS-UNITS-BNKRPT-2-1-10.
           MOVE DS-OUTBAL-BNKRPT(2 1 10) TO QDS-OUTBAL-BNKRPT-2-1-10.
           MOVE DS-UNITS-BNKRPT(2 2 1) TO QDS-UNITS-BNKRPT-2-2-1.
           MOVE DS-OUTBAL-BNKRPT(2 2 1) TO QDS-OUTBAL-BNKRPT-2-2-1.
           MOVE DS-UNITS-BNKRPT(2 2 2) TO QDS-UNITS-BNKRPT-2-2-2.
           MOVE DS-OUTBAL-BNKRPT(2 2 2) TO QDS-OUTBAL-BNKRPT-2-2-2.
           MOVE DS-UNITS-BNKRPT(2 2 3) TO QDS-UNITS-BNKRPT-2-2-3.
           MOVE DS-OUTBAL-BNKRPT(2 2 3) TO QDS-OUTBAL-BNKRPT-2-2-3.
           MOVE DS-UNITS-BNKRPT(2 2 4) TO QDS-UNITS-BNKRPT-2-2-4.
           MOVE DS-OUTBAL-BNKRPT(2 2 4) TO QDS-OUTBAL-BNKRPT-2-2-4.
           MOVE DS-UNITS-BNKRPT(2 2 5) TO QDS-UNITS-BNKRPT-2-2-5.
           MOVE DS-OUTBAL-BNKRPT(2 2 5) TO QDS-OUTBAL-BNKRPT-2-2-5.
           MOVE DS-UNITS-BNKRPT(2 2 6) TO QDS-UNITS-BNKRPT-2-2-6.
           MOVE DS-OUTBAL-BNKRPT(2 2 6) TO QDS-OUTBAL-BNKRPT-2-2-6.
           MOVE DS-UNITS-BNKRPT(2 2 7) TO QDS-UNITS-BNKRPT-2-2-7.
           MOVE DS-OUTBAL-BNKRPT(2 2 7) TO QDS-OUTBAL-BNKRPT-2-2-7.
           MOVE DS-UNITS-BNKRPT(2 2 8) TO QDS-UNITS-BNKRPT-2-2-8.
           MOVE DS-OUTBAL-BNKRPT(2 2 8) TO QDS-OUTBAL-BNKRPT-2-2-8.
           MOVE DS-UNITS-BNKRPT(2 2 9) TO QDS-UNITS-BNKRPT-2-2-9.
           MOVE DS-OUTBAL-BNKRPT(2 2 9) TO QDS-OUTBAL-BNKRPT-2-2-9.
           MOVE DS-UNITS-BNKRPT(2 2 10) TO QDS-UNITS-BNKRPT-2-2-10.
           MOVE DS-OUTBAL-BNKRPT(2 2 10) TO QDS-OUTBAL-BNKRPT-2-2-10.
           MOVE DS-UNITS-BNKRPT(3 1 1) TO QDS-UNITS-BNKRPT-3-1-1.
           MOVE DS-OUTBAL-BNKRPT(3 1 1) TO QDS-OUTBAL-BNKRPT-3-1-1.
           MOVE DS-UNITS-BNKRPT(3 1 2) TO QDS-UNITS-BNKRPT-3-1-2.
           MOVE DS-OUTBAL-BNKRPT(3 1 2) TO QDS-OUTBAL-BNKRPT-3-1-2.
           MOVE DS-UNITS-BNKRPT(3 1 3) TO QDS-UNITS-BNKRPT-3-1-3.
           MOVE DS-OUTBAL-BNKRPT(3 1 3) TO QDS-OUTBAL-BNKRPT-3-1-3.
           MOVE DS-UNITS-BNKRPT(3 1 4) TO QDS-UNITS-BNKRPT-3-1-4.
           MOVE DS-OUTBAL-BNKRPT(3 1 4) TO QDS-OUTBAL-BNKRPT-3-1-4.
           MOVE DS-UNITS-BNKRPT(3 1 5) TO QDS-UNITS-BNKRPT-3-1-5.
           MOVE DS-OUTBAL-BNKRPT(3 1 5) TO QDS-OUTBAL-BNKRPT-3-1-5.
           MOVE DS-UNITS-BNKRPT(3 1 6) TO QDS-UNITS-BNKRPT-3-1-6.
           MOVE DS-OUTBAL-BNKRPT(3 1 6) TO QDS-OUTBAL-BNKRPT-3-1-6.
           MOVE DS-UNITS-BNKRPT(3 1 7) TO QDS-UNITS-BNKRPT-3-1-7.
           MOVE DS-OUTBAL-BNKRPT(3 1 7) TO QDS-OUTBAL-BNKRPT-3-1-7.
           MOVE DS-UNITS-BNKRPT(3 1 8) TO QDS-UNITS-BNKRPT-3-1-8.
           MOVE DS-OUTBAL-BNKRPT(3 1 8) TO QDS-OUTBAL-BNKRPT-3-1-8.
           MOVE DS-UNITS-BNKRPT(3 1 9) TO QDS-UNITS-BNKRPT-3-1-9.
           MOVE DS-OUTBAL-BNKRPT(3 1 9) TO QDS-OUTBAL-BNKRPT-3-1-9.
           MOVE DS-UNITS-BNKRPT(3 1 10) TO QDS-UNITS-BNKRPT-3-1-10.
           MOVE DS-OUTBAL-BNKRPT(3 1 10) TO QDS-OUTBAL-BNKRPT-3-1-10.
           MOVE DS-UNITS-BNKRPT(3 2 1) TO QDS-UNITS-BNKRPT-3-2-1.
           MOVE DS-OUTBAL-BNKRPT(3 2 1) TO QDS-OUTBAL-BNKRPT-3-2-1.
           MOVE DS-UNITS-BNKRPT(3 2 2) TO QDS-UNITS-BNKRPT-3-2-2.
           MOVE DS-OUTBAL-BNKRPT(3 2 2) TO QDS-OUTBAL-BNKRPT-3-2-2.
           MOVE DS-UNITS-BNKRPT(3 2 3) TO QDS-UNITS-BNKRPT-3-2-3.
           MOVE DS-OUTBAL-BNKRPT(3 2 3) TO QDS-OUTBAL-BNKRPT-3-2-3.
           MOVE DS-UNITS-BNKRPT(3 2 4) TO QDS-UNITS-BNKRPT-3-2-4.
           MOVE DS-OUTBAL-BNKRPT(3 2 4) TO QDS-OUTBAL-BNKRPT-3-2-4.
           MOVE DS-UNITS-BNKRPT(3 2 5) TO QDS-UNITS-BNKRPT-3-2-5.
           MOVE DS-OUTBAL-BNKRPT(3 2 5) TO QDS-OUTBAL-BNKRPT-3-2-5.
           MOVE DS-UNITS-BNKRPT(3 2 6) TO QDS-UNITS-BNKRPT-3-2-6.
           MOVE DS-OUTBAL-BNKRPT(3 2 6) TO QDS-OUTBAL-BNKRPT-3-2-6.
           MOVE DS-UNITS-BNKRPT(3 2 7) TO QDS-UNITS-BNKRPT-3-2-7.
           MOVE DS-OUTBAL-BNKRPT(3 2 7) TO QDS-OUTBAL-BNKRPT-3-2-7.
           MOVE DS-UNITS-BNKRPT(3 2 8) TO QDS-UNITS-BNKRPT-3-2-8.
           MOVE DS-OUTBAL-BNKRPT(3 2 8) TO QDS-OUTBAL-BNKRPT-3-2-8.
           MOVE DS-UNITS-BNKRPT(3 2 9) TO QDS-UNITS-BNKRPT-3-2-9.
           MOVE DS-OUTBAL-BNKRPT(3 2 9) TO QDS-OUTBAL-BNKRPT-3-2-9.
           MOVE DS-UNITS-BNKRPT(3 2 10) TO QDS-UNITS-BNKRPT-3-2-10.
           MOVE DS-OUTBAL-BNKRPT(3 2 10) TO QDS-OUTBAL-BNKRPT-3-2-10.
           MOVE DS-UNEARNED-AMT(1 1 1) TO QDS-UNEARNED-AMT-1-1-1.
           MOVE DS-UNEARNED-AMT(1 1 2) TO QDS-UNEARNED-AMT-1-1-2.
           MOVE DS-UNEARNED-AMT(1 1 3) TO QDS-UNEARNED-AMT-1-1-3.
           MOVE DS-UNEARNED-AMT(1 1 4) TO QDS-UNEARNED-AMT-1-1-4.
           MOVE DS-UNEARNED-AMT(1 1 5) TO QDS-UNEARNED-AMT-1-1-5.
           MOVE DS-UNEARNED-AMT(1 1 6) TO QDS-UNEARNED-AMT-1-1-6.
           MOVE DS-UNEARNED-AMT(1 1 7) TO QDS-UNEARNED-AMT-1-1-7.
           MOVE DS-UNEARNED-AMT(1 1 8) TO QDS-UNEARNED-AMT-1-1-8.
           MOVE DS-UNEARNED-AMT(1 1 9) TO QDS-UNEARNED-AMT-1-1-9.
           MOVE DS-UNEARNED-AMT(1 1 10) TO QDS-UNEARNED-AMT-1-1-10.
           MOVE DS-UNEARNED-AMT(1 2 1) TO QDS-UNEARNED-AMT-1-2-1.
           MOVE DS-UNEARNED-AMT(1 2 2) TO QDS-UNEARNED-AMT-1-2-2.
           MOVE DS-UNEARNED-AMT(1 2 3) TO QDS-UNEARNED-AMT-1-2-3.
           MOVE DS-UNEARNED-AMT(1 2 4) TO QDS-UNEARNED-AMT-1-2-4.
           MOVE DS-UNEARNED-AMT(1 2 5) TO QDS-UNEARNED-AMT-1-2-5.
           MOVE DS-UNEARNED-AMT(1 2 6) TO QDS-UNEARNED-AMT-1-2-6.
           MOVE DS-UNEARNED-AMT(1 2 7) TO QDS-UNEARNED-AMT-1-2-7.
           MOVE DS-UNEARNED-AMT(1 2 8) TO QDS-UNEARNED-AMT-1-2-8.
           MOVE DS-UNEARNED-AMT(1 2 9) TO QDS-UNEARNED-AMT-1-2-9.
           MOVE DS-UNEARNED-AMT(1 2 10) TO QDS-UNEARNED-AMT-1-2-10.
           MOVE DS-UNEARNED-AMT(2 1 1) TO QDS-UNEARNED-AMT-2-1-1.
           MOVE DS-UNEARNED-AMT(2 1 2) TO QDS-UNEARNED-AMT-2-1-2.
           MOVE DS-UNEARNED-AMT(2 1 3) TO QDS-UNEARNED-AMT-2-1-3.
           MOVE DS-UNEARNED-AMT(2 1 4) TO QDS-UNEARNED-AMT-2-1-4.
           MOVE DS-UNEARNED-AMT(2 1 5) TO QDS-UNEARNED-AMT-2-1-5.
           MOVE DS-UNEARNED-AMT(2 1 6) TO QDS-UNEARNED-AMT-2-1-6.
           MOVE DS-UNEARNED-AMT(2 1 7) TO QDS-UNEARNED-AMT-2-1-7.
           MOVE DS-UNEARNED-AMT(2 1 8) TO QDS-UNEARNED-AMT-2-1-8.
           MOVE DS-UNEARNED-AMT(2 1 9) TO QDS-UNEARNED-AMT-2-1-9.
           MOVE DS-UNEARNED-AMT(2 1 10) TO QDS-UNEARNED-AMT-2-1-10.
           MOVE DS-UNEARNED-AMT(2 2 1) TO QDS-UNEARNED-AMT-2-2-1.
           MOVE DS-UNEARNED-AMT(2 2 2) TO QDS-UNEARNED-AMT-2-2-2.
           MOVE DS-UNEARNED-AMT(2 2 3) TO QDS-UNEARNED-AMT-2-2-3.
           MOVE DS-UNEARNED-AMT(2 2 4) TO QDS-UNEARNED-AMT-2-2-4.
           MOVE DS-UNEARNED-AMT(2 2 5) TO QDS-UNEARNED-AMT-2-2-5.
           MOVE DS-UNEARNED-AMT(2 2 6) TO QDS-UNEARNED-AMT-2-2-6.
           MOVE DS-UNEARNED-AMT(2 2 7) TO QDS-UNEARNED-AMT-2-2-7.
           MOVE DS-UNEARNED-AMT(2 2 8) TO QDS-UNEARNED-AMT-2-2-8.
           MOVE DS-UNEARNED-AMT(2 2 9) TO QDS-UNEARNED-AMT-2-2-9.
           MOVE DS-UNEARNED-AMT(2 2 10) TO QDS-UNEARNED-AMT-2-2-10.
           MOVE DS-UNEARNED-AMT(3 1 1) TO QDS-UNEARNED-AMT-3-1-1.
           MOVE DS-UNEARNED-AMT(3 1 2) TO QDS-UNEARNED-AMT-3-1-2.
           MOVE DS-UNEARNED-AMT(3 1 3) TO QDS-UNEARNED-AMT-3-1-3.
           MOVE DS-UNEARNED-AMT(3 1 4) TO QDS-UNEARNED-AMT-3-1-4.
           MOVE DS-UNEARNED-AMT(3 1 5) TO QDS-UNEARNED-AMT-3-1-5.
           MOVE DS-UNEARNED-AMT(3 1 6) TO QDS-UNEARNED-AMT-3-1-6.
           MOVE DS-UNEARNED-AMT(3 1 7) TO QDS-UNEARNED-AMT-3-1-7.
           MOVE DS-UNEARNED-AMT(3 1 8) TO QDS-UNEARNED-AMT-3-1-8.
           MOVE DS-UNEARNED-AMT(3 1 9) TO QDS-UNEARNED-AMT-3-1-9.
           MOVE DS-UNEARNED-AMT(3 1 10) TO QDS-UNEARNED-AMT-3-1-10.
           MOVE DS-UNEARNED-AMT(3 2 1) TO QDS-UNEARNED-AMT-3-2-1.
           MOVE DS-UNEARNED-AMT(3 2 2) TO QDS-UNEARNED-AMT-3-2-2.
           MOVE DS-UNEARNED-AMT(3 2 3) TO QDS-UNEARNED-AMT-3-2-3.
           MOVE DS-UNEARNED-AMT(3 2 4) TO QDS-UNEARNED-AMT-3-2-4.
           MOVE DS-UNEARNED-AMT(3 2 5) TO QDS-UNEARNED-AMT-3-2-5.
           MOVE DS-UNEARNED-AMT(3 2 6) TO QDS-UNEARNED-AMT-3-2-6.
           MOVE DS-UNEARNED-AMT(3 2 7) TO QDS-UNEARNED-AMT-3-2-7.
           MOVE DS-UNEARNED-AMT(3 2 8) TO QDS-UNEARNED-AMT-3-2-8.
           MOVE DS-UNEARNED-AMT(3 2 9) TO QDS-UNEARNED-AMT-3-2-9.
           MOVE DS-UNEARNED-AMT(3 2 10) TO QDS-UNEARNED-AMT-3-2-10.
           MOVE DS-DLDISC-VOL(1) TO QDS-DLDISC-VOL-1.
           MOVE DS-DLDISC-VOL(2) TO QDS-DLDISC-VOL-2.
           MOVE DS-DLDISC-VOL(3) TO QDS-DLDISC-VOL-3.
           MOVE DS-AFPDUEDL-MEMO TO QDS-AFPDUEDL-MEMO.
           MOVE DS-UNPAID-MANUAL TO QDS-UNPAID-MANUAL.

           IF ( DS-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QDS-LTOUCH-DATE
           ELSE
              MOVE DS-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QDS-LTOUCH-DATE.

 
