      * COPYMEMBER: LIBLP/LPDS1RN
       LOAD-DS1-FILE.
      *- - - -{ SET OVERRIDE TO A "Y" TO NOT TOUCH THE PATH AT ALL  }- -
           IF ( DS-PATH-OVERRIDE = "Y" ) 
              NEXT SENTENCE
           ELSE
      *- - - -{ SPACES IS THE DEFAULT, NO CROSSING BRANCHES }- - - - - -
           IF ( DS-PATH-OVERRIDE = SPACES ) 
              MOVE EXT-FILPATH-BASE        TO DS-ALL-BASE
              MOVE EXT-FILPATH-MACHINE     TO DS-ALL-MACHINE
              MOVE EXT-FILPATH-DATA        TO DS-ALL-DATA
              MOVE DS-ALL-PATH             TO DS-PATH
           ELSE
      *- - - -{ USE BRANCH VALUES }- - - - - - - - - - - - - - - - - - -
           IF ( DS-PATH-OVERRIDE = "B" ) 
              MOVE FILPATH-BASE            TO DS-ALL-BASE
              MOVE FILPATH-MACHINE         TO DS-ALL-MACHINE
              MOVE FILPATH-DATA            TO DS-ALL-DATA
              MOVE DS-ALL-PATH             TO DS-PATH.

      *-----------------------------------------------------------------
       OPEN-DS1-FILE.
           PERFORM LOAD-DS1-FILE.
           PERFORM OPEN-IT.
           MOVE DS-PATH-SQL TO E-FILE.

      *    IF ( SQL-CONNECT-STAT-BAD )
      *       PERFORM SQL-CONNECT.

      *-----------------------------------------------------------------
       START-DS1-FILE.
           PERFORM START-IT.
           MOVE DS-PATH-OWNBR  TO DS-BRANCH.
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.

           IF ( DS1-CURSOR-STAT-GOOD )
              PERFORM CLOSE-DS1-FILE.

           IF ( QDS1-WEND-CLASS = ZEROES    ) OR
              ( QDS1-WEND-CLASS NOT NUMERIC )
              MOVE DS-PATH-OWNBR        TO QDS1-WBEG-BRANCH
              MOVE DS-PATH-OWNBR        TO QDS1-WEND-BRANCH
              MOVE DS-DATE-CCYYMM       TO QDS1-WBEG-DATE-CCYYMM
              MOVE ALL "9"              TO QDS1-WEND-DATE-CCYYMM
                                           QDS1-WEND-NUM
                                           QDS1-WEND-CLASS
              MOVE DS-NUM               TO QDS1-WBEG-NUM
              MOVE DS-CLASS             TO QDS1-WBEG-CLASS.


           EXEC SQL
            DECLARE DS1_CURSOR CURSOR FOR
            SELECT DSFILE.DS_DATE_CCYYMM,
                   DSFILE.DS_BRANCH,
                   DSFILE.DS_NUM,
                   DSFILE.DS_CLASS,
                   DSFILE.DS_DLRVPRIN_1,
                   DSFILE.DS_DLRVPRIN_2,
                   DSFILE.DS_DLRVPRIN_3,
                   DSFILE.DS_DLRVCHGS_1,
                   DSFILE.DS_DLRVCHGS_2,
                   DSFILE.DS_DLRVCHGS_3,
                   DSFILE.DS_DLPARVHELD,
                   DSFILE.DS_UNPAIDCK,
                   DSFILE.DS_DLDISC,
                   DSFILE.DS_DLPARVPAID,
                   DSFILE.DS_SUMWGTTM,
                   DSFILE.DS_SUMWGTAV,
                   DSFILE.DS_SUMWGTTA,
                   DSFILE.DS_RCOURSE_UNITS_1,
                   DSFILE.DS_RCOURSE_UNITS_2,
                   DSFILE.DS_RCOURSE_UNITS_3,
                   DSFILE.DS_RCOURSE_AMT_1,
                   DSFILE.DS_RCOURSE_AMT_2,
                   DSFILE.DS_RCOURSE_AMT_3,
                   DSFILE.DS_NPURUNIT_1,
                   DSFILE.DS_NPURUNIT_2,
                   DSFILE.DS_NPURUNIT_3,
                   DSFILE.DS_NPURAMT_1,
                   DSFILE.DS_NPURAMT_2,
                   DSFILE.DS_NPURAMT_3,
                   DSFILE.DS_OPURUNIT_1,
                   DSFILE.DS_OPURUNIT_2,
                   DSFILE.DS_OPURUNIT_3,
                   DSFILE.DS_OPURAMT_1,
                   DSFILE.DS_OPURAMT_2,
                   DSFILE.DS_OPURAMT_3,
                   DSFILE.DS_RNEWUNIT_1,
                   DSFILE.DS_RNEWUNIT_2,
                   DSFILE.DS_RNEWUNIT_3,
                   DSFILE.DS_RNEWAMT_1,
                   DSFILE.DS_RNEWAMT_2,
                   DSFILE.DS_RNEWAMT_3,
                   DSFILE.DS_PAIDUNIT_1,
                   DSFILE.DS_PAIDUNIT_2,
                   DSFILE.DS_PAIDUNIT_3,
                   DSFILE.DS_PAIDAMT_1,
                   DSFILE.DS_PAIDAMT_2,
                   DSFILE.DS_PAIDAMT_3,
                   DSFILE.DS_TODLUNIT_1,
                   DSFILE.DS_TODLUNIT_2,
                   DSFILE.DS_TODLUNIT_3,
                   DSFILE.DS_TODLAMT_1,
                   DSFILE.DS_TODLAMT_2,
                   DSFILE.DS_TODLAMT_3,
                   DSFILE.DS_OUTSUNIT_1,
                   DSFILE.DS_OUTSUNIT_2,
                   DSFILE.DS_OUTSUNIT_3,
                   DSFILE.DS_OUTSAMT_1,
                   DSFILE.DS_OUTSAMT_2,
                   DSFILE.DS_OUTSAMT_3,
                   DSFILE.DS_PLOSUNIT_1,
                   DSFILE.DS_PLOSUNIT_2,
                   DSFILE.DS_PLOSUNIT_3,
                   DSFILE.DS_PLOSAMT_1,
                   DSFILE.DS_PLOSAMT_2,
                   DSFILE.DS_PLOSAMT_3,
                   DSFILE.DS_RCPLUNIT_1,
                   DSFILE.DS_RCPLUNIT_2,
                   DSFILE.DS_RCPLUNIT_3,
                   DSFILE.DS_RCPLAMT_1,
                   DSFILE.DS_RCPLAMT_2,
                   DSFILE.DS_RCPLAMT_3,
                   DSFILE.DS_JDOSUNIT_1,
                   DSFILE.DS_JDOSUNIT_2,
                   DSFILE.DS_JDOSUNIT_3,
                   DSFILE.DS_JDOSAMT_1,
                   DSFILE.DS_JDOSAMT_2,
                   DSFILE.DS_JDOSAMT_3,
                   CAST(DSFILE.DS_DELUNEARN_DATE
                                                  AS VARCHAR(10)),
                   DSFILE.DS_PROCEEDS_1,
                   DSFILE.DS_PROCEEDS_2,
                   DSFILE.DS_NO_REPO_1_1_1,
                   DSFILE.DS_AMT_REPO_1_1_1,
                   DSFILE.DS_NO_REPO_1_1_2,
                   DSFILE.DS_AMT_REPO_1_1_2,
                   DSFILE.DS_NO_REPO_1_1_3,
                   DSFILE.DS_AMT_REPO_1_1_3,
                   DSFILE.DS_NO_REPO_1_1_4,
                   DSFILE.DS_AMT_REPO_1_1_4,
                   DSFILE.DS_NO_REPO_1_1_5,
                   DSFILE.DS_AMT_REPO_1_1_5,
                   DSFILE.DS_NO_REPO_1_2_1,
                   DSFILE.DS_AMT_REPO_1_2_1,
                   DSFILE.DS_NO_REPO_1_2_2,
                   DSFILE.DS_AMT_REPO_1_2_2,
                   DSFILE.DS_NO_REPO_1_2_3,
                   DSFILE.DS_AMT_REPO_1_2_3,
                   DSFILE.DS_NO_REPO_1_2_4,
                   DSFILE.DS_AMT_REPO_1_2_4,
                   DSFILE.DS_NO_REPO_1_2_5,
                   DSFILE.DS_AMT_REPO_1_2_5,
                   DSFILE.DS_NO_REPO_2_1_1,
                   DSFILE.DS_AMT_REPO_2_1_1,
                   DSFILE.DS_NO_REPO_2_1_2,
                   DSFILE.DS_AMT_REPO_2_1_2,
                   DSFILE.DS_NO_REPO_2_1_3,
                   DSFILE.DS_AMT_REPO_2_1_3,
                   DSFILE.DS_NO_REPO_2_1_4,
                   DSFILE.DS_AMT_REPO_2_1_4,
                   DSFILE.DS_NO_REPO_2_1_5,
                   DSFILE.DS_AMT_REPO_2_1_5,
                   DSFILE.DS_NO_REPO_2_2_1,
                   DSFILE.DS_AMT_REPO_2_2_1,
                   DSFILE.DS_NO_REPO_2_2_2,
                   DSFILE.DS_AMT_REPO_2_2_2,
                   DSFILE.DS_NO_REPO_2_2_3,
                   DSFILE.DS_AMT_REPO_2_2_3,
                   DSFILE.DS_NO_REPO_2_2_4,
                   DSFILE.DS_AMT_REPO_2_2_4,
                   DSFILE.DS_NO_REPO_2_2_5,
                   DSFILE.DS_AMT_REPO_2_2_5,
                   DSFILE.DS_NO_REPO_3_1_1,
                   DSFILE.DS_AMT_REPO_3_1_1,
                   DSFILE.DS_NO_REPO_3_1_2,
                   DSFILE.DS_AMT_REPO_3_1_2,
                   DSFILE.DS_NO_REPO_3_1_3,
                   DSFILE.DS_AMT_REPO_3_1_3,
                   DSFILE.DS_NO_REPO_3_1_4,
                   DSFILE.DS_AMT_REPO_3_1_4,
                   DSFILE.DS_NO_REPO_3_1_5,
                   DSFILE.DS_AMT_REPO_3_1_5,
                   DSFILE.DS_NO_REPO_3_2_1,
                   DSFILE.DS_AMT_REPO_3_2_1,
                   DSFILE.DS_NO_REPO_3_2_2,
                   DSFILE.DS_AMT_REPO_3_2_2,
                   DSFILE.DS_NO_REPO_3_2_3,
                   DSFILE.DS_AMT_REPO_3_2_3,
                   DSFILE.DS_NO_REPO_3_2_4,
                   DSFILE.DS_AMT_REPO_3_2_4,
                   DSFILE.DS_NO_REPO_3_2_5,
                   DSFILE.DS_AMT_REPO_3_2_5,
                   DSFILE.DS_UNITS_1_1_1,
                   DSFILE.DS_OUTBAL_1_1_1,
                   DSFILE.DS_UNITS_1_1_2,
                   DSFILE.DS_OUTBAL_1_1_2,
                   DSFILE.DS_UNITS_1_1_3,
                   DSFILE.DS_OUTBAL_1_1_3,
                   DSFILE.DS_UNITS_1_1_4,
                   DSFILE.DS_OUTBAL_1_1_4,
                   DSFILE.DS_UNITS_1_1_5,
                   DSFILE.DS_OUTBAL_1_1_5,
                   DSFILE.DS_UNITS_1_1_6,
                   DSFILE.DS_OUTBAL_1_1_6,
                   DSFILE.DS_UNITS_1_1_7,
                   DSFILE.DS_OUTBAL_1_1_7,
                   DSFILE.DS_UNITS_1_1_8,
                   DSFILE.DS_OUTBAL_1_1_8,
                   DSFILE.DS_UNITS_1_1_9,
                   DSFILE.DS_OUTBAL_1_1_9,
                   DSFILE.DS_UNITS_1_1_10,
                   DSFILE.DS_OUTBAL_1_1_10,
                   DSFILE.DS_UNITS_1_2_1,
                   DSFILE.DS_OUTBAL_1_2_1,
                   DSFILE.DS_UNITS_1_2_2,
                   DSFILE.DS_OUTBAL_1_2_2,
                   DSFILE.DS_UNITS_1_2_3,
                   DSFILE.DS_OUTBAL_1_2_3,
                   DSFILE.DS_UNITS_1_2_4,
                   DSFILE.DS_OUTBAL_1_2_4,
                   DSFILE.DS_UNITS_1_2_5,
                   DSFILE.DS_OUTBAL_1_2_5,
                   DSFILE.DS_UNITS_1_2_6,
                   DSFILE.DS_OUTBAL_1_2_6,
                   DSFILE.DS_UNITS_1_2_7,
                   DSFILE.DS_OUTBAL_1_2_7,
                   DSFILE.DS_UNITS_1_2_8,
                   DSFILE.DS_OUTBAL_1_2_8,
                   DSFILE.DS_UNITS_1_2_9,
                   DSFILE.DS_OUTBAL_1_2_9,
                   DSFILE.DS_UNITS_1_2_10,
                   DSFILE.DS_OUTBAL_1_2_10,
                   DSFILE.DS_UNITS_2_1_1,
                   DSFILE.DS_OUTBAL_2_1_1,
                   DSFILE.DS_UNITS_2_1_2,
                   DSFILE.DS_OUTBAL_2_1_2,
                   DSFILE.DS_UNITS_2_1_3,
                   DSFILE.DS_OUTBAL_2_1_3,
                   DSFILE.DS_UNITS_2_1_4,
                   DSFILE.DS_OUTBAL_2_1_4,
                   DSFILE.DS_UNITS_2_1_5,
                   DSFILE.DS_OUTBAL_2_1_5,
                   DSFILE.DS_UNITS_2_1_6,
                   DSFILE.DS_OUTBAL_2_1_6,
                   DSFILE.DS_UNITS_2_1_7,
                   DSFILE.DS_OUTBAL_2_1_7,
                   DSFILE.DS_UNITS_2_1_8,
                   DSFILE.DS_OUTBAL_2_1_8,
                   DSFILE.DS_UNITS_2_1_9,
                   DSFILE.DS_OUTBAL_2_1_9,
                   DSFILE.DS_UNITS_2_1_10,
                   DSFILE.DS_OUTBAL_2_1_10,
                   DSFILE.DS_UNITS_2_2_1,
                   DSFILE.DS_OUTBAL_2_2_1,
                   DSFILE.DS_UNITS_2_2_2,
                   DSFILE.DS_OUTBAL_2_2_2,
                   DSFILE.DS_UNITS_2_2_3,
                   DSFILE.DS_OUTBAL_2_2_3,
                   DSFILE.DS_UNITS_2_2_4,
                   DSFILE.DS_OUTBAL_2_2_4,
                   DSFILE.DS_UNITS_2_2_5,
                   DSFILE.DS_OUTBAL_2_2_5,
                   DSFILE.DS_UNITS_2_2_6,
                   DSFILE.DS_OUTBAL_2_2_6,
                   DSFILE.DS_UNITS_2_2_7,
                   DSFILE.DS_OUTBAL_2_2_7,
                   DSFILE.DS_UNITS_2_2_8,
                   DSFILE.DS_OUTBAL_2_2_8,
                   DSFILE.DS_UNITS_2_2_9,
                   DSFILE.DS_OUTBAL_2_2_9,
                   DSFILE.DS_UNITS_2_2_10,
                   DSFILE.DS_OUTBAL_2_2_10,
                   DSFILE.DS_UNITS_3_1_1,
                   DSFILE.DS_OUTBAL_3_1_1,
                   DSFILE.DS_UNITS_3_1_2,
                   DSFILE.DS_OUTBAL_3_1_2,
                   DSFILE.DS_UNITS_3_1_3,
                   DSFILE.DS_OUTBAL_3_1_3,
                   DSFILE.DS_UNITS_3_1_4,
                   DSFILE.DS_OUTBAL_3_1_4,
                   DSFILE.DS_UNITS_3_1_5,
                   DSFILE.DS_OUTBAL_3_1_5,
                   DSFILE.DS_UNITS_3_1_6,
                   DSFILE.DS_OUTBAL_3_1_6,
                   DSFILE.DS_UNITS_3_1_7,
                   DSFILE.DS_OUTBAL_3_1_7,
                   DSFILE.DS_UNITS_3_1_8,
                   DSFILE.DS_OUTBAL_3_1_8,
                   DSFILE.DS_UNITS_3_1_9,
                   DSFILE.DS_OUTBAL_3_1_9,
                   DSFILE.DS_UNITS_3_1_10,
                   DSFILE.DS_OUTBAL_3_1_10,
                   DSFILE.DS_UNITS_3_2_1,
                   DSFILE.DS_OUTBAL_3_2_1,
                   DSFILE.DS_UNITS_3_2_2,
                   DSFILE.DS_OUTBAL_3_2_2,
                   DSFILE.DS_UNITS_3_2_3,
                   DSFILE.DS_OUTBAL_3_2_3,
                   DSFILE.DS_UNITS_3_2_4,
                   DSFILE.DS_OUTBAL_3_2_4,
                   DSFILE.DS_UNITS_3_2_5,
                   DSFILE.DS_OUTBAL_3_2_5,
                   DSFILE.DS_UNITS_3_2_6,
                   DSFILE.DS_OUTBAL_3_2_6,
                   DSFILE.DS_UNITS_3_2_7,
                   DSFILE.DS_OUTBAL_3_2_7,
                   DSFILE.DS_UNITS_3_2_8,
                   DSFILE.DS_OUTBAL_3_2_8,
                   DSFILE.DS_UNITS_3_2_9,
                   DSFILE.DS_OUTBAL_3_2_9,
                   DSFILE.DS_UNITS_3_2_10,
                   DSFILE.DS_OUTBAL_3_2_10,
                   DSFILE.DS_UNITS_BNKRPT_1_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_1,
                   DSFILE.DS_UNITS_BNKRPT_1_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_2,
                   DSFILE.DS_UNITS_BNKRPT_1_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_3,
                   DSFILE.DS_UNITS_BNKRPT_1_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_4,
                   DSFILE.DS_UNITS_BNKRPT_1_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_5,
                   DSFILE.DS_UNITS_BNKRPT_1_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_6,
                   DSFILE.DS_UNITS_BNKRPT_1_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_7,
                   DSFILE.DS_UNITS_BNKRPT_1_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_8,
                   DSFILE.DS_UNITS_BNKRPT_1_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_9,
                   DSFILE.DS_UNITS_BNKRPT_1_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_10,
                   DSFILE.DS_UNITS_BNKRPT_1_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_1,
                   DSFILE.DS_UNITS_BNKRPT_1_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_2,
                   DSFILE.DS_UNITS_BNKRPT_1_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_3,
                   DSFILE.DS_UNITS_BNKRPT_1_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_4,
                   DSFILE.DS_UNITS_BNKRPT_1_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_5,
                   DSFILE.DS_UNITS_BNKRPT_1_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_6,
                   DSFILE.DS_UNITS_BNKRPT_1_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_7,
                   DSFILE.DS_UNITS_BNKRPT_1_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_8,
                   DSFILE.DS_UNITS_BNKRPT_1_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_9,
                   DSFILE.DS_UNITS_BNKRPT_1_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_10,
                   DSFILE.DS_UNITS_BNKRPT_2_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_1,
                   DSFILE.DS_UNITS_BNKRPT_2_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_2,
                   DSFILE.DS_UNITS_BNKRPT_2_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_3,
                   DSFILE.DS_UNITS_BNKRPT_2_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_4,
                   DSFILE.DS_UNITS_BNKRPT_2_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_5,
                   DSFILE.DS_UNITS_BNKRPT_2_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_6,
                   DSFILE.DS_UNITS_BNKRPT_2_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_7,
                   DSFILE.DS_UNITS_BNKRPT_2_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_8,
                   DSFILE.DS_UNITS_BNKRPT_2_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_9,
                   DSFILE.DS_UNITS_BNKRPT_2_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_10,
                   DSFILE.DS_UNITS_BNKRPT_2_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_1,
                   DSFILE.DS_UNITS_BNKRPT_2_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_2,
                   DSFILE.DS_UNITS_BNKRPT_2_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_3,
                   DSFILE.DS_UNITS_BNKRPT_2_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_4,
                   DSFILE.DS_UNITS_BNKRPT_2_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_5,
                   DSFILE.DS_UNITS_BNKRPT_2_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_6,
                   DSFILE.DS_UNITS_BNKRPT_2_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_7,
                   DSFILE.DS_UNITS_BNKRPT_2_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_8,
                   DSFILE.DS_UNITS_BNKRPT_2_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_9,
                   DSFILE.DS_UNITS_BNKRPT_2_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_10,
                   DSFILE.DS_UNITS_BNKRPT_3_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_1,
                   DSFILE.DS_UNITS_BNKRPT_3_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_2,
                   DSFILE.DS_UNITS_BNKRPT_3_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_3,
                   DSFILE.DS_UNITS_BNKRPT_3_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_4,
                   DSFILE.DS_UNITS_BNKRPT_3_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_5,
                   DSFILE.DS_UNITS_BNKRPT_3_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_6,
                   DSFILE.DS_UNITS_BNKRPT_3_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_7,
                   DSFILE.DS_UNITS_BNKRPT_3_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_8,
                   DSFILE.DS_UNITS_BNKRPT_3_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_9,
                   DSFILE.DS_UNITS_BNKRPT_3_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_10,
                   DSFILE.DS_UNITS_BNKRPT_3_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_1,
                   DSFILE.DS_UNITS_BNKRPT_3_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_2,
                   DSFILE.DS_UNITS_BNKRPT_3_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_3,
                   DSFILE.DS_UNITS_BNKRPT_3_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_4,
                   DSFILE.DS_UNITS_BNKRPT_3_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_5,
                   DSFILE.DS_UNITS_BNKRPT_3_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_6,
                   DSFILE.DS_UNITS_BNKRPT_3_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_7,
                   DSFILE.DS_UNITS_BNKRPT_3_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_8,
                   DSFILE.DS_UNITS_BNKRPT_3_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_9,
                   DSFILE.DS_UNITS_BNKRPT_3_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_10,
                   DSFILE.DS_UNEARNED_AMT_1_1_1,
                   DSFILE.DS_UNEARNED_AMT_1_1_2,
                   DSFILE.DS_UNEARNED_AMT_1_1_3,
                   DSFILE.DS_UNEARNED_AMT_1_1_4,
                   DSFILE.DS_UNEARNED_AMT_1_1_5,
                   DSFILE.DS_UNEARNED_AMT_1_1_6,
                   DSFILE.DS_UNEARNED_AMT_1_1_7,
                   DSFILE.DS_UNEARNED_AMT_1_1_8,
                   DSFILE.DS_UNEARNED_AMT_1_1_9,
                   DSFILE.DS_UNEARNED_AMT_1_1_10,
                   DSFILE.DS_UNEARNED_AMT_1_2_1,
                   DSFILE.DS_UNEARNED_AMT_1_2_2,
                   DSFILE.DS_UNEARNED_AMT_1_2_3,
                   DSFILE.DS_UNEARNED_AMT_1_2_4,
                   DSFILE.DS_UNEARNED_AMT_1_2_5,
                   DSFILE.DS_UNEARNED_AMT_1_2_6,
                   DSFILE.DS_UNEARNED_AMT_1_2_7,
                   DSFILE.DS_UNEARNED_AMT_1_2_8,
                   DSFILE.DS_UNEARNED_AMT_1_2_9,
                   DSFILE.DS_UNEARNED_AMT_1_2_10,
                   DSFILE.DS_UNEARNED_AMT_2_1_1,
                   DSFILE.DS_UNEARNED_AMT_2_1_2,
                   DSFILE.DS_UNEARNED_AMT_2_1_3,
                   DSFILE.DS_UNEARNED_AMT_2_1_4,
                   DSFILE.DS_UNEARNED_AMT_2_1_5,
                   DSFILE.DS_UNEARNED_AMT_2_1_6,
                   DSFILE.DS_UNEARNED_AMT_2_1_7,
                   DSFILE.DS_UNEARNED_AMT_2_1_8,
                   DSFILE.DS_UNEARNED_AMT_2_1_9,
                   DSFILE.DS_UNEARNED_AMT_2_1_10,
                   DSFILE.DS_UNEARNED_AMT_2_2_1,
                   DSFILE.DS_UNEARNED_AMT_2_2_2,
                   DSFILE.DS_UNEARNED_AMT_2_2_3,
                   DSFILE.DS_UNEARNED_AMT_2_2_4,
                   DSFILE.DS_UNEARNED_AMT_2_2_5,
                   DSFILE.DS_UNEARNED_AMT_2_2_6,
                   DSFILE.DS_UNEARNED_AMT_2_2_7,
                   DSFILE.DS_UNEARNED_AMT_2_2_8,
                   DSFILE.DS_UNEARNED_AMT_2_2_9,
                   DSFILE.DS_UNEARNED_AMT_2_2_10,
                   DSFILE.DS_UNEARNED_AMT_3_1_1,
                   DSFILE.DS_UNEARNED_AMT_3_1_2,
                   DSFILE.DS_UNEARNED_AMT_3_1_3,
                   DSFILE.DS_UNEARNED_AMT_3_1_4,
                   DSFILE.DS_UNEARNED_AMT_3_1_5,
                   DSFILE.DS_UNEARNED_AMT_3_1_6,
                   DSFILE.DS_UNEARNED_AMT_3_1_7,
                   DSFILE.DS_UNEARNED_AMT_3_1_8,
                   DSFILE.DS_UNEARNED_AMT_3_1_9,
                   DSFILE.DS_UNEARNED_AMT_3_1_10,
                   DSFILE.DS_UNEARNED_AMT_3_2_1,
                   DSFILE.DS_UNEARNED_AMT_3_2_2,
                   DSFILE.DS_UNEARNED_AMT_3_2_3,
                   DSFILE.DS_UNEARNED_AMT_3_2_4,
                   DSFILE.DS_UNEARNED_AMT_3_2_5,
                   DSFILE.DS_UNEARNED_AMT_3_2_6,
                   DSFILE.DS_UNEARNED_AMT_3_2_7,
                   DSFILE.DS_UNEARNED_AMT_3_2_8,
                   DSFILE.DS_UNEARNED_AMT_3_2_9,
                   DSFILE.DS_UNEARNED_AMT_3_2_10,
                   DSFILE.DS_DLDISC_VOL_1,
                   DSFILE.DS_DLDISC_VOL_2,
                   DSFILE.DS_DLDISC_VOL_3,
                   DSFILE.DS_AFPDUEDL_MEMO,
                   DSFILE.DS_UNPAID_MANUAL,
                   CAST(DSFILE.DS_LTOUCH_DATE
                                                  AS VARCHAR(10))
            FROM DBO.DSFILE
            WHERE DSFILE.DS_DATE_CCYYMM >= :QDS1-WBEG-DATE-CCYYMM
              AND DSFILE.DS_DATE_CCYYMM <= :QDS1-WEND-DATE-CCYYMM
              AND DSFILE.DS_BRANCH = :QDS1-WBEG-BRANCH
              AND DSFILE.DS_NUM >= :QDS1-WBEG-NUM
              AND DSFILE.DS_NUM <= :QDS1-WEND-NUM
              AND DSFILE.DS_CLASS >= :QDS1-WBEG-CLASS
              AND DSFILE.DS_CLASS <= :QDS1-WEND-CLASS
            ORDER BY DSFILE.DS_DATE_CCYYMM,
                     DSFILE.DS_BRANCH,
                     DSFILE.DS_NUM,
                     DSFILE.DS_CLASS
           END-EXEC.

           EXEC SQL
               OPEN DS1_CURSOR
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           MOVE ZEROES TO QDS1-WBEG-BRANCH 
                          QDS1-WEND-BRANCH
                          QDS1-WBEG-DATE-CCYYMM
                          QDS1-WEND-DATE-CCYYMM
                          QDS1-WBEG-NUM
                          QDS1-WEND-NUM
                          QDS1-WBEG-CLASS
                          QDS1-WEND-CLASS.
 
           MOVE STAT---GOOD TO DS1-CURSOR-STAT.

      *-----------------------------------------------------------------
       READ-DS1-FILE.
           PERFORM READ-IT.
           MOVE DS-PATH-OWNBR  TO DS-BRANCH. 
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.
           INITIALIZE QDS-REC. 

           MOVE DS-DATE-CCYYMM  TO QDS-DATE-CCYYMM.
           MOVE DS-BRANCH       TO QDS-BRANCH.
           MOVE DS-NUM          TO QDS-NUM.
           MOVE DS-CLASS        TO QDS-CLASS.

           EXEC SQL
            SELECT DSFILE.DS_DATE_CCYYMM,
                   DSFILE.DS_BRANCH,
                   DSFILE.DS_NUM,
                   DSFILE.DS_CLASS,
                   DSFILE.DS_DLRVPRIN_1,
                   DSFILE.DS_DLRVPRIN_2,
                   DSFILE.DS_DLRVPRIN_3,
                   DSFILE.DS_DLRVCHGS_1,
                   DSFILE.DS_DLRVCHGS_2,
                   DSFILE.DS_DLRVCHGS_3,
                   DSFILE.DS_DLPARVHELD,
                   DSFILE.DS_UNPAIDCK,
                   DSFILE.DS_DLDISC,
                   DSFILE.DS_DLPARVPAID,
                   DSFILE.DS_SUMWGTTM,
                   DSFILE.DS_SUMWGTAV,
                   DSFILE.DS_SUMWGTTA,
                   DSFILE.DS_RCOURSE_UNITS_1,
                   DSFILE.DS_RCOURSE_UNITS_2,
                   DSFILE.DS_RCOURSE_UNITS_3,
                   DSFILE.DS_RCOURSE_AMT_1,
                   DSFILE.DS_RCOURSE_AMT_2,
                   DSFILE.DS_RCOURSE_AMT_3,
                   DSFILE.DS_NPURUNIT_1,
                   DSFILE.DS_NPURUNIT_2,
                   DSFILE.DS_NPURUNIT_3,
                   DSFILE.DS_NPURAMT_1,
                   DSFILE.DS_NPURAMT_2,
                   DSFILE.DS_NPURAMT_3,
                   DSFILE.DS_OPURUNIT_1,
                   DSFILE.DS_OPURUNIT_2,
                   DSFILE.DS_OPURUNIT_3,
                   DSFILE.DS_OPURAMT_1,
                   DSFILE.DS_OPURAMT_2,
                   DSFILE.DS_OPURAMT_3,
                   DSFILE.DS_RNEWUNIT_1,
                   DSFILE.DS_RNEWUNIT_2,
                   DSFILE.DS_RNEWUNIT_3,
                   DSFILE.DS_RNEWAMT_1,
                   DSFILE.DS_RNEWAMT_2,
                   DSFILE.DS_RNEWAMT_3,
                   DSFILE.DS_PAIDUNIT_1,
                   DSFILE.DS_PAIDUNIT_2,
                   DSFILE.DS_PAIDUNIT_3,
                   DSFILE.DS_PAIDAMT_1,
                   DSFILE.DS_PAIDAMT_2,
                   DSFILE.DS_PAIDAMT_3,
                   DSFILE.DS_TODLUNIT_1,
                   DSFILE.DS_TODLUNIT_2,
                   DSFILE.DS_TODLUNIT_3,
                   DSFILE.DS_TODLAMT_1,
                   DSFILE.DS_TODLAMT_2,
                   DSFILE.DS_TODLAMT_3,
                   DSFILE.DS_OUTSUNIT_1,
                   DSFILE.DS_OUTSUNIT_2,
                   DSFILE.DS_OUTSUNIT_3,
                   DSFILE.DS_OUTSAMT_1,
                   DSFILE.DS_OUTSAMT_2,
                   DSFILE.DS_OUTSAMT_3,
                   DSFILE.DS_PLOSUNIT_1,
                   DSFILE.DS_PLOSUNIT_2,
                   DSFILE.DS_PLOSUNIT_3,
                   DSFILE.DS_PLOSAMT_1,
                   DSFILE.DS_PLOSAMT_2,
                   DSFILE.DS_PLOSAMT_3,
                   DSFILE.DS_RCPLUNIT_1,
                   DSFILE.DS_RCPLUNIT_2,
                   DSFILE.DS_RCPLUNIT_3,
                   DSFILE.DS_RCPLAMT_1,
                   DSFILE.DS_RCPLAMT_2,
                   DSFILE.DS_RCPLAMT_3,
                   DSFILE.DS_JDOSUNIT_1,
                   DSFILE.DS_JDOSUNIT_2,
                   DSFILE.DS_JDOSUNIT_3,
                   DSFILE.DS_JDOSAMT_1,
                   DSFILE.DS_JDOSAMT_2,
                   DSFILE.DS_JDOSAMT_3,
                   CAST(DSFILE.DS_DELUNEARN_DATE
                                                  AS VARCHAR(10)),
                   DSFILE.DS_PROCEEDS_1,
                   DSFILE.DS_PROCEEDS_2,
                   DSFILE.DS_NO_REPO_1_1_1,
                   DSFILE.DS_AMT_REPO_1_1_1,
                   DSFILE.DS_NO_REPO_1_1_2,
                   DSFILE.DS_AMT_REPO_1_1_2,
                   DSFILE.DS_NO_REPO_1_1_3,
                   DSFILE.DS_AMT_REPO_1_1_3,
                   DSFILE.DS_NO_REPO_1_1_4,
                   DSFILE.DS_AMT_REPO_1_1_4,
                   DSFILE.DS_NO_REPO_1_1_5,
                   DSFILE.DS_AMT_REPO_1_1_5,
                   DSFILE.DS_NO_REPO_1_2_1,
                   DSFILE.DS_AMT_REPO_1_2_1,
                   DSFILE.DS_NO_REPO_1_2_2,
                   DSFILE.DS_AMT_REPO_1_2_2,
                   DSFILE.DS_NO_REPO_1_2_3,
                   DSFILE.DS_AMT_REPO_1_2_3,
                   DSFILE.DS_NO_REPO_1_2_4,
                   DSFILE.DS_AMT_REPO_1_2_4,
                   DSFILE.DS_NO_REPO_1_2_5,
                   DSFILE.DS_AMT_REPO_1_2_5,
                   DSFILE.DS_NO_REPO_2_1_1,
                   DSFILE.DS_AMT_REPO_2_1_1,
                   DSFILE.DS_NO_REPO_2_1_2,
                   DSFILE.DS_AMT_REPO_2_1_2,
                   DSFILE.DS_NO_REPO_2_1_3,
                   DSFILE.DS_AMT_REPO_2_1_3,
                   DSFILE.DS_NO_REPO_2_1_4,
                   DSFILE.DS_AMT_REPO_2_1_4,
                   DSFILE.DS_NO_REPO_2_1_5,
                   DSFILE.DS_AMT_REPO_2_1_5,
                   DSFILE.DS_NO_REPO_2_2_1,
                   DSFILE.DS_AMT_REPO_2_2_1,
                   DSFILE.DS_NO_REPO_2_2_2,
                   DSFILE.DS_AMT_REPO_2_2_2,
                   DSFILE.DS_NO_REPO_2_2_3,
                   DSFILE.DS_AMT_REPO_2_2_3,
                   DSFILE.DS_NO_REPO_2_2_4,
                   DSFILE.DS_AMT_REPO_2_2_4,
                   DSFILE.DS_NO_REPO_2_2_5,
                   DSFILE.DS_AMT_REPO_2_2_5,
                   DSFILE.DS_NO_REPO_3_1_1,
                   DSFILE.DS_AMT_REPO_3_1_1,
                   DSFILE.DS_NO_REPO_3_1_2,
                   DSFILE.DS_AMT_REPO_3_1_2,
                   DSFILE.DS_NO_REPO_3_1_3,
                   DSFILE.DS_AMT_REPO_3_1_3,
                   DSFILE.DS_NO_REPO_3_1_4,
                   DSFILE.DS_AMT_REPO_3_1_4,
                   DSFILE.DS_NO_REPO_3_1_5,
                   DSFILE.DS_AMT_REPO_3_1_5,
                   DSFILE.DS_NO_REPO_3_2_1,
                   DSFILE.DS_AMT_REPO_3_2_1,
                   DSFILE.DS_NO_REPO_3_2_2,
                   DSFILE.DS_AMT_REPO_3_2_2,
                   DSFILE.DS_NO_REPO_3_2_3,
                   DSFILE.DS_AMT_REPO_3_2_3,
                   DSFILE.DS_NO_REPO_3_2_4,
                   DSFILE.DS_AMT_REPO_3_2_4,
                   DSFILE.DS_NO_REPO_3_2_5,
                   DSFILE.DS_AMT_REPO_3_2_5,
                   DSFILE.DS_UNITS_1_1_1,
                   DSFILE.DS_OUTBAL_1_1_1,
                   DSFILE.DS_UNITS_1_1_2,
                   DSFILE.DS_OUTBAL_1_1_2,
                   DSFILE.DS_UNITS_1_1_3,
                   DSFILE.DS_OUTBAL_1_1_3,
                   DSFILE.DS_UNITS_1_1_4,
                   DSFILE.DS_OUTBAL_1_1_4,
                   DSFILE.DS_UNITS_1_1_5,
                   DSFILE.DS_OUTBAL_1_1_5,
                   DSFILE.DS_UNITS_1_1_6,
                   DSFILE.DS_OUTBAL_1_1_6,
                   DSFILE.DS_UNITS_1_1_7,
                   DSFILE.DS_OUTBAL_1_1_7,
                   DSFILE.DS_UNITS_1_1_8,
                   DSFILE.DS_OUTBAL_1_1_8,
                   DSFILE.DS_UNITS_1_1_9,
                   DSFILE.DS_OUTBAL_1_1_9,
                   DSFILE.DS_UNITS_1_1_10,
                   DSFILE.DS_OUTBAL_1_1_10,
                   DSFILE.DS_UNITS_1_2_1,
                   DSFILE.DS_OUTBAL_1_2_1,
                   DSFILE.DS_UNITS_1_2_2,
                   DSFILE.DS_OUTBAL_1_2_2,
                   DSFILE.DS_UNITS_1_2_3,
                   DSFILE.DS_OUTBAL_1_2_3,
                   DSFILE.DS_UNITS_1_2_4,
                   DSFILE.DS_OUTBAL_1_2_4,
                   DSFILE.DS_UNITS_1_2_5,
                   DSFILE.DS_OUTBAL_1_2_5,
                   DSFILE.DS_UNITS_1_2_6,
                   DSFILE.DS_OUTBAL_1_2_6,
                   DSFILE.DS_UNITS_1_2_7,
                   DSFILE.DS_OUTBAL_1_2_7,
                   DSFILE.DS_UNITS_1_2_8,
                   DSFILE.DS_OUTBAL_1_2_8,
                   DSFILE.DS_UNITS_1_2_9,
                   DSFILE.DS_OUTBAL_1_2_9,
                   DSFILE.DS_UNITS_1_2_10,
                   DSFILE.DS_OUTBAL_1_2_10,
                   DSFILE.DS_UNITS_2_1_1,
                   DSFILE.DS_OUTBAL_2_1_1,
                   DSFILE.DS_UNITS_2_1_2,
                   DSFILE.DS_OUTBAL_2_1_2,
                   DSFILE.DS_UNITS_2_1_3,
                   DSFILE.DS_OUTBAL_2_1_3,
                   DSFILE.DS_UNITS_2_1_4,
                   DSFILE.DS_OUTBAL_2_1_4,
                   DSFILE.DS_UNITS_2_1_5,
                   DSFILE.DS_OUTBAL_2_1_5,
                   DSFILE.DS_UNITS_2_1_6,
                   DSFILE.DS_OUTBAL_2_1_6,
                   DSFILE.DS_UNITS_2_1_7,
                   DSFILE.DS_OUTBAL_2_1_7,
                   DSFILE.DS_UNITS_2_1_8,
                   DSFILE.DS_OUTBAL_2_1_8,
                   DSFILE.DS_UNITS_2_1_9,
                   DSFILE.DS_OUTBAL_2_1_9,
                   DSFILE.DS_UNITS_2_1_10,
                   DSFILE.DS_OUTBAL_2_1_10,
                   DSFILE.DS_UNITS_2_2_1,
                   DSFILE.DS_OUTBAL_2_2_1,
                   DSFILE.DS_UNITS_2_2_2,
                   DSFILE.DS_OUTBAL_2_2_2,
                   DSFILE.DS_UNITS_2_2_3,
                   DSFILE.DS_OUTBAL_2_2_3,
                   DSFILE.DS_UNITS_2_2_4,
                   DSFILE.DS_OUTBAL_2_2_4,
                   DSFILE.DS_UNITS_2_2_5,
                   DSFILE.DS_OUTBAL_2_2_5,
                   DSFILE.DS_UNITS_2_2_6,
                   DSFILE.DS_OUTBAL_2_2_6,
                   DSFILE.DS_UNITS_2_2_7,
                   DSFILE.DS_OUTBAL_2_2_7,
                   DSFILE.DS_UNITS_2_2_8,
                   DSFILE.DS_OUTBAL_2_2_8,
                   DSFILE.DS_UNITS_2_2_9,
                   DSFILE.DS_OUTBAL_2_2_9,
                   DSFILE.DS_UNITS_2_2_10,
                   DSFILE.DS_OUTBAL_2_2_10,
                   DSFILE.DS_UNITS_3_1_1,
                   DSFILE.DS_OUTBAL_3_1_1,
                   DSFILE.DS_UNITS_3_1_2,
                   DSFILE.DS_OUTBAL_3_1_2,
                   DSFILE.DS_UNITS_3_1_3,
                   DSFILE.DS_OUTBAL_3_1_3,
                   DSFILE.DS_UNITS_3_1_4,
                   DSFILE.DS_OUTBAL_3_1_4,
                   DSFILE.DS_UNITS_3_1_5,
                   DSFILE.DS_OUTBAL_3_1_5,
                   DSFILE.DS_UNITS_3_1_6,
                   DSFILE.DS_OUTBAL_3_1_6,
                   DSFILE.DS_UNITS_3_1_7,
                   DSFILE.DS_OUTBAL_3_1_7,
                   DSFILE.DS_UNITS_3_1_8,
                   DSFILE.DS_OUTBAL_3_1_8,
                   DSFILE.DS_UNITS_3_1_9,
                   DSFILE.DS_OUTBAL_3_1_9,
                   DSFILE.DS_UNITS_3_1_10,
                   DSFILE.DS_OUTBAL_3_1_10,
                   DSFILE.DS_UNITS_3_2_1,
                   DSFILE.DS_OUTBAL_3_2_1,
                   DSFILE.DS_UNITS_3_2_2,
                   DSFILE.DS_OUTBAL_3_2_2,
                   DSFILE.DS_UNITS_3_2_3,
                   DSFILE.DS_OUTBAL_3_2_3,
                   DSFILE.DS_UNITS_3_2_4,
                   DSFILE.DS_OUTBAL_3_2_4,
                   DSFILE.DS_UNITS_3_2_5,
                   DSFILE.DS_OUTBAL_3_2_5,
                   DSFILE.DS_UNITS_3_2_6,
                   DSFILE.DS_OUTBAL_3_2_6,
                   DSFILE.DS_UNITS_3_2_7,
                   DSFILE.DS_OUTBAL_3_2_7,
                   DSFILE.DS_UNITS_3_2_8,
                   DSFILE.DS_OUTBAL_3_2_8,
                   DSFILE.DS_UNITS_3_2_9,
                   DSFILE.DS_OUTBAL_3_2_9,
                   DSFILE.DS_UNITS_3_2_10,
                   DSFILE.DS_OUTBAL_3_2_10,
                   DSFILE.DS_UNITS_BNKRPT_1_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_1,
                   DSFILE.DS_UNITS_BNKRPT_1_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_2,
                   DSFILE.DS_UNITS_BNKRPT_1_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_3,
                   DSFILE.DS_UNITS_BNKRPT_1_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_4,
                   DSFILE.DS_UNITS_BNKRPT_1_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_5,
                   DSFILE.DS_UNITS_BNKRPT_1_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_6,
                   DSFILE.DS_UNITS_BNKRPT_1_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_7,
                   DSFILE.DS_UNITS_BNKRPT_1_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_8,
                   DSFILE.DS_UNITS_BNKRPT_1_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_9,
                   DSFILE.DS_UNITS_BNKRPT_1_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_1_10,
                   DSFILE.DS_UNITS_BNKRPT_1_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_1,
                   DSFILE.DS_UNITS_BNKRPT_1_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_2,
                   DSFILE.DS_UNITS_BNKRPT_1_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_3,
                   DSFILE.DS_UNITS_BNKRPT_1_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_4,
                   DSFILE.DS_UNITS_BNKRPT_1_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_5,
                   DSFILE.DS_UNITS_BNKRPT_1_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_6,
                   DSFILE.DS_UNITS_BNKRPT_1_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_7,
                   DSFILE.DS_UNITS_BNKRPT_1_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_8,
                   DSFILE.DS_UNITS_BNKRPT_1_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_9,
                   DSFILE.DS_UNITS_BNKRPT_1_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_1_2_10,
                   DSFILE.DS_UNITS_BNKRPT_2_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_1,
                   DSFILE.DS_UNITS_BNKRPT_2_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_2,
                   DSFILE.DS_UNITS_BNKRPT_2_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_3,
                   DSFILE.DS_UNITS_BNKRPT_2_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_4,
                   DSFILE.DS_UNITS_BNKRPT_2_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_5,
                   DSFILE.DS_UNITS_BNKRPT_2_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_6,
                   DSFILE.DS_UNITS_BNKRPT_2_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_7,
                   DSFILE.DS_UNITS_BNKRPT_2_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_8,
                   DSFILE.DS_UNITS_BNKRPT_2_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_9,
                   DSFILE.DS_UNITS_BNKRPT_2_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_1_10,
                   DSFILE.DS_UNITS_BNKRPT_2_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_1,
                   DSFILE.DS_UNITS_BNKRPT_2_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_2,
                   DSFILE.DS_UNITS_BNKRPT_2_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_3,
                   DSFILE.DS_UNITS_BNKRPT_2_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_4,
                   DSFILE.DS_UNITS_BNKRPT_2_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_5,
                   DSFILE.DS_UNITS_BNKRPT_2_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_6,
                   DSFILE.DS_UNITS_BNKRPT_2_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_7,
                   DSFILE.DS_UNITS_BNKRPT_2_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_8,
                   DSFILE.DS_UNITS_BNKRPT_2_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_9,
                   DSFILE.DS_UNITS_BNKRPT_2_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_2_2_10,
                   DSFILE.DS_UNITS_BNKRPT_3_1_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_1,
                   DSFILE.DS_UNITS_BNKRPT_3_1_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_2,
                   DSFILE.DS_UNITS_BNKRPT_3_1_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_3,
                   DSFILE.DS_UNITS_BNKRPT_3_1_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_4,
                   DSFILE.DS_UNITS_BNKRPT_3_1_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_5,
                   DSFILE.DS_UNITS_BNKRPT_3_1_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_6,
                   DSFILE.DS_UNITS_BNKRPT_3_1_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_7,
                   DSFILE.DS_UNITS_BNKRPT_3_1_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_8,
                   DSFILE.DS_UNITS_BNKRPT_3_1_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_9,
                   DSFILE.DS_UNITS_BNKRPT_3_1_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_1_10,
                   DSFILE.DS_UNITS_BNKRPT_3_2_1,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_1,
                   DSFILE.DS_UNITS_BNKRPT_3_2_2,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_2,
                   DSFILE.DS_UNITS_BNKRPT_3_2_3,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_3,
                   DSFILE.DS_UNITS_BNKRPT_3_2_4,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_4,
                   DSFILE.DS_UNITS_BNKRPT_3_2_5,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_5,
                   DSFILE.DS_UNITS_BNKRPT_3_2_6,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_6,
                   DSFILE.DS_UNITS_BNKRPT_3_2_7,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_7,
                   DSFILE.DS_UNITS_BNKRPT_3_2_8,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_8,
                   DSFILE.DS_UNITS_BNKRPT_3_2_9,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_9,
                   DSFILE.DS_UNITS_BNKRPT_3_2_10,
                   DSFILE.DS_OUTBAL_BNKRPT_3_2_10,
                   DSFILE.DS_UNEARNED_AMT_1_1_1,
                   DSFILE.DS_UNEARNED_AMT_1_1_2,
                   DSFILE.DS_UNEARNED_AMT_1_1_3,
                   DSFILE.DS_UNEARNED_AMT_1_1_4,
                   DSFILE.DS_UNEARNED_AMT_1_1_5,
                   DSFILE.DS_UNEARNED_AMT_1_1_6,
                   DSFILE.DS_UNEARNED_AMT_1_1_7,
                   DSFILE.DS_UNEARNED_AMT_1_1_8,
                   DSFILE.DS_UNEARNED_AMT_1_1_9,
                   DSFILE.DS_UNEARNED_AMT_1_1_10,
                   DSFILE.DS_UNEARNED_AMT_1_2_1,
                   DSFILE.DS_UNEARNED_AMT_1_2_2,
                   DSFILE.DS_UNEARNED_AMT_1_2_3,
                   DSFILE.DS_UNEARNED_AMT_1_2_4,
                   DSFILE.DS_UNEARNED_AMT_1_2_5,
                   DSFILE.DS_UNEARNED_AMT_1_2_6,
                   DSFILE.DS_UNEARNED_AMT_1_2_7,
                   DSFILE.DS_UNEARNED_AMT_1_2_8,
                   DSFILE.DS_UNEARNED_AMT_1_2_9,
                   DSFILE.DS_UNEARNED_AMT_1_2_10,
                   DSFILE.DS_UNEARNED_AMT_2_1_1,
                   DSFILE.DS_UNEARNED_AMT_2_1_2,
                   DSFILE.DS_UNEARNED_AMT_2_1_3,
                   DSFILE.DS_UNEARNED_AMT_2_1_4,
                   DSFILE.DS_UNEARNED_AMT_2_1_5,
                   DSFILE.DS_UNEARNED_AMT_2_1_6,
                   DSFILE.DS_UNEARNED_AMT_2_1_7,
                   DSFILE.DS_UNEARNED_AMT_2_1_8,
                   DSFILE.DS_UNEARNED_AMT_2_1_9,
                   DSFILE.DS_UNEARNED_AMT_2_1_10,
                   DSFILE.DS_UNEARNED_AMT_2_2_1,
                   DSFILE.DS_UNEARNED_AMT_2_2_2,
                   DSFILE.DS_UNEARNED_AMT_2_2_3,
                   DSFILE.DS_UNEARNED_AMT_2_2_4,
                   DSFILE.DS_UNEARNED_AMT_2_2_5,
                   DSFILE.DS_UNEARNED_AMT_2_2_6,
                   DSFILE.DS_UNEARNED_AMT_2_2_7,
                   DSFILE.DS_UNEARNED_AMT_2_2_8,
                   DSFILE.DS_UNEARNED_AMT_2_2_9,
                   DSFILE.DS_UNEARNED_AMT_2_2_10,
                   DSFILE.DS_UNEARNED_AMT_3_1_1,
                   DSFILE.DS_UNEARNED_AMT_3_1_2,
                   DSFILE.DS_UNEARNED_AMT_3_1_3,
                   DSFILE.DS_UNEARNED_AMT_3_1_4,
                   DSFILE.DS_UNEARNED_AMT_3_1_5,
                   DSFILE.DS_UNEARNED_AMT_3_1_6,
                   DSFILE.DS_UNEARNED_AMT_3_1_7,
                   DSFILE.DS_UNEARNED_AMT_3_1_8,
                   DSFILE.DS_UNEARNED_AMT_3_1_9,
                   DSFILE.DS_UNEARNED_AMT_3_1_10,
                   DSFILE.DS_UNEARNED_AMT_3_2_1,
                   DSFILE.DS_UNEARNED_AMT_3_2_2,
                   DSFILE.DS_UNEARNED_AMT_3_2_3,
                   DSFILE.DS_UNEARNED_AMT_3_2_4,
                   DSFILE.DS_UNEARNED_AMT_3_2_5,
                   DSFILE.DS_UNEARNED_AMT_3_2_6,
                   DSFILE.DS_UNEARNED_AMT_3_2_7,
                   DSFILE.DS_UNEARNED_AMT_3_2_8,
                   DSFILE.DS_UNEARNED_AMT_3_2_9,
                   DSFILE.DS_UNEARNED_AMT_3_2_10,
                   DSFILE.DS_DLDISC_VOL_1,
                   DSFILE.DS_DLDISC_VOL_2,
                   DSFILE.DS_DLDISC_VOL_3,
                   DSFILE.DS_AFPDUEDL_MEMO,
                   DSFILE.DS_UNPAID_MANUAL,
                   CAST(DSFILE.DS_LTOUCH_DATE
                                                  AS VARCHAR(10))
            INTO :QDS-REC
            FROM DBO.DSFILE
            WHERE DSFILE.DS_DATE_CCYYMM = :QDS-DATE-CCYYMM
              AND DSFILE.DS_BRANCH = :QDS-BRANCH
              AND DSFILE.DS_NUM = :QDS-NUM
              AND DSFILE.DS_CLASS = :QDS-CLASS
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-DS1-FILE.

           IF ( IO-FG = 0 )
              PERFORM GET-DS-FIELDS.

      *-----------------------------------------------------------------
       READ-DS1-FILE-NEXT.
           PERFORM READ-IT.
           MOVE DS-PATH-OWNBR  TO DS-BRANCH.
           MOVE DS-PATH-SQL    TO E-FILE.
           MOVE DS1-KEY        TO E-KEYX.
           INITIALIZE QDS-REC.

           IF ( DS1-CURSOR-STAT-GOOD )
              EXEC SQL
                   FETCH DS1_CURSOR INTO :QDS-REC
              END-EXEC
           ELSE
              MOVE 9        TO SQLCODE
              MOVE "RDNXCR" TO SQLSTATE.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-DS1-FILE-NEXT.

           IF ( IO-FG = 0 )
              PERFORM GET-DS-FIELDS.

      *-----------------------------------------------------------------
       CLOSE-DS1-FILE.

           PERFORM CLOSE-IT.
           IF ( DS1-CURSOR-STAT-GOOD )
              EXEC SQL
                   CLOSE DS1_CURSOR
              END-EXEC
              MOVE STAT---BAD TO DS1-CURSOR-STAT.

