      * COPYMEMBER: LIBLP/LPDUEDAW
      *--------------------------------------------------------
      *    DUE DATE CHANGE RESTRICTION WORKERS
      * REV:
      *--------------------------------------------------------
       01  DUEDA-WORKERS.
           03  DUEDA-TRANS-DATE    PIC 9(8)    COMP.
           03  DUEDA-ALLOWED       PIC X.
