      * COPYMEMBER: LIBLP/LPEDAYW
      *-------------------------------------------------------
      *                LPEDAYW
      *   EXTENSION/GRACE DAY CALCULATION WORKERS
      * REV:
      *  JTG 051089 CHANGED WORKERS TO COMP
      *  JTG 043090 ADDED EDAY-MONTHS
      *-------------------------------------------------------
       01  EDAY-EXTDAYS        PIC S9(3)  COMP VALUE 0.
       01  EDAY-GRACEDAYS      PIC S9(3)  COMP VALUE 0.
       01  EDAY-MONTHS         PIC S9(3)  COMP VALUE 0.
