      * COPYMEMBER: LIBLP/LPESGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - ESFILE
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD ES-REC FROM QES-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-ES-FIELDS.
           MOVE QES-BRNO TO ES-BRNO.
           MOVE QES-ACCTNO TO ES-ACCTNO.

           IF ( QES-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO ES-LTOUCH-DATE
           ELSE
              MOVE QES-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-LTOUCH-DATE.


           IF ( QES-SCHD-EFF-DATE-1 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(1)
           ELSE
              MOVE QES-SCHD-EFF-DATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(1).


           IF ( QES-SCHD-1STPYDATE-1 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(1)
           ELSE
              MOVE QES-SCHD-1STPYDATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(1).

           MOVE QES-SCHD-ESCROW-1 TO ES-SCHD-ESCROW(1).
           MOVE QES-SCHD-TERM-1 TO ES-SCHD-TERM(1).
           MOVE QES-SCHD-COLLECTED-1 TO ES-SCHD-COLLECTED(1).

           IF ( QES-SCHD-EFF-DATE-2 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(2)
           ELSE
              MOVE QES-SCHD-EFF-DATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(2).


           IF ( QES-SCHD-1STPYDATE-2 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(2)
           ELSE
              MOVE QES-SCHD-1STPYDATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(2).

           MOVE QES-SCHD-ESCROW-2 TO ES-SCHD-ESCROW(2).
           MOVE QES-SCHD-TERM-2 TO ES-SCHD-TERM(2).
           MOVE QES-SCHD-COLLECTED-2 TO ES-SCHD-COLLECTED(2).

           IF ( QES-SCHD-EFF-DATE-3 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(3)
           ELSE
              MOVE QES-SCHD-EFF-DATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(3).


           IF ( QES-SCHD-1STPYDATE-3 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(3)
           ELSE
              MOVE QES-SCHD-1STPYDATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(3).

           MOVE QES-SCHD-ESCROW-3 TO ES-SCHD-ESCROW(3).
           MOVE QES-SCHD-TERM-3 TO ES-SCHD-TERM(3).
           MOVE QES-SCHD-COLLECTED-3 TO ES-SCHD-COLLECTED(3).

           IF ( QES-SCHD-EFF-DATE-4 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(4)
           ELSE
              MOVE QES-SCHD-EFF-DATE-4 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(4).


           IF ( QES-SCHD-1STPYDATE-4 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(4)
           ELSE
              MOVE QES-SCHD-1STPYDATE-4 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(4).

           MOVE QES-SCHD-ESCROW-4 TO ES-SCHD-ESCROW(4).
           MOVE QES-SCHD-TERM-4 TO ES-SCHD-TERM(4).
           MOVE QES-SCHD-COLLECTED-4 TO ES-SCHD-COLLECTED(4).

           IF ( QES-SCHD-EFF-DATE-5 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(5)
           ELSE
              MOVE QES-SCHD-EFF-DATE-5 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(5).


           IF ( QES-SCHD-1STPYDATE-5 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(5)
           ELSE
              MOVE QES-SCHD-1STPYDATE-5 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(5).

           MOVE QES-SCHD-ESCROW-5 TO ES-SCHD-ESCROW(5).
           MOVE QES-SCHD-TERM-5 TO ES-SCHD-TERM(5).
           MOVE QES-SCHD-COLLECTED-5 TO ES-SCHD-COLLECTED(5).

           IF ( QES-SCHD-EFF-DATE-6 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(6)
           ELSE
              MOVE QES-SCHD-EFF-DATE-6 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(6).


           IF ( QES-SCHD-1STPYDATE-6 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(6)
           ELSE
              MOVE QES-SCHD-1STPYDATE-6 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(6).

           MOVE QES-SCHD-ESCROW-6 TO ES-SCHD-ESCROW(6).
           MOVE QES-SCHD-TERM-6 TO ES-SCHD-TERM(6).
           MOVE QES-SCHD-COLLECTED-6 TO ES-SCHD-COLLECTED(6).

           IF ( QES-SCHD-EFF-DATE-7 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(7)
           ELSE
              MOVE QES-SCHD-EFF-DATE-7 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(7).


           IF ( QES-SCHD-1STPYDATE-7 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(7)
           ELSE
              MOVE QES-SCHD-1STPYDATE-7 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(7).

           MOVE QES-SCHD-ESCROW-7 TO ES-SCHD-ESCROW(7).
           MOVE QES-SCHD-TERM-7 TO ES-SCHD-TERM(7).
           MOVE QES-SCHD-COLLECTED-7 TO ES-SCHD-COLLECTED(7).

           IF ( QES-SCHD-EFF-DATE-8 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(8)
           ELSE
              MOVE QES-SCHD-EFF-DATE-8 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(8).


           IF ( QES-SCHD-1STPYDATE-8 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(8)
           ELSE
              MOVE QES-SCHD-1STPYDATE-8 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(8).

           MOVE QES-SCHD-ESCROW-8 TO ES-SCHD-ESCROW(8).
           MOVE QES-SCHD-TERM-8 TO ES-SCHD-TERM(8).
           MOVE QES-SCHD-COLLECTED-8 TO ES-SCHD-COLLECTED(8).

           IF ( QES-SCHD-EFF-DATE-9 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(9)
           ELSE
              MOVE QES-SCHD-EFF-DATE-9 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(9).


           IF ( QES-SCHD-1STPYDATE-9 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(9)
           ELSE
              MOVE QES-SCHD-1STPYDATE-9 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(9).

           MOVE QES-SCHD-ESCROW-9 TO ES-SCHD-ESCROW(9).
           MOVE QES-SCHD-TERM-9 TO ES-SCHD-TERM(9).
           MOVE QES-SCHD-COLLECTED-9 TO ES-SCHD-COLLECTED(9).

           IF ( QES-SCHD-EFF-DATE-10 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(10)
           ELSE
              MOVE QES-SCHD-EFF-DATE-10 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(10).


           IF ( QES-SCHD-1STPYDATE-10 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(10)
           ELSE
              MOVE QES-SCHD-1STPYDATE-10 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(10).

           MOVE QES-SCHD-ESCROW-10 TO ES-SCHD-ESCROW(10).
           MOVE QES-SCHD-TERM-10 TO ES-SCHD-TERM(10).
           MOVE QES-SCHD-COLLECTED-10 TO ES-SCHD-COLLECTED(10).

           IF ( QES-SCHD-EFF-DATE-11 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(11)
           ELSE
              MOVE QES-SCHD-EFF-DATE-11 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(11).


           IF ( QES-SCHD-1STPYDATE-11 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(11)
           ELSE
              MOVE QES-SCHD-1STPYDATE-11 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(11).

           MOVE QES-SCHD-ESCROW-11 TO ES-SCHD-ESCROW(11).
           MOVE QES-SCHD-TERM-11 TO ES-SCHD-TERM(11).
           MOVE QES-SCHD-COLLECTED-11 TO ES-SCHD-COLLECTED(11).

           IF ( QES-SCHD-EFF-DATE-12 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(12)
           ELSE
              MOVE QES-SCHD-EFF-DATE-12 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(12).


           IF ( QES-SCHD-1STPYDATE-12 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(12)
           ELSE
              MOVE QES-SCHD-1STPYDATE-12 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(12).

           MOVE QES-SCHD-ESCROW-12 TO ES-SCHD-ESCROW(12).
           MOVE QES-SCHD-TERM-12 TO ES-SCHD-TERM(12).
           MOVE QES-SCHD-COLLECTED-12 TO ES-SCHD-COLLECTED(12).

           IF ( QES-SCHD-EFF-DATE-13 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(13)
           ELSE
              MOVE QES-SCHD-EFF-DATE-13 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(13).


           IF ( QES-SCHD-1STPYDATE-13 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(13)
           ELSE
              MOVE QES-SCHD-1STPYDATE-13 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(13).

           MOVE QES-SCHD-ESCROW-13 TO ES-SCHD-ESCROW(13).
           MOVE QES-SCHD-TERM-13 TO ES-SCHD-TERM(13).
           MOVE QES-SCHD-COLLECTED-13 TO ES-SCHD-COLLECTED(13).

           IF ( QES-SCHD-EFF-DATE-14 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(14)
           ELSE
              MOVE QES-SCHD-EFF-DATE-14 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(14).


           IF ( QES-SCHD-1STPYDATE-14 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(14)
           ELSE
              MOVE QES-SCHD-1STPYDATE-14 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(14).

           MOVE QES-SCHD-ESCROW-14 TO ES-SCHD-ESCROW(14).
           MOVE QES-SCHD-TERM-14 TO ES-SCHD-TERM(14).
           MOVE QES-SCHD-COLLECTED-14 TO ES-SCHD-COLLECTED(14).

           IF ( QES-SCHD-EFF-DATE-15 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(15)
           ELSE
              MOVE QES-SCHD-EFF-DATE-15 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(15).


           IF ( QES-SCHD-1STPYDATE-15 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(15)
           ELSE
              MOVE QES-SCHD-1STPYDATE-15 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(15).

           MOVE QES-SCHD-ESCROW-15 TO ES-SCHD-ESCROW(15).
           MOVE QES-SCHD-TERM-15 TO ES-SCHD-TERM(15).
           MOVE QES-SCHD-COLLECTED-15 TO ES-SCHD-COLLECTED(15).

           IF ( QES-SCHD-EFF-DATE-16 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(16)
           ELSE
              MOVE QES-SCHD-EFF-DATE-16 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(16).


           IF ( QES-SCHD-1STPYDATE-16 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(16)
           ELSE
              MOVE QES-SCHD-1STPYDATE-16 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(16).

           MOVE QES-SCHD-ESCROW-16 TO ES-SCHD-ESCROW(16).
           MOVE QES-SCHD-TERM-16 TO ES-SCHD-TERM(16).
           MOVE QES-SCHD-COLLECTED-16 TO ES-SCHD-COLLECTED(16).

           IF ( QES-SCHD-EFF-DATE-17 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(17)
           ELSE
              MOVE QES-SCHD-EFF-DATE-17 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(17).


           IF ( QES-SCHD-1STPYDATE-17 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(17)
           ELSE
              MOVE QES-SCHD-1STPYDATE-17 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(17).

           MOVE QES-SCHD-ESCROW-17 TO ES-SCHD-ESCROW(17).
           MOVE QES-SCHD-TERM-17 TO ES-SCHD-TERM(17).
           MOVE QES-SCHD-COLLECTED-17 TO ES-SCHD-COLLECTED(17).

           IF ( QES-SCHD-EFF-DATE-18 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(18)
           ELSE
              MOVE QES-SCHD-EFF-DATE-18 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(18).


           IF ( QES-SCHD-1STPYDATE-18 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(18)
           ELSE
              MOVE QES-SCHD-1STPYDATE-18 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(18).

           MOVE QES-SCHD-ESCROW-18 TO ES-SCHD-ESCROW(18).
           MOVE QES-SCHD-TERM-18 TO ES-SCHD-TERM(18).
           MOVE QES-SCHD-COLLECTED-18 TO ES-SCHD-COLLECTED(18).

           IF ( QES-SCHD-EFF-DATE-19 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(19)
           ELSE
              MOVE QES-SCHD-EFF-DATE-19 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(19).


           IF ( QES-SCHD-1STPYDATE-19 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(19)
           ELSE
              MOVE QES-SCHD-1STPYDATE-19 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(19).

           MOVE QES-SCHD-ESCROW-19 TO ES-SCHD-ESCROW(19).
           MOVE QES-SCHD-TERM-19 TO ES-SCHD-TERM(19).
           MOVE QES-SCHD-COLLECTED-19 TO ES-SCHD-COLLECTED(19).

           IF ( QES-SCHD-EFF-DATE-20 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(20)
           ELSE
              MOVE QES-SCHD-EFF-DATE-20 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(20).


           IF ( QES-SCHD-1STPYDATE-20 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(20)
           ELSE
              MOVE QES-SCHD-1STPYDATE-20 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(20).

           MOVE QES-SCHD-ESCROW-20 TO ES-SCHD-ESCROW(20).
           MOVE QES-SCHD-TERM-20 TO ES-SCHD-TERM(20).
           MOVE QES-SCHD-COLLECTED-20 TO ES-SCHD-COLLECTED(20).

           IF ( QES-SCHD-EFF-DATE-21 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(21)
           ELSE
              MOVE QES-SCHD-EFF-DATE-21 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(21).


           IF ( QES-SCHD-1STPYDATE-21 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(21)
           ELSE
              MOVE QES-SCHD-1STPYDATE-21 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(21).

           MOVE QES-SCHD-ESCROW-21 TO ES-SCHD-ESCROW(21).
           MOVE QES-SCHD-TERM-21 TO ES-SCHD-TERM(21).
           MOVE QES-SCHD-COLLECTED-21 TO ES-SCHD-COLLECTED(21).

           IF ( QES-SCHD-EFF-DATE-22 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(22)
           ELSE
              MOVE QES-SCHD-EFF-DATE-22 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(22).


           IF ( QES-SCHD-1STPYDATE-22 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(22)
           ELSE
              MOVE QES-SCHD-1STPYDATE-22 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(22).

           MOVE QES-SCHD-ESCROW-22 TO ES-SCHD-ESCROW(22).
           MOVE QES-SCHD-TERM-22 TO ES-SCHD-TERM(22).
           MOVE QES-SCHD-COLLECTED-22 TO ES-SCHD-COLLECTED(22).

           IF ( QES-SCHD-EFF-DATE-23 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(23)
           ELSE
              MOVE QES-SCHD-EFF-DATE-23 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(23).


           IF ( QES-SCHD-1STPYDATE-23 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(23)
           ELSE
              MOVE QES-SCHD-1STPYDATE-23 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(23).

           MOVE QES-SCHD-ESCROW-23 TO ES-SCHD-ESCROW(23).
           MOVE QES-SCHD-TERM-23 TO ES-SCHD-TERM(23).
           MOVE QES-SCHD-COLLECTED-23 TO ES-SCHD-COLLECTED(23).

           IF ( QES-SCHD-EFF-DATE-24 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(24)
           ELSE
              MOVE QES-SCHD-EFF-DATE-24 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(24).


           IF ( QES-SCHD-1STPYDATE-24 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(24)
           ELSE
              MOVE QES-SCHD-1STPYDATE-24 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(24).

           MOVE QES-SCHD-ESCROW-24 TO ES-SCHD-ESCROW(24).
           MOVE QES-SCHD-TERM-24 TO ES-SCHD-TERM(24).
           MOVE QES-SCHD-COLLECTED-24 TO ES-SCHD-COLLECTED(24).

           IF ( QES-SCHD-EFF-DATE-25 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(25)
           ELSE
              MOVE QES-SCHD-EFF-DATE-25 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(25).


           IF ( QES-SCHD-1STPYDATE-25 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(25)
           ELSE
              MOVE QES-SCHD-1STPYDATE-25 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(25).

           MOVE QES-SCHD-ESCROW-25 TO ES-SCHD-ESCROW(25).
           MOVE QES-SCHD-TERM-25 TO ES-SCHD-TERM(25).
           MOVE QES-SCHD-COLLECTED-25 TO ES-SCHD-COLLECTED(25).

           IF ( QES-SCHD-EFF-DATE-26 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(26)
           ELSE
              MOVE QES-SCHD-EFF-DATE-26 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(26).


           IF ( QES-SCHD-1STPYDATE-26 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(26)
           ELSE
              MOVE QES-SCHD-1STPYDATE-26 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(26).

           MOVE QES-SCHD-ESCROW-26 TO ES-SCHD-ESCROW(26).
           MOVE QES-SCHD-TERM-26 TO ES-SCHD-TERM(26).
           MOVE QES-SCHD-COLLECTED-26 TO ES-SCHD-COLLECTED(26).

           IF ( QES-SCHD-EFF-DATE-27 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(27)
           ELSE
              MOVE QES-SCHD-EFF-DATE-27 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(27).


           IF ( QES-SCHD-1STPYDATE-27 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(27)
           ELSE
              MOVE QES-SCHD-1STPYDATE-27 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(27).

           MOVE QES-SCHD-ESCROW-27 TO ES-SCHD-ESCROW(27).
           MOVE QES-SCHD-TERM-27 TO ES-SCHD-TERM(27).
           MOVE QES-SCHD-COLLECTED-27 TO ES-SCHD-COLLECTED(27).

           IF ( QES-SCHD-EFF-DATE-28 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(28)
           ELSE
              MOVE QES-SCHD-EFF-DATE-28 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(28).


           IF ( QES-SCHD-1STPYDATE-28 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(28)
           ELSE
              MOVE QES-SCHD-1STPYDATE-28 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(28).

           MOVE QES-SCHD-ESCROW-28 TO ES-SCHD-ESCROW(28).
           MOVE QES-SCHD-TERM-28 TO ES-SCHD-TERM(28).
           MOVE QES-SCHD-COLLECTED-28 TO ES-SCHD-COLLECTED(28).

           IF ( QES-SCHD-EFF-DATE-29 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(29)
           ELSE
              MOVE QES-SCHD-EFF-DATE-29 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(29).


           IF ( QES-SCHD-1STPYDATE-29 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(29)
           ELSE
              MOVE QES-SCHD-1STPYDATE-29 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(29).

           MOVE QES-SCHD-ESCROW-29 TO ES-SCHD-ESCROW(29).
           MOVE QES-SCHD-TERM-29 TO ES-SCHD-TERM(29).
           MOVE QES-SCHD-COLLECTED-29 TO ES-SCHD-COLLECTED(29).

           IF ( QES-SCHD-EFF-DATE-30 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(30)
           ELSE
              MOVE QES-SCHD-EFF-DATE-30 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(30).


           IF ( QES-SCHD-1STPYDATE-30 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(30)
           ELSE
              MOVE QES-SCHD-1STPYDATE-30 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(30).

           MOVE QES-SCHD-ESCROW-30 TO ES-SCHD-ESCROW(30).
           MOVE QES-SCHD-TERM-30 TO ES-SCHD-TERM(30).
           MOVE QES-SCHD-COLLECTED-30 TO ES-SCHD-COLLECTED(30).

           IF ( QES-SCHD-EFF-DATE-31 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(31)
           ELSE
              MOVE QES-SCHD-EFF-DATE-31 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(31).


           IF ( QES-SCHD-1STPYDATE-31 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(31)
           ELSE
              MOVE QES-SCHD-1STPYDATE-31 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(31).

           MOVE QES-SCHD-ESCROW-31 TO ES-SCHD-ESCROW(31).
           MOVE QES-SCHD-TERM-31 TO ES-SCHD-TERM(31).
           MOVE QES-SCHD-COLLECTED-31 TO ES-SCHD-COLLECTED(31).

           IF ( QES-SCHD-EFF-DATE-32 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(32)
           ELSE
              MOVE QES-SCHD-EFF-DATE-32 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(32).


           IF ( QES-SCHD-1STPYDATE-32 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(32)
           ELSE
              MOVE QES-SCHD-1STPYDATE-32 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(32).

           MOVE QES-SCHD-ESCROW-32 TO ES-SCHD-ESCROW(32).
           MOVE QES-SCHD-TERM-32 TO ES-SCHD-TERM(32).
           MOVE QES-SCHD-COLLECTED-32 TO ES-SCHD-COLLECTED(32).

           IF ( QES-SCHD-EFF-DATE-33 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(33)
           ELSE
              MOVE QES-SCHD-EFF-DATE-33 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(33).


           IF ( QES-SCHD-1STPYDATE-33 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(33)
           ELSE
              MOVE QES-SCHD-1STPYDATE-33 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(33).

           MOVE QES-SCHD-ESCROW-33 TO ES-SCHD-ESCROW(33).
           MOVE QES-SCHD-TERM-33 TO ES-SCHD-TERM(33).
           MOVE QES-SCHD-COLLECTED-33 TO ES-SCHD-COLLECTED(33).

           IF ( QES-SCHD-EFF-DATE-34 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(34)
           ELSE
              MOVE QES-SCHD-EFF-DATE-34 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(34).


           IF ( QES-SCHD-1STPYDATE-34 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(34)
           ELSE
              MOVE QES-SCHD-1STPYDATE-34 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(34).

           MOVE QES-SCHD-ESCROW-34 TO ES-SCHD-ESCROW(34).
           MOVE QES-SCHD-TERM-34 TO ES-SCHD-TERM(34).
           MOVE QES-SCHD-COLLECTED-34 TO ES-SCHD-COLLECTED(34).

           IF ( QES-SCHD-EFF-DATE-35 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(35)
           ELSE
              MOVE QES-SCHD-EFF-DATE-35 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(35).


           IF ( QES-SCHD-1STPYDATE-35 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(35)
           ELSE
              MOVE QES-SCHD-1STPYDATE-35 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(35).

           MOVE QES-SCHD-ESCROW-35 TO ES-SCHD-ESCROW(35).
           MOVE QES-SCHD-TERM-35 TO ES-SCHD-TERM(35).
           MOVE QES-SCHD-COLLECTED-35 TO ES-SCHD-COLLECTED(35).

           IF ( QES-SCHD-EFF-DATE-36 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(36)
           ELSE
              MOVE QES-SCHD-EFF-DATE-36 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(36).


           IF ( QES-SCHD-1STPYDATE-36 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(36)
           ELSE
              MOVE QES-SCHD-1STPYDATE-36 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(36).

           MOVE QES-SCHD-ESCROW-36 TO ES-SCHD-ESCROW(36).
           MOVE QES-SCHD-TERM-36 TO ES-SCHD-TERM(36).
           MOVE QES-SCHD-COLLECTED-36 TO ES-SCHD-COLLECTED(36).

           IF ( QES-SCHD-EFF-DATE-37 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(37)
           ELSE
              MOVE QES-SCHD-EFF-DATE-37 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(37).


           IF ( QES-SCHD-1STPYDATE-37 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(37)
           ELSE
              MOVE QES-SCHD-1STPYDATE-37 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(37).

           MOVE QES-SCHD-ESCROW-37 TO ES-SCHD-ESCROW(37).
           MOVE QES-SCHD-TERM-37 TO ES-SCHD-TERM(37).
           MOVE QES-SCHD-COLLECTED-37 TO ES-SCHD-COLLECTED(37).

           IF ( QES-SCHD-EFF-DATE-38 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(38)
           ELSE
              MOVE QES-SCHD-EFF-DATE-38 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(38).


           IF ( QES-SCHD-1STPYDATE-38 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(38)
           ELSE
              MOVE QES-SCHD-1STPYDATE-38 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(38).

           MOVE QES-SCHD-ESCROW-38 TO ES-SCHD-ESCROW(38).
           MOVE QES-SCHD-TERM-38 TO ES-SCHD-TERM(38).
           MOVE QES-SCHD-COLLECTED-38 TO ES-SCHD-COLLECTED(38).

           IF ( QES-SCHD-EFF-DATE-39 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(39)
           ELSE
              MOVE QES-SCHD-EFF-DATE-39 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(39).


           IF ( QES-SCHD-1STPYDATE-39 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(39)
           ELSE
              MOVE QES-SCHD-1STPYDATE-39 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(39).

           MOVE QES-SCHD-ESCROW-39 TO ES-SCHD-ESCROW(39).
           MOVE QES-SCHD-TERM-39 TO ES-SCHD-TERM(39).
           MOVE QES-SCHD-COLLECTED-39 TO ES-SCHD-COLLECTED(39).

           IF ( QES-SCHD-EFF-DATE-40 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-EFF-DATE(40)
           ELSE
              MOVE QES-SCHD-EFF-DATE-40 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-EFF-DATE(40).


           IF ( QES-SCHD-1STPYDATE-40 = "1900-01-01" )
              MOVE ZEROES TO ES-SCHD-1STPYDATE(40)
           ELSE
              MOVE QES-SCHD-1STPYDATE-40 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-SCHD-1STPYDATE(40).

           MOVE QES-SCHD-ESCROW-40 TO ES-SCHD-ESCROW(40).
           MOVE QES-SCHD-TERM-40 TO ES-SCHD-TERM(40).
           MOVE QES-SCHD-COLLECTED-40 TO ES-SCHD-COLLECTED(40).
           MOVE QES-BALANCE TO ES-BALANCE.
           MOVE QES-PREPAID-1 TO ES-PREPAID(1).
           MOVE QES-COLLECTED-1 TO ES-COLLECTED(1).
           MOVE QES-DISBURSED-TAXES-1 TO ES-DISBURSED-TAXES(1).
           MOVE QES-DISBURSED-INS-1 TO ES-DISBURSED-INS(1).
           MOVE QES-DISBURSED-PMI-1 TO ES-DISBURSED-PMI(1).
           MOVE QES-DISBURSED-OTHER-1 TO ES-DISBURSED-OTHER(1).
           MOVE QES-DISBURSED-REF-1 TO ES-DISBURSED-REF(1).
           MOVE QES-DISBURSED-CNT-TAXES-1 TO ES-DISBURSED-CNT-TAXES(1).
           MOVE QES-DISBURSED-MISC1-1 TO ES-DISBURSED-MISC1(1).
           MOVE QES-DISBURSED-MISC2-1 TO ES-DISBURSED-MISC2(1).
           MOVE QES-PREPAID-2 TO ES-PREPAID(2).
           MOVE QES-COLLECTED-2 TO ES-COLLECTED(2).
           MOVE QES-DISBURSED-TAXES-2 TO ES-DISBURSED-TAXES(2).
           MOVE QES-DISBURSED-INS-2 TO ES-DISBURSED-INS(2).
           MOVE QES-DISBURSED-PMI-2 TO ES-DISBURSED-PMI(2).
           MOVE QES-DISBURSED-OTHER-2 TO ES-DISBURSED-OTHER(2).
           MOVE QES-DISBURSED-REF-2 TO ES-DISBURSED-REF(2).
           MOVE QES-DISBURSED-CNT-TAXES-2 TO ES-DISBURSED-CNT-TAXES(2).
           MOVE QES-DISBURSED-MISC1-2 TO ES-DISBURSED-MISC1(2).
           MOVE QES-DISBURSED-MISC2-2 TO ES-DISBURSED-MISC2(2).
           MOVE QES-PREPAID-3 TO ES-PREPAID(3).
           MOVE QES-COLLECTED-3 TO ES-COLLECTED(3).
           MOVE QES-DISBURSED-TAXES-3 TO ES-DISBURSED-TAXES(3).
           MOVE QES-DISBURSED-INS-3 TO ES-DISBURSED-INS(3).
           MOVE QES-DISBURSED-PMI-3 TO ES-DISBURSED-PMI(3).
           MOVE QES-DISBURSED-OTHER-3 TO ES-DISBURSED-OTHER(3).
           MOVE QES-DISBURSED-REF-3 TO ES-DISBURSED-REF(3).
           MOVE QES-DISBURSED-CNT-TAXES-3 TO ES-DISBURSED-CNT-TAXES(3).
           MOVE QES-DISBURSED-MISC1-3 TO ES-DISBURSED-MISC1(3).
           MOVE QES-DISBURSED-MISC2-3 TO ES-DISBURSED-MISC2(3).
           MOVE QES-MISC-AMT-1 TO ES-MISC-AMT(1).

           IF ( QES-EXP-DATE-1 = "1900-01-01" )
              MOVE ZEROES TO ES-EXP-DATE(1)
           ELSE
              MOVE QES-EXP-DATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-EXP-DATE(1).

           MOVE QES-MISC-AMT-2 TO ES-MISC-AMT(2).

           IF ( QES-EXP-DATE-2 = "1900-01-01" )
              MOVE ZEROES TO ES-EXP-DATE(2)
           ELSE
              MOVE QES-EXP-DATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-EXP-DATE(2).

           MOVE QES-MISC-AMT-3 TO ES-MISC-AMT(3).

           IF ( QES-EXP-DATE-3 = "1900-01-01" )
              MOVE ZEROES TO ES-EXP-DATE(3)
           ELSE
              MOVE QES-EXP-DATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-EXP-DATE(3).

           MOVE QES-MISC-AMT-4 TO ES-MISC-AMT(4).

           IF ( QES-EXP-DATE-4 = "1900-01-01" )
              MOVE ZEROES TO ES-EXP-DATE(4)
           ELSE
              MOVE QES-EXP-DATE-4 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-EXP-DATE(4).

           MOVE QES-MISC-AMT-5 TO ES-MISC-AMT(5).

           IF ( QES-EXP-DATE-5 = "1900-01-01" )
              MOVE ZEROES TO ES-EXP-DATE(5)
           ELSE
              MOVE QES-EXP-DATE-5 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-EXP-DATE(5).

           MOVE QES-MISC-AMT-6 TO ES-MISC-AMT(6).

           IF ( QES-EXP-DATE-6 = "1900-01-01" )
              MOVE ZEROES TO ES-EXP-DATE(6)
           ELSE
              MOVE QES-EXP-DATE-6 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO ES-EXP-DATE(6).

 
      *-----------------------------------------------------------------
      *    LOAD QES-REC FROM ES-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-ES-FIELDS.
           MOVE ES-BRNO TO QES-BRNO.
           MOVE ES-ACCTNO TO QES-ACCTNO.

           IF ( ES-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QES-LTOUCH-DATE
           ELSE
              MOVE ES-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-LTOUCH-DATE.


           IF ( ES-SCHD-EFF-DATE(1) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-1
           ELSE
              MOVE ES-SCHD-EFF-DATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-1.


           IF ( ES-SCHD-1STPYDATE(1) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-1
           ELSE
              MOVE ES-SCHD-1STPYDATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-1.

           MOVE ES-SCHD-ESCROW(1) TO QES-SCHD-ESCROW-1.
           MOVE ES-SCHD-TERM(1) TO QES-SCHD-TERM-1.
           MOVE ES-SCHD-COLLECTED(1) TO QES-SCHD-COLLECTED-1.

           IF ( ES-SCHD-EFF-DATE(2) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-2
           ELSE
              MOVE ES-SCHD-EFF-DATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-2.


           IF ( ES-SCHD-1STPYDATE(2) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-2
           ELSE
              MOVE ES-SCHD-1STPYDATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-2.

           MOVE ES-SCHD-ESCROW(2) TO QES-SCHD-ESCROW-2.
           MOVE ES-SCHD-TERM(2) TO QES-SCHD-TERM-2.
           MOVE ES-SCHD-COLLECTED(2) TO QES-SCHD-COLLECTED-2.

           IF ( ES-SCHD-EFF-DATE(3) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-3
           ELSE
              MOVE ES-SCHD-EFF-DATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-3.


           IF ( ES-SCHD-1STPYDATE(3) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-3
           ELSE
              MOVE ES-SCHD-1STPYDATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-3.

           MOVE ES-SCHD-ESCROW(3) TO QES-SCHD-ESCROW-3.
           MOVE ES-SCHD-TERM(3) TO QES-SCHD-TERM-3.
           MOVE ES-SCHD-COLLECTED(3) TO QES-SCHD-COLLECTED-3.

           IF ( ES-SCHD-EFF-DATE(4) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-4
           ELSE
              MOVE ES-SCHD-EFF-DATE(4) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-4.


           IF ( ES-SCHD-1STPYDATE(4) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-4
           ELSE
              MOVE ES-SCHD-1STPYDATE(4) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-4.

           MOVE ES-SCHD-ESCROW(4) TO QES-SCHD-ESCROW-4.
           MOVE ES-SCHD-TERM(4) TO QES-SCHD-TERM-4.
           MOVE ES-SCHD-COLLECTED(4) TO QES-SCHD-COLLECTED-4.

           IF ( ES-SCHD-EFF-DATE(5) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-5
           ELSE
              MOVE ES-SCHD-EFF-DATE(5) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-5.


           IF ( ES-SCHD-1STPYDATE(5) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-5
           ELSE
              MOVE ES-SCHD-1STPYDATE(5) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-5.

           MOVE ES-SCHD-ESCROW(5) TO QES-SCHD-ESCROW-5.
           MOVE ES-SCHD-TERM(5) TO QES-SCHD-TERM-5.
           MOVE ES-SCHD-COLLECTED(5) TO QES-SCHD-COLLECTED-5.

           IF ( ES-SCHD-EFF-DATE(6) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-6
           ELSE
              MOVE ES-SCHD-EFF-DATE(6) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-6.


           IF ( ES-SCHD-1STPYDATE(6) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-6
           ELSE
              MOVE ES-SCHD-1STPYDATE(6) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-6.

           MOVE ES-SCHD-ESCROW(6) TO QES-SCHD-ESCROW-6.
           MOVE ES-SCHD-TERM(6) TO QES-SCHD-TERM-6.
           MOVE ES-SCHD-COLLECTED(6) TO QES-SCHD-COLLECTED-6.

           IF ( ES-SCHD-EFF-DATE(7) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-7
           ELSE
              MOVE ES-SCHD-EFF-DATE(7) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-7.


           IF ( ES-SCHD-1STPYDATE(7) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-7
           ELSE
              MOVE ES-SCHD-1STPYDATE(7) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-7.

           MOVE ES-SCHD-ESCROW(7) TO QES-SCHD-ESCROW-7.
           MOVE ES-SCHD-TERM(7) TO QES-SCHD-TERM-7.
           MOVE ES-SCHD-COLLECTED(7) TO QES-SCHD-COLLECTED-7.

           IF ( ES-SCHD-EFF-DATE(8) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-8
           ELSE
              MOVE ES-SCHD-EFF-DATE(8) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-8.


           IF ( ES-SCHD-1STPYDATE(8) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-8
           ELSE
              MOVE ES-SCHD-1STPYDATE(8) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-8.

           MOVE ES-SCHD-ESCROW(8) TO QES-SCHD-ESCROW-8.
           MOVE ES-SCHD-TERM(8) TO QES-SCHD-TERM-8.
           MOVE ES-SCHD-COLLECTED(8) TO QES-SCHD-COLLECTED-8.

           IF ( ES-SCHD-EFF-DATE(9) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-9
           ELSE
              MOVE ES-SCHD-EFF-DATE(9) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-9.


           IF ( ES-SCHD-1STPYDATE(9) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-9
           ELSE
              MOVE ES-SCHD-1STPYDATE(9) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-9.

           MOVE ES-SCHD-ESCROW(9) TO QES-SCHD-ESCROW-9.
           MOVE ES-SCHD-TERM(9) TO QES-SCHD-TERM-9.
           MOVE ES-SCHD-COLLECTED(9) TO QES-SCHD-COLLECTED-9.

           IF ( ES-SCHD-EFF-DATE(10) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-10
           ELSE
              MOVE ES-SCHD-EFF-DATE(10) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-10.


           IF ( ES-SCHD-1STPYDATE(10) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-10
           ELSE
              MOVE ES-SCHD-1STPYDATE(10) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-10.

           MOVE ES-SCHD-ESCROW(10) TO QES-SCHD-ESCROW-10.
           MOVE ES-SCHD-TERM(10) TO QES-SCHD-TERM-10.
           MOVE ES-SCHD-COLLECTED(10) TO QES-SCHD-COLLECTED-10.

           IF ( ES-SCHD-EFF-DATE(11) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-11
           ELSE
              MOVE ES-SCHD-EFF-DATE(11) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-11.


           IF ( ES-SCHD-1STPYDATE(11) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-11
           ELSE
              MOVE ES-SCHD-1STPYDATE(11) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-11.

           MOVE ES-SCHD-ESCROW(11) TO QES-SCHD-ESCROW-11.
           MOVE ES-SCHD-TERM(11) TO QES-SCHD-TERM-11.
           MOVE ES-SCHD-COLLECTED(11) TO QES-SCHD-COLLECTED-11.

           IF ( ES-SCHD-EFF-DATE(12) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-12
           ELSE
              MOVE ES-SCHD-EFF-DATE(12) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-12.


           IF ( ES-SCHD-1STPYDATE(12) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-12
           ELSE
              MOVE ES-SCHD-1STPYDATE(12) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-12.

           MOVE ES-SCHD-ESCROW(12) TO QES-SCHD-ESCROW-12.
           MOVE ES-SCHD-TERM(12) TO QES-SCHD-TERM-12.
           MOVE ES-SCHD-COLLECTED(12) TO QES-SCHD-COLLECTED-12.

           IF ( ES-SCHD-EFF-DATE(13) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-13
           ELSE
              MOVE ES-SCHD-EFF-DATE(13) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-13.


           IF ( ES-SCHD-1STPYDATE(13) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-13
           ELSE
              MOVE ES-SCHD-1STPYDATE(13) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-13.

           MOVE ES-SCHD-ESCROW(13) TO QES-SCHD-ESCROW-13.
           MOVE ES-SCHD-TERM(13) TO QES-SCHD-TERM-13.
           MOVE ES-SCHD-COLLECTED(13) TO QES-SCHD-COLLECTED-13.

           IF ( ES-SCHD-EFF-DATE(14) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-14
           ELSE
              MOVE ES-SCHD-EFF-DATE(14) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-14.


           IF ( ES-SCHD-1STPYDATE(14) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-14
           ELSE
              MOVE ES-SCHD-1STPYDATE(14) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-14.

           MOVE ES-SCHD-ESCROW(14) TO QES-SCHD-ESCROW-14.
           MOVE ES-SCHD-TERM(14) TO QES-SCHD-TERM-14.
           MOVE ES-SCHD-COLLECTED(14) TO QES-SCHD-COLLECTED-14.

           IF ( ES-SCHD-EFF-DATE(15) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-15
           ELSE
              MOVE ES-SCHD-EFF-DATE(15) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-15.


           IF ( ES-SCHD-1STPYDATE(15) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-15
           ELSE
              MOVE ES-SCHD-1STPYDATE(15) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-15.

           MOVE ES-SCHD-ESCROW(15) TO QES-SCHD-ESCROW-15.
           MOVE ES-SCHD-TERM(15) TO QES-SCHD-TERM-15.
           MOVE ES-SCHD-COLLECTED(15) TO QES-SCHD-COLLECTED-15.

           IF ( ES-SCHD-EFF-DATE(16) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-16
           ELSE
              MOVE ES-SCHD-EFF-DATE(16) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-16.


           IF ( ES-SCHD-1STPYDATE(16) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-16
           ELSE
              MOVE ES-SCHD-1STPYDATE(16) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-16.

           MOVE ES-SCHD-ESCROW(16) TO QES-SCHD-ESCROW-16.
           MOVE ES-SCHD-TERM(16) TO QES-SCHD-TERM-16.
           MOVE ES-SCHD-COLLECTED(16) TO QES-SCHD-COLLECTED-16.

           IF ( ES-SCHD-EFF-DATE(17) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-17
           ELSE
              MOVE ES-SCHD-EFF-DATE(17) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-17.


           IF ( ES-SCHD-1STPYDATE(17) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-17
           ELSE
              MOVE ES-SCHD-1STPYDATE(17) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-17.

           MOVE ES-SCHD-ESCROW(17) TO QES-SCHD-ESCROW-17.
           MOVE ES-SCHD-TERM(17) TO QES-SCHD-TERM-17.
           MOVE ES-SCHD-COLLECTED(17) TO QES-SCHD-COLLECTED-17.

           IF ( ES-SCHD-EFF-DATE(18) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-18
           ELSE
              MOVE ES-SCHD-EFF-DATE(18) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-18.


           IF ( ES-SCHD-1STPYDATE(18) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-18
           ELSE
              MOVE ES-SCHD-1STPYDATE(18) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-18.

           MOVE ES-SCHD-ESCROW(18) TO QES-SCHD-ESCROW-18.
           MOVE ES-SCHD-TERM(18) TO QES-SCHD-TERM-18.
           MOVE ES-SCHD-COLLECTED(18) TO QES-SCHD-COLLECTED-18.

           IF ( ES-SCHD-EFF-DATE(19) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-19
           ELSE
              MOVE ES-SCHD-EFF-DATE(19) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-19.


           IF ( ES-SCHD-1STPYDATE(19) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-19
           ELSE
              MOVE ES-SCHD-1STPYDATE(19) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-19.

           MOVE ES-SCHD-ESCROW(19) TO QES-SCHD-ESCROW-19.
           MOVE ES-SCHD-TERM(19) TO QES-SCHD-TERM-19.
           MOVE ES-SCHD-COLLECTED(19) TO QES-SCHD-COLLECTED-19.

           IF ( ES-SCHD-EFF-DATE(20) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-20
           ELSE
              MOVE ES-SCHD-EFF-DATE(20) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-20.


           IF ( ES-SCHD-1STPYDATE(20) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-20
           ELSE
              MOVE ES-SCHD-1STPYDATE(20) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-20.

           MOVE ES-SCHD-ESCROW(20) TO QES-SCHD-ESCROW-20.
           MOVE ES-SCHD-TERM(20) TO QES-SCHD-TERM-20.
           MOVE ES-SCHD-COLLECTED(20) TO QES-SCHD-COLLECTED-20.

           IF ( ES-SCHD-EFF-DATE(21) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-21
           ELSE
              MOVE ES-SCHD-EFF-DATE(21) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-21.


           IF ( ES-SCHD-1STPYDATE(21) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-21
           ELSE
              MOVE ES-SCHD-1STPYDATE(21) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-21.

           MOVE ES-SCHD-ESCROW(21) TO QES-SCHD-ESCROW-21.
           MOVE ES-SCHD-TERM(21) TO QES-SCHD-TERM-21.
           MOVE ES-SCHD-COLLECTED(21) TO QES-SCHD-COLLECTED-21.

           IF ( ES-SCHD-EFF-DATE(22) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-22
           ELSE
              MOVE ES-SCHD-EFF-DATE(22) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-22.


           IF ( ES-SCHD-1STPYDATE(22) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-22
           ELSE
              MOVE ES-SCHD-1STPYDATE(22) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-22.

           MOVE ES-SCHD-ESCROW(22) TO QES-SCHD-ESCROW-22.
           MOVE ES-SCHD-TERM(22) TO QES-SCHD-TERM-22.
           MOVE ES-SCHD-COLLECTED(22) TO QES-SCHD-COLLECTED-22.

           IF ( ES-SCHD-EFF-DATE(23) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-23
           ELSE
              MOVE ES-SCHD-EFF-DATE(23) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-23.


           IF ( ES-SCHD-1STPYDATE(23) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-23
           ELSE
              MOVE ES-SCHD-1STPYDATE(23) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-23.

           MOVE ES-SCHD-ESCROW(23) TO QES-SCHD-ESCROW-23.
           MOVE ES-SCHD-TERM(23) TO QES-SCHD-TERM-23.
           MOVE ES-SCHD-COLLECTED(23) TO QES-SCHD-COLLECTED-23.

           IF ( ES-SCHD-EFF-DATE(24) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-24
           ELSE
              MOVE ES-SCHD-EFF-DATE(24) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-24.


           IF ( ES-SCHD-1STPYDATE(24) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-24
           ELSE
              MOVE ES-SCHD-1STPYDATE(24) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-24.

           MOVE ES-SCHD-ESCROW(24) TO QES-SCHD-ESCROW-24.
           MOVE ES-SCHD-TERM(24) TO QES-SCHD-TERM-24.
           MOVE ES-SCHD-COLLECTED(24) TO QES-SCHD-COLLECTED-24.

           IF ( ES-SCHD-EFF-DATE(25) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-25
           ELSE
              MOVE ES-SCHD-EFF-DATE(25) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-25.


           IF ( ES-SCHD-1STPYDATE(25) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-25
           ELSE
              MOVE ES-SCHD-1STPYDATE(25) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-25.

           MOVE ES-SCHD-ESCROW(25) TO QES-SCHD-ESCROW-25.
           MOVE ES-SCHD-TERM(25) TO QES-SCHD-TERM-25.
           MOVE ES-SCHD-COLLECTED(25) TO QES-SCHD-COLLECTED-25.

           IF ( ES-SCHD-EFF-DATE(26) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-26
           ELSE
              MOVE ES-SCHD-EFF-DATE(26) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-26.


           IF ( ES-SCHD-1STPYDATE(26) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-26
           ELSE
              MOVE ES-SCHD-1STPYDATE(26) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-26.

           MOVE ES-SCHD-ESCROW(26) TO QES-SCHD-ESCROW-26.
           MOVE ES-SCHD-TERM(26) TO QES-SCHD-TERM-26.
           MOVE ES-SCHD-COLLECTED(26) TO QES-SCHD-COLLECTED-26.

           IF ( ES-SCHD-EFF-DATE(27) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-27
           ELSE
              MOVE ES-SCHD-EFF-DATE(27) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-27.


           IF ( ES-SCHD-1STPYDATE(27) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-27
           ELSE
              MOVE ES-SCHD-1STPYDATE(27) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-27.

           MOVE ES-SCHD-ESCROW(27) TO QES-SCHD-ESCROW-27.
           MOVE ES-SCHD-TERM(27) TO QES-SCHD-TERM-27.
           MOVE ES-SCHD-COLLECTED(27) TO QES-SCHD-COLLECTED-27.

           IF ( ES-SCHD-EFF-DATE(28) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-28
           ELSE
              MOVE ES-SCHD-EFF-DATE(28) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-28.


           IF ( ES-SCHD-1STPYDATE(28) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-28
           ELSE
              MOVE ES-SCHD-1STPYDATE(28) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-28.

           MOVE ES-SCHD-ESCROW(28) TO QES-SCHD-ESCROW-28.
           MOVE ES-SCHD-TERM(28) TO QES-SCHD-TERM-28.
           MOVE ES-SCHD-COLLECTED(28) TO QES-SCHD-COLLECTED-28.

           IF ( ES-SCHD-EFF-DATE(29) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-29
           ELSE
              MOVE ES-SCHD-EFF-DATE(29) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-29.


           IF ( ES-SCHD-1STPYDATE(29) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-29
           ELSE
              MOVE ES-SCHD-1STPYDATE(29) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-29.

           MOVE ES-SCHD-ESCROW(29) TO QES-SCHD-ESCROW-29.
           MOVE ES-SCHD-TERM(29) TO QES-SCHD-TERM-29.
           MOVE ES-SCHD-COLLECTED(29) TO QES-SCHD-COLLECTED-29.

           IF ( ES-SCHD-EFF-DATE(30) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-30
           ELSE
              MOVE ES-SCHD-EFF-DATE(30) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-30.


           IF ( ES-SCHD-1STPYDATE(30) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-30
           ELSE
              MOVE ES-SCHD-1STPYDATE(30) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-30.

           MOVE ES-SCHD-ESCROW(30) TO QES-SCHD-ESCROW-30.
           MOVE ES-SCHD-TERM(30) TO QES-SCHD-TERM-30.
           MOVE ES-SCHD-COLLECTED(30) TO QES-SCHD-COLLECTED-30.

           IF ( ES-SCHD-EFF-DATE(31) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-31
           ELSE
              MOVE ES-SCHD-EFF-DATE(31) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-31.


           IF ( ES-SCHD-1STPYDATE(31) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-31
           ELSE
              MOVE ES-SCHD-1STPYDATE(31) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-31.

           MOVE ES-SCHD-ESCROW(31) TO QES-SCHD-ESCROW-31.
           MOVE ES-SCHD-TERM(31) TO QES-SCHD-TERM-31.
           MOVE ES-SCHD-COLLECTED(31) TO QES-SCHD-COLLECTED-31.

           IF ( ES-SCHD-EFF-DATE(32) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-32
           ELSE
              MOVE ES-SCHD-EFF-DATE(32) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-32.


           IF ( ES-SCHD-1STPYDATE(32) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-32
           ELSE
              MOVE ES-SCHD-1STPYDATE(32) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-32.

           MOVE ES-SCHD-ESCROW(32) TO QES-SCHD-ESCROW-32.
           MOVE ES-SCHD-TERM(32) TO QES-SCHD-TERM-32.
           MOVE ES-SCHD-COLLECTED(32) TO QES-SCHD-COLLECTED-32.

           IF ( ES-SCHD-EFF-DATE(33) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-33
           ELSE
              MOVE ES-SCHD-EFF-DATE(33) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-33.


           IF ( ES-SCHD-1STPYDATE(33) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-33
           ELSE
              MOVE ES-SCHD-1STPYDATE(33) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-33.

           MOVE ES-SCHD-ESCROW(33) TO QES-SCHD-ESCROW-33.
           MOVE ES-SCHD-TERM(33) TO QES-SCHD-TERM-33.
           MOVE ES-SCHD-COLLECTED(33) TO QES-SCHD-COLLECTED-33.

           IF ( ES-SCHD-EFF-DATE(34) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-34
           ELSE
              MOVE ES-SCHD-EFF-DATE(34) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-34.


           IF ( ES-SCHD-1STPYDATE(34) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-34
           ELSE
              MOVE ES-SCHD-1STPYDATE(34) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-34.

           MOVE ES-SCHD-ESCROW(34) TO QES-SCHD-ESCROW-34.
           MOVE ES-SCHD-TERM(34) TO QES-SCHD-TERM-34.
           MOVE ES-SCHD-COLLECTED(34) TO QES-SCHD-COLLECTED-34.

           IF ( ES-SCHD-EFF-DATE(35) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-35
           ELSE
              MOVE ES-SCHD-EFF-DATE(35) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-35.


           IF ( ES-SCHD-1STPYDATE(35) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-35
           ELSE
              MOVE ES-SCHD-1STPYDATE(35) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-35.

           MOVE ES-SCHD-ESCROW(35) TO QES-SCHD-ESCROW-35.
           MOVE ES-SCHD-TERM(35) TO QES-SCHD-TERM-35.
           MOVE ES-SCHD-COLLECTED(35) TO QES-SCHD-COLLECTED-35.

           IF ( ES-SCHD-EFF-DATE(36) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-36
           ELSE
              MOVE ES-SCHD-EFF-DATE(36) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-36.


           IF ( ES-SCHD-1STPYDATE(36) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-36
           ELSE
              MOVE ES-SCHD-1STPYDATE(36) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-36.

           MOVE ES-SCHD-ESCROW(36) TO QES-SCHD-ESCROW-36.
           MOVE ES-SCHD-TERM(36) TO QES-SCHD-TERM-36.
           MOVE ES-SCHD-COLLECTED(36) TO QES-SCHD-COLLECTED-36.

           IF ( ES-SCHD-EFF-DATE(37) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-37
           ELSE
              MOVE ES-SCHD-EFF-DATE(37) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-37.


           IF ( ES-SCHD-1STPYDATE(37) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-37
           ELSE
              MOVE ES-SCHD-1STPYDATE(37) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-37.

           MOVE ES-SCHD-ESCROW(37) TO QES-SCHD-ESCROW-37.
           MOVE ES-SCHD-TERM(37) TO QES-SCHD-TERM-37.
           MOVE ES-SCHD-COLLECTED(37) TO QES-SCHD-COLLECTED-37.

           IF ( ES-SCHD-EFF-DATE(38) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-38
           ELSE
              MOVE ES-SCHD-EFF-DATE(38) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-38.


           IF ( ES-SCHD-1STPYDATE(38) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-38
           ELSE
              MOVE ES-SCHD-1STPYDATE(38) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-38.

           MOVE ES-SCHD-ESCROW(38) TO QES-SCHD-ESCROW-38.
           MOVE ES-SCHD-TERM(38) TO QES-SCHD-TERM-38.
           MOVE ES-SCHD-COLLECTED(38) TO QES-SCHD-COLLECTED-38.

           IF ( ES-SCHD-EFF-DATE(39) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-39
           ELSE
              MOVE ES-SCHD-EFF-DATE(39) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-39.


           IF ( ES-SCHD-1STPYDATE(39) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-39
           ELSE
              MOVE ES-SCHD-1STPYDATE(39) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-39.

           MOVE ES-SCHD-ESCROW(39) TO QES-SCHD-ESCROW-39.
           MOVE ES-SCHD-TERM(39) TO QES-SCHD-TERM-39.
           MOVE ES-SCHD-COLLECTED(39) TO QES-SCHD-COLLECTED-39.

           IF ( ES-SCHD-EFF-DATE(40) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-EFF-DATE-40
           ELSE
              MOVE ES-SCHD-EFF-DATE(40) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-EFF-DATE-40.


           IF ( ES-SCHD-1STPYDATE(40) = ZEROES )
              MOVE "1900-01-01" TO QES-SCHD-1STPYDATE-40
           ELSE
              MOVE ES-SCHD-1STPYDATE(40) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-SCHD-1STPYDATE-40.

           MOVE ES-SCHD-ESCROW(40) TO QES-SCHD-ESCROW-40.
           MOVE ES-SCHD-TERM(40) TO QES-SCHD-TERM-40.
           MOVE ES-SCHD-COLLECTED(40) TO QES-SCHD-COLLECTED-40.
           MOVE ES-BALANCE TO QES-BALANCE.
           MOVE ES-PREPAID(1) TO QES-PREPAID-1.
           MOVE ES-COLLECTED(1) TO QES-COLLECTED-1.
           MOVE ES-DISBURSED-TAXES(1) TO QES-DISBURSED-TAXES-1.
           MOVE ES-DISBURSED-INS(1) TO QES-DISBURSED-INS-1.
           MOVE ES-DISBURSED-PMI(1) TO QES-DISBURSED-PMI-1.
           MOVE ES-DISBURSED-OTHER(1) TO QES-DISBURSED-OTHER-1.
           MOVE ES-DISBURSED-REF(1) TO QES-DISBURSED-REF-1.
           MOVE ES-DISBURSED-CNT-TAXES(1) TO QES-DISBURSED-CNT-TAXES-1.
           MOVE ES-DISBURSED-MISC1(1) TO QES-DISBURSED-MISC1-1.
           MOVE ES-DISBURSED-MISC2(1) TO QES-DISBURSED-MISC2-1.
           MOVE ES-PREPAID(2) TO QES-PREPAID-2.
           MOVE ES-COLLECTED(2) TO QES-COLLECTED-2.
           MOVE ES-DISBURSED-TAXES(2) TO QES-DISBURSED-TAXES-2.
           MOVE ES-DISBURSED-INS(2) TO QES-DISBURSED-INS-2.
           MOVE ES-DISBURSED-PMI(2) TO QES-DISBURSED-PMI-2.
           MOVE ES-DISBURSED-OTHER(2) TO QES-DISBURSED-OTHER-2.
           MOVE ES-DISBURSED-REF(2) TO QES-DISBURSED-REF-2.
           MOVE ES-DISBURSED-CNT-TAXES(2) TO QES-DISBURSED-CNT-TAXES-2.
           MOVE ES-DISBURSED-MISC1(2) TO QES-DISBURSED-MISC1-2.
           MOVE ES-DISBURSED-MISC2(2) TO QES-DISBURSED-MISC2-2.
           MOVE ES-PREPAID(3) TO QES-PREPAID-3.
           MOVE ES-COLLECTED(3) TO QES-COLLECTED-3.
           MOVE ES-DISBURSED-TAXES(3) TO QES-DISBURSED-TAXES-3.
           MOVE ES-DISBURSED-INS(3) TO QES-DISBURSED-INS-3.
           MOVE ES-DISBURSED-PMI(3) TO QES-DISBURSED-PMI-3.
           MOVE ES-DISBURSED-OTHER(3) TO QES-DISBURSED-OTHER-3.
           MOVE ES-DISBURSED-REF(3) TO QES-DISBURSED-REF-3.
           MOVE ES-DISBURSED-CNT-TAXES(3) TO QES-DISBURSED-CNT-TAXES-3.
           MOVE ES-DISBURSED-MISC1(3) TO QES-DISBURSED-MISC1-3.
           MOVE ES-DISBURSED-MISC2(3) TO QES-DISBURSED-MISC2-3.
           MOVE ES-MISC-AMT(1) TO QES-MISC-AMT-1.

           IF ( ES-EXP-DATE(1) = ZEROES )
              MOVE "1900-01-01" TO QES-EXP-DATE-1
           ELSE
              MOVE ES-EXP-DATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-EXP-DATE-1.

           MOVE ES-MISC-AMT(2) TO QES-MISC-AMT-2.

           IF ( ES-EXP-DATE(2) = ZEROES )
              MOVE "1900-01-01" TO QES-EXP-DATE-2
           ELSE
              MOVE ES-EXP-DATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-EXP-DATE-2.

           MOVE ES-MISC-AMT(3) TO QES-MISC-AMT-3.

           IF ( ES-EXP-DATE(3) = ZEROES )
              MOVE "1900-01-01" TO QES-EXP-DATE-3
           ELSE
              MOVE ES-EXP-DATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-EXP-DATE-3.

           MOVE ES-MISC-AMT(4) TO QES-MISC-AMT-4.

           IF ( ES-EXP-DATE(4) = ZEROES )
              MOVE "1900-01-01" TO QES-EXP-DATE-4
           ELSE
              MOVE ES-EXP-DATE(4) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-EXP-DATE-4.

           MOVE ES-MISC-AMT(5) TO QES-MISC-AMT-5.

           IF ( ES-EXP-DATE(5) = ZEROES )
              MOVE "1900-01-01" TO QES-EXP-DATE-5
           ELSE
              MOVE ES-EXP-DATE(5) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-EXP-DATE-5.

           MOVE ES-MISC-AMT(6) TO QES-MISC-AMT-6.

           IF ( ES-EXP-DATE(6) = ZEROES )
              MOVE "1900-01-01" TO QES-EXP-DATE-6
           ELSE
              MOVE ES-EXP-DATE(6) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QES-EXP-DATE-6.

 
