      **************************************************
      * REPAY PAYMENT ASCII FILE    (INCLUDES 0D0A)
      *   * * MUST MATCH EX01XTRP SIZE * *
      **************************************************
       FD  REPAY-TRP-FILE
           LABEL RECORDS ARE STANDARD.
       01  REPAY-TRP-REC              PIC X(1056).
