      * COPYMEMBER: LIBLP/LPFDGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - FDFILE
      *
      *=================================================================
      * REV:
      * BAH 2021-0507 ***NEW***
      * BAH 2023.1113 ADDED FD-TYPE-OF-DOC #1630
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD FD-REC FROM QFD-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-FD-FIELDS.
           MOVE QFD-FMNO TO FD-FMNO.

           IF ( QFD-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO FD-LTOUCH-DATE
           ELSE
              MOVE QFD-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO FD-LTOUCH-DATE.

           MOVE QFD-DESC TO FD-DESC.
           MOVE QFD-OPTION TO FD-OPTION.
           MOVE QFD-FORM-CHG-CD TO FD-FORM-CHG-CD.
           MOVE QFD-PROG-PREFIX TO FD-PROG-PREFIX.
           MOVE QFD-TYPE TO FD-TYPE.
           MOVE QFD-LNMEMO TO FD-LNMEMO.
           MOVE QFD-BODY TO FD-BODY.
           MOVE QFD-TOP TO FD-TOP.
           MOVE QFD-BOTTOM TO FD-BOTTOM.
           MOVE QFD-PROG TO FD-PROG.
           MOVE QFD-PROMPTS-1 TO FD-PROMPTS(1).
           MOVE QFD-PROMPTS-2 TO FD-PROMPTS(2).
           MOVE QFD-PROMPTS-3 TO FD-PROMPTS(3).
           MOVE QFD-PROMPTS-4 TO FD-PROMPTS(4).
           MOVE QFD-PROMPTS-5 TO FD-PROMPTS(5).
           MOVE QFD-PROMPTS-6 TO FD-PROMPTS(6).
           MOVE QFD-PROMPTS-7 TO FD-PROMPTS(7).
           MOVE QFD-PROMPTS-8 TO FD-PROMPTS(8).
           MOVE QFD-PROMPTS-9 TO FD-PROMPTS(9).
           MOVE QFD-PROMPTS-10 TO FD-PROMPTS(10).
           MOVE QFD-PROMPTS-11 TO FD-PROMPTS(11).
           MOVE QFD-PROMPTS-12 TO FD-PROMPTS(12).
           MOVE QFD-PROMPTS-13 TO FD-PROMPTS(13).
           MOVE QFD-PROMPTS-14 TO FD-PROMPTS(14).
           MOVE QFD-PROMPTS-15 TO FD-PROMPTS(15).
           MOVE QFD-PROMPTS-16 TO FD-PROMPTS(16).
           MOVE QFD-PROMPTS-17 TO FD-PROMPTS(17).
           MOVE QFD-PROMPTS-18 TO FD-PROMPTS(18).
           MOVE QFD-PROMPTS-19 TO FD-PROMPTS(19).
           MOVE QFD-PROMPTS-20 TO FD-PROMPTS(20).
           MOVE QFD-PROMPTS-21 TO FD-PROMPTS(21).
           MOVE QFD-PROMPTS-22 TO FD-PROMPTS(22).
           MOVE QFD-PROMPTS-23 TO FD-PROMPTS(23).
           MOVE QFD-PROMPTS-24 TO FD-PROMPTS(24).
           MOVE QFD-PROMPTS-25 TO FD-PROMPTS(25).
           MOVE QFD-PROMPTS-26 TO FD-PROMPTS(26).
           MOVE QFD-PROMPTS-27 TO FD-PROMPTS(27).
           MOVE QFD-PROMPTS-28 TO FD-PROMPTS(28).
           MOVE QFD-PROMPTS-29 TO FD-PROMPTS(29).
           MOVE QFD-PROMPTS-30 TO FD-PROMPTS(30).
           MOVE QFD-FIELDNO-1 TO FD-FIELDNO(1).
           MOVE QFD-FIELDROW-1 TO FD-FIELDROW(1).
           MOVE QFD-FIELDCOL-1 TO FD-FIELDCOL(1).
           MOVE QFD-FIELDED-1 TO FD-FIELDED(1).
           MOVE QFD-FIELDKEY-1 TO FD-FIELDKEY(1).
           MOVE QFD-FIELDNO-2 TO FD-FIELDNO(2).
           MOVE QFD-FIELDROW-2 TO FD-FIELDROW(2).
           MOVE QFD-FIELDCOL-2 TO FD-FIELDCOL(2).
           MOVE QFD-FIELDED-2 TO FD-FIELDED(2).
           MOVE QFD-FIELDKEY-2 TO FD-FIELDKEY(2).
           MOVE QFD-FIELDNO-3 TO FD-FIELDNO(3).
           MOVE QFD-FIELDROW-3 TO FD-FIELDROW(3).
           MOVE QFD-FIELDCOL-3 TO FD-FIELDCOL(3).
           MOVE QFD-FIELDED-3 TO FD-FIELDED(3).
           MOVE QFD-FIELDKEY-3 TO FD-FIELDKEY(3).
           MOVE QFD-FIELDNO-4 TO FD-FIELDNO(4).
           MOVE QFD-FIELDROW-4 TO FD-FIELDROW(4).
           MOVE QFD-FIELDCOL-4 TO FD-FIELDCOL(4).
           MOVE QFD-FIELDED-4 TO FD-FIELDED(4).
           MOVE QFD-FIELDKEY-4 TO FD-FIELDKEY(4).
           MOVE QFD-FIELDNO-5 TO FD-FIELDNO(5).
           MOVE QFD-FIELDROW-5 TO FD-FIELDROW(5).
           MOVE QFD-FIELDCOL-5 TO FD-FIELDCOL(5).
           MOVE QFD-FIELDED-5 TO FD-FIELDED(5).
           MOVE QFD-FIELDKEY-5 TO FD-FIELDKEY(5).
           MOVE QFD-FIELDNO-6 TO FD-FIELDNO(6).
           MOVE QFD-FIELDROW-6 TO FD-FIELDROW(6).
           MOVE QFD-FIELDCOL-6 TO FD-FIELDCOL(6).
           MOVE QFD-FIELDED-6 TO FD-FIELDED(6).
           MOVE QFD-FIELDKEY-6 TO FD-FIELDKEY(6).
           MOVE QFD-FIELDNO-7 TO FD-FIELDNO(7).
           MOVE QFD-FIELDROW-7 TO FD-FIELDROW(7).
           MOVE QFD-FIELDCOL-7 TO FD-FIELDCOL(7).
           MOVE QFD-FIELDED-7 TO FD-FIELDED(7).
           MOVE QFD-FIELDKEY-7 TO FD-FIELDKEY(7).
           MOVE QFD-FIELDNO-8 TO FD-FIELDNO(8).
           MOVE QFD-FIELDROW-8 TO FD-FIELDROW(8).
           MOVE QFD-FIELDCOL-8 TO FD-FIELDCOL(8).
           MOVE QFD-FIELDED-8 TO FD-FIELDED(8).
           MOVE QFD-FIELDKEY-8 TO FD-FIELDKEY(8).
           MOVE QFD-FIELDNO-9 TO FD-FIELDNO(9).
           MOVE QFD-FIELDROW-9 TO FD-FIELDROW(9).
           MOVE QFD-FIELDCOL-9 TO FD-FIELDCOL(9).
           MOVE QFD-FIELDED-9 TO FD-FIELDED(9).
           MOVE QFD-FIELDKEY-9 TO FD-FIELDKEY(9).
           MOVE QFD-FIELDNO-10 TO FD-FIELDNO(10).
           MOVE QFD-FIELDROW-10 TO FD-FIELDROW(10).
           MOVE QFD-FIELDCOL-10 TO FD-FIELDCOL(10).
           MOVE QFD-FIELDED-10 TO FD-FIELDED(10).
           MOVE QFD-FIELDKEY-10 TO FD-FIELDKEY(10).
           MOVE QFD-FIELDNO-11 TO FD-FIELDNO(11).
           MOVE QFD-FIELDROW-11 TO FD-FIELDROW(11).
           MOVE QFD-FIELDCOL-11 TO FD-FIELDCOL(11).
           MOVE QFD-FIELDED-11 TO FD-FIELDED(11).
           MOVE QFD-FIELDKEY-11 TO FD-FIELDKEY(11).
           MOVE QFD-FIELDNO-12 TO FD-FIELDNO(12).
           MOVE QFD-FIELDROW-12 TO FD-FIELDROW(12).
           MOVE QFD-FIELDCOL-12 TO FD-FIELDCOL(12).
           MOVE QFD-FIELDED-12 TO FD-FIELDED(12).
           MOVE QFD-FIELDKEY-12 TO FD-FIELDKEY(12).
           MOVE QFD-FIELDNO-13 TO FD-FIELDNO(13).
           MOVE QFD-FIELDROW-13 TO FD-FIELDROW(13).
           MOVE QFD-FIELDCOL-13 TO FD-FIELDCOL(13).
           MOVE QFD-FIELDED-13 TO FD-FIELDED(13).
           MOVE QFD-FIELDKEY-13 TO FD-FIELDKEY(13).
           MOVE QFD-FIELDNO-14 TO FD-FIELDNO(14).
           MOVE QFD-FIELDROW-14 TO FD-FIELDROW(14).
           MOVE QFD-FIELDCOL-14 TO FD-FIELDCOL(14).
           MOVE QFD-FIELDED-14 TO FD-FIELDED(14).
           MOVE QFD-FIELDKEY-14 TO FD-FIELDKEY(14).
           MOVE QFD-FIELDNO-15 TO FD-FIELDNO(15).
           MOVE QFD-FIELDROW-15 TO FD-FIELDROW(15).
           MOVE QFD-FIELDCOL-15 TO FD-FIELDCOL(15).
           MOVE QFD-FIELDED-15 TO FD-FIELDED(15).
           MOVE QFD-FIELDKEY-15 TO FD-FIELDKEY(15).
           MOVE QFD-FIELDNO-16 TO FD-FIELDNO(16).
           MOVE QFD-FIELDROW-16 TO FD-FIELDROW(16).
           MOVE QFD-FIELDCOL-16 TO FD-FIELDCOL(16).
           MOVE QFD-FIELDED-16 TO FD-FIELDED(16).
           MOVE QFD-FIELDKEY-16 TO FD-FIELDKEY(16).
           MOVE QFD-FIELDNO-17 TO FD-FIELDNO(17).
           MOVE QFD-FIELDROW-17 TO FD-FIELDROW(17).
           MOVE QFD-FIELDCOL-17 TO FD-FIELDCOL(17).
           MOVE QFD-FIELDED-17 TO FD-FIELDED(17).
           MOVE QFD-FIELDKEY-17 TO FD-FIELDKEY(17).
           MOVE QFD-FIELDNO-18 TO FD-FIELDNO(18).
           MOVE QFD-FIELDROW-18 TO FD-FIELDROW(18).
           MOVE QFD-FIELDCOL-18 TO FD-FIELDCOL(18).
           MOVE QFD-FIELDED-18 TO FD-FIELDED(18).
           MOVE QFD-FIELDKEY-18 TO FD-FIELDKEY(18).
           MOVE QFD-FIELDNO-19 TO FD-FIELDNO(19).
           MOVE QFD-FIELDROW-19 TO FD-FIELDROW(19).
           MOVE QFD-FIELDCOL-19 TO FD-FIELDCOL(19).
           MOVE QFD-FIELDED-19 TO FD-FIELDED(19).
           MOVE QFD-FIELDKEY-19 TO FD-FIELDKEY(19).
           MOVE QFD-FIELDNO-20 TO FD-FIELDNO(20).
           MOVE QFD-FIELDROW-20 TO FD-FIELDROW(20).
           MOVE QFD-FIELDCOL-20 TO FD-FIELDCOL(20).
           MOVE QFD-FIELDED-20 TO FD-FIELDED(20).
           MOVE QFD-FIELDKEY-20 TO FD-FIELDKEY(20).
           MOVE QFD-FIELDNO-21 TO FD-FIELDNO(21).
           MOVE QFD-FIELDROW-21 TO FD-FIELDROW(21).
           MOVE QFD-FIELDCOL-21 TO FD-FIELDCOL(21).
           MOVE QFD-FIELDED-21 TO FD-FIELDED(21).
           MOVE QFD-FIELDKEY-21 TO FD-FIELDKEY(21).
           MOVE QFD-FIELDNO-22 TO FD-FIELDNO(22).
           MOVE QFD-FIELDROW-22 TO FD-FIELDROW(22).
           MOVE QFD-FIELDCOL-22 TO FD-FIELDCOL(22).
           MOVE QFD-FIELDED-22 TO FD-FIELDED(22).
           MOVE QFD-FIELDKEY-22 TO FD-FIELDKEY(22).
           MOVE QFD-FIELDNO-23 TO FD-FIELDNO(23).
           MOVE QFD-FIELDROW-23 TO FD-FIELDROW(23).
           MOVE QFD-FIELDCOL-23 TO FD-FIELDCOL(23).
           MOVE QFD-FIELDED-23 TO FD-FIELDED(23).
           MOVE QFD-FIELDKEY-23 TO FD-FIELDKEY(23).
           MOVE QFD-FIELDNO-24 TO FD-FIELDNO(24).
           MOVE QFD-FIELDROW-24 TO FD-FIELDROW(24).
           MOVE QFD-FIELDCOL-24 TO FD-FIELDCOL(24).
           MOVE QFD-FIELDED-24 TO FD-FIELDED(24).
           MOVE QFD-FIELDKEY-24 TO FD-FIELDKEY(24).
           MOVE QFD-FIELDNO-25 TO FD-FIELDNO(25).
           MOVE QFD-FIELDROW-25 TO FD-FIELDROW(25).
           MOVE QFD-FIELDCOL-25 TO FD-FIELDCOL(25).
           MOVE QFD-FIELDED-25 TO FD-FIELDED(25).
           MOVE QFD-FIELDKEY-25 TO FD-FIELDKEY(25).
           MOVE QFD-FIELDNO-26 TO FD-FIELDNO(26).
           MOVE QFD-FIELDROW-26 TO FD-FIELDROW(26).
           MOVE QFD-FIELDCOL-26 TO FD-FIELDCOL(26).
           MOVE QFD-FIELDED-26 TO FD-FIELDED(26).
           MOVE QFD-FIELDKEY-26 TO FD-FIELDKEY(26).
           MOVE QFD-FIELDNO-27 TO FD-FIELDNO(27).
           MOVE QFD-FIELDROW-27 TO FD-FIELDROW(27).
           MOVE QFD-FIELDCOL-27 TO FD-FIELDCOL(27).
           MOVE QFD-FIELDED-27 TO FD-FIELDED(27).
           MOVE QFD-FIELDKEY-27 TO FD-FIELDKEY(27).
           MOVE QFD-FIELDNO-28 TO FD-FIELDNO(28).
           MOVE QFD-FIELDROW-28 TO FD-FIELDROW(28).
           MOVE QFD-FIELDCOL-28 TO FD-FIELDCOL(28).
           MOVE QFD-FIELDED-28 TO FD-FIELDED(28).
           MOVE QFD-FIELDKEY-28 TO FD-FIELDKEY(28).
           MOVE QFD-FIELDNO-29 TO FD-FIELDNO(29).
           MOVE QFD-FIELDROW-29 TO FD-FIELDROW(29).
           MOVE QFD-FIELDCOL-29 TO FD-FIELDCOL(29).
           MOVE QFD-FIELDED-29 TO FD-FIELDED(29).
           MOVE QFD-FIELDKEY-29 TO FD-FIELDKEY(29).
           MOVE QFD-FIELDNO-30 TO FD-FIELDNO(30).
           MOVE QFD-FIELDROW-30 TO FD-FIELDROW(30).
           MOVE QFD-FIELDCOL-30 TO FD-FIELDCOL(30).
           MOVE QFD-FIELDED-30 TO FD-FIELDED(30).
           MOVE QFD-FIELDKEY-30 TO FD-FIELDKEY(30).
           MOVE QFD-FIELDNO-31 TO FD-FIELDNO(31).
           MOVE QFD-FIELDROW-31 TO FD-FIELDROW(31).
           MOVE QFD-FIELDCOL-31 TO FD-FIELDCOL(31).
           MOVE QFD-FIELDED-31 TO FD-FIELDED(31).
           MOVE QFD-FIELDKEY-31 TO FD-FIELDKEY(31).
           MOVE QFD-FIELDNO-32 TO FD-FIELDNO(32).
           MOVE QFD-FIELDROW-32 TO FD-FIELDROW(32).
           MOVE QFD-FIELDCOL-32 TO FD-FIELDCOL(32).
           MOVE QFD-FIELDED-32 TO FD-FIELDED(32).
           MOVE QFD-FIELDKEY-32 TO FD-FIELDKEY(32).
           MOVE QFD-FIELDNO-33 TO FD-FIELDNO(33).
           MOVE QFD-FIELDROW-33 TO FD-FIELDROW(33).
           MOVE QFD-FIELDCOL-33 TO FD-FIELDCOL(33).
           MOVE QFD-FIELDED-33 TO FD-FIELDED(33).
           MOVE QFD-FIELDKEY-33 TO FD-FIELDKEY(33).
           MOVE QFD-FIELDNO-34 TO FD-FIELDNO(34).
           MOVE QFD-FIELDROW-34 TO FD-FIELDROW(34).
           MOVE QFD-FIELDCOL-34 TO FD-FIELDCOL(34).
           MOVE QFD-FIELDED-34 TO FD-FIELDED(34).
           MOVE QFD-FIELDKEY-34 TO FD-FIELDKEY(34).
           MOVE QFD-FIELDNO-35 TO FD-FIELDNO(35).
           MOVE QFD-FIELDROW-35 TO FD-FIELDROW(35).
           MOVE QFD-FIELDCOL-35 TO FD-FIELDCOL(35).
           MOVE QFD-FIELDED-35 TO FD-FIELDED(35).
           MOVE QFD-FIELDKEY-35 TO FD-FIELDKEY(35).
           MOVE QFD-FIELDNO-36 TO FD-FIELDNO(36).
           MOVE QFD-FIELDROW-36 TO FD-FIELDROW(36).
           MOVE QFD-FIELDCOL-36 TO FD-FIELDCOL(36).
           MOVE QFD-FIELDED-36 TO FD-FIELDED(36).
           MOVE QFD-FIELDKEY-36 TO FD-FIELDKEY(36).
           MOVE QFD-FIELDNO-37 TO FD-FIELDNO(37).
           MOVE QFD-FIELDROW-37 TO FD-FIELDROW(37).
           MOVE QFD-FIELDCOL-37 TO FD-FIELDCOL(37).
           MOVE QFD-FIELDED-37 TO FD-FIELDED(37).
           MOVE QFD-FIELDKEY-37 TO FD-FIELDKEY(37).
           MOVE QFD-FIELDNO-38 TO FD-FIELDNO(38).
           MOVE QFD-FIELDROW-38 TO FD-FIELDROW(38).
           MOVE QFD-FIELDCOL-38 TO FD-FIELDCOL(38).
           MOVE QFD-FIELDED-38 TO FD-FIELDED(38).
           MOVE QFD-FIELDKEY-38 TO FD-FIELDKEY(38).
           MOVE QFD-FIELDNO-39 TO FD-FIELDNO(39).
           MOVE QFD-FIELDROW-39 TO FD-FIELDROW(39).
           MOVE QFD-FIELDCOL-39 TO FD-FIELDCOL(39).
           MOVE QFD-FIELDED-39 TO FD-FIELDED(39).
           MOVE QFD-FIELDKEY-39 TO FD-FIELDKEY(39).
           MOVE QFD-FIELDNO-40 TO FD-FIELDNO(40).
           MOVE QFD-FIELDROW-40 TO FD-FIELDROW(40).
           MOVE QFD-FIELDCOL-40 TO FD-FIELDCOL(40).
           MOVE QFD-FIELDED-40 TO FD-FIELDED(40).
           MOVE QFD-FIELDKEY-40 TO FD-FIELDKEY(40).
           MOVE QFD-FIELDNO-41 TO FD-FIELDNO(41).
           MOVE QFD-FIELDROW-41 TO FD-FIELDROW(41).
           MOVE QFD-FIELDCOL-41 TO FD-FIELDCOL(41).
           MOVE QFD-FIELDED-41 TO FD-FIELDED(41).
           MOVE QFD-FIELDKEY-41 TO FD-FIELDKEY(41).
           MOVE QFD-FIELDNO-42 TO FD-FIELDNO(42).
           MOVE QFD-FIELDROW-42 TO FD-FIELDROW(42).
           MOVE QFD-FIELDCOL-42 TO FD-FIELDCOL(42).
           MOVE QFD-FIELDED-42 TO FD-FIELDED(42).
           MOVE QFD-FIELDKEY-42 TO FD-FIELDKEY(42).
           MOVE QFD-FIELDNO-43 TO FD-FIELDNO(43).
           MOVE QFD-FIELDROW-43 TO FD-FIELDROW(43).
           MOVE QFD-FIELDCOL-43 TO FD-FIELDCOL(43).
           MOVE QFD-FIELDED-43 TO FD-FIELDED(43).
           MOVE QFD-FIELDKEY-43 TO FD-FIELDKEY(43).
           MOVE QFD-FIELDNO-44 TO FD-FIELDNO(44).
           MOVE QFD-FIELDROW-44 TO FD-FIELDROW(44).
           MOVE QFD-FIELDCOL-44 TO FD-FIELDCOL(44).
           MOVE QFD-FIELDED-44 TO FD-FIELDED(44).
           MOVE QFD-FIELDKEY-44 TO FD-FIELDKEY(44).
           MOVE QFD-FIELDNO-45 TO FD-FIELDNO(45).
           MOVE QFD-FIELDROW-45 TO FD-FIELDROW(45).
           MOVE QFD-FIELDCOL-45 TO FD-FIELDCOL(45).
           MOVE QFD-FIELDED-45 TO FD-FIELDED(45).
           MOVE QFD-FIELDKEY-45 TO FD-FIELDKEY(45).
           MOVE QFD-FIELDNO-46 TO FD-FIELDNO(46).
           MOVE QFD-FIELDROW-46 TO FD-FIELDROW(46).
           MOVE QFD-FIELDCOL-46 TO FD-FIELDCOL(46).
           MOVE QFD-FIELDED-46 TO FD-FIELDED(46).
           MOVE QFD-FIELDKEY-46 TO FD-FIELDKEY(46).
           MOVE QFD-FIELDNO-47 TO FD-FIELDNO(47).
           MOVE QFD-FIELDROW-47 TO FD-FIELDROW(47).
           MOVE QFD-FIELDCOL-47 TO FD-FIELDCOL(47).
           MOVE QFD-FIELDED-47 TO FD-FIELDED(47).
           MOVE QFD-FIELDKEY-47 TO FD-FIELDKEY(47).
           MOVE QFD-FIELDNO-48 TO FD-FIELDNO(48).
           MOVE QFD-FIELDROW-48 TO FD-FIELDROW(48).
           MOVE QFD-FIELDCOL-48 TO FD-FIELDCOL(48).
           MOVE QFD-FIELDED-48 TO FD-FIELDED(48).
           MOVE QFD-FIELDKEY-48 TO FD-FIELDKEY(48).
           MOVE QFD-FIELDNO-49 TO FD-FIELDNO(49).
           MOVE QFD-FIELDROW-49 TO FD-FIELDROW(49).
           MOVE QFD-FIELDCOL-49 TO FD-FIELDCOL(49).
           MOVE QFD-FIELDED-49 TO FD-FIELDED(49).
           MOVE QFD-FIELDKEY-49 TO FD-FIELDKEY(49).
           MOVE QFD-FIELDNO-50 TO FD-FIELDNO(50).
           MOVE QFD-FIELDROW-50 TO FD-FIELDROW(50).
           MOVE QFD-FIELDCOL-50 TO FD-FIELDCOL(50).
           MOVE QFD-FIELDED-50 TO FD-FIELDED(50).
           MOVE QFD-FIELDKEY-50 TO FD-FIELDKEY(50).
           MOVE QFD-1STFILE TO FD-1STFILE.
           MOVE QFD-INCR-DELCNT TO FD-INCR-DELCNT.
           MOVE QFD-FMTYPE TO FD-FMTYPE.
           MOVE QFD-PRCONT TO FD-PRCONT.
           MOVE QFD-NEXTFM TO FD-NEXTFM.
           MOVE QFD-VALID-BRANCH TO FD-VALID-BRANCH.
           MOVE QFD-MIN-FORM-SENT-DAYS TO FD-MIN-FORM-SENT-DAYS.
           MOVE QFD-SKIP-BAD-ADR TO FD-SKIP-BAD-ADR.
           MOVE QFD-SECURITY-PROFILE TO FD-SECURITY-PROFILE.
           MOVE QFD-FORM-RIGHT-TO-CURE TO FD-FORM-RIGHT-TO-CURE.
           MOVE QFD-TEST-WHICH-STATE TO FD-TEST-WHICH-STATE.
           MOVE QFD-STATE-1 TO FD-STATE(1).
           MOVE QFD-STATE-2 TO FD-STATE(2).
           MOVE QFD-STATE-3 TO FD-STATE(3).
           MOVE QFD-STATE-4 TO FD-STATE(4).
           MOVE QFD-STATE-5 TO FD-STATE(5).
           MOVE QFD-STATE-6 TO FD-STATE(6).
           MOVE QFD-STATE-7 TO FD-STATE(7).
           MOVE QFD-STATE-8 TO FD-STATE(8).
           MOVE QFD-STATE-9 TO FD-STATE(9).
           MOVE QFD-STATE-10 TO FD-STATE(10).
           MOVE QFD-STATE-11 TO FD-STATE(11).
           MOVE QFD-STATE-12 TO FD-STATE(12).
           MOVE QFD-STATE-13 TO FD-STATE(13).
           MOVE QFD-STATE-14 TO FD-STATE(14).
           MOVE QFD-STATE-15 TO FD-STATE(15).
           MOVE QFD-STATE-16 TO FD-STATE(16).
           MOVE QFD-STATE-17 TO FD-STATE(17).
           MOVE QFD-STATE-18 TO FD-STATE(18).
           MOVE QFD-STATE-19 TO FD-STATE(19).
           MOVE QFD-STATE-20 TO FD-STATE(20).
           MOVE QFD-STATE-21 TO FD-STATE(21).
           MOVE QFD-STATE-22 TO FD-STATE(22).
           MOVE QFD-STATE-23 TO FD-STATE(23).
           MOVE QFD-STATE-24 TO FD-STATE(24).
           MOVE QFD-STATE-25 TO FD-STATE(25).
           MOVE QFD-STATE-26 TO FD-STATE(26).
           MOVE QFD-STATE-27 TO FD-STATE(27).
           MOVE QFD-STATE-28 TO FD-STATE(28).
           MOVE QFD-STATE-29 TO FD-STATE(29).
           MOVE QFD-STATE-30 TO FD-STATE(30).
           MOVE QFD-STATE-31 TO FD-STATE(31).
           MOVE QFD-STATE-32 TO FD-STATE(32).
           MOVE QFD-STATE-33 TO FD-STATE(33).
           MOVE QFD-STATE-34 TO FD-STATE(34).
           MOVE QFD-STATE-35 TO FD-STATE(35).
           MOVE QFD-STATE-36 TO FD-STATE(36).
           MOVE QFD-STATE-37 TO FD-STATE(37).
           MOVE QFD-STATE-38 TO FD-STATE(38).
           MOVE QFD-STATE-39 TO FD-STATE(39).
           MOVE QFD-STATE-40 TO FD-STATE(40).
           MOVE QFD-STATE-41 TO FD-STATE(41).
           MOVE QFD-STATE-42 TO FD-STATE(42).
           MOVE QFD-STATE-43 TO FD-STATE(43).
           MOVE QFD-STATE-44 TO FD-STATE(44).
           MOVE QFD-STATE-45 TO FD-STATE(45).
           MOVE QFD-STATE-46 TO FD-STATE(46).
           MOVE QFD-STATE-47 TO FD-STATE(47).
           MOVE QFD-STATE-48 TO FD-STATE(48).
           MOVE QFD-STATE-49 TO FD-STATE(49).
           MOVE QFD-STATE-50 TO FD-STATE(50).
           MOVE QFD-TYPE-OF-DOC TO FD-TYPE-OF-DOC.

      *-----------------------------------------------------------------
      *    LOAD QFD-REC FROM FD-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-FD-FIELDS.
           MOVE FD-FMNO TO QFD-FMNO.

           IF ( FD-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QFD-LTOUCH-DATE
           ELSE
              MOVE FD-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QFD-LTOUCH-DATE.

           MOVE FD-DESC TO QFD-DESC.
           MOVE FD-OPTION TO QFD-OPTION.
           MOVE FD-FORM-CHG-CD TO QFD-FORM-CHG-CD.
           MOVE FD-PROG-PREFIX TO QFD-PROG-PREFIX.
           MOVE FD-TYPE TO QFD-TYPE.
           MOVE FD-LNMEMO TO QFD-LNMEMO.
           MOVE FD-BODY TO QFD-BODY.
           MOVE FD-TOP TO QFD-TOP.
           MOVE FD-BOTTOM TO QFD-BOTTOM.
           MOVE FD-PROG TO QFD-PROG.
           MOVE FD-PROMPTS(1) TO QFD-PROMPTS-1.
           MOVE FD-PROMPTS(2) TO QFD-PROMPTS-2.
           MOVE FD-PROMPTS(3) TO QFD-PROMPTS-3.
           MOVE FD-PROMPTS(4) TO QFD-PROMPTS-4.
           MOVE FD-PROMPTS(5) TO QFD-PROMPTS-5.
           MOVE FD-PROMPTS(6) TO QFD-PROMPTS-6.
           MOVE FD-PROMPTS(7) TO QFD-PROMPTS-7.
           MOVE FD-PROMPTS(8) TO QFD-PROMPTS-8.
           MOVE FD-PROMPTS(9) TO QFD-PROMPTS-9.
           MOVE FD-PROMPTS(10) TO QFD-PROMPTS-10.
           MOVE FD-PROMPTS(11) TO QFD-PROMPTS-11.
           MOVE FD-PROMPTS(12) TO QFD-PROMPTS-12.
           MOVE FD-PROMPTS(13) TO QFD-PROMPTS-13.
           MOVE FD-PROMPTS(14) TO QFD-PROMPTS-14.
           MOVE FD-PROMPTS(15) TO QFD-PROMPTS-15.
           MOVE FD-PROMPTS(16) TO QFD-PROMPTS-16.
           MOVE FD-PROMPTS(17) TO QFD-PROMPTS-17.
           MOVE FD-PROMPTS(18) TO QFD-PROMPTS-18.
           MOVE FD-PROMPTS(19) TO QFD-PROMPTS-19.
           MOVE FD-PROMPTS(20) TO QFD-PROMPTS-20.
           MOVE FD-PROMPTS(21) TO QFD-PROMPTS-21.
           MOVE FD-PROMPTS(22) TO QFD-PROMPTS-22.
           MOVE FD-PROMPTS(23) TO QFD-PROMPTS-23.
           MOVE FD-PROMPTS(24) TO QFD-PROMPTS-24.
           MOVE FD-PROMPTS(25) TO QFD-PROMPTS-25.
           MOVE FD-PROMPTS(26) TO QFD-PROMPTS-26.
           MOVE FD-PROMPTS(27) TO QFD-PROMPTS-27.
           MOVE FD-PROMPTS(28) TO QFD-PROMPTS-28.
           MOVE FD-PROMPTS(29) TO QFD-PROMPTS-29.
           MOVE FD-PROMPTS(30) TO QFD-PROMPTS-30.
           MOVE FD-FIELDNO(1) TO QFD-FIELDNO-1.
           MOVE FD-FIELDROW(1) TO QFD-FIELDROW-1.
           MOVE FD-FIELDCOL(1) TO QFD-FIELDCOL-1.
           MOVE FD-FIELDED(1) TO QFD-FIELDED-1.
           MOVE FD-FIELDKEY(1) TO QFD-FIELDKEY-1.
           MOVE FD-FIELDNO(2) TO QFD-FIELDNO-2.
           MOVE FD-FIELDROW(2) TO QFD-FIELDROW-2.
           MOVE FD-FIELDCOL(2) TO QFD-FIELDCOL-2.
           MOVE FD-FIELDED(2) TO QFD-FIELDED-2.
           MOVE FD-FIELDKEY(2) TO QFD-FIELDKEY-2.
           MOVE FD-FIELDNO(3) TO QFD-FIELDNO-3.
           MOVE FD-FIELDROW(3) TO QFD-FIELDROW-3.
           MOVE FD-FIELDCOL(3) TO QFD-FIELDCOL-3.
           MOVE FD-FIELDED(3) TO QFD-FIELDED-3.
           MOVE FD-FIELDKEY(3) TO QFD-FIELDKEY-3.
           MOVE FD-FIELDNO(4) TO QFD-FIELDNO-4.
           MOVE FD-FIELDROW(4) TO QFD-FIELDROW-4.
           MOVE FD-FIELDCOL(4) TO QFD-FIELDCOL-4.
           MOVE FD-FIELDED(4) TO QFD-FIELDED-4.
           MOVE FD-FIELDKEY(4) TO QFD-FIELDKEY-4.
           MOVE FD-FIELDNO(5) TO QFD-FIELDNO-5.
           MOVE FD-FIELDROW(5) TO QFD-FIELDROW-5.
           MOVE FD-FIELDCOL(5) TO QFD-FIELDCOL-5.
           MOVE FD-FIELDED(5) TO QFD-FIELDED-5.
           MOVE FD-FIELDKEY(5) TO QFD-FIELDKEY-5.
           MOVE FD-FIELDNO(6) TO QFD-FIELDNO-6.
           MOVE FD-FIELDROW(6) TO QFD-FIELDROW-6.
           MOVE FD-FIELDCOL(6) TO QFD-FIELDCOL-6.
           MOVE FD-FIELDED(6) TO QFD-FIELDED-6.
           MOVE FD-FIELDKEY(6) TO QFD-FIELDKEY-6.
           MOVE FD-FIELDNO(7) TO QFD-FIELDNO-7.
           MOVE FD-FIELDROW(7) TO QFD-FIELDROW-7.
           MOVE FD-FIELDCOL(7) TO QFD-FIELDCOL-7.
           MOVE FD-FIELDED(7) TO QFD-FIELDED-7.
           MOVE FD-FIELDKEY(7) TO QFD-FIELDKEY-7.
           MOVE FD-FIELDNO(8) TO QFD-FIELDNO-8.
           MOVE FD-FIELDROW(8) TO QFD-FIELDROW-8.
           MOVE FD-FIELDCOL(8) TO QFD-FIELDCOL-8.
           MOVE FD-FIELDED(8) TO QFD-FIELDED-8.
           MOVE FD-FIELDKEY(8) TO QFD-FIELDKEY-8.
           MOVE FD-FIELDNO(9) TO QFD-FIELDNO-9.
           MOVE FD-FIELDROW(9) TO QFD-FIELDROW-9.
           MOVE FD-FIELDCOL(9) TO QFD-FIELDCOL-9.
           MOVE FD-FIELDED(9) TO QFD-FIELDED-9.
           MOVE FD-FIELDKEY(9) TO QFD-FIELDKEY-9.
           MOVE FD-FIELDNO(10) TO QFD-FIELDNO-10.
           MOVE FD-FIELDROW(10) TO QFD-FIELDROW-10.
           MOVE FD-FIELDCOL(10) TO QFD-FIELDCOL-10.
           MOVE FD-FIELDED(10) TO QFD-FIELDED-10.
           MOVE FD-FIELDKEY(10) TO QFD-FIELDKEY-10.
           MOVE FD-FIELDNO(11) TO QFD-FIELDNO-11.
           MOVE FD-FIELDROW(11) TO QFD-FIELDROW-11.
           MOVE FD-FIELDCOL(11) TO QFD-FIELDCOL-11.
           MOVE FD-FIELDED(11) TO QFD-FIELDED-11.
           MOVE FD-FIELDKEY(11) TO QFD-FIELDKEY-11.
           MOVE FD-FIELDNO(12) TO QFD-FIELDNO-12.
           MOVE FD-FIELDROW(12) TO QFD-FIELDROW-12.
           MOVE FD-FIELDCOL(12) TO QFD-FIELDCOL-12.
           MOVE FD-FIELDED(12) TO QFD-FIELDED-12.
           MOVE FD-FIELDKEY(12) TO QFD-FIELDKEY-12.
           MOVE FD-FIELDNO(13) TO QFD-FIELDNO-13.
           MOVE FD-FIELDROW(13) TO QFD-FIELDROW-13.
           MOVE FD-FIELDCOL(13) TO QFD-FIELDCOL-13.
           MOVE FD-FIELDED(13) TO QFD-FIELDED-13.
           MOVE FD-FIELDKEY(13) TO QFD-FIELDKEY-13.
           MOVE FD-FIELDNO(14) TO QFD-FIELDNO-14.
           MOVE FD-FIELDROW(14) TO QFD-FIELDROW-14.
           MOVE FD-FIELDCOL(14) TO QFD-FIELDCOL-14.
           MOVE FD-FIELDED(14) TO QFD-FIELDED-14.
           MOVE FD-FIELDKEY(14) TO QFD-FIELDKEY-14.
           MOVE FD-FIELDNO(15) TO QFD-FIELDNO-15.
           MOVE FD-FIELDROW(15) TO QFD-FIELDROW-15.
           MOVE FD-FIELDCOL(15) TO QFD-FIELDCOL-15.
           MOVE FD-FIELDED(15) TO QFD-FIELDED-15.
           MOVE FD-FIELDKEY(15) TO QFD-FIELDKEY-15.
           MOVE FD-FIELDNO(16) TO QFD-FIELDNO-16.
           MOVE FD-FIELDROW(16) TO QFD-FIELDROW-16.
           MOVE FD-FIELDCOL(16) TO QFD-FIELDCOL-16.
           MOVE FD-FIELDED(16) TO QFD-FIELDED-16.
           MOVE FD-FIELDKEY(16) TO QFD-FIELDKEY-16.
           MOVE FD-FIELDNO(17) TO QFD-FIELDNO-17.
           MOVE FD-FIELDROW(17) TO QFD-FIELDROW-17.
           MOVE FD-FIELDCOL(17) TO QFD-FIELDCOL-17.
           MOVE FD-FIELDED(17) TO QFD-FIELDED-17.
           MOVE FD-FIELDKEY(17) TO QFD-FIELDKEY-17.
           MOVE FD-FIELDNO(18) TO QFD-FIELDNO-18.
           MOVE FD-FIELDROW(18) TO QFD-FIELDROW-18.
           MOVE FD-FIELDCOL(18) TO QFD-FIELDCOL-18.
           MOVE FD-FIELDED(18) TO QFD-FIELDED-18.
           MOVE FD-FIELDKEY(18) TO QFD-FIELDKEY-18.
           MOVE FD-FIELDNO(19) TO QFD-FIELDNO-19.
           MOVE FD-FIELDROW(19) TO QFD-FIELDROW-19.
           MOVE FD-FIELDCOL(19) TO QFD-FIELDCOL-19.
           MOVE FD-FIELDED(19) TO QFD-FIELDED-19.
           MOVE FD-FIELDKEY(19) TO QFD-FIELDKEY-19.
           MOVE FD-FIELDNO(20) TO QFD-FIELDNO-20.
           MOVE FD-FIELDROW(20) TO QFD-FIELDROW-20.
           MOVE FD-FIELDCOL(20) TO QFD-FIELDCOL-20.
           MOVE FD-FIELDED(20) TO QFD-FIELDED-20.
           MOVE FD-FIELDKEY(20) TO QFD-FIELDKEY-20.
           MOVE FD-FIELDNO(21) TO QFD-FIELDNO-21.
           MOVE FD-FIELDROW(21) TO QFD-FIELDROW-21.
           MOVE FD-FIELDCOL(21) TO QFD-FIELDCOL-21.
           MOVE FD-FIELDED(21) TO QFD-FIELDED-21.
           MOVE FD-FIELDKEY(21) TO QFD-FIELDKEY-21.
           MOVE FD-FIELDNO(22) TO QFD-FIELDNO-22.
           MOVE FD-FIELDROW(22) TO QFD-FIELDROW-22.
           MOVE FD-FIELDCOL(22) TO QFD-FIELDCOL-22.
           MOVE FD-FIELDED(22) TO QFD-FIELDED-22.
           MOVE FD-FIELDKEY(22) TO QFD-FIELDKEY-22.
           MOVE FD-FIELDNO(23) TO QFD-FIELDNO-23.
           MOVE FD-FIELDROW(23) TO QFD-FIELDROW-23.
           MOVE FD-FIELDCOL(23) TO QFD-FIELDCOL-23.
           MOVE FD-FIELDED(23) TO QFD-FIELDED-23.
           MOVE FD-FIELDKEY(23) TO QFD-FIELDKEY-23.
           MOVE FD-FIELDNO(24) TO QFD-FIELDNO-24.
           MOVE FD-FIELDROW(24) TO QFD-FIELDROW-24.
           MOVE FD-FIELDCOL(24) TO QFD-FIELDCOL-24.
           MOVE FD-FIELDED(24) TO QFD-FIELDED-24.
           MOVE FD-FIELDKEY(24) TO QFD-FIELDKEY-24.
           MOVE FD-FIELDNO(25) TO QFD-FIELDNO-25.
           MOVE FD-FIELDROW(25) TO QFD-FIELDROW-25.
           MOVE FD-FIELDCOL(25) TO QFD-FIELDCOL-25.
           MOVE FD-FIELDED(25) TO QFD-FIELDED-25.
           MOVE FD-FIELDKEY(25) TO QFD-FIELDKEY-25.
           MOVE FD-FIELDNO(26) TO QFD-FIELDNO-26.
           MOVE FD-FIELDROW(26) TO QFD-FIELDROW-26.
           MOVE FD-FIELDCOL(26) TO QFD-FIELDCOL-26.
           MOVE FD-FIELDED(26) TO QFD-FIELDED-26.
           MOVE FD-FIELDKEY(26) TO QFD-FIELDKEY-26.
           MOVE FD-FIELDNO(27) TO QFD-FIELDNO-27.
           MOVE FD-FIELDROW(27) TO QFD-FIELDROW-27.
           MOVE FD-FIELDCOL(27) TO QFD-FIELDCOL-27.
           MOVE FD-FIELDED(27) TO QFD-FIELDED-27.
           MOVE FD-FIELDKEY(27) TO QFD-FIELDKEY-27.
           MOVE FD-FIELDNO(28) TO QFD-FIELDNO-28.
           MOVE FD-FIELDROW(28) TO QFD-FIELDROW-28.
           MOVE FD-FIELDCOL(28) TO QFD-FIELDCOL-28.
           MOVE FD-FIELDED(28) TO QFD-FIELDED-28.
           MOVE FD-FIELDKEY(28) TO QFD-FIELDKEY-28.
           MOVE FD-FIELDNO(29) TO QFD-FIELDNO-29.
           MOVE FD-FIELDROW(29) TO QFD-FIELDROW-29.
           MOVE FD-FIELDCOL(29) TO QFD-FIELDCOL-29.
           MOVE FD-FIELDED(29) TO QFD-FIELDED-29.
           MOVE FD-FIELDKEY(29) TO QFD-FIELDKEY-29.
           MOVE FD-FIELDNO(30) TO QFD-FIELDNO-30.
           MOVE FD-FIELDROW(30) TO QFD-FIELDROW-30.
           MOVE FD-FIELDCOL(30) TO QFD-FIELDCOL-30.
           MOVE FD-FIELDED(30) TO QFD-FIELDED-30.
           MOVE FD-FIELDKEY(30) TO QFD-FIELDKEY-30.
           MOVE FD-FIELDNO(31) TO QFD-FIELDNO-31.
           MOVE FD-FIELDROW(31) TO QFD-FIELDROW-31.
           MOVE FD-FIELDCOL(31) TO QFD-FIELDCOL-31.
           MOVE FD-FIELDED(31) TO QFD-FIELDED-31.
           MOVE FD-FIELDKEY(31) TO QFD-FIELDKEY-31.
           MOVE FD-FIELDNO(32) TO QFD-FIELDNO-32.
           MOVE FD-FIELDROW(32) TO QFD-FIELDROW-32.
           MOVE FD-FIELDCOL(32) TO QFD-FIELDCOL-32.
           MOVE FD-FIELDED(32) TO QFD-FIELDED-32.
           MOVE FD-FIELDKEY(32) TO QFD-FIELDKEY-32.
           MOVE FD-FIELDNO(33) TO QFD-FIELDNO-33.
           MOVE FD-FIELDROW(33) TO QFD-FIELDROW-33.
           MOVE FD-FIELDCOL(33) TO QFD-FIELDCOL-33.
           MOVE FD-FIELDED(33) TO QFD-FIELDED-33.
           MOVE FD-FIELDKEY(33) TO QFD-FIELDKEY-33.
           MOVE FD-FIELDNO(34) TO QFD-FIELDNO-34.
           MOVE FD-FIELDROW(34) TO QFD-FIELDROW-34.
           MOVE FD-FIELDCOL(34) TO QFD-FIELDCOL-34.
           MOVE FD-FIELDED(34) TO QFD-FIELDED-34.
           MOVE FD-FIELDKEY(34) TO QFD-FIELDKEY-34.
           MOVE FD-FIELDNO(35) TO QFD-FIELDNO-35.
           MOVE FD-FIELDROW(35) TO QFD-FIELDROW-35.
           MOVE FD-FIELDCOL(35) TO QFD-FIELDCOL-35.
           MOVE FD-FIELDED(35) TO QFD-FIELDED-35.
           MOVE FD-FIELDKEY(35) TO QFD-FIELDKEY-35.
           MOVE FD-FIELDNO(36) TO QFD-FIELDNO-36.
           MOVE FD-FIELDROW(36) TO QFD-FIELDROW-36.
           MOVE FD-FIELDCOL(36) TO QFD-FIELDCOL-36.
           MOVE FD-FIELDED(36) TO QFD-FIELDED-36.
           MOVE FD-FIELDKEY(36) TO QFD-FIELDKEY-36.
           MOVE FD-FIELDNO(37) TO QFD-FIELDNO-37.
           MOVE FD-FIELDROW(37) TO QFD-FIELDROW-37.
           MOVE FD-FIELDCOL(37) TO QFD-FIELDCOL-37.
           MOVE FD-FIELDED(37) TO QFD-FIELDED-37.
           MOVE FD-FIELDKEY(37) TO QFD-FIELDKEY-37.
           MOVE FD-FIELDNO(38) TO QFD-FIELDNO-38.
           MOVE FD-FIELDROW(38) TO QFD-FIELDROW-38.
           MOVE FD-FIELDCOL(38) TO QFD-FIELDCOL-38.
           MOVE FD-FIELDED(38) TO QFD-FIELDED-38.
           MOVE FD-FIELDKEY(38) TO QFD-FIELDKEY-38.
           MOVE FD-FIELDNO(39) TO QFD-FIELDNO-39.
           MOVE FD-FIELDROW(39) TO QFD-FIELDROW-39.
           MOVE FD-FIELDCOL(39) TO QFD-FIELDCOL-39.
           MOVE FD-FIELDED(39) TO QFD-FIELDED-39.
           MOVE FD-FIELDKEY(39) TO QFD-FIELDKEY-39.
           MOVE FD-FIELDNO(40) TO QFD-FIELDNO-40.
           MOVE FD-FIELDROW(40) TO QFD-FIELDROW-40.
           MOVE FD-FIELDCOL(40) TO QFD-FIELDCOL-40.
           MOVE FD-FIELDED(40) TO QFD-FIELDED-40.
           MOVE FD-FIELDKEY(40) TO QFD-FIELDKEY-40.
           MOVE FD-FIELDNO(41) TO QFD-FIELDNO-41.
           MOVE FD-FIELDROW(41) TO QFD-FIELDROW-41.
           MOVE FD-FIELDCOL(41) TO QFD-FIELDCOL-41.
           MOVE FD-FIELDED(41) TO QFD-FIELDED-41.
           MOVE FD-FIELDKEY(41) TO QFD-FIELDKEY-41.
           MOVE FD-FIELDNO(42) TO QFD-FIELDNO-42.
           MOVE FD-FIELDROW(42) TO QFD-FIELDROW-42.
           MOVE FD-FIELDCOL(42) TO QFD-FIELDCOL-42.
           MOVE FD-FIELDED(42) TO QFD-FIELDED-42.
           MOVE FD-FIELDKEY(42) TO QFD-FIELDKEY-42.
           MOVE FD-FIELDNO(43) TO QFD-FIELDNO-43.
           MOVE FD-FIELDROW(43) TO QFD-FIELDROW-43.
           MOVE FD-FIELDCOL(43) TO QFD-FIELDCOL-43.
           MOVE FD-FIELDED(43) TO QFD-FIELDED-43.
           MOVE FD-FIELDKEY(43) TO QFD-FIELDKEY-43.
           MOVE FD-FIELDNO(44) TO QFD-FIELDNO-44.
           MOVE FD-FIELDROW(44) TO QFD-FIELDROW-44.
           MOVE FD-FIELDCOL(44) TO QFD-FIELDCOL-44.
           MOVE FD-FIELDED(44) TO QFD-FIELDED-44.
           MOVE FD-FIELDKEY(44) TO QFD-FIELDKEY-44.
           MOVE FD-FIELDNO(45) TO QFD-FIELDNO-45.
           MOVE FD-FIELDROW(45) TO QFD-FIELDROW-45.
           MOVE FD-FIELDCOL(45) TO QFD-FIELDCOL-45.
           MOVE FD-FIELDED(45) TO QFD-FIELDED-45.
           MOVE FD-FIELDKEY(45) TO QFD-FIELDKEY-45.
           MOVE FD-FIELDNO(46) TO QFD-FIELDNO-46.
           MOVE FD-FIELDROW(46) TO QFD-FIELDROW-46.
           MOVE FD-FIELDCOL(46) TO QFD-FIELDCOL-46.
           MOVE FD-FIELDED(46) TO QFD-FIELDED-46.
           MOVE FD-FIELDKEY(46) TO QFD-FIELDKEY-46.
           MOVE FD-FIELDNO(47) TO QFD-FIELDNO-47.
           MOVE FD-FIELDROW(47) TO QFD-FIELDROW-47.
           MOVE FD-FIELDCOL(47) TO QFD-FIELDCOL-47.
           MOVE FD-FIELDED(47) TO QFD-FIELDED-47.
           MOVE FD-FIELDKEY(47) TO QFD-FIELDKEY-47.
           MOVE FD-FIELDNO(48) TO QFD-FIELDNO-48.
           MOVE FD-FIELDROW(48) TO QFD-FIELDROW-48.
           MOVE FD-FIELDCOL(48) TO QFD-FIELDCOL-48.
           MOVE FD-FIELDED(48) TO QFD-FIELDED-48.
           MOVE FD-FIELDKEY(48) TO QFD-FIELDKEY-48.
           MOVE FD-FIELDNO(49) TO QFD-FIELDNO-49.
           MOVE FD-FIELDROW(49) TO QFD-FIELDROW-49.
           MOVE FD-FIELDCOL(49) TO QFD-FIELDCOL-49.
           MOVE FD-FIELDED(49) TO QFD-FIELDED-49.
           MOVE FD-FIELDKEY(49) TO QFD-FIELDKEY-49.
           MOVE FD-FIELDNO(50) TO QFD-FIELDNO-50.
           MOVE FD-FIELDROW(50) TO QFD-FIELDROW-50.
           MOVE FD-FIELDCOL(50) TO QFD-FIELDCOL-50.
           MOVE FD-FIELDED(50) TO QFD-FIELDED-50.
           MOVE FD-FIELDKEY(50) TO QFD-FIELDKEY-50.
           MOVE FD-1STFILE TO QFD-1STFILE.
           MOVE FD-INCR-DELCNT TO QFD-INCR-DELCNT.
           MOVE FD-FMTYPE TO QFD-FMTYPE.
           MOVE FD-PRCONT TO QFD-PRCONT.
           MOVE FD-NEXTFM TO QFD-NEXTFM.
           MOVE FD-VALID-BRANCH TO QFD-VALID-BRANCH.
           MOVE FD-MIN-FORM-SENT-DAYS TO QFD-MIN-FORM-SENT-DAYS.
           MOVE FD-SKIP-BAD-ADR TO QFD-SKIP-BAD-ADR.
           MOVE FD-SECURITY-PROFILE TO QFD-SECURITY-PROFILE.
           MOVE FD-FORM-RIGHT-TO-CURE TO QFD-FORM-RIGHT-TO-CURE.
           MOVE FD-TEST-WHICH-STATE TO QFD-TEST-WHICH-STATE.
           MOVE FD-STATE(1) TO QFD-STATE-1.
           MOVE FD-STATE(2) TO QFD-STATE-2.
           MOVE FD-STATE(3) TO QFD-STATE-3.
           MOVE FD-STATE(4) TO QFD-STATE-4.
           MOVE FD-STATE(5) TO QFD-STATE-5.
           MOVE FD-STATE(6) TO QFD-STATE-6.
           MOVE FD-STATE(7) TO QFD-STATE-7.
           MOVE FD-STATE(8) TO QFD-STATE-8.
           MOVE FD-STATE(9) TO QFD-STATE-9.
           MOVE FD-STATE(10) TO QFD-STATE-10.
           MOVE FD-STATE(11) TO QFD-STATE-11.
           MOVE FD-STATE(12) TO QFD-STATE-12.
           MOVE FD-STATE(13) TO QFD-STATE-13.
           MOVE FD-STATE(14) TO QFD-STATE-14.
           MOVE FD-STATE(15) TO QFD-STATE-15.
           MOVE FD-STATE(16) TO QFD-STATE-16.
           MOVE FD-STATE(17) TO QFD-STATE-17.
           MOVE FD-STATE(18) TO QFD-STATE-18.
           MOVE FD-STATE(19) TO QFD-STATE-19.
           MOVE FD-STATE(20) TO QFD-STATE-20.
           MOVE FD-STATE(21) TO QFD-STATE-21.
           MOVE FD-STATE(22) TO QFD-STATE-22.
           MOVE FD-STATE(23) TO QFD-STATE-23.
           MOVE FD-STATE(24) TO QFD-STATE-24.
           MOVE FD-STATE(25) TO QFD-STATE-25.
           MOVE FD-STATE(26) TO QFD-STATE-26.
           MOVE FD-STATE(27) TO QFD-STATE-27.
           MOVE FD-STATE(28) TO QFD-STATE-28.
           MOVE FD-STATE(29) TO QFD-STATE-29.
           MOVE FD-STATE(30) TO QFD-STATE-30.
           MOVE FD-STATE(31) TO QFD-STATE-31.
           MOVE FD-STATE(32) TO QFD-STATE-32.
           MOVE FD-STATE(33) TO QFD-STATE-33.
           MOVE FD-STATE(34) TO QFD-STATE-34.
           MOVE FD-STATE(35) TO QFD-STATE-35.
           MOVE FD-STATE(36) TO QFD-STATE-36.
           MOVE FD-STATE(37) TO QFD-STATE-37.
           MOVE FD-STATE(38) TO QFD-STATE-38.
           MOVE FD-STATE(39) TO QFD-STATE-39.
           MOVE FD-STATE(40) TO QFD-STATE-40.
           MOVE FD-STATE(41) TO QFD-STATE-41.
           MOVE FD-STATE(42) TO QFD-STATE-42.
           MOVE FD-STATE(43) TO QFD-STATE-43.
           MOVE FD-STATE(44) TO QFD-STATE-44.
           MOVE FD-STATE(45) TO QFD-STATE-45.
           MOVE FD-STATE(46) TO QFD-STATE-46.
           MOVE FD-STATE(47) TO QFD-STATE-47.
           MOVE FD-STATE(48) TO QFD-STATE-48.
           MOVE FD-STATE(49) TO QFD-STATE-49.
           MOVE FD-STATE(50) TO QFD-STATE-50.
           MOVE FD-TYPE-OF-DOC TO QFD-TYPE-OF-DOC.
 
