      * COPYMEMBER: LIBLP/LPFD1RN
      * 
      * REV:
      *  20231113 BAH ADDED FD-TYPE-OF-DOC #1630
       LOAD-FD1-FILE.
      *- - - -{ SET OVERRIDE TO A "Y" TO NOT TOUCH THE PATH AT ALL  }- -
           IF ( FD-PATH-OVERRIDE = "Y" ) 
              NEXT SENTENCE
           ELSE
      *- - - -{ SPACES IS THE DEFAULT, NO CROSSING BRANCHES }- - - - - -
           IF ( FD-PATH-OVERRIDE = SPACES ) 
              MOVE EXT-FILPATH-BASE        TO FD-ALL-BASE
              MOVE EXT-FILPATH-MACHINE     TO FD-ALL-MACHINE
              MOVE FD-ALL-PATH             TO FD-PATH
           ELSE
      *- - - -{ USE BRANCH VALUES }- - - - - - - - - - - - - - - - - - -
           IF ( FD-PATH-OVERRIDE = "B" ) 
              MOVE FILPATH-BASE            TO FD-ALL-BASE
              MOVE FILPATH-MACHINE         TO FD-ALL-MACHINE
              MOVE FD-ALL-PATH             TO FD-PATH.

      *-----------------------------------------------------------------
       OPEN-FD1-FILE.
           PERFORM LOAD-FD1-FILE.
           PERFORM OPEN-IT.
           MOVE FD-PATH-SQL TO E-FILE.

      *    IF ( SQL-CONNECT-STAT-BAD )
      *       PERFORM SQL-CONNECT.

      *-----------------------------------------------------------------
       START-FD1-FILE.
           PERFORM START-IT.
           MOVE FD-PATH-SQL TO E-FILE.
           MOVE FD1-KEY TO E-KEYX.

           IF ( FD1-CURSOR-STAT-GOOD )
              PERFORM CLOSE-FD1-FILE.

           IF ( QFD1-WEND-FMNO = ZEROES    ) OR
              ( QFD1-WEND-FMNO NOT NUMERIC )
              MOVE FD-FMNO        TO QFD1-WBEG-FMNO
              MOVE ALL "9"        TO QFD1-WEND-FMNO.

           EXEC SQL
            DECLARE FD1_CURSOR CURSOR FOR
            SELECT FDFILE.FD_FMNO,
                   CAST(FDFILE.FD_LTOUCH_DATE
                                                  AS VARCHAR(10)),
                   FDFILE.FD_DESC,
                   FDFILE.FD_OPTION,
                   FDFILE.FD_FORM_CHG_CD,
                   FDFILE.FD_PROG_PREFIX,
                   FDFILE.FD_TYPE,
                   FDFILE.FD_LNMEMO,
                   FDFILE.FD_BODY,
                   FDFILE.FD_TOP,
                   FDFILE.FD_BOTTOM,
                   FDFILE.FD_PROG,
                   FDFILE.FD_PROMPTS_1,
                   FDFILE.FD_PROMPTS_2,
                   FDFILE.FD_PROMPTS_3,
                   FDFILE.FD_PROMPTS_4,
                   FDFILE.FD_PROMPTS_5,
                   FDFILE.FD_PROMPTS_6,
                   FDFILE.FD_PROMPTS_7,
                   FDFILE.FD_PROMPTS_8,
                   FDFILE.FD_PROMPTS_9,
                   FDFILE.FD_PROMPTS_10,
                   FDFILE.FD_PROMPTS_11,
                   FDFILE.FD_PROMPTS_12,
                   FDFILE.FD_PROMPTS_13,
                   FDFILE.FD_PROMPTS_14,
                   FDFILE.FD_PROMPTS_15,
                   FDFILE.FD_PROMPTS_16,
                   FDFILE.FD_PROMPTS_17,
                   FDFILE.FD_PROMPTS_18,
                   FDFILE.FD_PROMPTS_19,
                   FDFILE.FD_PROMPTS_20,
                   FDFILE.FD_PROMPTS_21,
                   FDFILE.FD_PROMPTS_22,
                   FDFILE.FD_PROMPTS_23,
                   FDFILE.FD_PROMPTS_24,
                   FDFILE.FD_PROMPTS_25,
                   FDFILE.FD_PROMPTS_26,
                   FDFILE.FD_PROMPTS_27,
                   FDFILE.FD_PROMPTS_28,
                   FDFILE.FD_PROMPTS_29,
                   FDFILE.FD_PROMPTS_30,
                   FDFILE.FD_FIELDNO_1,
                   FDFILE.FD_FIELDROW_1,
                   FDFILE.FD_FIELDCOL_1,
                   FDFILE.FD_FIELDED_1,
                   FDFILE.FD_FIELDKEY_1,
                   FDFILE.FD_FIELDNO_2,
                   FDFILE.FD_FIELDROW_2,
                   FDFILE.FD_FIELDCOL_2,
                   FDFILE.FD_FIELDED_2,
                   FDFILE.FD_FIELDKEY_2,
                   FDFILE.FD_FIELDNO_3,
                   FDFILE.FD_FIELDROW_3,
                   FDFILE.FD_FIELDCOL_3,
                   FDFILE.FD_FIELDED_3,
                   FDFILE.FD_FIELDKEY_3,
                   FDFILE.FD_FIELDNO_4,
                   FDFILE.FD_FIELDROW_4,
                   FDFILE.FD_FIELDCOL_4,
                   FDFILE.FD_FIELDED_4,
                   FDFILE.FD_FIELDKEY_4,
                   FDFILE.FD_FIELDNO_5,
                   FDFILE.FD_FIELDROW_5,
                   FDFILE.FD_FIELDCOL_5,
                   FDFILE.FD_FIELDED_5,
                   FDFILE.FD_FIELDKEY_5,
                   FDFILE.FD_FIELDNO_6,
                   FDFILE.FD_FIELDROW_6,
                   FDFILE.FD_FIELDCOL_6,
                   FDFILE.FD_FIELDED_6,
                   FDFILE.FD_FIELDKEY_6,
                   FDFILE.FD_FIELDNO_7,
                   FDFILE.FD_FIELDROW_7,
                   FDFILE.FD_FIELDCOL_7,
                   FDFILE.FD_FIELDED_7,
                   FDFILE.FD_FIELDKEY_7,
                   FDFILE.FD_FIELDNO_8,
                   FDFILE.FD_FIELDROW_8,
                   FDFILE.FD_FIELDCOL_8,
                   FDFILE.FD_FIELDED_8,
                   FDFILE.FD_FIELDKEY_8,
                   FDFILE.FD_FIELDNO_9,
                   FDFILE.FD_FIELDROW_9,
                   FDFILE.FD_FIELDCOL_9,
                   FDFILE.FD_FIELDED_9,
                   FDFILE.FD_FIELDKEY_9,
                   FDFILE.FD_FIELDNO_10,
                   FDFILE.FD_FIELDROW_10,
                   FDFILE.FD_FIELDCOL_10,
                   FDFILE.FD_FIELDED_10,
                   FDFILE.FD_FIELDKEY_10,
                   FDFILE.FD_FIELDNO_11,
                   FDFILE.FD_FIELDROW_11,
                   FDFILE.FD_FIELDCOL_11,
                   FDFILE.FD_FIELDED_11,
                   FDFILE.FD_FIELDKEY_11,
                   FDFILE.FD_FIELDNO_12,
                   FDFILE.FD_FIELDROW_12,
                   FDFILE.FD_FIELDCOL_12,
                   FDFILE.FD_FIELDED_12,
                   FDFILE.FD_FIELDKEY_12,
                   FDFILE.FD_FIELDNO_13,
                   FDFILE.FD_FIELDROW_13,
                   FDFILE.FD_FIELDCOL_13,
                   FDFILE.FD_FIELDED_13,
                   FDFILE.FD_FIELDKEY_13,
                   FDFILE.FD_FIELDNO_14,
                   FDFILE.FD_FIELDROW_14,
                   FDFILE.FD_FIELDCOL_14,
                   FDFILE.FD_FIELDED_14,
                   FDFILE.FD_FIELDKEY_14,
                   FDFILE.FD_FIELDNO_15,
                   FDFILE.FD_FIELDROW_15,
                   FDFILE.FD_FIELDCOL_15,
                   FDFILE.FD_FIELDED_15,
                   FDFILE.FD_FIELDKEY_15,
                   FDFILE.FD_FIELDNO_16,
                   FDFILE.FD_FIELDROW_16,
                   FDFILE.FD_FIELDCOL_16,
                   FDFILE.FD_FIELDED_16,
                   FDFILE.FD_FIELDKEY_16,
                   FDFILE.FD_FIELDNO_17,
                   FDFILE.FD_FIELDROW_17,
                   FDFILE.FD_FIELDCOL_17,
                   FDFILE.FD_FIELDED_17,
                   FDFILE.FD_FIELDKEY_17,
                   FDFILE.FD_FIELDNO_18,
                   FDFILE.FD_FIELDROW_18,
                   FDFILE.FD_FIELDCOL_18,
                   FDFILE.FD_FIELDED_18,
                   FDFILE.FD_FIELDKEY_18,
                   FDFILE.FD_FIELDNO_19,
                   FDFILE.FD_FIELDROW_19,
                   FDFILE.FD_FIELDCOL_19,
                   FDFILE.FD_FIELDED_19,
                   FDFILE.FD_FIELDKEY_19,
                   FDFILE.FD_FIELDNO_20,
                   FDFILE.FD_FIELDROW_20,
                   FDFILE.FD_FIELDCOL_20,
                   FDFILE.FD_FIELDED_20,
                   FDFILE.FD_FIELDKEY_20,
                   FDFILE.FD_FIELDNO_21,
                   FDFILE.FD_FIELDROW_21,
                   FDFILE.FD_FIELDCOL_21,
                   FDFILE.FD_FIELDED_21,
                   FDFILE.FD_FIELDKEY_21,
                   FDFILE.FD_FIELDNO_22,
                   FDFILE.FD_FIELDROW_22,
                   FDFILE.FD_FIELDCOL_22,
                   FDFILE.FD_FIELDED_22,
                   FDFILE.FD_FIELDKEY_22,
                   FDFILE.FD_FIELDNO_23,
                   FDFILE.FD_FIELDROW_23,
                   FDFILE.FD_FIELDCOL_23,
                   FDFILE.FD_FIELDED_23,
                   FDFILE.FD_FIELDKEY_23,
                   FDFILE.FD_FIELDNO_24,
                   FDFILE.FD_FIELDROW_24,
                   FDFILE.FD_FIELDCOL_24,
                   FDFILE.FD_FIELDED_24,
                   FDFILE.FD_FIELDKEY_24,
                   FDFILE.FD_FIELDNO_25,
                   FDFILE.FD_FIELDROW_25,
                   FDFILE.FD_FIELDCOL_25,
                   FDFILE.FD_FIELDED_25,
                   FDFILE.FD_FIELDKEY_25,
                   FDFILE.FD_FIELDNO_26,
                   FDFILE.FD_FIELDROW_26,
                   FDFILE.FD_FIELDCOL_26,
                   FDFILE.FD_FIELDED_26,
                   FDFILE.FD_FIELDKEY_26,
                   FDFILE.FD_FIELDNO_27,
                   FDFILE.FD_FIELDROW_27,
                   FDFILE.FD_FIELDCOL_27,
                   FDFILE.FD_FIELDED_27,
                   FDFILE.FD_FIELDKEY_27,
                   FDFILE.FD_FIELDNO_28,
                   FDFILE.FD_FIELDROW_28,
                   FDFILE.FD_FIELDCOL_28,
                   FDFILE.FD_FIELDED_28,
                   FDFILE.FD_FIELDKEY_28,
                   FDFILE.FD_FIELDNO_29,
                   FDFILE.FD_FIELDROW_29,
                   FDFILE.FD_FIELDCOL_29,
                   FDFILE.FD_FIELDED_29,
                   FDFILE.FD_FIELDKEY_29,
                   FDFILE.FD_FIELDNO_30,
                   FDFILE.FD_FIELDROW_30,
                   FDFILE.FD_FIELDCOL_30,
                   FDFILE.FD_FIELDED_30,
                   FDFILE.FD_FIELDKEY_30,
                   FDFILE.FD_FIELDNO_31,
                   FDFILE.FD_FIELDROW_31,
                   FDFILE.FD_FIELDCOL_31,
                   FDFILE.FD_FIELDED_31,
                   FDFILE.FD_FIELDKEY_31,
                   FDFILE.FD_FIELDNO_32,
                   FDFILE.FD_FIELDROW_32,
                   FDFILE.FD_FIELDCOL_32,
                   FDFILE.FD_FIELDED_32,
                   FDFILE.FD_FIELDKEY_32,
                   FDFILE.FD_FIELDNO_33,
                   FDFILE.FD_FIELDROW_33,
                   FDFILE.FD_FIELDCOL_33,
                   FDFILE.FD_FIELDED_33,
                   FDFILE.FD_FIELDKEY_33,
                   FDFILE.FD_FIELDNO_34,
                   FDFILE.FD_FIELDROW_34,
                   FDFILE.FD_FIELDCOL_34,
                   FDFILE.FD_FIELDED_34,
                   FDFILE.FD_FIELDKEY_34,
                   FDFILE.FD_FIELDNO_35,
                   FDFILE.FD_FIELDROW_35,
                   FDFILE.FD_FIELDCOL_35,
                   FDFILE.FD_FIELDED_35,
                   FDFILE.FD_FIELDKEY_35,
                   FDFILE.FD_FIELDNO_36,
                   FDFILE.FD_FIELDROW_36,
                   FDFILE.FD_FIELDCOL_36,
                   FDFILE.FD_FIELDED_36,
                   FDFILE.FD_FIELDKEY_36,
                   FDFILE.FD_FIELDNO_37,
                   FDFILE.FD_FIELDROW_37,
                   FDFILE.FD_FIELDCOL_37,
                   FDFILE.FD_FIELDED_37,
                   FDFILE.FD_FIELDKEY_37,
                   FDFILE.FD_FIELDNO_38,
                   FDFILE.FD_FIELDROW_38,
                   FDFILE.FD_FIELDCOL_38,
                   FDFILE.FD_FIELDED_38,
                   FDFILE.FD_FIELDKEY_38,
                   FDFILE.FD_FIELDNO_39,
                   FDFILE.FD_FIELDROW_39,
                   FDFILE.FD_FIELDCOL_39,
                   FDFILE.FD_FIELDED_39,
                   FDFILE.FD_FIELDKEY_39,
                   FDFILE.FD_FIELDNO_40,
                   FDFILE.FD_FIELDROW_40,
                   FDFILE.FD_FIELDCOL_40,
                   FDFILE.FD_FIELDED_40,
                   FDFILE.FD_FIELDKEY_40,
                   FDFILE.FD_FIELDNO_41,
                   FDFILE.FD_FIELDROW_41,
                   FDFILE.FD_FIELDCOL_41,
                   FDFILE.FD_FIELDED_41,
                   FDFILE.FD_FIELDKEY_41,
                   FDFILE.FD_FIELDNO_42,
                   FDFILE.FD_FIELDROW_42,
                   FDFILE.FD_FIELDCOL_42,
                   FDFILE.FD_FIELDED_42,
                   FDFILE.FD_FIELDKEY_42,
                   FDFILE.FD_FIELDNO_43,
                   FDFILE.FD_FIELDROW_43,
                   FDFILE.FD_FIELDCOL_43,
                   FDFILE.FD_FIELDED_43,
                   FDFILE.FD_FIELDKEY_43,
                   FDFILE.FD_FIELDNO_44,
                   FDFILE.FD_FIELDROW_44,
                   FDFILE.FD_FIELDCOL_44,
                   FDFILE.FD_FIELDED_44,
                   FDFILE.FD_FIELDKEY_44,
                   FDFILE.FD_FIELDNO_45,
                   FDFILE.FD_FIELDROW_45,
                   FDFILE.FD_FIELDCOL_45,
                   FDFILE.FD_FIELDED_45,
                   FDFILE.FD_FIELDKEY_45,
                   FDFILE.FD_FIELDNO_46,
                   FDFILE.FD_FIELDROW_46,
                   FDFILE.FD_FIELDCOL_46,
                   FDFILE.FD_FIELDED_46,
                   FDFILE.FD_FIELDKEY_46,
                   FDFILE.FD_FIELDNO_47,
                   FDFILE.FD_FIELDROW_47,
                   FDFILE.FD_FIELDCOL_47,
                   FDFILE.FD_FIELDED_47,
                   FDFILE.FD_FIELDKEY_47,
                   FDFILE.FD_FIELDNO_48,
                   FDFILE.FD_FIELDROW_48,
                   FDFILE.FD_FIELDCOL_48,
                   FDFILE.FD_FIELDED_48,
                   FDFILE.FD_FIELDKEY_48,
                   FDFILE.FD_FIELDNO_49,
                   FDFILE.FD_FIELDROW_49,
                   FDFILE.FD_FIELDCOL_49,
                   FDFILE.FD_FIELDED_49,
                   FDFILE.FD_FIELDKEY_49,
                   FDFILE.FD_FIELDNO_50,
                   FDFILE.FD_FIELDROW_50,
                   FDFILE.FD_FIELDCOL_50,
                   FDFILE.FD_FIELDED_50,
                   FDFILE.FD_FIELDKEY_50,
                   FDFILE.FD_1STFILE,
                   FDFILE.FD_INCR_DELCNT,
                   FDFILE.FD_FMTYPE,
                   FDFILE.FD_PRCONT,
                   FDFILE.FD_NEXTFM,
                   FDFILE.FD_VALID_BRANCH,
                   FDFILE.FD_MIN_FORM_SENT_DAYS,
                   FDFILE.FD_SKIP_BAD_ADR,
                   FDFILE.FD_SECURITY_PROFILE,
                   FDFILE.FD_FORM_RIGHT_TO_CURE,
                   FDFILE.FD_TEST_WHICH_STATE,
                   FDFILE.FD_STATE_1,
                   FDFILE.FD_STATE_2,
                   FDFILE.FD_STATE_3,
                   FDFILE.FD_STATE_4,
                   FDFILE.FD_STATE_5,
                   FDFILE.FD_STATE_6,
                   FDFILE.FD_STATE_7,
                   FDFILE.FD_STATE_8,
                   FDFILE.FD_STATE_9,
                   FDFILE.FD_STATE_10,
                   FDFILE.FD_STATE_11,
                   FDFILE.FD_STATE_12,
                   FDFILE.FD_STATE_13,
                   FDFILE.FD_STATE_14,
                   FDFILE.FD_STATE_15,
                   FDFILE.FD_STATE_16,
                   FDFILE.FD_STATE_17,
                   FDFILE.FD_STATE_18,
                   FDFILE.FD_STATE_19,
                   FDFILE.FD_STATE_20,
                   FDFILE.FD_STATE_21,
                   FDFILE.FD_STATE_22,
                   FDFILE.FD_STATE_23,
                   FDFILE.FD_STATE_24,
                   FDFILE.FD_STATE_25,
                   FDFILE.FD_STATE_26,
                   FDFILE.FD_STATE_27,
                   FDFILE.FD_STATE_28,
                   FDFILE.FD_STATE_29,
                   FDFILE.FD_STATE_30,
                   FDFILE.FD_STATE_31,
                   FDFILE.FD_STATE_32,
                   FDFILE.FD_STATE_33,
                   FDFILE.FD_STATE_34,
                   FDFILE.FD_STATE_35,
                   FDFILE.FD_STATE_36,
                   FDFILE.FD_STATE_37,
                   FDFILE.FD_STATE_38,
                   FDFILE.FD_STATE_39,
                   FDFILE.FD_STATE_40,
                   FDFILE.FD_STATE_41,
                   FDFILE.FD_STATE_42,
                   FDFILE.FD_STATE_43,
                   FDFILE.FD_STATE_44,
                   FDFILE.FD_STATE_45,
                   FDFILE.FD_STATE_46,
                   FDFILE.FD_STATE_47,
                   FDFILE.FD_STATE_48,
                   FDFILE.FD_STATE_49,
                   FDFILE.FD_STATE_50,
                   FDFILE.FD_TYPE_OF_DOC
            FROM DBO.FDFILE
            WHERE FDFILE.FD_FMNO >= :QFD1-WBEG-FMNO
              AND FDFILE.FD_FMNO <= :QFD1-WEND-FMNO
            ORDER BY FDFILE.FD_FMNO
           END-EXEC.

           EXEC SQL
               OPEN FD1_CURSOR
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           MOVE ZEROES TO QFD1-WBEG-FMNO
                          QFD1-WEND-FMNO.

           MOVE STAT---GOOD TO FD1-CURSOR-STAT.

      *-----------------------------------------------------------------
       READ-FD1-FILE.
           PERFORM READ-IT.
           MOVE FD-PATH-SQL TO E-FILE.
           MOVE FD1-KEY TO E-KEYX.
           INITIALIZE QFD-REC.

           MOVE FD-FMNO    TO QFD-FMNO.  

           EXEC SQL
            SELECT FDFILE.FD_FMNO,
                   CAST(FDFILE.FD_LTOUCH_DATE
                                                  AS VARCHAR(10)),
                   FDFILE.FD_DESC,
                   FDFILE.FD_OPTION,
                   FDFILE.FD_FORM_CHG_CD,
                   FDFILE.FD_PROG_PREFIX,
                   FDFILE.FD_TYPE,
                   FDFILE.FD_LNMEMO,
                   FDFILE.FD_BODY,
                   FDFILE.FD_TOP,
                   FDFILE.FD_BOTTOM,
                   FDFILE.FD_PROG,
                   FDFILE.FD_PROMPTS_1,
                   FDFILE.FD_PROMPTS_2,
                   FDFILE.FD_PROMPTS_3,
                   FDFILE.FD_PROMPTS_4,
                   FDFILE.FD_PROMPTS_5,
                   FDFILE.FD_PROMPTS_6,
                   FDFILE.FD_PROMPTS_7,
                   FDFILE.FD_PROMPTS_8,
                   FDFILE.FD_PROMPTS_9,
                   FDFILE.FD_PROMPTS_10,
                   FDFILE.FD_PROMPTS_11,
                   FDFILE.FD_PROMPTS_12,
                   FDFILE.FD_PROMPTS_13,
                   FDFILE.FD_PROMPTS_14,
                   FDFILE.FD_PROMPTS_15,
                   FDFILE.FD_PROMPTS_16,
                   FDFILE.FD_PROMPTS_17,
                   FDFILE.FD_PROMPTS_18,
                   FDFILE.FD_PROMPTS_19,
                   FDFILE.FD_PROMPTS_20,
                   FDFILE.FD_PROMPTS_21,
                   FDFILE.FD_PROMPTS_22,
                   FDFILE.FD_PROMPTS_23,
                   FDFILE.FD_PROMPTS_24,
                   FDFILE.FD_PROMPTS_25,
                   FDFILE.FD_PROMPTS_26,
                   FDFILE.FD_PROMPTS_27,
                   FDFILE.FD_PROMPTS_28,
                   FDFILE.FD_PROMPTS_29,
                   FDFILE.FD_PROMPTS_30,
                   FDFILE.FD_FIELDNO_1,
                   FDFILE.FD_FIELDROW_1,
                   FDFILE.FD_FIELDCOL_1,
                   FDFILE.FD_FIELDED_1,
                   FDFILE.FD_FIELDKEY_1,
                   FDFILE.FD_FIELDNO_2,
                   FDFILE.FD_FIELDROW_2,
                   FDFILE.FD_FIELDCOL_2,
                   FDFILE.FD_FIELDED_2,
                   FDFILE.FD_FIELDKEY_2,
                   FDFILE.FD_FIELDNO_3,
                   FDFILE.FD_FIELDROW_3,
                   FDFILE.FD_FIELDCOL_3,
                   FDFILE.FD_FIELDED_3,
                   FDFILE.FD_FIELDKEY_3,
                   FDFILE.FD_FIELDNO_4,
                   FDFILE.FD_FIELDROW_4,
                   FDFILE.FD_FIELDCOL_4,
                   FDFILE.FD_FIELDED_4,
                   FDFILE.FD_FIELDKEY_4,
                   FDFILE.FD_FIELDNO_5,
                   FDFILE.FD_FIELDROW_5,
                   FDFILE.FD_FIELDCOL_5,
                   FDFILE.FD_FIELDED_5,
                   FDFILE.FD_FIELDKEY_5,
                   FDFILE.FD_FIELDNO_6,
                   FDFILE.FD_FIELDROW_6,
                   FDFILE.FD_FIELDCOL_6,
                   FDFILE.FD_FIELDED_6,
                   FDFILE.FD_FIELDKEY_6,
                   FDFILE.FD_FIELDNO_7,
                   FDFILE.FD_FIELDROW_7,
                   FDFILE.FD_FIELDCOL_7,
                   FDFILE.FD_FIELDED_7,
                   FDFILE.FD_FIELDKEY_7,
                   FDFILE.FD_FIELDNO_8,
                   FDFILE.FD_FIELDROW_8,
                   FDFILE.FD_FIELDCOL_8,
                   FDFILE.FD_FIELDED_8,
                   FDFILE.FD_FIELDKEY_8,
                   FDFILE.FD_FIELDNO_9,
                   FDFILE.FD_FIELDROW_9,
                   FDFILE.FD_FIELDCOL_9,
                   FDFILE.FD_FIELDED_9,
                   FDFILE.FD_FIELDKEY_9,
                   FDFILE.FD_FIELDNO_10,
                   FDFILE.FD_FIELDROW_10,
                   FDFILE.FD_FIELDCOL_10,
                   FDFILE.FD_FIELDED_10,
                   FDFILE.FD_FIELDKEY_10,
                   FDFILE.FD_FIELDNO_11,
                   FDFILE.FD_FIELDROW_11,
                   FDFILE.FD_FIELDCOL_11,
                   FDFILE.FD_FIELDED_11,
                   FDFILE.FD_FIELDKEY_11,
                   FDFILE.FD_FIELDNO_12,
                   FDFILE.FD_FIELDROW_12,
                   FDFILE.FD_FIELDCOL_12,
                   FDFILE.FD_FIELDED_12,
                   FDFILE.FD_FIELDKEY_12,
                   FDFILE.FD_FIELDNO_13,
                   FDFILE.FD_FIELDROW_13,
                   FDFILE.FD_FIELDCOL_13,
                   FDFILE.FD_FIELDED_13,
                   FDFILE.FD_FIELDKEY_13,
                   FDFILE.FD_FIELDNO_14,
                   FDFILE.FD_FIELDROW_14,
                   FDFILE.FD_FIELDCOL_14,
                   FDFILE.FD_FIELDED_14,
                   FDFILE.FD_FIELDKEY_14,
                   FDFILE.FD_FIELDNO_15,
                   FDFILE.FD_FIELDROW_15,
                   FDFILE.FD_FIELDCOL_15,
                   FDFILE.FD_FIELDED_15,
                   FDFILE.FD_FIELDKEY_15,
                   FDFILE.FD_FIELDNO_16,
                   FDFILE.FD_FIELDROW_16,
                   FDFILE.FD_FIELDCOL_16,
                   FDFILE.FD_FIELDED_16,
                   FDFILE.FD_FIELDKEY_16,
                   FDFILE.FD_FIELDNO_17,
                   FDFILE.FD_FIELDROW_17,
                   FDFILE.FD_FIELDCOL_17,
                   FDFILE.FD_FIELDED_17,
                   FDFILE.FD_FIELDKEY_17,
                   FDFILE.FD_FIELDNO_18,
                   FDFILE.FD_FIELDROW_18,
                   FDFILE.FD_FIELDCOL_18,
                   FDFILE.FD_FIELDED_18,
                   FDFILE.FD_FIELDKEY_18,
                   FDFILE.FD_FIELDNO_19,
                   FDFILE.FD_FIELDROW_19,
                   FDFILE.FD_FIELDCOL_19,
                   FDFILE.FD_FIELDED_19,
                   FDFILE.FD_FIELDKEY_19,
                   FDFILE.FD_FIELDNO_20,
                   FDFILE.FD_FIELDROW_20,
                   FDFILE.FD_FIELDCOL_20,
                   FDFILE.FD_FIELDED_20,
                   FDFILE.FD_FIELDKEY_20,
                   FDFILE.FD_FIELDNO_21,
                   FDFILE.FD_FIELDROW_21,
                   FDFILE.FD_FIELDCOL_21,
                   FDFILE.FD_FIELDED_21,
                   FDFILE.FD_FIELDKEY_21,
                   FDFILE.FD_FIELDNO_22,
                   FDFILE.FD_FIELDROW_22,
                   FDFILE.FD_FIELDCOL_22,
                   FDFILE.FD_FIELDED_22,
                   FDFILE.FD_FIELDKEY_22,
                   FDFILE.FD_FIELDNO_23,
                   FDFILE.FD_FIELDROW_23,
                   FDFILE.FD_FIELDCOL_23,
                   FDFILE.FD_FIELDED_23,
                   FDFILE.FD_FIELDKEY_23,
                   FDFILE.FD_FIELDNO_24,
                   FDFILE.FD_FIELDROW_24,
                   FDFILE.FD_FIELDCOL_24,
                   FDFILE.FD_FIELDED_24,
                   FDFILE.FD_FIELDKEY_24,
                   FDFILE.FD_FIELDNO_25,
                   FDFILE.FD_FIELDROW_25,
                   FDFILE.FD_FIELDCOL_25,
                   FDFILE.FD_FIELDED_25,
                   FDFILE.FD_FIELDKEY_25,
                   FDFILE.FD_FIELDNO_26,
                   FDFILE.FD_FIELDROW_26,
                   FDFILE.FD_FIELDCOL_26,
                   FDFILE.FD_FIELDED_26,
                   FDFILE.FD_FIELDKEY_26,
                   FDFILE.FD_FIELDNO_27,
                   FDFILE.FD_FIELDROW_27,
                   FDFILE.FD_FIELDCOL_27,
                   FDFILE.FD_FIELDED_27,
                   FDFILE.FD_FIELDKEY_27,
                   FDFILE.FD_FIELDNO_28,
                   FDFILE.FD_FIELDROW_28,
                   FDFILE.FD_FIELDCOL_28,
                   FDFILE.FD_FIELDED_28,
                   FDFILE.FD_FIELDKEY_28,
                   FDFILE.FD_FIELDNO_29,
                   FDFILE.FD_FIELDROW_29,
                   FDFILE.FD_FIELDCOL_29,
                   FDFILE.FD_FIELDED_29,
                   FDFILE.FD_FIELDKEY_29,
                   FDFILE.FD_FIELDNO_30,
                   FDFILE.FD_FIELDROW_30,
                   FDFILE.FD_FIELDCOL_30,
                   FDFILE.FD_FIELDED_30,
                   FDFILE.FD_FIELDKEY_30,
                   FDFILE.FD_FIELDNO_31,
                   FDFILE.FD_FIELDROW_31,
                   FDFILE.FD_FIELDCOL_31,
                   FDFILE.FD_FIELDED_31,
                   FDFILE.FD_FIELDKEY_31,
                   FDFILE.FD_FIELDNO_32,
                   FDFILE.FD_FIELDROW_32,
                   FDFILE.FD_FIELDCOL_32,
                   FDFILE.FD_FIELDED_32,
                   FDFILE.FD_FIELDKEY_32,
                   FDFILE.FD_FIELDNO_33,
                   FDFILE.FD_FIELDROW_33,
                   FDFILE.FD_FIELDCOL_33,
                   FDFILE.FD_FIELDED_33,
                   FDFILE.FD_FIELDKEY_33,
                   FDFILE.FD_FIELDNO_34,
                   FDFILE.FD_FIELDROW_34,
                   FDFILE.FD_FIELDCOL_34,
                   FDFILE.FD_FIELDED_34,
                   FDFILE.FD_FIELDKEY_34,
                   FDFILE.FD_FIELDNO_35,
                   FDFILE.FD_FIELDROW_35,
                   FDFILE.FD_FIELDCOL_35,
                   FDFILE.FD_FIELDED_35,
                   FDFILE.FD_FIELDKEY_35,
                   FDFILE.FD_FIELDNO_36,
                   FDFILE.FD_FIELDROW_36,
                   FDFILE.FD_FIELDCOL_36,
                   FDFILE.FD_FIELDED_36,
                   FDFILE.FD_FIELDKEY_36,
                   FDFILE.FD_FIELDNO_37,
                   FDFILE.FD_FIELDROW_37,
                   FDFILE.FD_FIELDCOL_37,
                   FDFILE.FD_FIELDED_37,
                   FDFILE.FD_FIELDKEY_37,
                   FDFILE.FD_FIELDNO_38,
                   FDFILE.FD_FIELDROW_38,
                   FDFILE.FD_FIELDCOL_38,
                   FDFILE.FD_FIELDED_38,
                   FDFILE.FD_FIELDKEY_38,
                   FDFILE.FD_FIELDNO_39,
                   FDFILE.FD_FIELDROW_39,
                   FDFILE.FD_FIELDCOL_39,
                   FDFILE.FD_FIELDED_39,
                   FDFILE.FD_FIELDKEY_39,
                   FDFILE.FD_FIELDNO_40,
                   FDFILE.FD_FIELDROW_40,
                   FDFILE.FD_FIELDCOL_40,
                   FDFILE.FD_FIELDED_40,
                   FDFILE.FD_FIELDKEY_40,
                   FDFILE.FD_FIELDNO_41,
                   FDFILE.FD_FIELDROW_41,
                   FDFILE.FD_FIELDCOL_41,
                   FDFILE.FD_FIELDED_41,
                   FDFILE.FD_FIELDKEY_41,
                   FDFILE.FD_FIELDNO_42,
                   FDFILE.FD_FIELDROW_42,
                   FDFILE.FD_FIELDCOL_42,
                   FDFILE.FD_FIELDED_42,
                   FDFILE.FD_FIELDKEY_42,
                   FDFILE.FD_FIELDNO_43,
                   FDFILE.FD_FIELDROW_43,
                   FDFILE.FD_FIELDCOL_43,
                   FDFILE.FD_FIELDED_43,
                   FDFILE.FD_FIELDKEY_43,
                   FDFILE.FD_FIELDNO_44,
                   FDFILE.FD_FIELDROW_44,
                   FDFILE.FD_FIELDCOL_44,
                   FDFILE.FD_FIELDED_44,
                   FDFILE.FD_FIELDKEY_44,
                   FDFILE.FD_FIELDNO_45,
                   FDFILE.FD_FIELDROW_45,
                   FDFILE.FD_FIELDCOL_45,
                   FDFILE.FD_FIELDED_45,
                   FDFILE.FD_FIELDKEY_45,
                   FDFILE.FD_FIELDNO_46,
                   FDFILE.FD_FIELDROW_46,
                   FDFILE.FD_FIELDCOL_46,
                   FDFILE.FD_FIELDED_46,
                   FDFILE.FD_FIELDKEY_46,
                   FDFILE.FD_FIELDNO_47,
                   FDFILE.FD_FIELDROW_47,
                   FDFILE.FD_FIELDCOL_47,
                   FDFILE.FD_FIELDED_47,
                   FDFILE.FD_FIELDKEY_47,
                   FDFILE.FD_FIELDNO_48,
                   FDFILE.FD_FIELDROW_48,
                   FDFILE.FD_FIELDCOL_48,
                   FDFILE.FD_FIELDED_48,
                   FDFILE.FD_FIELDKEY_48,
                   FDFILE.FD_FIELDNO_49,
                   FDFILE.FD_FIELDROW_49,
                   FDFILE.FD_FIELDCOL_49,
                   FDFILE.FD_FIELDED_49,
                   FDFILE.FD_FIELDKEY_49,
                   FDFILE.FD_FIELDNO_50,
                   FDFILE.FD_FIELDROW_50,
                   FDFILE.FD_FIELDCOL_50,
                   FDFILE.FD_FIELDED_50,
                   FDFILE.FD_FIELDKEY_50,
                   FDFILE.FD_1STFILE,
                   FDFILE.FD_INCR_DELCNT,
                   FDFILE.FD_FMTYPE,
                   FDFILE.FD_PRCONT,
                   FDFILE.FD_NEXTFM,
                   FDFILE.FD_VALID_BRANCH,
                   FDFILE.FD_MIN_FORM_SENT_DAYS,
                   FDFILE.FD_SKIP_BAD_ADR,
                   FDFILE.FD_SECURITY_PROFILE,
                   FDFILE.FD_FORM_RIGHT_TO_CURE,
                   FDFILE.FD_TEST_WHICH_STATE,
                   FDFILE.FD_STATE_1,
                   FDFILE.FD_STATE_2,
                   FDFILE.FD_STATE_3,
                   FDFILE.FD_STATE_4,
                   FDFILE.FD_STATE_5,
                   FDFILE.FD_STATE_6,
                   FDFILE.FD_STATE_7,
                   FDFILE.FD_STATE_8,
                   FDFILE.FD_STATE_9,
                   FDFILE.FD_STATE_10,
                   FDFILE.FD_STATE_11,
                   FDFILE.FD_STATE_12,
                   FDFILE.FD_STATE_13,
                   FDFILE.FD_STATE_14,
                   FDFILE.FD_STATE_15,
                   FDFILE.FD_STATE_16,
                   FDFILE.FD_STATE_17,
                   FDFILE.FD_STATE_18,
                   FDFILE.FD_STATE_19,
                   FDFILE.FD_STATE_20,
                   FDFILE.FD_STATE_21,
                   FDFILE.FD_STATE_22,
                   FDFILE.FD_STATE_23,
                   FDFILE.FD_STATE_24,
                   FDFILE.FD_STATE_25,
                   FDFILE.FD_STATE_26,
                   FDFILE.FD_STATE_27,
                   FDFILE.FD_STATE_28,
                   FDFILE.FD_STATE_29,
                   FDFILE.FD_STATE_30,
                   FDFILE.FD_STATE_31,
                   FDFILE.FD_STATE_32,
                   FDFILE.FD_STATE_33,
                   FDFILE.FD_STATE_34,
                   FDFILE.FD_STATE_35,
                   FDFILE.FD_STATE_36,
                   FDFILE.FD_STATE_37,
                   FDFILE.FD_STATE_38,
                   FDFILE.FD_STATE_39,
                   FDFILE.FD_STATE_40,
                   FDFILE.FD_STATE_41,
                   FDFILE.FD_STATE_42,
                   FDFILE.FD_STATE_43,
                   FDFILE.FD_STATE_44,
                   FDFILE.FD_STATE_45,
                   FDFILE.FD_STATE_46,
                   FDFILE.FD_STATE_47,
                   FDFILE.FD_STATE_48,
                   FDFILE.FD_STATE_49,
                   FDFILE.FD_STATE_50,
                   FDFILE.FD_TYPE_OF_DOC
            INTO :QFD-REC
            FROM DBO.FDFILE
            WHERE FDFILE.FD_FMNO = :QFD-FMNO
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-FD1-FILE.

           IF ( IO-FG = 0 )
              PERFORM GET-FD-FIELDS.

      *-----------------------------------------------------------------
       READ-FD1-FILE-NEXT.
           PERFORM READ-IT.
           MOVE FD-PATH-SQL TO E-FILE.
           MOVE FD1-KEY TO E-KEYX.
           INITIALIZE QFD-REC.

           IF ( FD1-CURSOR-STAT-GOOD )
              EXEC SQL
                   FETCH FD1_CURSOR INTO :QFD-REC
              END-EXEC
           ELSE
              MOVE 9        TO SQLCODE
              MOVE "RDNXCR" TO SQLSTATE.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-FD1-FILE-NEXT.

           IF ( IO-FG = 0 )
              PERFORM GET-FD-FIELDS.

      *-----------------------------------------------------------------
       CLOSE-FD1-FILE.
           PERFORM CLOSE-IT.
           IF ( FD1-CURSOR-STAT-GOOD )
              EXEC SQL
                   CLOSE FD1_CURSOR
              END-EXEC
              MOVE STAT---BAD TO FD1-CURSOR-STAT.

