      * REPAY NOTICE FILE AS PAYMENTS ARE MADE
       SELECT REPAY-NO-FILE ASSIGN REPAY-NO-PATH
              ORGANIZATION SEQUENTIAL
              LOCK MODE AUTOMATIC WITH LOCK ON RECORD
              FILE STATUS FILE-STAT.
