      * COPYMEMBER: LIBLP/LPIRGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - IRFILE
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD IR-REC FROM QIR-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-IR-FIELDS.
           MOVE QIR-KEY TO IR-KEY.

           IF ( QIR-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO IR-LTOUCH-DATE
           ELSE
              MOVE QIR-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO IR-LTOUCH-DATE.

           MOVE QIR-PER-FG TO IR-PER-FG.
           MOVE QIR-INSRATE-1 TO IR-INSRATE(1).
           MOVE QIR-INSRATE-2 TO IR-INSRATE(2).
           MOVE QIR-INSRATE-3 TO IR-INSRATE(3).
           MOVE QIR-INSRATE-4 TO IR-INSRATE(4).
           MOVE QIR-INSRATE-5 TO IR-INSRATE(5).
           MOVE QIR-INSRATE-6 TO IR-INSRATE(6).
           MOVE QIR-INSRATE-7 TO IR-INSRATE(7).
           MOVE QIR-INSRATE-8 TO IR-INSRATE(8).
           MOVE QIR-INSRATE-9 TO IR-INSRATE(9).
           MOVE QIR-INSRATE-10 TO IR-INSRATE(10).
           MOVE QIR-INSRATE-11 TO IR-INSRATE(11).
           MOVE QIR-INSRATE-12 TO IR-INSRATE(12).
           MOVE QIR-INSRATE-13 TO IR-INSRATE(13).
           MOVE QIR-INSRATE-14 TO IR-INSRATE(14).
           MOVE QIR-INSRATE-15 TO IR-INSRATE(15).
           MOVE QIR-INSRATE-16 TO IR-INSRATE(16).
           MOVE QIR-INSRATE-17 TO IR-INSRATE(17).
           MOVE QIR-INSRATE-18 TO IR-INSRATE(18).
           MOVE QIR-INSRATE-19 TO IR-INSRATE(19).
           MOVE QIR-INSRATE-20 TO IR-INSRATE(20).
           MOVE QIR-INSRATE-21 TO IR-INSRATE(21).
           MOVE QIR-INSRATE-22 TO IR-INSRATE(22).
           MOVE QIR-INSRATE-23 TO IR-INSRATE(23).
           MOVE QIR-INSRATE-24 TO IR-INSRATE(24).
           MOVE QIR-INSRATE-25 TO IR-INSRATE(25).
           MOVE QIR-INSRATE-26 TO IR-INSRATE(26).
           MOVE QIR-INSRATE-27 TO IR-INSRATE(27).
           MOVE QIR-INSRATE-28 TO IR-INSRATE(28).
           MOVE QIR-INSRATE-29 TO IR-INSRATE(29).
           MOVE QIR-INSRATE-30 TO IR-INSRATE(30).
           MOVE QIR-INSRATE-31 TO IR-INSRATE(31).
           MOVE QIR-INSRATE-32 TO IR-INSRATE(32).
           MOVE QIR-INSRATE-33 TO IR-INSRATE(33).
           MOVE QIR-INSRATE-34 TO IR-INSRATE(34).
           MOVE QIR-INSRATE-35 TO IR-INSRATE(35).
           MOVE QIR-INSRATE-36 TO IR-INSRATE(36).
           MOVE QIR-INSRATE-37 TO IR-INSRATE(37).
           MOVE QIR-INSRATE-38 TO IR-INSRATE(38).
           MOVE QIR-INSRATE-39 TO IR-INSRATE(39).
           MOVE QIR-INSRATE-40 TO IR-INSRATE(40).
           MOVE QIR-INSRATE-41 TO IR-INSRATE(41).
           MOVE QIR-INSRATE-42 TO IR-INSRATE(42).
           MOVE QIR-INSRATE-43 TO IR-INSRATE(43).
           MOVE QIR-INSRATE-44 TO IR-INSRATE(44).
           MOVE QIR-INSRATE-45 TO IR-INSRATE(45).
           MOVE QIR-INSRATE-46 TO IR-INSRATE(46).
           MOVE QIR-INSRATE-47 TO IR-INSRATE(47).
           MOVE QIR-INSRATE-48 TO IR-INSRATE(48).
           MOVE QIR-INSRATE-49 TO IR-INSRATE(49).
           MOVE QIR-INSRATE-50 TO IR-INSRATE(50).
           MOVE QIR-INSRATE-51 TO IR-INSRATE(51).
           MOVE QIR-INSRATE-52 TO IR-INSRATE(52).
           MOVE QIR-INSRATE-53 TO IR-INSRATE(53).
           MOVE QIR-INSRATE-54 TO IR-INSRATE(54).
           MOVE QIR-INSRATE-55 TO IR-INSRATE(55).
           MOVE QIR-INSRATE-56 TO IR-INSRATE(56).
           MOVE QIR-INSRATE-57 TO IR-INSRATE(57).
           MOVE QIR-INSRATE-58 TO IR-INSRATE(58).
           MOVE QIR-INSRATE-59 TO IR-INSRATE(59).
           MOVE QIR-INSRATE-60 TO IR-INSRATE(60).
           MOVE QIR-INSRATE-61 TO IR-INSRATE(61).
           MOVE QIR-INSRATE-62 TO IR-INSRATE(62).
           MOVE QIR-INSRATE-63 TO IR-INSRATE(63).
           MOVE QIR-INSRATE-64 TO IR-INSRATE(64).
           MOVE QIR-INSRATE-65 TO IR-INSRATE(65).
           MOVE QIR-INSRATE-66 TO IR-INSRATE(66).
           MOVE QIR-INSRATE-67 TO IR-INSRATE(67).
           MOVE QIR-INSRATE-68 TO IR-INSRATE(68).
           MOVE QIR-INSRATE-69 TO IR-INSRATE(69).
           MOVE QIR-INSRATE-70 TO IR-INSRATE(70).
           MOVE QIR-INSRATE-71 TO IR-INSRATE(71).
           MOVE QIR-INSRATE-72 TO IR-INSRATE(72).
           MOVE QIR-INSRATE-73 TO IR-INSRATE(73).
           MOVE QIR-INSRATE-74 TO IR-INSRATE(74).
           MOVE QIR-INSRATE-75 TO IR-INSRATE(75).
           MOVE QIR-INSRATE-76 TO IR-INSRATE(76).
           MOVE QIR-INSRATE-77 TO IR-INSRATE(77).
           MOVE QIR-INSRATE-78 TO IR-INSRATE(78).
           MOVE QIR-INSRATE-79 TO IR-INSRATE(79).
           MOVE QIR-INSRATE-80 TO IR-INSRATE(80).
           MOVE QIR-INSRATE-81 TO IR-INSRATE(81).
           MOVE QIR-INSRATE-82 TO IR-INSRATE(82).
           MOVE QIR-INSRATE-83 TO IR-INSRATE(83).
           MOVE QIR-INSRATE-84 TO IR-INSRATE(84).
           MOVE QIR-INSRATE-85 TO IR-INSRATE(85).
           MOVE QIR-INSRATE-86 TO IR-INSRATE(86).
           MOVE QIR-INSRATE-87 TO IR-INSRATE(87).
           MOVE QIR-INSRATE-88 TO IR-INSRATE(88).
           MOVE QIR-INSRATE-89 TO IR-INSRATE(89).
           MOVE QIR-INSRATE-90 TO IR-INSRATE(90).
           MOVE QIR-INSRATE-91 TO IR-INSRATE(91).
           MOVE QIR-INSRATE-92 TO IR-INSRATE(92).
           MOVE QIR-INSRATE-93 TO IR-INSRATE(93).
           MOVE QIR-INSRATE-94 TO IR-INSRATE(94).
           MOVE QIR-INSRATE-95 TO IR-INSRATE(95).
           MOVE QIR-INSRATE-96 TO IR-INSRATE(96).
           MOVE QIR-INSRATE-97 TO IR-INSRATE(97).
           MOVE QIR-INSRATE-98 TO IR-INSRATE(98).
           MOVE QIR-INSRATE-99 TO IR-INSRATE(99).
           MOVE QIR-INSRATE-100 TO IR-INSRATE(100).
           MOVE QIR-INSRATE-101 TO IR-INSRATE(101).
           MOVE QIR-INSRATE-102 TO IR-INSRATE(102).
           MOVE QIR-INSRATE-103 TO IR-INSRATE(103).
           MOVE QIR-INSRATE-104 TO IR-INSRATE(104).
           MOVE QIR-INSRATE-105 TO IR-INSRATE(105).
           MOVE QIR-INSRATE-106 TO IR-INSRATE(106).
           MOVE QIR-INSRATE-107 TO IR-INSRATE(107).
           MOVE QIR-INSRATE-108 TO IR-INSRATE(108).
           MOVE QIR-INSRATE-109 TO IR-INSRATE(109).
           MOVE QIR-INSRATE-110 TO IR-INSRATE(110).
           MOVE QIR-INSRATE-111 TO IR-INSRATE(111).
           MOVE QIR-INSRATE-112 TO IR-INSRATE(112).
           MOVE QIR-INSRATE-113 TO IR-INSRATE(113).
           MOVE QIR-INSRATE-114 TO IR-INSRATE(114).
           MOVE QIR-INSRATE-115 TO IR-INSRATE(115).
           MOVE QIR-INSRATE-116 TO IR-INSRATE(116).
           MOVE QIR-INSRATE-117 TO IR-INSRATE(117).
           MOVE QIR-INSRATE-118 TO IR-INSRATE(118).
           MOVE QIR-INSRATE-119 TO IR-INSRATE(119).
           MOVE QIR-INSRATE-120 TO IR-INSRATE(120).
           MOVE QIR-DESC TO IR-DESC.
 
      *-----------------------------------------------------------------
      *    LOAD QIR-REC FROM IR-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-IR-FIELDS.
           MOVE IR-KEY TO QIR-KEY.

           IF ( IR-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QIR-LTOUCH-DATE
           ELSE
              MOVE IR-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QIR-LTOUCH-DATE.

           MOVE IR-PER-FG TO QIR-PER-FG.
           MOVE IR-INSRATE(1) TO QIR-INSRATE-1.
           MOVE IR-INSRATE(2) TO QIR-INSRATE-2.
           MOVE IR-INSRATE(3) TO QIR-INSRATE-3.
           MOVE IR-INSRATE(4) TO QIR-INSRATE-4.
           MOVE IR-INSRATE(5) TO QIR-INSRATE-5.
           MOVE IR-INSRATE(6) TO QIR-INSRATE-6.
           MOVE IR-INSRATE(7) TO QIR-INSRATE-7.
           MOVE IR-INSRATE(8) TO QIR-INSRATE-8.
           MOVE IR-INSRATE(9) TO QIR-INSRATE-9.
           MOVE IR-INSRATE(10) TO QIR-INSRATE-10.
           MOVE IR-INSRATE(11) TO QIR-INSRATE-11.
           MOVE IR-INSRATE(12) TO QIR-INSRATE-12.
           MOVE IR-INSRATE(13) TO QIR-INSRATE-13.
           MOVE IR-INSRATE(14) TO QIR-INSRATE-14.
           MOVE IR-INSRATE(15) TO QIR-INSRATE-15.
           MOVE IR-INSRATE(16) TO QIR-INSRATE-16.
           MOVE IR-INSRATE(17) TO QIR-INSRATE-17.
           MOVE IR-INSRATE(18) TO QIR-INSRATE-18.
           MOVE IR-INSRATE(19) TO QIR-INSRATE-19.
           MOVE IR-INSRATE(20) TO QIR-INSRATE-20.
           MOVE IR-INSRATE(21) TO QIR-INSRATE-21.
           MOVE IR-INSRATE(22) TO QIR-INSRATE-22.
           MOVE IR-INSRATE(23) TO QIR-INSRATE-23.
           MOVE IR-INSRATE(24) TO QIR-INSRATE-24.
           MOVE IR-INSRATE(25) TO QIR-INSRATE-25.
           MOVE IR-INSRATE(26) TO QIR-INSRATE-26.
           MOVE IR-INSRATE(27) TO QIR-INSRATE-27.
           MOVE IR-INSRATE(28) TO QIR-INSRATE-28.
           MOVE IR-INSRATE(29) TO QIR-INSRATE-29.
           MOVE IR-INSRATE(30) TO QIR-INSRATE-30.
           MOVE IR-INSRATE(31) TO QIR-INSRATE-31.
           MOVE IR-INSRATE(32) TO QIR-INSRATE-32.
           MOVE IR-INSRATE(33) TO QIR-INSRATE-33.
           MOVE IR-INSRATE(34) TO QIR-INSRATE-34.
           MOVE IR-INSRATE(35) TO QIR-INSRATE-35.
           MOVE IR-INSRATE(36) TO QIR-INSRATE-36.
           MOVE IR-INSRATE(37) TO QIR-INSRATE-37.
           MOVE IR-INSRATE(38) TO QIR-INSRATE-38.
           MOVE IR-INSRATE(39) TO QIR-INSRATE-39.
           MOVE IR-INSRATE(40) TO QIR-INSRATE-40.
           MOVE IR-INSRATE(41) TO QIR-INSRATE-41.
           MOVE IR-INSRATE(42) TO QIR-INSRATE-42.
           MOVE IR-INSRATE(43) TO QIR-INSRATE-43.
           MOVE IR-INSRATE(44) TO QIR-INSRATE-44.
           MOVE IR-INSRATE(45) TO QIR-INSRATE-45.
           MOVE IR-INSRATE(46) TO QIR-INSRATE-46.
           MOVE IR-INSRATE(47) TO QIR-INSRATE-47.
           MOVE IR-INSRATE(48) TO QIR-INSRATE-48.
           MOVE IR-INSRATE(49) TO QIR-INSRATE-49.
           MOVE IR-INSRATE(50) TO QIR-INSRATE-50.
           MOVE IR-INSRATE(51) TO QIR-INSRATE-51.
           MOVE IR-INSRATE(52) TO QIR-INSRATE-52.
           MOVE IR-INSRATE(53) TO QIR-INSRATE-53.
           MOVE IR-INSRATE(54) TO QIR-INSRATE-54.
           MOVE IR-INSRATE(55) TO QIR-INSRATE-55.
           MOVE IR-INSRATE(56) TO QIR-INSRATE-56.
           MOVE IR-INSRATE(57) TO QIR-INSRATE-57.
           MOVE IR-INSRATE(58) TO QIR-INSRATE-58.
           MOVE IR-INSRATE(59) TO QIR-INSRATE-59.
           MOVE IR-INSRATE(60) TO QIR-INSRATE-60.
           MOVE IR-INSRATE(61) TO QIR-INSRATE-61.
           MOVE IR-INSRATE(62) TO QIR-INSRATE-62.
           MOVE IR-INSRATE(63) TO QIR-INSRATE-63.
           MOVE IR-INSRATE(64) TO QIR-INSRATE-64.
           MOVE IR-INSRATE(65) TO QIR-INSRATE-65.
           MOVE IR-INSRATE(66) TO QIR-INSRATE-66.
           MOVE IR-INSRATE(67) TO QIR-INSRATE-67.
           MOVE IR-INSRATE(68) TO QIR-INSRATE-68.
           MOVE IR-INSRATE(69) TO QIR-INSRATE-69.
           MOVE IR-INSRATE(70) TO QIR-INSRATE-70.
           MOVE IR-INSRATE(71) TO QIR-INSRATE-71.
           MOVE IR-INSRATE(72) TO QIR-INSRATE-72.
           MOVE IR-INSRATE(73) TO QIR-INSRATE-73.
           MOVE IR-INSRATE(74) TO QIR-INSRATE-74.
           MOVE IR-INSRATE(75) TO QIR-INSRATE-75.
           MOVE IR-INSRATE(76) TO QIR-INSRATE-76.
           MOVE IR-INSRATE(77) TO QIR-INSRATE-77.
           MOVE IR-INSRATE(78) TO QIR-INSRATE-78.
           MOVE IR-INSRATE(79) TO QIR-INSRATE-79.
           MOVE IR-INSRATE(80) TO QIR-INSRATE-80.
           MOVE IR-INSRATE(81) TO QIR-INSRATE-81.
           MOVE IR-INSRATE(82) TO QIR-INSRATE-82.
           MOVE IR-INSRATE(83) TO QIR-INSRATE-83.
           MOVE IR-INSRATE(84) TO QIR-INSRATE-84.
           MOVE IR-INSRATE(85) TO QIR-INSRATE-85.
           MOVE IR-INSRATE(86) TO QIR-INSRATE-86.
           MOVE IR-INSRATE(87) TO QIR-INSRATE-87.
           MOVE IR-INSRATE(88) TO QIR-INSRATE-88.
           MOVE IR-INSRATE(89) TO QIR-INSRATE-89.
           MOVE IR-INSRATE(90) TO QIR-INSRATE-90.
           MOVE IR-INSRATE(91) TO QIR-INSRATE-91.
           MOVE IR-INSRATE(92) TO QIR-INSRATE-92.
           MOVE IR-INSRATE(93) TO QIR-INSRATE-93.
           MOVE IR-INSRATE(94) TO QIR-INSRATE-94.
           MOVE IR-INSRATE(95) TO QIR-INSRATE-95.
           MOVE IR-INSRATE(96) TO QIR-INSRATE-96.
           MOVE IR-INSRATE(97) TO QIR-INSRATE-97.
           MOVE IR-INSRATE(98) TO QIR-INSRATE-98.
           MOVE IR-INSRATE(99) TO QIR-INSRATE-99.
           MOVE IR-INSRATE(100) TO QIR-INSRATE-100.
           MOVE IR-INSRATE(101) TO QIR-INSRATE-101.
           MOVE IR-INSRATE(102) TO QIR-INSRATE-102.
           MOVE IR-INSRATE(103) TO QIR-INSRATE-103.
           MOVE IR-INSRATE(104) TO QIR-INSRATE-104.
           MOVE IR-INSRATE(105) TO QIR-INSRATE-105.
           MOVE IR-INSRATE(106) TO QIR-INSRATE-106.
           MOVE IR-INSRATE(107) TO QIR-INSRATE-107.
           MOVE IR-INSRATE(108) TO QIR-INSRATE-108.
           MOVE IR-INSRATE(109) TO QIR-INSRATE-109.
           MOVE IR-INSRATE(110) TO QIR-INSRATE-110.
           MOVE IR-INSRATE(111) TO QIR-INSRATE-111.
           MOVE IR-INSRATE(112) TO QIR-INSRATE-112.
           MOVE IR-INSRATE(113) TO QIR-INSRATE-113.
           MOVE IR-INSRATE(114) TO QIR-INSRATE-114.
           MOVE IR-INSRATE(115) TO QIR-INSRATE-115.
           MOVE IR-INSRATE(116) TO QIR-INSRATE-116.
           MOVE IR-INSRATE(117) TO QIR-INSRATE-117.
           MOVE IR-INSRATE(118) TO QIR-INSRATE-118.
           MOVE IR-INSRATE(119) TO QIR-INSRATE-119.
           MOVE IR-INSRATE(120) TO QIR-INSRATE-120.
           MOVE IR-DESC TO QIR-DESC.
 
