      * COPYMEMBER: LIBLP/LPLSXGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - LOAN STATUS - REPOSSESSION
      *
      *=================================================================
      * REV:
      * AMM 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD LSX-REC FROM QLSX-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-LSX-FIELDS.
           MOVE QLSX-BRNO TO LSX-BRNO.
           MOVE QLSX-ACCTNO TO LSX-ACCTNO.
           MOVE QLSX-SEQNO TO LSX-SEQNO.

           IF ( QLSX-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-LTOUCH-DATE
           ELSE
              MOVE QLSX-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-LTOUCH-DATE.


           IF ( QLSX-REPODATE = "1900-01-01" )
              MOVE ZEROES TO LSX-REPODATE
           ELSE
              MOVE QLSX-REPODATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-REPODATE.

           MOVE QLSX-TITLE-MILEAGE TO LSX-TITLE-MILEAGE.
           MOVE QLSX-VOLUNTARY-FG TO LSX-VOLUNTARY-FG.
           MOVE QLSX-PERFECT TO LSX-PERFECT.

           IF ( QLSX-AUTHORIZED-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-AUTHORIZED-DATE
           ELSE
              MOVE QLSX-AUTHORIZED-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-AUTHORIZED-DATE.

           MOVE QLSX-AUTHORIZED-BY TO LSX-AUTHORIZED-BY.
           MOVE QLSX-REASON TO LSX-REASON.
           MOVE QLSX-X-ASSIGNED-TO TO LSX-X-ASSIGNED-TO.

           IF ( QLSX-ASSIGNED-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-ASSIGNED-DATE
           ELSE
              MOVE QLSX-ASSIGNED-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-ASSIGNED-DATE.

           MOVE QLSX-REPO-CKNO TO LSX-REPO-CKNO.

           IF ( QLSX-REPO-CKDATE = "1900-01-01" )
              MOVE ZEROES TO LSX-REPO-CKDATE
           ELSE
              MOVE QLSX-REPO-CKDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-REPO-CKDATE.

           MOVE QLSX-REPO-CKAMT TO LSX-REPO-CKAMT.
           MOVE QLSX-STORED-ADR1 TO LSX-STORED-ADR1.

           IF ( QLSX-STORED-CKDATE = "1900-01-01" )
              MOVE ZEROES TO LSX-STORED-CKDATE
           ELSE
              MOVE QLSX-STORED-CKDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-STORED-CKDATE.

           MOVE QLSX-STORED-CKNO TO LSX-STORED-CKNO.
           MOVE QLSX-STORED-CKAMT TO LSX-STORED-CKAMT.

           IF ( QLSX-REDEEM-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-REDEEM-DATE
           ELSE
              MOVE QLSX-REDEEM-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-REDEEM-DATE.

           MOVE QLSX-BUREAU-NOTIFIED TO LSX-BUREAU-NOTIFIED.

           IF ( QLSX-BUREAU-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-BUREAU-DATE
           ELSE
              MOVE QLSX-BUREAU-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-BUREAU-DATE.

           MOVE QLSX-BUREAU-BY TO LSX-BUREAU-BY.

           IF ( QLSX-10DAY-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-10DAY-DATE
           ELSE
              MOVE QLSX-10DAY-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-10DAY-DATE.

           MOVE QLSX-10DAY-BY TO LSX-10DAY-BY.
           MOVE QLSX-10DAY-COST TO LSX-10DAY-COST.

           IF ( QLSX-TITLE-APPL-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-TITLE-APPL-DATE
           ELSE
              MOVE QLSX-TITLE-APPL-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-TITLE-APPL-DATE.

           MOVE QLSX-TITLE-APPL-BY TO LSX-TITLE-APPL-BY.
           MOVE QLSX-TITLE-APPL-COST TO LSX-TITLE-APPL-COST.
           MOVE QLSX-COND-MILEAGE TO LSX-COND-MILEAGE.
           MOVE QLSX-COND-REPORT-Y-N TO LSX-COND-REPORT-Y-N.
           MOVE QLSX-REPAIRS-DESC-1 TO LSX-REPAIRS-DESC(1).
           MOVE QLSX-REPAIRS-DESC-2 TO LSX-REPAIRS-DESC(2).
           MOVE QLSX-REPAIRS-COST TO LSX-REPAIRS-COST.
           MOVE QLSX-ASSIGN-TO-1 TO LSX-ASSIGN-TO(1).

           IF ( QLSX-ASSIGN-COMPLETE-DATE-1 = "1900-01-01" )
              MOVE ZEROES TO LSX-ASSIGN-COMPLETE-DATE(1)
           ELSE
              MOVE QLSX-ASSIGN-COMPLETE-DATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-ASSIGN-COMPLETE-DATE(1).


           IF ( QLSX-ASSIGN-CKDATE-1 = "1900-01-01" )
              MOVE ZEROES TO LSX-ASSIGN-CKDATE(1)
           ELSE
              MOVE QLSX-ASSIGN-CKDATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-ASSIGN-CKDATE(1).

           MOVE QLSX-ASSIGN-CKNO-1 TO LSX-ASSIGN-CKNO(1).
           MOVE QLSX-ASSIGN-CKAMT-1 TO LSX-ASSIGN-CKAMT(1).
           MOVE QLSX-ASSIGN-TO-2 TO LSX-ASSIGN-TO(2).

           IF ( QLSX-ASSIGN-COMPLETE-DATE-2 = "1900-01-01" )
              MOVE ZEROES TO LSX-ASSIGN-COMPLETE-DATE(2)
           ELSE
              MOVE QLSX-ASSIGN-COMPLETE-DATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-ASSIGN-COMPLETE-DATE(2).


           IF ( QLSX-ASSIGN-CKDATE-2 = "1900-01-01" )
              MOVE ZEROES TO LSX-ASSIGN-CKDATE(2)
           ELSE
              MOVE QLSX-ASSIGN-CKDATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-ASSIGN-CKDATE(2).

           MOVE QLSX-ASSIGN-CKNO-2 TO LSX-ASSIGN-CKNO(2).
           MOVE QLSX-ASSIGN-CKAMT-2 TO LSX-ASSIGN-CKAMT(2).
           MOVE QLSX-OTH-EXP-1 TO LSX-OTH-EXP(1).

           IF ( QLSX-OTH-EXP-CKDATE-1 = "1900-01-01" )
              MOVE ZEROES TO LSX-OTH-EXP-CKDATE(1)
           ELSE
              MOVE QLSX-OTH-EXP-CKDATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-OTH-EXP-CKDATE(1).

           MOVE QLSX-OTH-EXP-CKNO-1 TO LSX-OTH-EXP-CKNO(1).
           MOVE QLSX-OTH-EXP-CKAMT-1 TO LSX-OTH-EXP-CKAMT(1).
           MOVE QLSX-OTH-EXP-2 TO LSX-OTH-EXP(2).

           IF ( QLSX-OTH-EXP-CKDATE-2 = "1900-01-01" )
              MOVE ZEROES TO LSX-OTH-EXP-CKDATE(2)
           ELSE
              MOVE QLSX-OTH-EXP-CKDATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-OTH-EXP-CKDATE(2).

           MOVE QLSX-OTH-EXP-CKNO-2 TO LSX-OTH-EXP-CKNO(2).
           MOVE QLSX-OTH-EXP-CKAMT-2 TO LSX-OTH-EXP-CKAMT(2).
           MOVE QLSX-OTH-EXP-3 TO LSX-OTH-EXP(3).

           IF ( QLSX-OTH-EXP-CKDATE-3 = "1900-01-01" )
              MOVE ZEROES TO LSX-OTH-EXP-CKDATE(3)
           ELSE
              MOVE QLSX-OTH-EXP-CKDATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-OTH-EXP-CKDATE(3).

           MOVE QLSX-OTH-EXP-CKNO-3 TO LSX-OTH-EXP-CKNO(3).
           MOVE QLSX-OTH-EXP-CKAMT-3 TO LSX-OTH-EXP-CKAMT(3).

           IF ( QLSX-INS-RB-REQ-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-INS-RB-REQ-DATE
           ELSE
              MOVE QLSX-INS-RB-REQ-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-INS-RB-REQ-DATE.


           IF ( QLSX-INS-RB-REC-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-INS-RB-REC-DATE
           ELSE
              MOVE QLSX-INS-RB-REC-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-INS-RB-REC-DATE.

           MOVE QLSX-INS-RB-AMT TO LSX-INS-RB-AMT.

           IF ( QLSX-RB-REQ-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-RB-REQ-DATE
           ELSE
              MOVE QLSX-RB-REQ-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-RB-REQ-DATE.


           IF ( QLSX-RB-REC-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-RB-REC-DATE
           ELSE
              MOVE QLSX-RB-REC-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-RB-REC-DATE.

           MOVE QLSX-RB-AMT TO LSX-RB-AMT.

           IF ( QLSX-SIC-INS-FILE-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-SIC-INS-FILE-DATE
           ELSE
              MOVE QLSX-SIC-INS-FILE-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-SIC-INS-FILE-DATE.


           IF ( QLSX-SIC-INS-PAID-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-SIC-INS-PAID-DATE
           ELSE
              MOVE QLSX-SIC-INS-PAID-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-SIC-INS-PAID-DATE.

           MOVE QLSX-SIC-INS-PAID-AMT TO LSX-SIC-INS-PAID-AMT.
           MOVE QLSX-BOOK-VALUE TO LSX-BOOK-VALUE.
           MOVE QLSX-SOLD-TO-1 TO LSX-SOLD-TO(1).
           MOVE QLSX-SOLD-TO-2 TO LSX-SOLD-TO(2).
           MOVE QLSX-SOLD-TO-3 TO LSX-SOLD-TO(3).

           IF ( QLSX-SOLD-TO-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-SOLD-TO-DATE
           ELSE
              MOVE QLSX-SOLD-TO-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-SOLD-TO-DATE.

           MOVE QLSX-SOLD-TO-AMT TO LSX-SOLD-TO-AMT.
           MOVE QLSX-DLNO TO LSX-DLNO.
           MOVE QLSX-DLR-RSV-CKNO TO LSX-DLR-RSV-CKNO.
           MOVE QLSX-DLR-RSV-CKAMT TO LSX-DLR-RSV-CKAMT.
           MOVE QLSX-PL-EXPENSE TO LSX-PL-EXPENSE.
           MOVE QLSX-DEFICIENCY-Y-N TO LSX-DEFICIENCY-Y-N.
           MOVE QLSX-NET-BAL-DUE TO LSX-NET-BAL-DUE.
           MOVE QLSX-DEFICIENCY-BAL TO LSX-DEFICIENCY-BAL.
           MOVE QLSX-AUCTION-EXPENSE TO LSX-AUCTION-EXPENSE.
           MOVE QLSX-REASON-CODE TO LSX-REASON-CODE.
           MOVE QLSX-TRIM TO LSX-TRIM.
           MOVE QLSX-DOORS TO LSX-DOORS.
           MOVE QLSX-COLOR TO LSX-COLOR.
           MOVE QLSX-CYLINDERS TO LSX-CYLINDERS.
           MOVE QLSX-AUTO-TRANS TO LSX-AUTO-TRANS.
           MOVE QLSX-AC TO LSX-AC.
           MOVE QLSX-SROOF TO LSX-SROOF.
           MOVE QLSX-LEATHER TO LSX-LEATHER.
           MOVE QLSX-4WD TO LSX-4WD.
           MOVE QLSX-DIESEL TO LSX-DIESEL.
           MOVE QLSX-DUAL-AIR TO LSX-DUAL-AIR.
           MOVE QLSX-EXT-CAB TO LSX-EXT-CAB.
           MOVE QLSX-AGENT-PHONE TO LSX-AGENT-PHONE.
           MOVE QLSX-AGENT-FAX TO LSX-AGENT-FAX.
           MOVE QLSX-STORED-ADR2 TO LSX-STORED-ADR2.
           MOVE QLSX-X-STORED-CITY TO LSX-X-STORED-CITY.
           MOVE QLSX-X-STORED-STATE TO LSX-X-STORED-STATE.
           MOVE QLSX-X-STORED-ZIP TO LSX-X-STORED-ZIP.
           MOVE QLSX-INS-CLAIM-PENDING TO LSX-INS-CLAIM-PENDING.
           MOVE QLSX-WARRANTY-AVAILABLE TO LSX-WARRANTY-AVAILABLE.
           MOVE QLSX-INS-REBATE-REQUESTED TO LSX-INS-REBATE-REQUESTED.
           MOVE QLSX-EXTRACTED TO LSX-EXTRACTED.

           IF ( QLSX-TITLE-SENT-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-TITLE-SENT-DATE
           ELSE
              MOVE QLSX-TITLE-SENT-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-TITLE-SENT-DATE.

           MOVE QLSX-DISPOSAL-HOLD TO LSX-DISPOSAL-HOLD.

           IF ( QLSX-NEXT-HLD-RVW-DATE = "1900-01-01" )
              MOVE ZEROES TO LSX-NEXT-HLD-RVW-DATE
           ELSE
              MOVE QLSX-NEXT-HLD-RVW-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LSX-NEXT-HLD-RVW-DATE.

           MOVE QLSX-CASE-ID TO LSX-CASE-ID.
           MOVE QLSX-COLLATERAL-LOCATION TO LSX-COLLATERAL-LOCATION.
           MOVE QLSX-VIN-MATCH TO LSX-VIN-MATCH.
           MOVE QLSX-PERSONALS TO LSX-PERSONALS.
           MOVE QLSX-KEYS TO LSX-KEYS.
           MOVE QLSX-DRIVES TO LSX-DRIVES.
           MOVE QLSX-DMG TO LSX-DMG.
           MOVE QLSX-Y-ASSIGNED-TO TO LSX-Y-ASSIGNED-TO.
           MOVE QLSX-SUPPLIER-ID TO LSX-SUPPLIER-ID.
           MOVE QLSX-TRANSPORT-EMAIL TO LSX-TRANSPORT-EMAIL.
           MOVE QLSX-STORED-LOCATION TO LSX-STORED-LOCATION.
           MOVE QLSX-STORED-ADDRESS TO LSX-STORED-ADDRESS.
           MOVE QLSX-Y-STORED-CITY TO LSX-Y-STORED-CITY.
           MOVE QLSX-Y-STORED-STATE TO LSX-Y-STORED-STATE.
           MOVE QLSX-Y-STORED-ZIP TO LSX-Y-STORED-ZIP.
           MOVE QLSX-AGENCY-NAME TO LSX-AGENCY-NAME.
           MOVE QLSX-AGENCY-ADDRESS TO LSX-AGENCY-ADDRESS.
           MOVE QLSX-AGENCY-CITY TO LSX-AGENCY-CITY.
           MOVE QLSX-AGENCY-STATE TO LSX-AGENCY-STATE.
           MOVE QLSX-AGENCY-ZIP TO LSX-AGENCY-ZIP.
           MOVE QLSX-AGENCY-PHONE TO LSX-AGENCY-PHONE.
 
      *-----------------------------------------------------------------
      *    LOAD QLSX-REC FROM LSX-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-LSX-FIELDS.
           MOVE LSX-BRNO TO QLSX-BRNO.
           MOVE LSX-ACCTNO TO QLSX-ACCTNO.
           MOVE LSX-SEQNO TO QLSX-SEQNO.

           IF ( LSX-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-LTOUCH-DATE
           ELSE
              MOVE LSX-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-LTOUCH-DATE.


           IF ( LSX-REPODATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-REPODATE
           ELSE
              MOVE LSX-REPODATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-REPODATE.

           MOVE LSX-TITLE-MILEAGE TO QLSX-TITLE-MILEAGE.
           MOVE LSX-VOLUNTARY-FG TO QLSX-VOLUNTARY-FG.
           MOVE LSX-PERFECT TO QLSX-PERFECT.

           IF ( LSX-AUTHORIZED-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-AUTHORIZED-DATE
           ELSE
              MOVE LSX-AUTHORIZED-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-AUTHORIZED-DATE.

           MOVE LSX-AUTHORIZED-BY TO QLSX-AUTHORIZED-BY.
           MOVE LSX-REASON TO QLSX-REASON.
           MOVE LSX-X-ASSIGNED-TO TO QLSX-X-ASSIGNED-TO.

           IF ( LSX-ASSIGNED-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-ASSIGNED-DATE
           ELSE
              MOVE LSX-ASSIGNED-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-ASSIGNED-DATE.

           MOVE LSX-REPO-CKNO TO QLSX-REPO-CKNO.

           IF ( LSX-REPO-CKDATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-REPO-CKDATE
           ELSE
              MOVE LSX-REPO-CKDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-REPO-CKDATE.

           MOVE LSX-REPO-CKAMT TO QLSX-REPO-CKAMT.
           MOVE LSX-STORED-ADR1 TO QLSX-STORED-ADR1.

           IF ( LSX-STORED-CKDATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-STORED-CKDATE
           ELSE
              MOVE LSX-STORED-CKDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-STORED-CKDATE.

           MOVE LSX-STORED-CKNO TO QLSX-STORED-CKNO.
           MOVE LSX-STORED-CKAMT TO QLSX-STORED-CKAMT.

           IF ( LSX-REDEEM-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-REDEEM-DATE
           ELSE
              MOVE LSX-REDEEM-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-REDEEM-DATE.

           MOVE LSX-BUREAU-NOTIFIED TO QLSX-BUREAU-NOTIFIED.

           IF ( LSX-BUREAU-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-BUREAU-DATE
           ELSE
              MOVE LSX-BUREAU-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-BUREAU-DATE.

           MOVE LSX-BUREAU-BY TO QLSX-BUREAU-BY.

           IF ( LSX-10DAY-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-10DAY-DATE
           ELSE
              MOVE LSX-10DAY-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-10DAY-DATE.

           MOVE LSX-10DAY-BY TO QLSX-10DAY-BY.
           MOVE LSX-10DAY-COST TO QLSX-10DAY-COST.

           IF ( LSX-TITLE-APPL-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-TITLE-APPL-DATE
           ELSE
              MOVE LSX-TITLE-APPL-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-TITLE-APPL-DATE.

           MOVE LSX-TITLE-APPL-BY TO QLSX-TITLE-APPL-BY.
           MOVE LSX-TITLE-APPL-COST TO QLSX-TITLE-APPL-COST.
           MOVE LSX-COND-MILEAGE TO QLSX-COND-MILEAGE.
           MOVE LSX-COND-REPORT-Y-N TO QLSX-COND-REPORT-Y-N.
           MOVE LSX-REPAIRS-DESC(1) TO QLSX-REPAIRS-DESC-1.
           MOVE LSX-REPAIRS-DESC(2) TO QLSX-REPAIRS-DESC-2.
           MOVE LSX-REPAIRS-COST TO QLSX-REPAIRS-COST.
           MOVE LSX-ASSIGN-TO(1) TO QLSX-ASSIGN-TO-1.

           IF ( LSX-ASSIGN-COMPLETE-DATE(1) = ZEROES )
              MOVE "1900-01-01" TO QLSX-ASSIGN-COMPLETE-DATE-1
           ELSE
              MOVE LSX-ASSIGN-COMPLETE-DATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-ASSIGN-COMPLETE-DATE-1.


           IF ( LSX-ASSIGN-CKDATE(1) = ZEROES )
              MOVE "1900-01-01" TO QLSX-ASSIGN-CKDATE-1
           ELSE
              MOVE LSX-ASSIGN-CKDATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-ASSIGN-CKDATE-1.

           MOVE LSX-ASSIGN-CKNO(1) TO QLSX-ASSIGN-CKNO-1.
           MOVE LSX-ASSIGN-CKAMT(1) TO QLSX-ASSIGN-CKAMT-1.
           MOVE LSX-ASSIGN-TO(2) TO QLSX-ASSIGN-TO-2.

           IF ( LSX-ASSIGN-COMPLETE-DATE(2) = ZEROES )
              MOVE "1900-01-01" TO QLSX-ASSIGN-COMPLETE-DATE-2
           ELSE
              MOVE LSX-ASSIGN-COMPLETE-DATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-ASSIGN-COMPLETE-DATE-2.


           IF ( LSX-ASSIGN-CKDATE(2) = ZEROES )
              MOVE "1900-01-01" TO QLSX-ASSIGN-CKDATE-2
           ELSE
              MOVE LSX-ASSIGN-CKDATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-ASSIGN-CKDATE-2.

           MOVE LSX-ASSIGN-CKNO(2) TO QLSX-ASSIGN-CKNO-2.
           MOVE LSX-ASSIGN-CKAMT(2) TO QLSX-ASSIGN-CKAMT-2.
           MOVE LSX-OTH-EXP(1) TO QLSX-OTH-EXP-1.

           IF ( LSX-OTH-EXP-CKDATE(1) = ZEROES )
              MOVE "1900-01-01" TO QLSX-OTH-EXP-CKDATE-1
           ELSE
              MOVE LSX-OTH-EXP-CKDATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-OTH-EXP-CKDATE-1.

           MOVE LSX-OTH-EXP-CKNO(1) TO QLSX-OTH-EXP-CKNO-1.
           MOVE LSX-OTH-EXP-CKAMT(1) TO QLSX-OTH-EXP-CKAMT-1.
           MOVE LSX-OTH-EXP(2) TO QLSX-OTH-EXP-2.

           IF ( LSX-OTH-EXP-CKDATE(2) = ZEROES )
              MOVE "1900-01-01" TO QLSX-OTH-EXP-CKDATE-2
           ELSE
              MOVE LSX-OTH-EXP-CKDATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-OTH-EXP-CKDATE-2.

           MOVE LSX-OTH-EXP-CKNO(2) TO QLSX-OTH-EXP-CKNO-2.
           MOVE LSX-OTH-EXP-CKAMT(2) TO QLSX-OTH-EXP-CKAMT-2.
           MOVE LSX-OTH-EXP(3) TO QLSX-OTH-EXP-3.

           IF ( LSX-OTH-EXP-CKDATE(3) = ZEROES )
              MOVE "1900-01-01" TO QLSX-OTH-EXP-CKDATE-3
           ELSE
              MOVE LSX-OTH-EXP-CKDATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-OTH-EXP-CKDATE-3.

           MOVE LSX-OTH-EXP-CKNO(3) TO QLSX-OTH-EXP-CKNO-3.
           MOVE LSX-OTH-EXP-CKAMT(3) TO QLSX-OTH-EXP-CKAMT-3.

           IF ( LSX-INS-RB-REQ-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-INS-RB-REQ-DATE
           ELSE
              MOVE LSX-INS-RB-REQ-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-INS-RB-REQ-DATE.


           IF ( LSX-INS-RB-REC-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-INS-RB-REC-DATE
           ELSE
              MOVE LSX-INS-RB-REC-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-INS-RB-REC-DATE.

           MOVE LSX-INS-RB-AMT TO QLSX-INS-RB-AMT.

           IF ( LSX-RB-REQ-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-RB-REQ-DATE
           ELSE
              MOVE LSX-RB-REQ-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-RB-REQ-DATE.


           IF ( LSX-RB-REC-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-RB-REC-DATE
           ELSE
              MOVE LSX-RB-REC-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-RB-REC-DATE.

           MOVE LSX-RB-AMT TO QLSX-RB-AMT.

           IF ( LSX-SIC-INS-FILE-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-SIC-INS-FILE-DATE
           ELSE
              MOVE LSX-SIC-INS-FILE-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-SIC-INS-FILE-DATE.


           IF ( LSX-SIC-INS-PAID-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-SIC-INS-PAID-DATE
           ELSE
              MOVE LSX-SIC-INS-PAID-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-SIC-INS-PAID-DATE.

           MOVE LSX-SIC-INS-PAID-AMT TO QLSX-SIC-INS-PAID-AMT.
           MOVE LSX-BOOK-VALUE TO QLSX-BOOK-VALUE.
           MOVE LSX-SOLD-TO(1) TO QLSX-SOLD-TO-1.
           MOVE LSX-SOLD-TO(2) TO QLSX-SOLD-TO-2.
           MOVE LSX-SOLD-TO(3) TO QLSX-SOLD-TO-3.

           IF ( LSX-SOLD-TO-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-SOLD-TO-DATE
           ELSE
              MOVE LSX-SOLD-TO-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-SOLD-TO-DATE.

           MOVE LSX-SOLD-TO-AMT TO QLSX-SOLD-TO-AMT.
           MOVE LSX-DLNO TO QLSX-DLNO.
           MOVE LSX-DLR-RSV-CKNO TO QLSX-DLR-RSV-CKNO.
           MOVE LSX-DLR-RSV-CKAMT TO QLSX-DLR-RSV-CKAMT.
           MOVE LSX-PL-EXPENSE TO QLSX-PL-EXPENSE.
           MOVE LSX-DEFICIENCY-Y-N TO QLSX-DEFICIENCY-Y-N.
           MOVE LSX-NET-BAL-DUE TO QLSX-NET-BAL-DUE.
           MOVE LSX-DEFICIENCY-BAL TO QLSX-DEFICIENCY-BAL.
           MOVE LSX-AUCTION-EXPENSE TO QLSX-AUCTION-EXPENSE.
           MOVE LSX-REASON-CODE TO QLSX-REASON-CODE.
           MOVE LSX-TRIM TO QLSX-TRIM.
           MOVE LSX-DOORS TO QLSX-DOORS.
           MOVE LSX-COLOR TO QLSX-COLOR.
           MOVE LSX-CYLINDERS TO QLSX-CYLINDERS.
           MOVE LSX-AUTO-TRANS TO QLSX-AUTO-TRANS.
           MOVE LSX-AC TO QLSX-AC.
           MOVE LSX-SROOF TO QLSX-SROOF.
           MOVE LSX-LEATHER TO QLSX-LEATHER.
           MOVE LSX-4WD TO QLSX-4WD.
           MOVE LSX-DIESEL TO QLSX-DIESEL.
           MOVE LSX-DUAL-AIR TO QLSX-DUAL-AIR.
           MOVE LSX-EXT-CAB TO QLSX-EXT-CAB.
           MOVE LSX-AGENT-PHONE TO QLSX-AGENT-PHONE.
           MOVE LSX-AGENT-FAX TO QLSX-AGENT-FAX.
           MOVE LSX-STORED-ADR2 TO QLSX-STORED-ADR2.
           MOVE LSX-X-STORED-CITY TO QLSX-X-STORED-CITY.
           MOVE LSX-X-STORED-STATE TO QLSX-X-STORED-STATE.
           MOVE LSX-X-STORED-ZIP TO QLSX-X-STORED-ZIP.
           MOVE LSX-INS-CLAIM-PENDING TO QLSX-INS-CLAIM-PENDING.
           MOVE LSX-WARRANTY-AVAILABLE TO QLSX-WARRANTY-AVAILABLE.
           MOVE LSX-INS-REBATE-REQUESTED TO QLSX-INS-REBATE-REQUESTED.
           MOVE LSX-EXTRACTED TO QLSX-EXTRACTED.

           IF ( LSX-TITLE-SENT-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-TITLE-SENT-DATE
           ELSE
              MOVE LSX-TITLE-SENT-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-TITLE-SENT-DATE.

           MOVE LSX-DISPOSAL-HOLD TO QLSX-DISPOSAL-HOLD.

           IF ( LSX-NEXT-HLD-RVW-DATE = ZEROES )
              MOVE "1900-01-01" TO QLSX-NEXT-HLD-RVW-DATE
           ELSE
              MOVE LSX-NEXT-HLD-RVW-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLSX-NEXT-HLD-RVW-DATE.

           MOVE LSX-CASE-ID TO QLSX-CASE-ID.
           MOVE LSX-COLLATERAL-LOCATION TO QLSX-COLLATERAL-LOCATION.
           MOVE LSX-VIN-MATCH TO QLSX-VIN-MATCH.
           MOVE LSX-PERSONALS TO QLSX-PERSONALS.
           MOVE LSX-KEYS TO QLSX-KEYS.
           MOVE LSX-DRIVES TO QLSX-DRIVES.
           MOVE LSX-DMG TO QLSX-DMG.
           MOVE LSX-Y-ASSIGNED-TO TO QLSX-Y-ASSIGNED-TO.
           MOVE LSX-SUPPLIER-ID TO QLSX-SUPPLIER-ID.
           MOVE LSX-TRANSPORT-EMAIL TO QLSX-TRANSPORT-EMAIL.
           MOVE LSX-STORED-LOCATION TO QLSX-STORED-LOCATION.
           MOVE LSX-STORED-ADDRESS TO QLSX-STORED-ADDRESS.
           MOVE LSX-Y-STORED-CITY TO QLSX-Y-STORED-CITY.
           MOVE LSX-Y-STORED-STATE TO QLSX-Y-STORED-STATE.
           MOVE LSX-Y-STORED-ZIP TO QLSX-Y-STORED-ZIP.
           MOVE LSX-AGENCY-NAME TO QLSX-AGENCY-NAME.
           MOVE LSX-AGENCY-ADDRESS TO QLSX-AGENCY-ADDRESS.
           MOVE LSX-AGENCY-CITY TO QLSX-AGENCY-CITY.
           MOVE LSX-AGENCY-STATE TO QLSX-AGENCY-STATE.
           MOVE LSX-AGENCY-ZIP TO QLSX-AGENCY-ZIP.
           MOVE LSX-AGENCY-PHONE TO QLSX-AGENCY-PHONE.
 

