      * COPYMEMBER: LIBLP/LPLTLGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - LOAN TRAILER - LIENHOLDER
      *
      *=================================================================
      * REV:
      * AMM 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD LTL-REC FROM QLTL-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-LTL-FIELDS.
           MOVE QLTL-BRNO TO LTL-BRNO.
           MOVE QLTL-ACCTNO TO LTL-ACCTNO.
           MOVE QLTL-SEQNO TO LTL-SEQNO.

           IF ( QLTL-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO LTL-LTOUCH-DATE
           ELSE
              MOVE QLTL-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LTL-LTOUCH-DATE.

           MOVE QLTL-LIEN-TYPE-1 TO LTL-LIEN-TYPE(1).
           MOVE QLTL-LIEN-NAME-1 TO LTL-LIEN-NAME(1).
           MOVE QLTL-LIEN-ADR-1 TO LTL-LIEN-ADR(1).
           MOVE QLTL-LIEN-CITY-1 TO LTL-LIEN-CITY(1).
           MOVE QLTL-LIEN-STATE-1 TO LTL-LIEN-STATE(1).
           MOVE QLTL-LIEN-ZIP-1 TO LTL-LIEN-ZIP(1).

           IF ( QLTL-LIEN-DATE-1 = "1900-01-01" )
              MOVE ZEROES TO LTL-LIEN-DATE(1)
           ELSE
              MOVE QLTL-LIEN-DATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LTL-LIEN-DATE(1).

           MOVE QLTL-LIEN-TYPE-2 TO LTL-LIEN-TYPE(2).
           MOVE QLTL-LIEN-NAME-2 TO LTL-LIEN-NAME(2).
           MOVE QLTL-LIEN-ADR-2 TO LTL-LIEN-ADR(2).
           MOVE QLTL-LIEN-CITY-2 TO LTL-LIEN-CITY(2).
           MOVE QLTL-LIEN-STATE-2 TO LTL-LIEN-STATE(2).
           MOVE QLTL-LIEN-ZIP-2 TO LTL-LIEN-ZIP(2).

           IF ( QLTL-LIEN-DATE-2 = "1900-01-01" )
              MOVE ZEROES TO LTL-LIEN-DATE(2)
           ELSE
              MOVE QLTL-LIEN-DATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LTL-LIEN-DATE(2).

           MOVE QLTL-LIEN-TYPE-3 TO LTL-LIEN-TYPE(3).
           MOVE QLTL-LIEN-NAME-3 TO LTL-LIEN-NAME(3).
           MOVE QLTL-LIEN-ADR-3 TO LTL-LIEN-ADR(3).
           MOVE QLTL-LIEN-CITY-3 TO LTL-LIEN-CITY(3).
           MOVE QLTL-LIEN-STATE-3 TO LTL-LIEN-STATE(3).
           MOVE QLTL-LIEN-ZIP-3 TO LTL-LIEN-ZIP(3).

           IF ( QLTL-LIEN-DATE-3 = "1900-01-01" )
              MOVE ZEROES TO LTL-LIEN-DATE(3)
           ELSE
              MOVE QLTL-LIEN-DATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LTL-LIEN-DATE(3).


           IF ( QLTL-TITLE-RCV-DATE = "1900-01-01" )
              MOVE ZEROES TO LTL-TITLE-RCV-DATE
           ELSE
              MOVE QLTL-TITLE-RCV-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LTL-TITLE-RCV-DATE.


           IF ( QLTL-TITLE-LIEN-DATE = "1900-01-01" )
              MOVE ZEROES TO LTL-TITLE-LIEN-DATE
           ELSE
              MOVE QLTL-TITLE-LIEN-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LTL-TITLE-LIEN-DATE.

           MOVE QLTL-TITLE-NO TO LTL-TITLE-NO.
           MOVE QLTL-LIEN-LETTER-SENT TO LTL-LIEN-LETTER-SENT.
           MOVE QLTL-LIEN-COMMENT1 TO LTL-LIEN-COMMENT1.
           MOVE QLTL-LIEN-COMMENT2 TO LTL-LIEN-COMMENT2.
           MOVE QLTL-LIEN-TITLE-STATE TO LTL-LIEN-TITLE-STATE.
           MOVE QLTL-TITLE-STATUS-CODE TO LTL-TITLE-STATUS-CODE.
           MOVE QLTL-TITLE-SEND-FLAG TO LTL-TITLE-SEND-FLAG.
           MOVE QLTL-TITLE-NAME TO LTL-TITLE-NAME.
           MOVE QLTL-TITLE-ADR TO LTL-TITLE-ADR.
           MOVE QLTL-TITLE-CITY TO LTL-TITLE-CITY.
           MOVE QLTL-TITLE-STATE TO LTL-TITLE-STATE.
           MOVE QLTL-TITLE-ZIP TO LTL-TITLE-ZIP.

           IF ( QLTL-TITLE-DATE = "1900-01-01" )
              MOVE ZEROES TO LTL-TITLE-DATE
           ELSE
              MOVE QLTL-TITLE-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LTL-TITLE-DATE.

           MOVE QLTL-TITLE-SENT-BY TO LTL-TITLE-SENT-BY.
           MOVE QLTL-SEND-ASAP TO LTL-SEND-ASAP.
           MOVE QLTL-TITLE-SEND-FMNO TO LTL-TITLE-SEND-FMNO.
           MOVE QLTL-TITLE-ADR2 TO LTL-TITLE-ADR2.
           MOVE QLTL-TITLE-COMMENT1 TO LTL-TITLE-COMMENT1.
           MOVE QLTL-TITLE-COMMENT2 TO LTL-TITLE-COMMENT2.
           MOVE QLTL-RELEASE-TYPE TO LTL-RELEASE-TYPE.
           MOVE QLTL-CARRIER-TYPE TO LTL-CARRIER-TYPE.
           MOVE QLTL-CARRIER-ACCTNO TO LTL-CARRIER-ACCTNO.
 
      *-----------------------------------------------------------------
      *    LOAD QLTL-REC FROM LTL-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-LTL-FIELDS.
           MOVE LTL-BRNO TO QLTL-BRNO.
           MOVE LTL-ACCTNO TO QLTL-ACCTNO.
           MOVE LTL-SEQNO TO QLTL-SEQNO.

           IF ( LTL-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QLTL-LTOUCH-DATE
           ELSE
              MOVE LTL-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLTL-LTOUCH-DATE.

           MOVE LTL-LIEN-TYPE(1) TO QLTL-LIEN-TYPE-1.
           MOVE LTL-LIEN-NAME(1) TO QLTL-LIEN-NAME-1.
           MOVE LTL-LIEN-ADR(1) TO QLTL-LIEN-ADR-1.
           MOVE LTL-LIEN-CITY(1) TO QLTL-LIEN-CITY-1.
           MOVE LTL-LIEN-STATE(1) TO QLTL-LIEN-STATE-1.
           MOVE LTL-LIEN-ZIP(1) TO QLTL-LIEN-ZIP-1.

           IF ( LTL-LIEN-DATE(1) = ZEROES )
              MOVE "1900-01-01" TO QLTL-LIEN-DATE-1
           ELSE
              MOVE LTL-LIEN-DATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLTL-LIEN-DATE-1.

           MOVE LTL-LIEN-TYPE(2) TO QLTL-LIEN-TYPE-2.
           MOVE LTL-LIEN-NAME(2) TO QLTL-LIEN-NAME-2.
           MOVE LTL-LIEN-ADR(2) TO QLTL-LIEN-ADR-2.
           MOVE LTL-LIEN-CITY(2) TO QLTL-LIEN-CITY-2.
           MOVE LTL-LIEN-STATE(2) TO QLTL-LIEN-STATE-2.
           MOVE LTL-LIEN-ZIP(2) TO QLTL-LIEN-ZIP-2.

           IF ( LTL-LIEN-DATE(2) = ZEROES )
              MOVE "1900-01-01" TO QLTL-LIEN-DATE-2
           ELSE
              MOVE LTL-LIEN-DATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLTL-LIEN-DATE-2.

           MOVE LTL-LIEN-TYPE(3) TO QLTL-LIEN-TYPE-3.
           MOVE LTL-LIEN-NAME(3) TO QLTL-LIEN-NAME-3.
           MOVE LTL-LIEN-ADR(3) TO QLTL-LIEN-ADR-3.
           MOVE LTL-LIEN-CITY(3) TO QLTL-LIEN-CITY-3.
           MOVE LTL-LIEN-STATE(3) TO QLTL-LIEN-STATE-3.
           MOVE LTL-LIEN-ZIP(3) TO QLTL-LIEN-ZIP-3.

           IF ( LTL-LIEN-DATE(3) = ZEROES )
              MOVE "1900-01-01" TO QLTL-LIEN-DATE-3
           ELSE
              MOVE LTL-LIEN-DATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLTL-LIEN-DATE-3.


           IF ( LTL-TITLE-RCV-DATE = ZEROES )
              MOVE "1900-01-01" TO QLTL-TITLE-RCV-DATE
           ELSE
              MOVE LTL-TITLE-RCV-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLTL-TITLE-RCV-DATE.


           IF ( LTL-TITLE-LIEN-DATE = ZEROES )
              MOVE "1900-01-01" TO QLTL-TITLE-LIEN-DATE
           ELSE
              MOVE LTL-TITLE-LIEN-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLTL-TITLE-LIEN-DATE.

           MOVE LTL-TITLE-NO TO QLTL-TITLE-NO.
           MOVE LTL-LIEN-LETTER-SENT TO QLTL-LIEN-LETTER-SENT.
           MOVE LTL-LIEN-COMMENT1 TO QLTL-LIEN-COMMENT1.
           MOVE LTL-LIEN-COMMENT2 TO QLTL-LIEN-COMMENT2.
           MOVE LTL-LIEN-TITLE-STATE TO QLTL-LIEN-TITLE-STATE.
           MOVE LTL-TITLE-STATUS-CODE TO QLTL-TITLE-STATUS-CODE.
           MOVE LTL-TITLE-SEND-FLAG TO QLTL-TITLE-SEND-FLAG.
           MOVE LTL-TITLE-NAME TO QLTL-TITLE-NAME.
           MOVE LTL-TITLE-ADR TO QLTL-TITLE-ADR.
           MOVE LTL-TITLE-CITY TO QLTL-TITLE-CITY.
           MOVE LTL-TITLE-STATE TO QLTL-TITLE-STATE.
           MOVE LTL-TITLE-ZIP TO QLTL-TITLE-ZIP.

           IF ( LTL-TITLE-DATE = ZEROES )
              MOVE "1900-01-01" TO QLTL-TITLE-DATE
           ELSE
              MOVE LTL-TITLE-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLTL-TITLE-DATE.

           MOVE LTL-TITLE-SENT-BY TO QLTL-TITLE-SENT-BY.
           MOVE LTL-SEND-ASAP TO QLTL-SEND-ASAP.
           MOVE LTL-TITLE-SEND-FMNO TO QLTL-TITLE-SEND-FMNO.
           MOVE LTL-TITLE-ADR2 TO QLTL-TITLE-ADR2.
           MOVE LTL-TITLE-COMMENT1 TO QLTL-TITLE-COMMENT1.
           MOVE LTL-TITLE-COMMENT2 TO QLTL-TITLE-COMMENT2.
           MOVE LTL-RELEASE-TYPE TO QLTL-RELEASE-TYPE.
           MOVE LTL-CARRIER-TYPE TO QLTL-CARRIER-TYPE.
           MOVE LTL-CARRIER-ACCTNO TO QLTL-CARRIER-ACCTNO.
 

