      * COPYMEMBER: LIBLP/LPLXGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - LOAN PAYMENT TRAILER - STANDARD
      *
      *=================================================================
      * REV:
      * AMM 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD LX-REC FROM QLX-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-LX-FIELDS.
           MOVE QLX-BRNO TO LX-BRNO.
           MOVE QLX-ACCTNO TO LX-ACCTNO.
           MOVE QLX-SEQNO TO LX-SEQNO.

           IF ( QLX-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO LX-LTOUCH-DATE
           ELSE
              MOVE QLX-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LX-LTOUCH-DATE.

           MOVE QLXT-CODE TO LXT-CODE.
           MOVE QLXT-EARN-1 TO LXT-EARN(1).
           MOVE QLXT-EARN-2 TO LXT-EARN(2).
           MOVE QLXT-EARN-3 TO LXT-EARN(3).
           MOVE QLXT-EARN-4 TO LXT-EARN(4).
           MOVE QLXT-EARN-5 TO LXT-EARN(5).
           MOVE QLXT-EARN-6 TO LXT-EARN(6).
           MOVE QLXT-EARN-7 TO LXT-EARN(7).
           MOVE QLXT-EARN-8 TO LXT-EARN(8).
           MOVE QLXT-EARN-9 TO LXT-EARN(9).
           MOVE QLXT-EARN-10 TO LXT-EARN(10).
           MOVE QLXT-EARN-11 TO LXT-EARN(11).
           MOVE QLXT-EARN-12 TO LXT-EARN(12).
           MOVE QLXT-EARN-13 TO LXT-EARN(13).
           MOVE QLXT-EARN-14 TO LXT-EARN(14).
           MOVE QLXT-EARN-15 TO LXT-EARN(15).
           MOVE QLXT-EARN-16 TO LXT-EARN(16).
           MOVE QLXT-EARN-17 TO LXT-EARN(17).
           MOVE QLXT-EARN-18 TO LXT-EARN(18).
           MOVE QLXT-EARN-19 TO LXT-EARN(19).
           MOVE QLXT-EARN-20 TO LXT-EARN(20).
           MOVE QLXP-CODE TO LXP-CODE.
           MOVE QLXP-EARN-1 TO LXP-EARN(1).
           MOVE QLXP-EARN-2 TO LXP-EARN(2).
           MOVE QLXP-EARN-3 TO LXP-EARN(3).
           MOVE QLXP-EARN-4 TO LXP-EARN(4).
           MOVE QLXP-EARN-5 TO LXP-EARN(5).
           MOVE QLXP-EARN-6 TO LXP-EARN(6).
           MOVE QLXP-EARN-7 TO LXP-EARN(7).
           MOVE QLXP-EARN-8 TO LXP-EARN(8).
           MOVE QLXP-EARN-9 TO LXP-EARN(9).
           MOVE QLXP-EARN-10 TO LXP-EARN(10).
           MOVE QLXP-EARN-11 TO LXP-EARN(11).
           MOVE QLXP-EARN-12 TO LXP-EARN(12).
           MOVE QLXP-EARN-13 TO LXP-EARN(13).
           MOVE QLXP-EARN-14 TO LXP-EARN(14).
           MOVE QLXP-EARN-15 TO LXP-EARN(15).
           MOVE QLXP-EARN-16 TO LXP-EARN(16).
           MOVE QLXP-EARN-17 TO LXP-EARN(17).
           MOVE QLXP-EARN-18 TO LXP-EARN(18).
           MOVE QLXP-EARN-19 TO LXP-EARN(19).
           MOVE QLXP-EARN-20 TO LXP-EARN(20).
           MOVE QLXA-CODE TO LXA-CODE.
           MOVE QLXA-SRCD TO LXA-SRCD.
           MOVE QLXA-START-PMT-1 TO LXA-START-PMT(1).
           MOVE QLXA-END-PMT-1 TO LXA-END-PMT(1).
           MOVE QLXA-NET-CHANGE-1 TO LXA-NET-CHANGE(1).
           MOVE QLXA-START-PMT-2 TO LXA-START-PMT(2).
           MOVE QLXA-END-PMT-2 TO LXA-END-PMT(2).
           MOVE QLXA-NET-CHANGE-2 TO LXA-NET-CHANGE(2).
           MOVE QLXA-START-PMT-3 TO LXA-START-PMT(3).
           MOVE QLXA-END-PMT-3 TO LXA-END-PMT(3).
           MOVE QLXA-NET-CHANGE-3 TO LXA-NET-CHANGE(3).
           MOVE QLXA-START-PMT-4 TO LXA-START-PMT(4).
           MOVE QLXA-END-PMT-4 TO LXA-END-PMT(4).
           MOVE QLXA-NET-CHANGE-4 TO LXA-NET-CHANGE(4).
           MOVE QLXA-START-PMT-5 TO LXA-START-PMT(5).
           MOVE QLXA-END-PMT-5 TO LXA-END-PMT(5).
           MOVE QLXA-NET-CHANGE-5 TO LXA-NET-CHANGE(5).
           MOVE QLXA-START-PMT-6 TO LXA-START-PMT(6).
           MOVE QLXA-END-PMT-6 TO LXA-END-PMT(6).
           MOVE QLXA-NET-CHANGE-6 TO LXA-NET-CHANGE(6).
           MOVE QLXA-START-PMT-7 TO LXA-START-PMT(7).
           MOVE QLXA-END-PMT-7 TO LXA-END-PMT(7).
           MOVE QLXA-NET-CHANGE-7 TO LXA-NET-CHANGE(7).
           MOVE QLXA-START-PMT-8 TO LXA-START-PMT(8).
           MOVE QLXA-END-PMT-8 TO LXA-END-PMT(8).
           MOVE QLXA-NET-CHANGE-8 TO LXA-NET-CHANGE(8).
           MOVE QLXA-START-PMT-9 TO LXA-START-PMT(9).
           MOVE QLXA-END-PMT-9 TO LXA-END-PMT(9).
           MOVE QLXA-NET-CHANGE-9 TO LXA-NET-CHANGE(9).
           MOVE QLXA-LN-INSCOMP TO LXA-LN-INSCOMP.
           MOVE QLXA-LN-INSOURS TO LXA-LN-INSOURS.

           IF ( QLXA-LN-INSEFF-DATE = "1900-01-01" )
              MOVE ZEROES TO LXA-LN-INSEFF-DATE
           ELSE
              MOVE QLXA-LN-INSEFF-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LXA-LN-INSEFF-DATE.


           IF ( QLXA-LN-INSEXP-DATE = "1900-01-01" )
              MOVE ZEROES TO LXA-LN-INSEXP-DATE
           ELSE
              MOVE QLXA-LN-INSEXP-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LXA-LN-INSEXP-DATE.

           MOVE QLXA-LN-INSPREM TO LXA-LN-INSPREM.
           MOVE QLXA-LN-INSCOVR TO LXA-LN-INSCOVR.
           MOVE QLXA-LN-INSCOMM TO LXA-LN-INSCOMM.
           MOVE QLXA-LN-INS-REBATE TO LXA-LN-INS-REBATE.
           MOVE QLXA-LN-INSCODES TO LXA-LN-INSCODES.
           MOVE QLXZ-CODE TO LXZ-CODE.
           MOVE QLXZ-POST-REGPY TO LXZ-POST-REGPY.
           MOVE QLXZ-POST-EXTRA-PRIN TO LXZ-POST-EXTRA-PRIN.
           MOVE QLXZ-POST-OTH TO LXZ-POST-OTH.
           MOVE QLXZ-POST-LCHG TO LXZ-POST-LCHG.
           MOVE QLXZ-PDUE-APINT TO LXZ-PDUE-APINT.
           MOVE QLXZ-PDUE-APPRIN TO LXZ-PDUE-APPRIN.
           MOVE QLXZ-CUR-APINT TO LXZ-CUR-APINT.
           MOVE QLXZ-CUR-APPRIN TO LXZ-CUR-APPRIN.
           MOVE QLXR-CODE TO LXR-CODE.
           MOVE QLXR-REB-AMT TO LXR-REB-AMT.
           MOVE QLXX-CODE TO LXX-CODE.
           MOVE QLXX-INS-TAX-COUNTY-CD TO LXX-INS-TAX-COUNTY-CD.
           MOVE QLXX-INS-TAX-CITY-CD TO LXX-INS-TAX-CITY-CD.
           MOVE QLXM-CODE TO LXM-CODE.
           MOVE QLXM-MIP-CLPAID TO LXM-MIP-CLPAID.

           IF ( QLXM-MIP-CLPDTH-DATE = "1900-01-01" )
              MOVE ZEROES TO LXM-MIP-CLPDTH-DATE
           ELSE
              MOVE QLXM-MIP-CLPDTH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LXM-MIP-CLPDTH-DATE.

           MOVE QLXM-MIP-AHPAID TO LXM-MIP-AHPAID.

           IF ( QLXM-MIP-AHPDTH-DATE = "1900-01-01" )
              MOVE ZEROES TO LXM-MIP-AHPDTH-DATE
           ELSE
              MOVE QLXM-MIP-AHPDTH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO LXM-MIP-AHPDTH-DATE.

 
      *-----------------------------------------------------------------
      *    LOAD QLX-REC FROM LX-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-LX-FIELDS.
           MOVE LX-BRNO TO QLX-BRNO.
           MOVE LX-ACCTNO TO QLX-ACCTNO.
           MOVE LX-SEQNO TO QLX-SEQNO.

           IF ( LX-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QLX-LTOUCH-DATE
           ELSE
              MOVE LX-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLX-LTOUCH-DATE.

           MOVE LXT-CODE TO QLXT-CODE.
           MOVE LXT-EARN(1) TO QLXT-EARN-1.
           MOVE LXT-EARN(2) TO QLXT-EARN-2.
           MOVE LXT-EARN(3) TO QLXT-EARN-3.
           MOVE LXT-EARN(4) TO QLXT-EARN-4.
           MOVE LXT-EARN(5) TO QLXT-EARN-5.
           MOVE LXT-EARN(6) TO QLXT-EARN-6.
           MOVE LXT-EARN(7) TO QLXT-EARN-7.
           MOVE LXT-EARN(8) TO QLXT-EARN-8.
           MOVE LXT-EARN(9) TO QLXT-EARN-9.
           MOVE LXT-EARN(10) TO QLXT-EARN-10.
           MOVE LXT-EARN(11) TO QLXT-EARN-11.
           MOVE LXT-EARN(12) TO QLXT-EARN-12.
           MOVE LXT-EARN(13) TO QLXT-EARN-13.
           MOVE LXT-EARN(14) TO QLXT-EARN-14.
           MOVE LXT-EARN(15) TO QLXT-EARN-15.
           MOVE LXT-EARN(16) TO QLXT-EARN-16.
           MOVE LXT-EARN(17) TO QLXT-EARN-17.
           MOVE LXT-EARN(18) TO QLXT-EARN-18.
           MOVE LXT-EARN(19) TO QLXT-EARN-19.
           MOVE LXT-EARN(20) TO QLXT-EARN-20.
           MOVE LXP-CODE TO QLXP-CODE.
           MOVE LXP-EARN(1) TO QLXP-EARN-1.
           MOVE LXP-EARN(2) TO QLXP-EARN-2.
           MOVE LXP-EARN(3) TO QLXP-EARN-3.
           MOVE LXP-EARN(4) TO QLXP-EARN-4.
           MOVE LXP-EARN(5) TO QLXP-EARN-5.
           MOVE LXP-EARN(6) TO QLXP-EARN-6.
           MOVE LXP-EARN(7) TO QLXP-EARN-7.
           MOVE LXP-EARN(8) TO QLXP-EARN-8.
           MOVE LXP-EARN(9) TO QLXP-EARN-9.
           MOVE LXP-EARN(10) TO QLXP-EARN-10.
           MOVE LXP-EARN(11) TO QLXP-EARN-11.
           MOVE LXP-EARN(12) TO QLXP-EARN-12.
           MOVE LXP-EARN(13) TO QLXP-EARN-13.
           MOVE LXP-EARN(14) TO QLXP-EARN-14.
           MOVE LXP-EARN(15) TO QLXP-EARN-15.
           MOVE LXP-EARN(16) TO QLXP-EARN-16.
           MOVE LXP-EARN(17) TO QLXP-EARN-17.
           MOVE LXP-EARN(18) TO QLXP-EARN-18.
           MOVE LXP-EARN(19) TO QLXP-EARN-19.
           MOVE LXP-EARN(20) TO QLXP-EARN-20.
           MOVE LXA-CODE TO QLXA-CODE.
           MOVE LXA-SRCD TO QLXA-SRCD.
           MOVE LXA-START-PMT(1) TO QLXA-START-PMT-1.
           MOVE LXA-END-PMT(1) TO QLXA-END-PMT-1.
           MOVE LXA-NET-CHANGE(1) TO QLXA-NET-CHANGE-1.
           MOVE LXA-START-PMT(2) TO QLXA-START-PMT-2.
           MOVE LXA-END-PMT(2) TO QLXA-END-PMT-2.
           MOVE LXA-NET-CHANGE(2) TO QLXA-NET-CHANGE-2.
           MOVE LXA-START-PMT(3) TO QLXA-START-PMT-3.
           MOVE LXA-END-PMT(3) TO QLXA-END-PMT-3.
           MOVE LXA-NET-CHANGE(3) TO QLXA-NET-CHANGE-3.
           MOVE LXA-START-PMT(4) TO QLXA-START-PMT-4.
           MOVE LXA-END-PMT(4) TO QLXA-END-PMT-4.
           MOVE LXA-NET-CHANGE(4) TO QLXA-NET-CHANGE-4.
           MOVE LXA-START-PMT(5) TO QLXA-START-PMT-5.
           MOVE LXA-END-PMT(5) TO QLXA-END-PMT-5.
           MOVE LXA-NET-CHANGE(5) TO QLXA-NET-CHANGE-5.
           MOVE LXA-START-PMT(6) TO QLXA-START-PMT-6.
           MOVE LXA-END-PMT(6) TO QLXA-END-PMT-6.
           MOVE LXA-NET-CHANGE(6) TO QLXA-NET-CHANGE-6.
           MOVE LXA-START-PMT(7) TO QLXA-START-PMT-7.
           MOVE LXA-END-PMT(7) TO QLXA-END-PMT-7.
           MOVE LXA-NET-CHANGE(7) TO QLXA-NET-CHANGE-7.
           MOVE LXA-START-PMT(8) TO QLXA-START-PMT-8.
           MOVE LXA-END-PMT(8) TO QLXA-END-PMT-8.
           MOVE LXA-NET-CHANGE(8) TO QLXA-NET-CHANGE-8.
           MOVE LXA-START-PMT(9) TO QLXA-START-PMT-9.
           MOVE LXA-END-PMT(9) TO QLXA-END-PMT-9.
           MOVE LXA-NET-CHANGE(9) TO QLXA-NET-CHANGE-9.
           MOVE LXA-LN-INSCOMP TO QLXA-LN-INSCOMP.
           MOVE LXA-LN-INSOURS TO QLXA-LN-INSOURS.

           IF ( LXA-LN-INSEFF-DATE = ZEROES )
              MOVE "1900-01-01" TO QLXA-LN-INSEFF-DATE
           ELSE
              MOVE LXA-LN-INSEFF-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLXA-LN-INSEFF-DATE.


           IF ( LXA-LN-INSEXP-DATE = ZEROES )
              MOVE "1900-01-01" TO QLXA-LN-INSEXP-DATE
           ELSE
              MOVE LXA-LN-INSEXP-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLXA-LN-INSEXP-DATE.

           MOVE LXA-LN-INSPREM TO QLXA-LN-INSPREM.
           MOVE LXA-LN-INSCOVR TO QLXA-LN-INSCOVR.
           MOVE LXA-LN-INSCOMM TO QLXA-LN-INSCOMM.
           MOVE LXA-LN-INS-REBATE TO QLXA-LN-INS-REBATE.
           MOVE LXA-LN-INSCODES TO QLXA-LN-INSCODES.
           MOVE LXZ-CODE TO QLXZ-CODE.
           MOVE LXZ-POST-REGPY TO QLXZ-POST-REGPY.
           MOVE LXZ-POST-EXTRA-PRIN TO QLXZ-POST-EXTRA-PRIN.
           MOVE LXZ-POST-OTH TO QLXZ-POST-OTH.
           MOVE LXZ-POST-LCHG TO QLXZ-POST-LCHG.
           MOVE LXZ-PDUE-APINT TO QLXZ-PDUE-APINT.
           MOVE LXZ-PDUE-APPRIN TO QLXZ-PDUE-APPRIN.
           MOVE LXZ-CUR-APINT TO QLXZ-CUR-APINT.
           MOVE LXZ-CUR-APPRIN TO QLXZ-CUR-APPRIN.
           MOVE LXR-CODE TO QLXR-CODE.
           MOVE LXR-REB-AMT TO QLXR-REB-AMT.
           MOVE LXX-CODE TO QLXX-CODE.
           MOVE LXX-INS-TAX-COUNTY-CD TO QLXX-INS-TAX-COUNTY-CD.
           MOVE LXX-INS-TAX-CITY-CD TO QLXX-INS-TAX-CITY-CD.
           MOVE LXM-CODE TO QLXM-CODE.
           MOVE LXM-MIP-CLPAID TO QLXM-MIP-CLPAID.

           IF ( LXM-MIP-CLPDTH-DATE = ZEROES )
              MOVE "1900-01-01" TO QLXM-MIP-CLPDTH-DATE
           ELSE
              MOVE LXM-MIP-CLPDTH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLXM-MIP-CLPDTH-DATE.

           MOVE LXM-MIP-AHPAID TO QLXM-MIP-AHPAID.

           IF ( LXM-MIP-AHPDTH-DATE = ZEROES )
              MOVE "1900-01-01" TO QLXM-MIP-AHPDTH-DATE
           ELSE
              MOVE LXM-MIP-AHPDTH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QLXM-MIP-AHPDTH-DATE.

 
     

