
      *****************************************************
       CLEAR-PA-FILE SECTION.
      *****************************************************
           MOVE SPACES TO PA-REC.

           MOVE 0 TO PA-PHONE     PA-FAX  PA-LCHECK
                     PA-LCDATE    PA-LAMT PA-YTD-PAID
                     PA-LYTD-PAID PA-VAT-PERC.
