      * COPYMEMBER: LIBLP/LPPCGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - PCFILE
      *
      *=================================================================
      * REV:
      * BLM 2021-0511 ***NEW***
      *
      ******************************************************************

      *-----------------------------------------------------------------
      *    LOAD PC-REC FROM QPC-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-PC-FIELDS.
           MOVE QPC-ID TO PC-ID.
           MOVE QPC-BRANCH TO PC-BRANCH.
           MOVE QPC-SOC-SEC TO PC-SOC-SEC.
           MOVE QPC-LTC-BRNO TO PC-LTC-BRNO.
           MOVE QPC-LTC-ACCTNO TO PC-LTC-ACCTNO.
           MOVE QPC-LTC-SEQNO TO PC-LTC-SEQNO.

           IF ( QPC-LTC-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO PC-LTC-LTOUCH-DATE
           ELSE
              MOVE QPC-LTC-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTC-LTOUCH-DATE.

           MOVE QPC-LTC-DESC-1 TO PC-LTC-DESC(1).
           MOVE QPC-LTC-MAKE-1 TO PC-LTC-MAKE(1).
           MOVE QPC-LTC-MODEL-1 TO PC-LTC-MODEL(1).
           MOVE QPC-LTC-YEAR-1 TO PC-LTC-YEAR(1).
           MOVE QPC-LTC-STYLE-1 TO PC-LTC-STYLE(1).
           MOVE QPC-LTC-CLASS-1 TO PC-LTC-CLASS(1).
           MOVE QPC-LTC-VIN-1 TO PC-LTC-VIN(1).
           MOVE QPC-LTC-TITLE-NO-1 TO PC-LTC-TITLE-NO(1).
           MOVE QPC-LTC-MILEAGE-1 TO PC-LTC-MILEAGE(1).
           MOVE QPC-LTC-VALUE-1 TO PC-LTC-VALUE(1).
           MOVE QPC-LTC-SELLPR-1 TO PC-LTC-SELLPR(1).
           MOVE QPC-LTC-MISC-AMT-1 TO PC-LTC-MISC-AMT(1).
           MOVE QPC-LTC-SENT-FLAG-1 TO PC-LTC-SENT-FLAG(1).

           IF ( QPC-LTC-VIN-CHG-DATE-1 = "1900-01-01" )
              MOVE ZEROES TO PC-LTC-VIN-CHG-DATE(1)
           ELSE
              MOVE QPC-LTC-VIN-CHG-DATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTC-VIN-CHG-DATE(1).

           MOVE QPC-LTC-DESC-2 TO PC-LTC-DESC(2).
           MOVE QPC-LTC-MAKE-2 TO PC-LTC-MAKE(2).
           MOVE QPC-LTC-MODEL-2 TO PC-LTC-MODEL(2).
           MOVE QPC-LTC-YEAR-2 TO PC-LTC-YEAR(2).
           MOVE QPC-LTC-STYLE-2 TO PC-LTC-STYLE(2).
           MOVE QPC-LTC-CLASS-2 TO PC-LTC-CLASS(2).
           MOVE QPC-LTC-VIN-2 TO PC-LTC-VIN(2).
           MOVE QPC-LTC-TITLE-NO-2 TO PC-LTC-TITLE-NO(2).
           MOVE QPC-LTC-MILEAGE-2 TO PC-LTC-MILEAGE(2).
           MOVE QPC-LTC-VALUE-2 TO PC-LTC-VALUE(2).
           MOVE QPC-LTC-SELLPR-2 TO PC-LTC-SELLPR(2).
           MOVE QPC-LTC-MISC-AMT-2 TO PC-LTC-MISC-AMT(2).
           MOVE QPC-LTC-SENT-FLAG-2 TO PC-LTC-SENT-FLAG(2).

           IF ( QPC-LTC-VIN-CHG-DATE-2 = "1900-01-01" )
              MOVE ZEROES TO PC-LTC-VIN-CHG-DATE(2)
           ELSE
              MOVE QPC-LTC-VIN-CHG-DATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTC-VIN-CHG-DATE(2).

           MOVE QPC-LTC-DESC-3 TO PC-LTC-DESC(3).
           MOVE QPC-LTC-MAKE-3 TO PC-LTC-MAKE(3).
           MOVE QPC-LTC-MODEL-3 TO PC-LTC-MODEL(3).
           MOVE QPC-LTC-YEAR-3 TO PC-LTC-YEAR(3).
           MOVE QPC-LTC-STYLE-3 TO PC-LTC-STYLE(3).
           MOVE QPC-LTC-CLASS-3 TO PC-LTC-CLASS(3).
           MOVE QPC-LTC-VIN-3 TO PC-LTC-VIN(3).
           MOVE QPC-LTC-TITLE-NO-3 TO PC-LTC-TITLE-NO(3).
           MOVE QPC-LTC-MILEAGE-3 TO PC-LTC-MILEAGE(3).
           MOVE QPC-LTC-VALUE-3 TO PC-LTC-VALUE(3).
           MOVE QPC-LTC-SELLPR-3 TO PC-LTC-SELLPR(3).
           MOVE QPC-LTC-MISC-AMT-3 TO PC-LTC-MISC-AMT(3).
           MOVE QPC-LTC-SENT-FLAG-3 TO PC-LTC-SENT-FLAG(3).

           IF ( QPC-LTC-VIN-CHG-DATE-3 = "1900-01-01" )
              MOVE ZEROES TO PC-LTC-VIN-CHG-DATE(3)
           ELSE
              MOVE QPC-LTC-VIN-CHG-DATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTC-VIN-CHG-DATE(3).

           MOVE QPC-LTC-HHGS-1 TO PC-LTC-HHGS(1).
           MOVE QPC-LTC-HHGS-2 TO PC-LTC-HHGS(2).
           MOVE QPC-LTC-HHGS-3 TO PC-LTC-HHGS(3).
           MOVE QPC-LTA-BRNO TO PC-LTA-BRNO.
           MOVE QPC-LTA-ACCTNO TO PC-LTA-ACCTNO.
           MOVE QPC-LTA-SEQNO TO PC-LTA-SEQNO.

           IF ( QPC-LTA-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO PC-LTA-LTOUCH-DATE
           ELSE
              MOVE QPC-LTA-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTA-LTOUCH-DATE.

           MOVE QPC-LTA-DLR-REQ TO PC-LTA-DLR-REQ.
           MOVE QPC-LTA-INS-TYPE TO PC-LTA-INS-TYPE.
           MOVE QPC-LTA-INS-CO TO PC-LTA-INS-CO.
           MOVE QPC-LTA-POLICY-NO TO PC-LTA-POLICY-NO.
           MOVE QPC-LTA-AGENCY TO PC-LTA-AGENCY.
           MOVE QPC-LTA-AGENT TO PC-LTA-AGENT.
           MOVE QPC-LTA-ADR1 TO PC-LTA-ADR1.
           MOVE QPC-LTA-ADR2 TO PC-LTA-ADR2.
           MOVE QPC-LTA-CITY TO PC-LTA-CITY.
           MOVE QPC-LTA-STATE TO PC-LTA-STATE.
           MOVE QPC-LTA-ZIP TO PC-LTA-ZIP.
           MOVE QPC-LTA-PHONE TO PC-LTA-PHONE.

           IF ( QPC-LTA-EFF-DATE = "1900-01-01" )
              MOVE ZEROES TO PC-LTA-EFF-DATE
           ELSE
              MOVE QPC-LTA-EFF-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTA-EFF-DATE.


           IF ( QPC-LTA-EXP-DATE = "1900-01-01" )
              MOVE ZEROES TO PC-LTA-EXP-DATE
           ELSE
              MOVE QPC-LTA-EXP-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTA-EXP-DATE.


           IF ( QPC-LTA-CAN-DATE = "1900-01-01" )
              MOVE ZEROES TO PC-LTA-CAN-DATE
           ELSE
              MOVE QPC-LTA-CAN-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTA-CAN-DATE.


           IF ( QPC-LTA-CONF-DATE = "1900-01-01" )
              MOVE ZEROES TO PC-LTA-CONF-DATE
           ELSE
              MOVE QPC-LTA-CONF-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTA-CONF-DATE.

           MOVE QPC-LTA-LAST-FORM TO PC-LTA-LAST-FORM.
           MOVE QPC-LTA-COV-TYPE TO PC-LTA-COV-TYPE.
           MOVE QPC-LTA-BIL-COV TO PC-LTA-BIL-COV.
           MOVE QPC-LTA-PDL-COV TO PC-LTA-PDL-COV.
           MOVE QPC-LTA-PIP-COV TO PC-LTA-PIP-COV.
           MOVE QPC-LTA-UMB-COV TO PC-LTA-UMB-COV.
           MOVE QPC-LTA-COL-COV TO PC-LTA-COL-COV.
           MOVE QPC-LTA-LOSS-PAYEE TO PC-LTA-LOSS-PAYEE.
           MOVE QPC-LTA-COM-COV TO PC-LTA-COM-COV.
           MOVE QPC-LTA-TRACK-ONLY TO PC-LTA-TRACK-ONLY.
           MOVE QPC-LTA-INSURANCE TO PC-LTA-INSURANCE.
           MOVE QPC-LTA-TRACK-MONTHS TO PC-LTA-TRACK-MONTHS.
           MOVE QPC-LTA-INS-MONTHS TO PC-LTA-INS-MONTHS.
           MOVE QPC-LTA-CPP-MONTHS TO PC-LTA-CPP-MONTHS.

           IF ( QPC-LOANDATE = "1900-01-01" )
              MOVE ZEROES TO PC-LOANDATE
           ELSE
              MOVE QPC-LOANDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LOANDATE.

           MOVE QPC-ORGTERM TO PC-ORGTERM.
           MOVE QPC-REGPYAMT TO PC-REGPYAMT.
           MOVE QPC2-ID TO PC2-ID.
           MOVE QPC2-BRANCH TO PC2-BRANCH.
           MOVE QPC2-BWNAME TO PC2-BWNAME.

           IF ( QPC-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO PC-LTOUCH-DATE
           ELSE
              MOVE QPC-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO PC-LTOUCH-DATE.

 
      *-----------------------------------------------------------------
      *    LOAD QPC-REC FROM PC-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-PC-FIELDS.
           MOVE PC-ID TO QPC-ID.
           MOVE PC-BRANCH TO QPC-BRANCH.
           MOVE PC-SOC-SEC TO QPC-SOC-SEC.
           MOVE PC-LTC-BRNO TO QPC-LTC-BRNO.
           MOVE PC-LTC-ACCTNO TO QPC-LTC-ACCTNO.
           MOVE PC-LTC-SEQNO TO QPC-LTC-SEQNO.

           IF ( PC-LTC-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LTC-LTOUCH-DATE
           ELSE
              MOVE PC-LTC-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTC-LTOUCH-DATE.

           MOVE PC-LTC-DESC(1) TO QPC-LTC-DESC-1.
           MOVE PC-LTC-MAKE(1) TO QPC-LTC-MAKE-1.
           MOVE PC-LTC-MODEL(1) TO QPC-LTC-MODEL-1.
           MOVE PC-LTC-YEAR(1) TO QPC-LTC-YEAR-1.
           MOVE PC-LTC-STYLE(1) TO QPC-LTC-STYLE-1.
           MOVE PC-LTC-CLASS(1) TO QPC-LTC-CLASS-1.
           MOVE PC-LTC-VIN(1) TO QPC-LTC-VIN-1.
           MOVE PC-LTC-TITLE-NO(1) TO QPC-LTC-TITLE-NO-1.
           MOVE PC-LTC-MILEAGE(1) TO QPC-LTC-MILEAGE-1.
           MOVE PC-LTC-VALUE(1) TO QPC-LTC-VALUE-1.
           MOVE PC-LTC-SELLPR(1) TO QPC-LTC-SELLPR-1.
           MOVE PC-LTC-MISC-AMT(1) TO QPC-LTC-MISC-AMT-1.
           MOVE PC-LTC-SENT-FLAG(1) TO QPC-LTC-SENT-FLAG-1.

           IF ( PC-LTC-VIN-CHG-DATE(1) = ZEROES )
              MOVE "1900-01-01" TO QPC-LTC-VIN-CHG-DATE-1
           ELSE
              MOVE PC-LTC-VIN-CHG-DATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTC-VIN-CHG-DATE-1.

           MOVE PC-LTC-DESC(2) TO QPC-LTC-DESC-2.
           MOVE PC-LTC-MAKE(2) TO QPC-LTC-MAKE-2.
           MOVE PC-LTC-MODEL(2) TO QPC-LTC-MODEL-2.
           MOVE PC-LTC-YEAR(2) TO QPC-LTC-YEAR-2.
           MOVE PC-LTC-STYLE(2) TO QPC-LTC-STYLE-2.
           MOVE PC-LTC-CLASS(2) TO QPC-LTC-CLASS-2.
           MOVE PC-LTC-VIN(2) TO QPC-LTC-VIN-2.
           MOVE PC-LTC-TITLE-NO(2) TO QPC-LTC-TITLE-NO-2.
           MOVE PC-LTC-MILEAGE(2) TO QPC-LTC-MILEAGE-2.
           MOVE PC-LTC-VALUE(2) TO QPC-LTC-VALUE-2.
           MOVE PC-LTC-SELLPR(2) TO QPC-LTC-SELLPR-2.
           MOVE PC-LTC-MISC-AMT(2) TO QPC-LTC-MISC-AMT-2.
           MOVE PC-LTC-SENT-FLAG(2) TO QPC-LTC-SENT-FLAG-2.

           IF ( PC-LTC-VIN-CHG-DATE(2) = ZEROES )
              MOVE "1900-01-01" TO QPC-LTC-VIN-CHG-DATE-2
           ELSE
              MOVE PC-LTC-VIN-CHG-DATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTC-VIN-CHG-DATE-2.

           MOVE PC-LTC-DESC(3) TO QPC-LTC-DESC-3.
           MOVE PC-LTC-MAKE(3) TO QPC-LTC-MAKE-3.
           MOVE PC-LTC-MODEL(3) TO QPC-LTC-MODEL-3.
           MOVE PC-LTC-YEAR(3) TO QPC-LTC-YEAR-3.
           MOVE PC-LTC-STYLE(3) TO QPC-LTC-STYLE-3.
           MOVE PC-LTC-CLASS(3) TO QPC-LTC-CLASS-3.
           MOVE PC-LTC-VIN(3) TO QPC-LTC-VIN-3.
           MOVE PC-LTC-TITLE-NO(3) TO QPC-LTC-TITLE-NO-3.
           MOVE PC-LTC-MILEAGE(3) TO QPC-LTC-MILEAGE-3.
           MOVE PC-LTC-VALUE(3) TO QPC-LTC-VALUE-3.
           MOVE PC-LTC-SELLPR(3) TO QPC-LTC-SELLPR-3.
           MOVE PC-LTC-MISC-AMT(3) TO QPC-LTC-MISC-AMT-3.
           MOVE PC-LTC-SENT-FLAG(3) TO QPC-LTC-SENT-FLAG-3.

           IF ( PC-LTC-VIN-CHG-DATE(3) = ZEROES )
              MOVE "1900-01-01" TO QPC-LTC-VIN-CHG-DATE-3
           ELSE
              MOVE PC-LTC-VIN-CHG-DATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTC-VIN-CHG-DATE-3.

           MOVE PC-LTC-HHGS(1) TO QPC-LTC-HHGS-1.
           MOVE PC-LTC-HHGS(2) TO QPC-LTC-HHGS-2.
           MOVE PC-LTC-HHGS(3) TO QPC-LTC-HHGS-3.
           MOVE PC-LTA-BRNO TO QPC-LTA-BRNO.
           MOVE PC-LTA-ACCTNO TO QPC-LTA-ACCTNO.
           MOVE PC-LTA-SEQNO TO QPC-LTA-SEQNO.

           IF ( PC-LTA-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LTA-LTOUCH-DATE
           ELSE
              MOVE PC-LTA-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTA-LTOUCH-DATE.

           MOVE PC-LTA-DLR-REQ TO QPC-LTA-DLR-REQ.
           MOVE PC-LTA-INS-TYPE TO QPC-LTA-INS-TYPE.
           MOVE PC-LTA-INS-CO TO QPC-LTA-INS-CO.
           MOVE PC-LTA-POLICY-NO TO QPC-LTA-POLICY-NO.
           MOVE PC-LTA-AGENCY TO QPC-LTA-AGENCY.
           MOVE PC-LTA-AGENT TO QPC-LTA-AGENT.
           MOVE PC-LTA-ADR1 TO QPC-LTA-ADR1.
           MOVE PC-LTA-ADR2 TO QPC-LTA-ADR2.
           MOVE PC-LTA-CITY TO QPC-LTA-CITY.
           MOVE PC-LTA-STATE TO QPC-LTA-STATE.
           MOVE PC-LTA-ZIP TO QPC-LTA-ZIP.
           MOVE PC-LTA-PHONE TO QPC-LTA-PHONE.

           IF ( PC-LTA-EFF-DATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LTA-EFF-DATE
           ELSE
              MOVE PC-LTA-EFF-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTA-EFF-DATE.


           IF ( PC-LTA-EXP-DATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LTA-EXP-DATE
           ELSE
              MOVE PC-LTA-EXP-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTA-EXP-DATE.


           IF ( PC-LTA-CAN-DATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LTA-CAN-DATE
           ELSE
              MOVE PC-LTA-CAN-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTA-CAN-DATE.


           IF ( PC-LTA-CONF-DATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LTA-CONF-DATE
           ELSE
              MOVE PC-LTA-CONF-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTA-CONF-DATE.

           MOVE PC-LTA-LAST-FORM TO QPC-LTA-LAST-FORM.
           MOVE PC-LTA-COV-TYPE TO QPC-LTA-COV-TYPE.
           MOVE PC-LTA-BIL-COV TO QPC-LTA-BIL-COV.
           MOVE PC-LTA-PDL-COV TO QPC-LTA-PDL-COV.
           MOVE PC-LTA-PIP-COV TO QPC-LTA-PIP-COV.
           MOVE PC-LTA-UMB-COV TO QPC-LTA-UMB-COV.
           MOVE PC-LTA-COL-COV TO QPC-LTA-COL-COV.
           MOVE PC-LTA-LOSS-PAYEE TO QPC-LTA-LOSS-PAYEE.
           MOVE PC-LTA-COM-COV TO QPC-LTA-COM-COV.
           MOVE PC-LTA-TRACK-ONLY TO QPC-LTA-TRACK-ONLY.
           MOVE PC-LTA-INSURANCE TO QPC-LTA-INSURANCE.
           MOVE PC-LTA-TRACK-MONTHS TO QPC-LTA-TRACK-MONTHS.
           MOVE PC-LTA-INS-MONTHS TO QPC-LTA-INS-MONTHS.
           MOVE PC-LTA-CPP-MONTHS TO QPC-LTA-CPP-MONTHS.

           IF ( PC-LOANDATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LOANDATE
           ELSE
              MOVE PC-LOANDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LOANDATE.

           MOVE PC-ORGTERM TO QPC-ORGTERM.
           MOVE PC-REGPYAMT TO QPC-REGPYAMT.
           MOVE PC2-ID TO QPC2-ID.
           MOVE PC2-BRANCH TO QPC2-BRANCH.
           MOVE PC2-BWNAME TO QPC2-BWNAME.

           IF ( PC-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QPC-LTOUCH-DATE
           ELSE
              MOVE PC-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QPC-LTOUCH-DATE.

