      * COPYMEMBER: LIBLP/LPSP1IN
      ******************************************************************
       LOAD-SP1-FILE.
           PERFORM LOAD-SPA1-FILE.
           PERFORM LOAD-SPB1-FILE.
           PERFORM LOAD-SPC1-FILE.

      *-----------------------------------------------------------------
       SET-ALL-TO-SP1.
           MOVE SPA1-KEY   TO SP1-KEY.
           MOVE SPA-AREA-A TO SP-AREA-A.
           MOVE SPB-AREA-B TO SP-AREA-B.
           MOVE SPC-AREA-C TO SP-AREA-C.

       SET-SP1-TO-ALL.
           MOVE SP1-KEY   TO SPA1-KEY.
           MOVE SP-AREA-A TO SPA-AREA-A.
           MOVE SP1-KEY   TO SPB1-KEY.
           MOVE SP-AREA-B TO SPB-AREA-B.
           MOVE SP1-KEY   TO SPC1-KEY.
           MOVE SP-AREA-C TO SPC-AREA-C.

      *-----------------------------------------------------------------
       OPEN-SP1-FILE.
           PERFORM OPEN-SPA1-FILE.
           IF ( IO-FG = 0 )
               PERFORM OPEN-SPB1-FILE
               IF ( IO-FG = 0 )
                  PERFORM OPEN-SPC1-FILE
                  IF ( IO-FG = 0 )
                     MOVE " " TO IO-MULTI-FG
                  ELSE
                     MOVE "C" TO IO-MULTI-FG
               ELSE
                  MOVE "B" TO IO-MULTI-FG
            ELSE
               MOVE "A" TO IO-MULTI-FG.

      *-----------------------------------------------------------------
       START-SP1-FILE.
           PERFORM SET-SP1-TO-ALL.
           PERFORM START-SPA1-FILE.
           IF ( IO-FG NOT = 0 )
              MOVE "A" TO IO-MULTI-FG.
             
      *-----------------------------------------------------------------
       START-SP1-FILE-NOT-GREATER.
           PERFORM SET-SP1-TO-ALL.
           PERFORM START-SPA1-FILE-NOT-GREATER.
           IF ( IO-FG NOT = 0 )
              MOVE "A" TO IO-MULTI-FG.
      *-----------------------------------------------------------------
       READ-SP1-FILE.
           PERFORM SET-SP1-TO-ALL.
           PERFORM READ-SPA1-FILE.
           IF ( IO-FG = 0 )
              PERFORM READ-SPB1-FILE
              IF ( IO-FG = 0 )
                 PERFORM READ-SPC1-FILE
                 IF ( IO-FG = 0 )
                    PERFORM SET-ALL-TO-SP1
                 ELSE
                    MOVE "C" TO IO-MULTI-FG
              ELSE
                 MOVE "B" TO IO-MULTI-FG
           ELSE
              MOVE "A" TO IO-MULTI-FG.

      *-----------------------------------------------------------------
       READ-SP1-FILE-NEXT.
           PERFORM SET-SP1-TO-ALL.
           PERFORM READ-SPA1-FILE-NEXT.
           IF ( IO-FG = 0 )
              MOVE SPA1-KEY TO SPB1-KEY
              PERFORM READ-SPB1-FILE
              IF ( IO-FG = 0 )
                 MOVE SPA1-KEY TO SPC1-KEY
                 PERFORM READ-SPC1-FILE
                 IF ( IO-FG = 0 )
                    PERFORM SET-ALL-TO-SP1
                 ELSE
                    MOVE "C" TO IO-MULTI-FG
              ELSE
                 MOVE "B" TO IO-MULTI-FG
           ELSE
              MOVE "A" TO IO-MULTI-FG.

      *-----------------------------------------------------------------
       READ-SP1-FILE-PREVIOUS.
           PERFORM SET-SP1-TO-ALL.
           PERFORM READ-SPA1-FILE-PREVIOUS.
           IF ( IO-FG = 0 )
              MOVE SPA1-KEY TO SPB1-KEY
              PERFORM READ-SPB1-FILE
              IF ( IO-FG = 0 )
                 MOVE SPA1-KEY TO SPC1-KEY
                 PERFORM READ-SPC1-FILE
                 IF ( IO-FG = 0 )
                    PERFORM SET-ALL-TO-SP1
                 ELSE
                    MOVE "C" TO IO-MULTI-FG
              ELSE
                 MOVE "B" TO IO-MULTI-FG
           ELSE
              MOVE "A" TO IO-MULTI-FG.

      *-----------------------------------------------------------------
       WRITE-SP1-FILE.

           PERFORM COMPUTE-SP-TABLE-NUMS.
           PERFORM SET-SP1-TO-ALL.
           PERFORM WRITE-SPA1-FILE.
           IF ( IO-FG = 0 )
              PERFORM WRITE-SPB1-FILE
              IF ( IO-FG = 0 )
                 PERFORM WRITE-SPC1-FILE
                 IF ( IO-FG = 0 )
                    PERFORM SET-ALL-TO-SP1
                 ELSE
                    MOVE "C" TO IO-MULTI-FG
              ELSE
                 MOVE "B" TO IO-MULTI-FG
           ELSE
              MOVE "A" TO IO-MULTI-FG.

      *-----------------------------------------------------------------
       REWRITE-SP1-FILE.

           PERFORM COMPUTE-SP-TABLE-NUMS.
           PERFORM SET-SP1-TO-ALL.
           PERFORM REWRITE-SPA1-FILE.
           IF ( IO-FG = 0 )
              PERFORM REWRITE-SPB1-FILE
              IF ( IO-FG = 0 )
                 PERFORM REWRITE-SPC1-FILE
                 IF ( IO-FG = 0 )
                    PERFORM SET-ALL-TO-SP1
                 ELSE
                    MOVE "C" TO IO-MULTI-FG
              ELSE
                 MOVE "B" TO IO-MULTI-FG
           ELSE
              MOVE "A" TO IO-MULTI-FG.

      *-----------------------------------------------------------------
       DELETE-SP1-FILE.

           PERFORM SET-SP1-TO-ALL.
           PERFORM DELETE-SPA1-FILE.
           IF ( IO-FG = 0 )
              PERFORM DELETE-SPB1-FILE
              IF ( IO-FG = 0 )
                 PERFORM DELETE-SPC1-FILE
                 IF ( IO-FG = 0 )
                    PERFORM SET-ALL-TO-SP1
                 ELSE
                    MOVE "C" TO IO-MULTI-FG
              ELSE
                 MOVE "B" TO IO-MULTI-FG
           ELSE
              MOVE "A" TO IO-MULTI-FG.

      *-----------------------------------------------------------------
       CLOSE-SP1-FILE.

           PERFORM CLOSE-IT.
           PERFORM CLOSE-SPA1-FILE.
           PERFORM CLOSE-SPB1-FILE.
           PERFORM CLOSE-SPC1-FILE.

      *================================================================E
       LOAD-SPA1-FILE.
      *- - - -{ SET OVERRIDE TO A "Y" TO NOT TOUCH THE PATH AT ALL  }- -
           IF ( SP-PATH-OVERRIDE = "Y" )
              NEXT SENTENCE
           ELSE
      *- - - -{ SPACES IS THE DEFAULT, NO CROSSING BRANCHES }- - - - - -
           IF ( SP-PATH-OVERRIDE = SPACES )
              MOVE EXT-FILPATH-BASE        TO SPA-ALL-BASE
              MOVE EXT-FILPATH-MACHINE     TO SPA-ALL-MACHINE
              MOVE SPA-ALL-PATH             TO SPA-PATH
           ELSE
      *- - - -{ USE BRANCH VALUES }- - - - - - - - - - - - - - - - - - -
           IF ( SP-PATH-OVERRIDE = "B" )
              MOVE FILPATH-BASE            TO SPA-ALL-BASE
              MOVE FILPATH-MACHINE         TO SPA-ALL-MACHINE
              MOVE SPA-ALL-PATH             TO SPA-PATH.

      *-----------------------------------------------------------------
       OPEN-SPA1-FILE.
           PERFORM LOAD-SPA1-FILE.
           PERFORM OPEN-IT.
           MOVE SPA-PATH-SQL TO E-FILE.
      *    IF ( SQL-CONNECT-STAT-BAD )
      *       PERFORM SQL-CONNECT.

      *-----------------------------------------------------------------
       START-SPA1-FILE.
           PERFORM START-IT.
           MOVE SPA-PATH-SQL TO E-FILE.
           MOVE SPA1-KEY TO E-KEYX.

           IF ( SPA1-CURSOR-STAT-GOOD )
              PERFORM CLOSE-SPA1-FILE.

           IF ( QSP1-WEND-LAWCODE = 0  ) OR
              ( QSP1-WEND-LAWCODE NOT NUMERIC)
              MOVE SPA-ORGST            TO QSP1-WBEG-ORGST 
              MOVE ALL "Z"              TO QSP1-WEND-ORGST 
              MOVE SPA-SPRCLASS         TO QSP1-WBEG-SPRCLASS
              MOVE ALL "9"              TO QSP1-WEND-SPRCLASS
              MOVE SPA-SUBCLASS         TO QSP1-WBEG-SUBCLASS
              MOVE ALL "9"              TO QSP1-WEND-SUBCLASS
              MOVE SPA-LAWCODE          TO QSP1-WBEG-LAWCODE
              MOVE ALL "9"              TO QSP1-WEND-LAWCODE.

           EXEC SQL
            DECLARE SPA1_CURSOR CURSOR FOR
            SELECT ISNULL(SPAFILE.SPA_ORGST,''),
                   SPAFILE.SPA_SPRCLASS,
                   SPAFILE.SPA_SUBCLASS,
                   SPAFILE.SPA_LAWCODE,
                   ISNULL(CAST(SPAFILE.SPA_LTOUCH_DATE
                                                  AS VARCHAR(10)),'0'),
                   ISNULL(SPAFILE.SPA_DESC,''),
                   ISNULL(SPAFILE.SPA_NOTES,''),
                   ISNULL(CAST(SPAFILE.SPA_EFFDATE
                                                  AS VARCHAR(10)),'0'),
                   ISNULL(CAST(SPAFILE.SPA_EXPDATE
                                                  AS VARCHAR(10)),'0'),
                   SPAFILE.SPA_EXPD_MONTHS,
                   SPAFILE.SPA_EXPD_DAYS,
                   ISNULL(SPAFILE.SPA_EXPD_FRMLA,''),
                   ISNULL(SPAFILE.SPA_EXPD_EXCEPT,''),
                   ISNULL(SPAFILE.SPA_EXPR_FRMLA,''),
                   ISNULL(SPAFILE.SPA_EXPR_REDU_FRMLA,''),
                   SPAFILE.SPA_EXPR_RATE_1,
                   SPAFILE.SPA_EXPR_BREAK_1,
                   SPAFILE.SPA_EXPR_YRTYPE_1,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_1,''),
                   SPAFILE.SPA_EXPR_RATE_2,
                   SPAFILE.SPA_EXPR_BREAK_2,
                   SPAFILE.SPA_EXPR_YRTYPE_2,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_2,''),
                   SPAFILE.SPA_EXPR_RATE_3,
                   SPAFILE.SPA_EXPR_BREAK_3,
                   SPAFILE.SPA_EXPR_YRTYPE_3,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_3,''),
                   SPAFILE.SPA_EXPR_RATE_4,
                   SPAFILE.SPA_EXPR_BREAK_4,
                   SPAFILE.SPA_EXPR_YRTYPE_4,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_4,''),
                   SPAFILE.SPA_EXPR_RATE_5,
                   SPAFILE.SPA_EXPR_BREAK_5,
                   SPAFILE.SPA_EXPR_YRTYPE_5,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_5,''),
                   ISNULL(SPAFILE.SPA_EXPR_LCHG,''),
                   ISNULL(SPAFILE.SPA_JUDGFRMLA,''),
                   SPAFILE.SPA_JUDGRATE,
                   SPAFILE.SPA_JUDGYRTYPE,
                   ISNULL(SPAFILE.SPA_JUDGINTMETH,''),
                   ISNULL(SPAFILE.SPA_ACC_FRMLA,''),
                   SPAFILE.SPA_ACC_YRTYPE,
                   ISNULL(SPAFILE.SPA_ACC_INTMETH,''),
                   SPAFILE.SPA_ACC_RATE_1,
                   SPAFILE.SPA_ACC_BREAK_1,
                   SPAFILE.SPA_ACC_RATE_2,
                   SPAFILE.SPA_ACC_BREAK_2,
                   SPAFILE.SPA_ACC_RATE_3,
                   SPAFILE.SPA_ACC_BREAK_3,
                   SPAFILE.SPA_ACC_RATE_4,
                   SPAFILE.SPA_ACC_BREAK_4,
                   SPAFILE.SPA_ACC_RATE_5,
                   SPAFILE.SPA_ACC_BREAK_5,
                   ISNULL(SPAFILE.SPA_1098FRMLA,''),
                   ISNULL(SPAFILE.SPA_DISFRMLA,''),
                   ISNULL(SPAFILE.SPA_CONTRFRMLA,''),
                   ISNULL(SPAFILE.SPA_BANKRULE,''),
                   SPAFILE.SPA_CONTPDTH,
                   SPAFILE.SPA_FINCHG,
                   ISNULL(SPAFILE.SPA_BANKUNITPER_CD,''),
                   ISNULL(SPAFILE.SPA_TRWBANKRULE,''),
                   SPAFILE.SPA_TRWCONTPDTH,
                   ISNULL(SPAFILE.SPA_TRWBANKUNITPER_CD,''),
                   ISNULL(SPAFILE.SPA_RECFRMLA,''),
                   ISNULL(SPAFILE.SPA_RECPAYCD,''),
                   SPAFILE.SPA_RECPDTH,
                   ISNULL(SPAFILE.SPA_DISFRMLA_SPAY_FG,''),
                   SPAFILE.SPA_ERNFRMLA_1,
                   SPAFILE.SPA_ERNAMT_1,
                   SPAFILE.SPA_ERNPERCT_1,
                   ISNULL(SPAFILE.SPA_ERNPERCD_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_1,''),
                   SPAFILE.SPA_ERN_DAYS_1,
                   SPAFILE.SPA_ERN_TERM_1,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_1,''),
                   SPAFILE.SPA_ERNFRMLA_2,
                   SPAFILE.SPA_ERNAMT_2,
                   SPAFILE.SPA_ERNPERCT_2,
                   ISNULL(SPAFILE.SPA_ERNPERCD_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_2,''),
                   SPAFILE.SPA_ERN_DAYS_2,
                   SPAFILE.SPA_ERN_TERM_2,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_2,''),
                   SPAFILE.SPA_ERNFRMLA_3,
                   SPAFILE.SPA_ERNAMT_3,
                   SPAFILE.SPA_ERNPERCT_3,
                   ISNULL(SPAFILE.SPA_ERNPERCD_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_3,''),
                   SPAFILE.SPA_ERN_DAYS_3,
                   SPAFILE.SPA_ERN_TERM_3,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_3,''),
                   SPAFILE.SPA_ERNFRMLA_4,
                   SPAFILE.SPA_ERNAMT_4,
                   SPAFILE.SPA_ERNPERCT_4,
                   ISNULL(SPAFILE.SPA_ERNPERCD_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_4,''),
                   SPAFILE.SPA_ERN_DAYS_4,
                   SPAFILE.SPA_ERN_TERM_4,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_4,''),
                   SPAFILE.SPA_ERNFRMLA_5,
                   SPAFILE.SPA_ERNAMT_5,
                   SPAFILE.SPA_ERNPERCT_5,
                   ISNULL(SPAFILE.SPA_ERNPERCD_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_5,''),
                   SPAFILE.SPA_ERN_DAYS_5,
                   SPAFILE.SPA_ERN_TERM_5,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_5,''),
                   SPAFILE.SPA_ERNFRMLA_6,
                   SPAFILE.SPA_ERNAMT_6,
                   SPAFILE.SPA_ERNPERCT_6,
                   ISNULL(SPAFILE.SPA_ERNPERCD_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_6,''),
                   SPAFILE.SPA_ERN_DAYS_6,
                   SPAFILE.SPA_ERN_TERM_6,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_6,''),
                   SPAFILE.SPA_ERNFRMLA_7,
                   SPAFILE.SPA_ERNAMT_7,
                   SPAFILE.SPA_ERNPERCT_7,
                   ISNULL(SPAFILE.SPA_ERNPERCD_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_7,''),
                   SPAFILE.SPA_ERN_DAYS_7,
                   SPAFILE.SPA_ERN_TERM_7,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_7,''),
                   SPAFILE.SPA_ERNFRMLA_8,
                   SPAFILE.SPA_ERNAMT_8,
                   SPAFILE.SPA_ERNPERCT_8,
                   ISNULL(SPAFILE.SPA_ERNPERCD_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_8,''),
                   SPAFILE.SPA_ERN_DAYS_8,
                   SPAFILE.SPA_ERN_TERM_8,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_8,''),
                   SPAFILE.SPA_ERNFRMLA_9,
                   SPAFILE.SPA_ERNAMT_9,
                   SPAFILE.SPA_ERNPERCT_9,
                   ISNULL(SPAFILE.SPA_ERNPERCD_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_9,''),
                   SPAFILE.SPA_ERN_DAYS_9,
                   SPAFILE.SPA_ERN_TERM_9,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_9,''),
                   SPAFILE.SPA_ERNFRMLA_10,
                   SPAFILE.SPA_ERNAMT_10,
                   SPAFILE.SPA_ERNPERCT_10,
                   ISNULL(SPAFILE.SPA_ERNPERCD_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_10,''),
                   SPAFILE.SPA_ERN_DAYS_10,
                   SPAFILE.SPA_ERN_TERM_10,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCEL_CD,''),
                   ISNULL(SPAFILE.SPA_ERNJD_CD,''),
                   ISNULL(SPAFILE.SPA_MIDSTRERNCD,''),
                   SPAFILE.SPA_EARN_ORDER_1,
                   SPAFILE.SPA_EARN_ORDER_2,
                   SPAFILE.SPA_EARN_ORDER_3,
                   SPAFILE.SPA_EARN_ORDER_4,
                   SPAFILE.SPA_EARN_ORDER_5,
                   SPAFILE.SPA_EARN_ORDER_6,
                   SPAFILE.SPA_EARN_ORDER_7,
                   SPAFILE.SPA_EARN_ORDER_8,
                   SPAFILE.SPA_EARN_ORDER_9,
                   SPAFILE.SPA_EARN_ORDER_10,
                   ISNULL(SPAFILE.SPA_ERNDELQFRMLA,''),
                   SPAFILE.SPA_ERNDELQ_START,
                   SPAFILE.SPA_ERNDELQ_STOP,
                   ISNULL(SPAFILE.SPA_1098_INC_LC,''),
                   SPAFILE.SPA_MAX_IB_ACR_DAYS,
                   SPAFILE.SPA_LCGRACE,
                   ISNULL(SPAFILE.SPA_LCGRACECD,''),
                   ISNULL(SPAFILE.SPA_LCTYPE,''),
                   SPAFILE.SPA_LCRATE,
                   ISNULL(SPAFILE.SPA_LCFRMLA,''),
                   SPAFILE.SPA_LCMINCHG,
                   SPAFILE.SPA_LCMAXAMT,
                   SPAFILE.SPA_LCDELFAC,
                   SPAFILE.SPA_LCYRTYPE,
                   SPAFILE.SPA_LC_CODE,
                   ISNULL(SPAFILE.SPA_LCUNITPER_CD,''),
                   SPAFILE.SPA_DEFFRMLA,
                   ISNULL(SPAFILE.SPA_DEFEXCEPT,''),
                   SPAFILE.SPA_DEFWORKER,
                   SPAFILE.SPA_DEFPERCD,
                   SPAFILE.SPA_DEFBASE,
                   ISNULL(SPAFILE.SPA_DEFPOLCD,''),
                   SPAFILE.SPA_DEFPOLMX_1,
                   SPAFILE.SPA_DEFPOLMX_2,
                   SPAFILE.SPA_DEFPOLMX_3,
                   SPAFILE.SPA_DEFMIN,
                   SPAFILE.SPA_DEFMAX,
                   ISNULL(SPAFILE.SPA_DEFUNITPER_CD,''),
                   SPAFILE.SPA_PRFORM_1,
                   ISNULL(SPAFILE.SPA_PRFLAG_1,''),
                   SPAFILE.SPA_PRFORM_2,
                   ISNULL(SPAFILE.SPA_PRFLAG_2,''),
                   SPAFILE.SPA_PRFORM_3,
                   ISNULL(SPAFILE.SPA_PRFLAG_3,''),
                   SPAFILE.SPA_PRFORM_4,
                   ISNULL(SPAFILE.SPA_PRFLAG_4,''),
                   SPAFILE.SPA_PRFORM_5,
                   ISNULL(SPAFILE.SPA_PRFLAG_5,''),
                   SPAFILE.SPA_PRFORM_6,
                   ISNULL(SPAFILE.SPA_PRFLAG_6,''),
                   SPAFILE.SPA_PRFORM_7,
                   ISNULL(SPAFILE.SPA_PRFLAG_7,''),
                   SPAFILE.SPA_PRFORM_8,
                   ISNULL(SPAFILE.SPA_PRFLAG_8,''),
                   SPAFILE.SPA_PRFORM_9,
                   ISNULL(SPAFILE.SPA_PRFLAG_9,''),
                   SPAFILE.SPA_PRFORM_10,
                   ISNULL(SPAFILE.SPA_PRFLAG_10,''),
                   SPAFILE.SPA_PRFORM_11,
                   ISNULL(SPAFILE.SPA_PRFLAG_11,''),
                   SPAFILE.SPA_PRFORM_12,
                   ISNULL(SPAFILE.SPA_PRFLAG_12,''),
                   SPAFILE.SPA_PRFORM_13,
                   ISNULL(SPAFILE.SPA_PRFLAG_13,''),
                   SPAFILE.SPA_PRFORM_14,
                   ISNULL(SPAFILE.SPA_PRFLAG_14,''),
                   SPAFILE.SPA_PRFORM_15,
                   ISNULL(SPAFILE.SPA_PRFLAG_15,''),
                   SPAFILE.SPA_PRFORM_16,
                   ISNULL(SPAFILE.SPA_PRFLAG_16,''),
                   SPAFILE.SPA_PRFORM_17,
                   ISNULL(SPAFILE.SPA_PRFLAG_17,''),
                   SPAFILE.SPA_PRFORM_18,
                   ISNULL(SPAFILE.SPA_PRFLAG_18,''),
                   SPAFILE.SPA_PRFORM_19,
                   ISNULL(SPAFILE.SPA_PRFLAG_19,''),
                   SPAFILE.SPA_PRFORM_20,
                   ISNULL(SPAFILE.SPA_PRFLAG_20,''),
                   ISNULL(SPAFILE.SPA_IMED_REC,''),
                   SPAFILE.SPA_SCFRMLA,
                   SPAFILE.SPA_SCRATE,
                   SPAFILE.SPA_SCMIN,
                   SPAFILE.SPA_SCMAX,
                   SPAFILE.SPA_MFFRMLA,
                   SPAFILE.SPA_MFRATE,
                   SPAFILE.SPA_MFMIN,
                   SPAFILE.SPA_MFMAX,
                   ISNULL(SPAFILE.SPA_INTMETHOD,''),
                   SPAFILE.SPA_YEARTYPE,
                   SPAFILE.SPA_PYEXFRMLA,
                   SPAFILE.SPA_PYEXSPCODE,
                   SPAFILE.SPA_PYEXYEARTP,
                   ISNULL(SPAFILE.SPA_PYEXFMDATE,''),
                   ISNULL(SPAFILE.SPA_PYEXBASECD,''),
                   SPAFILE.SPA_PYEXBASE,
                   SPAFILE.SPA_PYEXDAYS,
                   SPAFILE.SPA_CAL_SPFRMLA,
                   ISNULL(SPAFILE.SPA_CAL_RATETYPE_1,''),
                   ISNULL(SPAFILE.SPA_CAL_BREAKTYPE_1,''),
                   ISNULL(SPAFILE.SPA_CAL_CHGABLE_1,''),
                   SPAFILE.SPA_CAL_NORATES_1,
                   SPAFILE.SPA_CAL_TBFRMLA_1,
                   SPAFILE.SPA_CAL_RATE_1_1,
                   SPAFILE.SPA_CAL_BREAK_1_1,
                   SPAFILE.SPA_CAL_RATE_1_2,
                   SPAFILE.SPA_CAL_BREAK_1_2,
                   SPAFILE.SPA_CAL_RATE_1_3,
                   SPAFILE.SPA_CAL_BREAK_1_3,
                   SPAFILE.SPA_CAL_RATE_1_4,
                   SPAFILE.SPA_CAL_BREAK_1_4,
                   SPAFILE.SPA_CAL_RATE_1_5,
                   SPAFILE.SPA_CAL_BREAK_1_5,
                   ISNULL(SPAFILE.SPA_CAL_RATETYPE_2,''),
                   ISNULL(SPAFILE.SPA_CAL_BREAKTYPE_2,''),
                   ISNULL(SPAFILE.SPA_CAL_CHGABLE_2,''),
                   SPAFILE.SPA_CAL_NORATES_2,
                   SPAFILE.SPA_CAL_TBFRMLA_2,
                   SPAFILE.SPA_CAL_RATE_2_1,
                   SPAFILE.SPA_CAL_BREAK_2_1,
                   SPAFILE.SPA_CAL_RATE_2_2,
                   SPAFILE.SPA_CAL_BREAK_2_2,
                   SPAFILE.SPA_CAL_RATE_2_3,
                   SPAFILE.SPA_CAL_BREAK_2_3,
                   SPAFILE.SPA_CAL_RATE_2_4,
                   SPAFILE.SPA_CAL_BREAK_2_4,
                   SPAFILE.SPA_CAL_RATE_2_5,
                   SPAFILE.SPA_CAL_BREAK_2_5,
                   SPAFILE.SPA_MINSF_FRMLA,
                   SPAFILE.SPA_MINSF_CHG,
                   SPAFILE.SPA_MAXAPR_FRMLA,
                   SPAFILE.SPA_EDT_NOEDITS_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_1,''),
                   SPAFILE.SPA_EDT_RATE_1_1,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_1,''),
                   SPAFILE.SPA_EDT_AMT_1_1,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_1,''),
                   SPAFILE.SPA_EDT_TERM_1_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_2,''),
                   SPAFILE.SPA_EDT_RATE_1_2,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_2,''),
                   SPAFILE.SPA_EDT_AMT_1_2,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_2,''),
                   SPAFILE.SPA_EDT_TERM_1_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_3,''),
                   SPAFILE.SPA_EDT_RATE_1_3,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_3,''),
                   SPAFILE.SPA_EDT_AMT_1_3,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_3,''),
                   SPAFILE.SPA_EDT_TERM_1_3,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_4,''),
                   SPAFILE.SPA_EDT_RATE_1_4,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_4,''),
                   SPAFILE.SPA_EDT_AMT_1_4,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_4,''),
                   SPAFILE.SPA_EDT_TERM_1_4,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_5,''),
                   SPAFILE.SPA_EDT_RATE_1_5,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_5,''),
                   SPAFILE.SPA_EDT_AMT_1_5,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_5,''),
                   SPAFILE.SPA_EDT_TERM_1_5,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_6,''),
                   SPAFILE.SPA_EDT_RATE_1_6,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_6,''),
                   SPAFILE.SPA_EDT_AMT_1_6,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_6,''),
                   SPAFILE.SPA_EDT_TERM_1_6,
                   SPAFILE.SPA_EDT_NOEDITS_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_1,''),
                   SPAFILE.SPA_EDT_RATE_2_1,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_1,''),
                   SPAFILE.SPA_EDT_AMT_2_1,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_1,''),
                   SPAFILE.SPA_EDT_TERM_2_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_2,''),
                   SPAFILE.SPA_EDT_RATE_2_2,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_2,''),
                   SPAFILE.SPA_EDT_AMT_2_2,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_2,''),
                   SPAFILE.SPA_EDT_TERM_2_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_3,''),
                   SPAFILE.SPA_EDT_RATE_2_3,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_3,''),
                   SPAFILE.SPA_EDT_AMT_2_3,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_3,''),
                   SPAFILE.SPA_EDT_TERM_2_3,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_4,''),
                   SPAFILE.SPA_EDT_RATE_2_4,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_4,''),
                   SPAFILE.SPA_EDT_AMT_2_4,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_4,''),
                   SPAFILE.SPA_EDT_TERM_2_4,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_5,''),
                   SPAFILE.SPA_EDT_RATE_2_5,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_5,''),
                   SPAFILE.SPA_EDT_AMT_2_5,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_5,''),
                   SPAFILE.SPA_EDT_TERM_2_5,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_6,''),
                   SPAFILE.SPA_EDT_RATE_2_6,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_6,''),
                   SPAFILE.SPA_EDT_AMT_2_6,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_6,''),
                   SPAFILE.SPA_EDT_TERM_2_6
            FROM DBO.SPAFILE
            WHERE SPAFILE.SPA_ORGST >= :QSP1-WBEG-ORGST
              AND SPAFILE.SPA_ORGST <= :QSP1-WEND-ORGST
              AND SPAFILE.SPA_SPRCLASS >= :QSP1-WBEG-SPRCLASS
              AND SPAFILE.SPA_SPRCLASS <= :QSP1-WEND-SPRCLASS
              AND SPAFILE.SPA_SUBCLASS >= :QSP1-WBEG-SUBCLASS
              AND SPAFILE.SPA_SUBCLASS <= :QSP1-WEND-SUBCLASS
              AND SPAFILE.SPA_LAWCODE >= :QSP1-WBEG-LAWCODE 
              AND SPAFILE.SPA_LAWCODE <= :QSP1-WEND-LAWCODE 
            ORDER BY SPAFILE.SPA_ORGST,
                     SPAFILE.SPA_SPRCLASS,
                     SPAFILE.SPA_SUBCLASS,
                     SPAFILE.SPA_LAWCODE
           END-EXEC.

           EXEC SQL
               OPEN SPA1_CURSOR
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           MOVE SPACES TO QSP1-WBEG-ORGST
                          QSP1-WEND-ORGST.

           MOVE ZEROES TO QSP1-WBEG-SPRCLASS
                          QSP1-WEND-SPRCLASS
                          QSP1-WBEG-SUBCLASS
                          QSP1-WEND-SUBCLASS
                          QSP1-WBEG-LAWCODE
                          QSP1-WEND-LAWCODE.

           MOVE STAT---GOOD TO SPA1-CURSOR-STAT.

      *-----------------------------------------------------------------
       START-SPA1-FILE-NOT-GREATER.
           PERFORM START-IT.
           MOVE SPA-PATH-SQL TO E-FILE.
           MOVE SPA1-KEY TO E-KEYX.

           IF ( SPA1-CURSOR-NG-STAT-GOOD )
              PERFORM CLOSE-SPA1-FILE.

           IF ( QSP1-WEND-LAWCODE = 0  ) OR
              ( QSP1-WEND-LAWCODE NOT NUMERIC)
              MOVE SPACES               TO QSP1-WBEG-ORGST 
              MOVE SPA-ORGST            TO QSP1-WEND-ORGST 
              MOVE 0                    TO QSP1-WBEG-SPRCLASS
              MOVE SPA-SPRCLASS         TO QSP1-WEND-SPRCLASS
              MOVE 0                    TO QSP1-WBEG-SUBCLASS
              MOVE SPA-SUBCLASS         TO QSP1-WEND-SUBCLASS
              MOVE 0                    TO QSP1-WBEG-LAWCODE
              MOVE SPA-LAWCODE          TO QSP1-WEND-LAWCODE.

           EXEC SQL
            DECLARE SPA1_CURSOR_NG CURSOR FOR
            SELECT ISNULL(SPAFILE.SPA_ORGST,''),
                   SPAFILE.SPA_SPRCLASS,
                   SPAFILE.SPA_SUBCLASS,
                   SPAFILE.SPA_LAWCODE,
                   ISNULL(CAST(SPAFILE.SPA_LTOUCH_DATE
                                                  AS VARCHAR(10)),'0'),
                   ISNULL(SPAFILE.SPA_DESC,''),
                   ISNULL(SPAFILE.SPA_NOTES,''),
                   ISNULL(CAST(SPAFILE.SPA_EFFDATE
                                                  AS VARCHAR(10)),'0'),
                   ISNULL(CAST(SPAFILE.SPA_EXPDATE
                                                  AS VARCHAR(10)),'0'),
                   SPAFILE.SPA_EXPD_MONTHS,
                   SPAFILE.SPA_EXPD_DAYS,
                   ISNULL(SPAFILE.SPA_EXPD_FRMLA,''),
                   ISNULL(SPAFILE.SPA_EXPD_EXCEPT,''),
                   ISNULL(SPAFILE.SPA_EXPR_FRMLA,''),
                   ISNULL(SPAFILE.SPA_EXPR_REDU_FRMLA,''),
                   SPAFILE.SPA_EXPR_RATE_1,
                   SPAFILE.SPA_EXPR_BREAK_1,
                   SPAFILE.SPA_EXPR_YRTYPE_1,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_1,''),
                   SPAFILE.SPA_EXPR_RATE_2,
                   SPAFILE.SPA_EXPR_BREAK_2,
                   SPAFILE.SPA_EXPR_YRTYPE_2,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_2,''),
                   SPAFILE.SPA_EXPR_RATE_3,
                   SPAFILE.SPA_EXPR_BREAK_3,
                   SPAFILE.SPA_EXPR_YRTYPE_3,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_3,''),
                   SPAFILE.SPA_EXPR_RATE_4,
                   SPAFILE.SPA_EXPR_BREAK_4,
                   SPAFILE.SPA_EXPR_YRTYPE_4,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_4,''),
                   SPAFILE.SPA_EXPR_RATE_5,
                   SPAFILE.SPA_EXPR_BREAK_5,
                   SPAFILE.SPA_EXPR_YRTYPE_5,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_5,''),
                   ISNULL(SPAFILE.SPA_EXPR_LCHG,''),
                   ISNULL(SPAFILE.SPA_JUDGFRMLA,''),
                   SPAFILE.SPA_JUDGRATE,
                   SPAFILE.SPA_JUDGYRTYPE,
                   ISNULL(SPAFILE.SPA_JUDGINTMETH,''),
                   ISNULL(SPAFILE.SPA_ACC_FRMLA,''),
                   SPAFILE.SPA_ACC_YRTYPE,
                   ISNULL(SPAFILE.SPA_ACC_INTMETH,''),
                   SPAFILE.SPA_ACC_RATE_1,
                   SPAFILE.SPA_ACC_BREAK_1,
                   SPAFILE.SPA_ACC_RATE_2,
                   SPAFILE.SPA_ACC_BREAK_2,
                   SPAFILE.SPA_ACC_RATE_3,
                   SPAFILE.SPA_ACC_BREAK_3,
                   SPAFILE.SPA_ACC_RATE_4,
                   SPAFILE.SPA_ACC_BREAK_4,
                   SPAFILE.SPA_ACC_RATE_5,
                   SPAFILE.SPA_ACC_BREAK_5,
                   ISNULL(SPAFILE.SPA_1098FRMLA,''),
                   ISNULL(SPAFILE.SPA_DISFRMLA,''),
                   ISNULL(SPAFILE.SPA_CONTRFRMLA,''),
                   ISNULL(SPAFILE.SPA_BANKRULE,''),
                   SPAFILE.SPA_CONTPDTH,
                   SPAFILE.SPA_FINCHG,
                   ISNULL(SPAFILE.SPA_BANKUNITPER_CD,''),
                   ISNULL(SPAFILE.SPA_TRWBANKRULE,''),
                   SPAFILE.SPA_TRWCONTPDTH,
                   ISNULL(SPAFILE.SPA_TRWBANKUNITPER_CD,''),
                   ISNULL(SPAFILE.SPA_RECFRMLA,''),
                   ISNULL(SPAFILE.SPA_RECPAYCD,''),
                   SPAFILE.SPA_RECPDTH,
                   ISNULL(SPAFILE.SPA_DISFRMLA_SPAY_FG,''),
                   SPAFILE.SPA_ERNFRMLA_1,
                   SPAFILE.SPA_ERNAMT_1,
                   SPAFILE.SPA_ERNPERCT_1,
                   ISNULL(SPAFILE.SPA_ERNPERCD_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_1,''),
                   SPAFILE.SPA_ERN_DAYS_1,
                   SPAFILE.SPA_ERN_TERM_1,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_1,''),
                   SPAFILE.SPA_ERNFRMLA_2,
                   SPAFILE.SPA_ERNAMT_2,
                   SPAFILE.SPA_ERNPERCT_2,
                   ISNULL(SPAFILE.SPA_ERNPERCD_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_2,''),
                   SPAFILE.SPA_ERN_DAYS_2,
                   SPAFILE.SPA_ERN_TERM_2,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_2,''),
                   SPAFILE.SPA_ERNFRMLA_3,
                   SPAFILE.SPA_ERNAMT_3,
                   SPAFILE.SPA_ERNPERCT_3,
                   ISNULL(SPAFILE.SPA_ERNPERCD_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_3,''),
                   SPAFILE.SPA_ERN_DAYS_3,
                   SPAFILE.SPA_ERN_TERM_3,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_3,''),
                   SPAFILE.SPA_ERNFRMLA_4,
                   SPAFILE.SPA_ERNAMT_4,
                   SPAFILE.SPA_ERNPERCT_4,
                   ISNULL(SPAFILE.SPA_ERNPERCD_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_4,''),
                   SPAFILE.SPA_ERN_DAYS_4,
                   SPAFILE.SPA_ERN_TERM_4,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_4,''),
                   SPAFILE.SPA_ERNFRMLA_5,
                   SPAFILE.SPA_ERNAMT_5,
                   SPAFILE.SPA_ERNPERCT_5,
                   ISNULL(SPAFILE.SPA_ERNPERCD_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_5,''),
                   SPAFILE.SPA_ERN_DAYS_5,
                   SPAFILE.SPA_ERN_TERM_5,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_5,''),
                   SPAFILE.SPA_ERNFRMLA_6,
                   SPAFILE.SPA_ERNAMT_6,
                   SPAFILE.SPA_ERNPERCT_6,
                   ISNULL(SPAFILE.SPA_ERNPERCD_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_6,''),
                   SPAFILE.SPA_ERN_DAYS_6,
                   SPAFILE.SPA_ERN_TERM_6,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_6,''),
                   SPAFILE.SPA_ERNFRMLA_7,
                   SPAFILE.SPA_ERNAMT_7,
                   SPAFILE.SPA_ERNPERCT_7,
                   ISNULL(SPAFILE.SPA_ERNPERCD_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_7,''),
                   SPAFILE.SPA_ERN_DAYS_7,
                   SPAFILE.SPA_ERN_TERM_7,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_7,''),
                   SPAFILE.SPA_ERNFRMLA_8,
                   SPAFILE.SPA_ERNAMT_8,
                   SPAFILE.SPA_ERNPERCT_8,
                   ISNULL(SPAFILE.SPA_ERNPERCD_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_8,''),
                   SPAFILE.SPA_ERN_DAYS_8,
                   SPAFILE.SPA_ERN_TERM_8,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_8,''),
                   SPAFILE.SPA_ERNFRMLA_9,
                   SPAFILE.SPA_ERNAMT_9,
                   SPAFILE.SPA_ERNPERCT_9,
                   ISNULL(SPAFILE.SPA_ERNPERCD_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_9,''),
                   SPAFILE.SPA_ERN_DAYS_9,
                   SPAFILE.SPA_ERN_TERM_9,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_9,''),
                   SPAFILE.SPA_ERNFRMLA_10,
                   SPAFILE.SPA_ERNAMT_10,
                   SPAFILE.SPA_ERNPERCT_10,
                   ISNULL(SPAFILE.SPA_ERNPERCD_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_10,''),
                   SPAFILE.SPA_ERN_DAYS_10,
                   SPAFILE.SPA_ERN_TERM_10,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCEL_CD,''),
                   ISNULL(SPAFILE.SPA_ERNJD_CD,''),
                   ISNULL(SPAFILE.SPA_MIDSTRERNCD,''),
                   SPAFILE.SPA_EARN_ORDER_1,
                   SPAFILE.SPA_EARN_ORDER_2,
                   SPAFILE.SPA_EARN_ORDER_3,
                   SPAFILE.SPA_EARN_ORDER_4,
                   SPAFILE.SPA_EARN_ORDER_5,
                   SPAFILE.SPA_EARN_ORDER_6,
                   SPAFILE.SPA_EARN_ORDER_7,
                   SPAFILE.SPA_EARN_ORDER_8,
                   SPAFILE.SPA_EARN_ORDER_9,
                   SPAFILE.SPA_EARN_ORDER_10,
                   ISNULL(SPAFILE.SPA_ERNDELQFRMLA,''),
                   SPAFILE.SPA_ERNDELQ_START,
                   SPAFILE.SPA_ERNDELQ_STOP,
                   ISNULL(SPAFILE.SPA_1098_INC_LC,''),
                   SPAFILE.SPA_MAX_IB_ACR_DAYS,
                   SPAFILE.SPA_LCGRACE,
                   ISNULL(SPAFILE.SPA_LCGRACECD,''),
                   ISNULL(SPAFILE.SPA_LCTYPE,''),
                   SPAFILE.SPA_LCRATE,
                   ISNULL(SPAFILE.SPA_LCFRMLA,''),
                   SPAFILE.SPA_LCMINCHG,
                   SPAFILE.SPA_LCMAXAMT,
                   SPAFILE.SPA_LCDELFAC,
                   SPAFILE.SPA_LCYRTYPE,
                   SPAFILE.SPA_LC_CODE,
                   ISNULL(SPAFILE.SPA_LCUNITPER_CD,''),
                   SPAFILE.SPA_DEFFRMLA,
                   ISNULL(SPAFILE.SPA_DEFEXCEPT,''),
                   SPAFILE.SPA_DEFWORKER,
                   SPAFILE.SPA_DEFPERCD,
                   SPAFILE.SPA_DEFBASE,
                   ISNULL(SPAFILE.SPA_DEFPOLCD,''),
                   SPAFILE.SPA_DEFPOLMX_1,
                   SPAFILE.SPA_DEFPOLMX_2,
                   SPAFILE.SPA_DEFPOLMX_3,
                   SPAFILE.SPA_DEFMIN,
                   SPAFILE.SPA_DEFMAX,
                   ISNULL(SPAFILE.SPA_DEFUNITPER_CD,''),
                   SPAFILE.SPA_PRFORM_1,
                   ISNULL(SPAFILE.SPA_PRFLAG_1,''),
                   SPAFILE.SPA_PRFORM_2,
                   ISNULL(SPAFILE.SPA_PRFLAG_2,''),
                   SPAFILE.SPA_PRFORM_3,
                   ISNULL(SPAFILE.SPA_PRFLAG_3,''),
                   SPAFILE.SPA_PRFORM_4,
                   ISNULL(SPAFILE.SPA_PRFLAG_4,''),
                   SPAFILE.SPA_PRFORM_5,
                   ISNULL(SPAFILE.SPA_PRFLAG_5,''),
                   SPAFILE.SPA_PRFORM_6,
                   ISNULL(SPAFILE.SPA_PRFLAG_6,''),
                   SPAFILE.SPA_PRFORM_7,
                   ISNULL(SPAFILE.SPA_PRFLAG_7,''),
                   SPAFILE.SPA_PRFORM_8,
                   ISNULL(SPAFILE.SPA_PRFLAG_8,''),
                   SPAFILE.SPA_PRFORM_9,
                   ISNULL(SPAFILE.SPA_PRFLAG_9,''),
                   SPAFILE.SPA_PRFORM_10,
                   ISNULL(SPAFILE.SPA_PRFLAG_10,''),
                   SPAFILE.SPA_PRFORM_11,
                   ISNULL(SPAFILE.SPA_PRFLAG_11,''),
                   SPAFILE.SPA_PRFORM_12,
                   ISNULL(SPAFILE.SPA_PRFLAG_12,''),
                   SPAFILE.SPA_PRFORM_13,
                   ISNULL(SPAFILE.SPA_PRFLAG_13,''),
                   SPAFILE.SPA_PRFORM_14,
                   ISNULL(SPAFILE.SPA_PRFLAG_14,''),
                   SPAFILE.SPA_PRFORM_15,
                   ISNULL(SPAFILE.SPA_PRFLAG_15,''),
                   SPAFILE.SPA_PRFORM_16,
                   ISNULL(SPAFILE.SPA_PRFLAG_16,''),
                   SPAFILE.SPA_PRFORM_17,
                   ISNULL(SPAFILE.SPA_PRFLAG_17,''),
                   SPAFILE.SPA_PRFORM_18,
                   ISNULL(SPAFILE.SPA_PRFLAG_18,''),
                   SPAFILE.SPA_PRFORM_19,
                   ISNULL(SPAFILE.SPA_PRFLAG_19,''),
                   SPAFILE.SPA_PRFORM_20,
                   ISNULL(SPAFILE.SPA_PRFLAG_20,''),
                   ISNULL(SPAFILE.SPA_IMED_REC,''),
                   SPAFILE.SPA_SCFRMLA,
                   SPAFILE.SPA_SCRATE,
                   SPAFILE.SPA_SCMIN,
                   SPAFILE.SPA_SCMAX,
                   SPAFILE.SPA_MFFRMLA,
                   SPAFILE.SPA_MFRATE,
                   SPAFILE.SPA_MFMIN,
                   SPAFILE.SPA_MFMAX,
                   ISNULL(SPAFILE.SPA_INTMETHOD,''),
                   SPAFILE.SPA_YEARTYPE,
                   SPAFILE.SPA_PYEXFRMLA,
                   SPAFILE.SPA_PYEXSPCODE,
                   SPAFILE.SPA_PYEXYEARTP,
                   ISNULL(SPAFILE.SPA_PYEXFMDATE,''),
                   ISNULL(SPAFILE.SPA_PYEXBASECD,''),
                   SPAFILE.SPA_PYEXBASE,
                   SPAFILE.SPA_PYEXDAYS,
                   SPAFILE.SPA_CAL_SPFRMLA,
                   ISNULL(SPAFILE.SPA_CAL_RATETYPE_1,''),
                   ISNULL(SPAFILE.SPA_CAL_BREAKTYPE_1,''),
                   ISNULL(SPAFILE.SPA_CAL_CHGABLE_1,''),
                   SPAFILE.SPA_CAL_NORATES_1,
                   SPAFILE.SPA_CAL_TBFRMLA_1,
                   SPAFILE.SPA_CAL_RATE_1_1,
                   SPAFILE.SPA_CAL_BREAK_1_1,
                   SPAFILE.SPA_CAL_RATE_1_2,
                   SPAFILE.SPA_CAL_BREAK_1_2,
                   SPAFILE.SPA_CAL_RATE_1_3,
                   SPAFILE.SPA_CAL_BREAK_1_3,
                   SPAFILE.SPA_CAL_RATE_1_4,
                   SPAFILE.SPA_CAL_BREAK_1_4,
                   SPAFILE.SPA_CAL_RATE_1_5,
                   SPAFILE.SPA_CAL_BREAK_1_5,
                   ISNULL(SPAFILE.SPA_CAL_RATETYPE_2,''),
                   ISNULL(SPAFILE.SPA_CAL_BREAKTYPE_2,''),
                   ISNULL(SPAFILE.SPA_CAL_CHGABLE_2,''),
                   SPAFILE.SPA_CAL_NORATES_2,
                   SPAFILE.SPA_CAL_TBFRMLA_2,
                   SPAFILE.SPA_CAL_RATE_2_1,
                   SPAFILE.SPA_CAL_BREAK_2_1,
                   SPAFILE.SPA_CAL_RATE_2_2,
                   SPAFILE.SPA_CAL_BREAK_2_2,
                   SPAFILE.SPA_CAL_RATE_2_3,
                   SPAFILE.SPA_CAL_BREAK_2_3,
                   SPAFILE.SPA_CAL_RATE_2_4,
                   SPAFILE.SPA_CAL_BREAK_2_4,
                   SPAFILE.SPA_CAL_RATE_2_5,
                   SPAFILE.SPA_CAL_BREAK_2_5,
                   SPAFILE.SPA_MINSF_FRMLA,
                   SPAFILE.SPA_MINSF_CHG,
                   SPAFILE.SPA_MAXAPR_FRMLA,
                   SPAFILE.SPA_EDT_NOEDITS_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_1,''),
                   SPAFILE.SPA_EDT_RATE_1_1,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_1,''),
                   SPAFILE.SPA_EDT_AMT_1_1,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_1,''),
                   SPAFILE.SPA_EDT_TERM_1_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_2,''),
                   SPAFILE.SPA_EDT_RATE_1_2,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_2,''),
                   SPAFILE.SPA_EDT_AMT_1_2,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_2,''),
                   SPAFILE.SPA_EDT_TERM_1_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_3,''),
                   SPAFILE.SPA_EDT_RATE_1_3,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_3,''),
                   SPAFILE.SPA_EDT_AMT_1_3,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_3,''),
                   SPAFILE.SPA_EDT_TERM_1_3,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_4,''),
                   SPAFILE.SPA_EDT_RATE_1_4,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_4,''),
                   SPAFILE.SPA_EDT_AMT_1_4,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_4,''),
                   SPAFILE.SPA_EDT_TERM_1_4,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_5,''),
                   SPAFILE.SPA_EDT_RATE_1_5,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_5,''),
                   SPAFILE.SPA_EDT_AMT_1_5,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_5,''),
                   SPAFILE.SPA_EDT_TERM_1_5,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_6,''),
                   SPAFILE.SPA_EDT_RATE_1_6,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_6,''),
                   SPAFILE.SPA_EDT_AMT_1_6,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_6,''),
                   SPAFILE.SPA_EDT_TERM_1_6,
                   SPAFILE.SPA_EDT_NOEDITS_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_1,''),
                   SPAFILE.SPA_EDT_RATE_2_1,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_1,''),
                   SPAFILE.SPA_EDT_AMT_2_1,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_1,''),
                   SPAFILE.SPA_EDT_TERM_2_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_2,''),
                   SPAFILE.SPA_EDT_RATE_2_2,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_2,''),
                   SPAFILE.SPA_EDT_AMT_2_2,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_2,''),
                   SPAFILE.SPA_EDT_TERM_2_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_3,''),
                   SPAFILE.SPA_EDT_RATE_2_3,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_3,''),
                   SPAFILE.SPA_EDT_AMT_2_3,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_3,''),
                   SPAFILE.SPA_EDT_TERM_2_3,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_4,''),
                   SPAFILE.SPA_EDT_RATE_2_4,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_4,''),
                   SPAFILE.SPA_EDT_AMT_2_4,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_4,''),
                   SPAFILE.SPA_EDT_TERM_2_4,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_5,''),
                   SPAFILE.SPA_EDT_RATE_2_5,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_5,''),
                   SPAFILE.SPA_EDT_AMT_2_5,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_5,''),
                   SPAFILE.SPA_EDT_TERM_2_5,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_6,''),
                   SPAFILE.SPA_EDT_RATE_2_6,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_6,''),
                   SPAFILE.SPA_EDT_AMT_2_6,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_6,''),
                   SPAFILE.SPA_EDT_TERM_2_6
            FROM DBO.SPAFILE
            WHERE SPAFILE.SPA_ORGST >= :QSP1-WBEG-ORGST
              AND SPAFILE.SPA_ORGST <= :QSP1-WEND-ORGST
              AND SPAFILE.SPA_SPRCLASS >= :QSP1-WBEG-SPRCLASS
              AND SPAFILE.SPA_SPRCLASS <= :QSP1-WEND-SPRCLASS
              AND SPAFILE.SPA_SUBCLASS >= :QSP1-WBEG-SUBCLASS
              AND SPAFILE.SPA_SUBCLASS <= :QSP1-WEND-SUBCLASS
              AND SPAFILE.SPA_LAWCODE >= :QSP1-WBEG-LAWCODE 
              AND SPAFILE.SPA_LAWCODE <= :QSP1-WEND-LAWCODE 
            ORDER BY SPAFILE.SPA_ORGST DESC,
                     SPAFILE.SPA_SPRCLASS DESC,
                     SPAFILE.SPA_SUBCLASS DESC,
                     SPAFILE.SPA_LAWCODE DESC
           END-EXEC.

           EXEC SQL
               OPEN SPA1_CURSOR_NG
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           MOVE SPACES TO QSP1-WBEG-ORGST
                          QSP1-WEND-ORGST.

           MOVE ZEROES TO QSP1-WBEG-SPRCLASS
                          QSP1-WEND-SPRCLASS
                          QSP1-WBEG-SUBCLASS
                          QSP1-WEND-SUBCLASS
                          QSP1-WBEG-LAWCODE
                          QSP1-WEND-LAWCODE.

           MOVE STAT---GOOD TO SPA1-CURSOR-NG-STAT.

      *-----------------------------------------------------------------
       READ-SPA1-FILE.
           PERFORM READ-IT.
           MOVE SPA-PATH-SQL TO E-FILE.
           MOVE SPA1-KEY TO E-KEYX.

           MOVE SPA-ORGST            TO QSPA-ORGST.
           MOVE SPA-SPRCLASS         TO QSPA-SPRCLASS.
           MOVE SPA-SUBCLASS         TO QSPA-SUBCLASS.
           MOVE SPA-LAWCODE          TO QSPA-LAWCODE.

           EXEC SQL
            SELECT ISNULL(SPAFILE.SPA_ORGST,''),
                   SPAFILE.SPA_SPRCLASS,
                   SPAFILE.SPA_SUBCLASS,
                   SPAFILE.SPA_LAWCODE,
                   ISNULL(CAST(SPAFILE.SPA_LTOUCH_DATE
                                                  AS VARCHAR(10)),'0'),
                   ISNULL(SPAFILE.SPA_DESC,''),
                   ISNULL(SPAFILE.SPA_NOTES,''),
                   ISNULL(CAST(SPAFILE.SPA_EFFDATE
                                                  AS VARCHAR(10)),'0'),
                   ISNULL(CAST(SPAFILE.SPA_EXPDATE
                                                  AS VARCHAR(10)),'0'),
                   SPAFILE.SPA_EXPD_MONTHS,
                   SPAFILE.SPA_EXPD_DAYS,
                   ISNULL(SPAFILE.SPA_EXPD_FRMLA,''),
                   ISNULL(SPAFILE.SPA_EXPD_EXCEPT,''),
                   ISNULL(SPAFILE.SPA_EXPR_FRMLA,''),
                   ISNULL(SPAFILE.SPA_EXPR_REDU_FRMLA,''),
                   SPAFILE.SPA_EXPR_RATE_1,
                   SPAFILE.SPA_EXPR_BREAK_1,
                   SPAFILE.SPA_EXPR_YRTYPE_1,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_1,''),
                   SPAFILE.SPA_EXPR_RATE_2,
                   SPAFILE.SPA_EXPR_BREAK_2,
                   SPAFILE.SPA_EXPR_YRTYPE_2,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_2,''),
                   SPAFILE.SPA_EXPR_RATE_3,
                   SPAFILE.SPA_EXPR_BREAK_3,
                   SPAFILE.SPA_EXPR_YRTYPE_3,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_3,''),
                   SPAFILE.SPA_EXPR_RATE_4,
                   SPAFILE.SPA_EXPR_BREAK_4,
                   SPAFILE.SPA_EXPR_YRTYPE_4,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_4,''),
                   SPAFILE.SPA_EXPR_RATE_5,
                   SPAFILE.SPA_EXPR_BREAK_5,
                   SPAFILE.SPA_EXPR_YRTYPE_5,
                   ISNULL(SPAFILE.SPA_EXPR_INTMETH_5,''),
                   ISNULL(SPAFILE.SPA_EXPR_LCHG,''),
                   ISNULL(SPAFILE.SPA_JUDGFRMLA,''),
                   SPAFILE.SPA_JUDGRATE,
                   SPAFILE.SPA_JUDGYRTYPE,
                   ISNULL(SPAFILE.SPA_JUDGINTMETH,''),
                   ISNULL(SPAFILE.SPA_ACC_FRMLA,''),
                   SPAFILE.SPA_ACC_YRTYPE,
                   ISNULL(SPAFILE.SPA_ACC_INTMETH,''),
                   SPAFILE.SPA_ACC_RATE_1,
                   SPAFILE.SPA_ACC_BREAK_1,
                   SPAFILE.SPA_ACC_RATE_2,
                   SPAFILE.SPA_ACC_BREAK_2,
                   SPAFILE.SPA_ACC_RATE_3,
                   SPAFILE.SPA_ACC_BREAK_3,
                   SPAFILE.SPA_ACC_RATE_4,
                   SPAFILE.SPA_ACC_BREAK_4,
                   SPAFILE.SPA_ACC_RATE_5,
                   SPAFILE.SPA_ACC_BREAK_5,
                   ISNULL(SPAFILE.SPA_1098FRMLA,''),
                   ISNULL(SPAFILE.SPA_DISFRMLA,''),
                   ISNULL(SPAFILE.SPA_CONTRFRMLA,''),
                   ISNULL(SPAFILE.SPA_BANKRULE,''),
                   SPAFILE.SPA_CONTPDTH,
                   SPAFILE.SPA_FINCHG,
                   ISNULL(SPAFILE.SPA_BANKUNITPER_CD,''),
                   ISNULL(SPAFILE.SPA_TRWBANKRULE,''),
                   SPAFILE.SPA_TRWCONTPDTH,
                   ISNULL(SPAFILE.SPA_TRWBANKUNITPER_CD,''),
                   ISNULL(SPAFILE.SPA_RECFRMLA,''),
                   ISNULL(SPAFILE.SPA_RECPAYCD,''),
                   SPAFILE.SPA_RECPDTH,
                   ISNULL(SPAFILE.SPA_DISFRMLA_SPAY_FG,''),
                   SPAFILE.SPA_ERNFRMLA_1,
                   SPAFILE.SPA_ERNAMT_1,
                   SPAFILE.SPA_ERNPERCT_1,
                   ISNULL(SPAFILE.SPA_ERNPERCD_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_1,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_1,''),
                   SPAFILE.SPA_ERN_DAYS_1,
                   SPAFILE.SPA_ERN_TERM_1,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_1,''),
                   SPAFILE.SPA_ERNFRMLA_2,
                   SPAFILE.SPA_ERNAMT_2,
                   SPAFILE.SPA_ERNPERCT_2,
                   ISNULL(SPAFILE.SPA_ERNPERCD_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_2,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_2,''),
                   SPAFILE.SPA_ERN_DAYS_2,
                   SPAFILE.SPA_ERN_TERM_2,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_2,''),
                   SPAFILE.SPA_ERNFRMLA_3,
                   SPAFILE.SPA_ERNAMT_3,
                   SPAFILE.SPA_ERNPERCT_3,
                   ISNULL(SPAFILE.SPA_ERNPERCD_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_3,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_3,''),
                   SPAFILE.SPA_ERN_DAYS_3,
                   SPAFILE.SPA_ERN_TERM_3,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_3,''),
                   SPAFILE.SPA_ERNFRMLA_4,
                   SPAFILE.SPA_ERNAMT_4,
                   SPAFILE.SPA_ERNPERCT_4,
                   ISNULL(SPAFILE.SPA_ERNPERCD_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_4,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_4,''),
                   SPAFILE.SPA_ERN_DAYS_4,
                   SPAFILE.SPA_ERN_TERM_4,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_4,''),
                   SPAFILE.SPA_ERNFRMLA_5,
                   SPAFILE.SPA_ERNAMT_5,
                   SPAFILE.SPA_ERNPERCT_5,
                   ISNULL(SPAFILE.SPA_ERNPERCD_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_5,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_5,''),
                   SPAFILE.SPA_ERN_DAYS_5,
                   SPAFILE.SPA_ERN_TERM_5,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_5,''),
                   SPAFILE.SPA_ERNFRMLA_6,
                   SPAFILE.SPA_ERNAMT_6,
                   SPAFILE.SPA_ERNPERCT_6,
                   ISNULL(SPAFILE.SPA_ERNPERCD_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_6,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_6,''),
                   SPAFILE.SPA_ERN_DAYS_6,
                   SPAFILE.SPA_ERN_TERM_6,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_6,''),
                   SPAFILE.SPA_ERNFRMLA_7,
                   SPAFILE.SPA_ERNAMT_7,
                   SPAFILE.SPA_ERNPERCT_7,
                   ISNULL(SPAFILE.SPA_ERNPERCD_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_7,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_7,''),
                   SPAFILE.SPA_ERN_DAYS_7,
                   SPAFILE.SPA_ERN_TERM_7,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_7,''),
                   SPAFILE.SPA_ERNFRMLA_8,
                   SPAFILE.SPA_ERNAMT_8,
                   SPAFILE.SPA_ERNPERCT_8,
                   ISNULL(SPAFILE.SPA_ERNPERCD_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_8,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_8,''),
                   SPAFILE.SPA_ERN_DAYS_8,
                   SPAFILE.SPA_ERN_TERM_8,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_8,''),
                   SPAFILE.SPA_ERNFRMLA_9,
                   SPAFILE.SPA_ERNAMT_9,
                   SPAFILE.SPA_ERNPERCT_9,
                   ISNULL(SPAFILE.SPA_ERNPERCD_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_9,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_9,''),
                   SPAFILE.SPA_ERN_DAYS_9,
                   SPAFILE.SPA_ERN_TERM_9,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_9,''),
                   SPAFILE.SPA_ERNFRMLA_10,
                   SPAFILE.SPA_ERNAMT_10,
                   SPAFILE.SPA_ERNPERCT_10,
                   ISNULL(SPAFILE.SPA_ERNPERCD_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_FG_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_START_CD_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCRL_DFCD_10,''),
                   SPAFILE.SPA_ERN_DAYS_10,
                   SPAFILE.SPA_ERN_TERM_10,
                   ISNULL(SPAFILE.SPA_ERN_TYPE_10,''),
                   ISNULL(SPAFILE.SPA_ERNACCEL_CD,''),
                   ISNULL(SPAFILE.SPA_ERNJD_CD,''),
                   ISNULL(SPAFILE.SPA_MIDSTRERNCD,''),
                   SPAFILE.SPA_EARN_ORDER_1,
                   SPAFILE.SPA_EARN_ORDER_2,
                   SPAFILE.SPA_EARN_ORDER_3,
                   SPAFILE.SPA_EARN_ORDER_4,
                   SPAFILE.SPA_EARN_ORDER_5,
                   SPAFILE.SPA_EARN_ORDER_6,
                   SPAFILE.SPA_EARN_ORDER_7,
                   SPAFILE.SPA_EARN_ORDER_8,
                   SPAFILE.SPA_EARN_ORDER_9,
                   SPAFILE.SPA_EARN_ORDER_10,
                   ISNULL(SPAFILE.SPA_ERNDELQFRMLA,''),
                   SPAFILE.SPA_ERNDELQ_START,
                   SPAFILE.SPA_ERNDELQ_STOP,
                   ISNULL(SPAFILE.SPA_1098_INC_LC,''),
                   SPAFILE.SPA_MAX_IB_ACR_DAYS,
                   SPAFILE.SPA_LCGRACE,
                   ISNULL(SPAFILE.SPA_LCGRACECD,''),
                   ISNULL(SPAFILE.SPA_LCTYPE,''),
                   SPAFILE.SPA_LCRATE,
                   ISNULL(SPAFILE.SPA_LCFRMLA,''),
                   SPAFILE.SPA_LCMINCHG,
                   SPAFILE.SPA_LCMAXAMT,
                   SPAFILE.SPA_LCDELFAC,
                   SPAFILE.SPA_LCYRTYPE,
                   SPAFILE.SPA_LC_CODE,
                   ISNULL(SPAFILE.SPA_LCUNITPER_CD,''),
                   SPAFILE.SPA_DEFFRMLA,
                   ISNULL(SPAFILE.SPA_DEFEXCEPT,''),
                   SPAFILE.SPA_DEFWORKER,
                   SPAFILE.SPA_DEFPERCD,
                   SPAFILE.SPA_DEFBASE,
                   ISNULL(SPAFILE.SPA_DEFPOLCD,''),
                   SPAFILE.SPA_DEFPOLMX_1,
                   SPAFILE.SPA_DEFPOLMX_2,
                   SPAFILE.SPA_DEFPOLMX_3,
                   SPAFILE.SPA_DEFMIN,
                   SPAFILE.SPA_DEFMAX,
                   ISNULL(SPAFILE.SPA_DEFUNITPER_CD,''),
                   SPAFILE.SPA_PRFORM_1,
                   ISNULL(SPAFILE.SPA_PRFLAG_1,''),
                   SPAFILE.SPA_PRFORM_2,
                   ISNULL(SPAFILE.SPA_PRFLAG_2,''),
                   SPAFILE.SPA_PRFORM_3,
                   ISNULL(SPAFILE.SPA_PRFLAG_3,''),
                   SPAFILE.SPA_PRFORM_4,
                   ISNULL(SPAFILE.SPA_PRFLAG_4,''),
                   SPAFILE.SPA_PRFORM_5,
                   ISNULL(SPAFILE.SPA_PRFLAG_5,''),
                   SPAFILE.SPA_PRFORM_6,
                   ISNULL(SPAFILE.SPA_PRFLAG_6,''),
                   SPAFILE.SPA_PRFORM_7,
                   ISNULL(SPAFILE.SPA_PRFLAG_7,''),
                   SPAFILE.SPA_PRFORM_8,
                   ISNULL(SPAFILE.SPA_PRFLAG_8,''),
                   SPAFILE.SPA_PRFORM_9,
                   ISNULL(SPAFILE.SPA_PRFLAG_9,''),
                   SPAFILE.SPA_PRFORM_10,
                   ISNULL(SPAFILE.SPA_PRFLAG_10,''),
                   SPAFILE.SPA_PRFORM_11,
                   ISNULL(SPAFILE.SPA_PRFLAG_11,''),
                   SPAFILE.SPA_PRFORM_12,
                   ISNULL(SPAFILE.SPA_PRFLAG_12,''),
                   SPAFILE.SPA_PRFORM_13,
                   ISNULL(SPAFILE.SPA_PRFLAG_13,''),
                   SPAFILE.SPA_PRFORM_14,
                   ISNULL(SPAFILE.SPA_PRFLAG_14,''),
                   SPAFILE.SPA_PRFORM_15,
                   ISNULL(SPAFILE.SPA_PRFLAG_15,''),
                   SPAFILE.SPA_PRFORM_16,
                   ISNULL(SPAFILE.SPA_PRFLAG_16,''),
                   SPAFILE.SPA_PRFORM_17,
                   ISNULL(SPAFILE.SPA_PRFLAG_17,''),
                   SPAFILE.SPA_PRFORM_18,
                   ISNULL(SPAFILE.SPA_PRFLAG_18,''),
                   SPAFILE.SPA_PRFORM_19,
                   ISNULL(SPAFILE.SPA_PRFLAG_19,''),
                   SPAFILE.SPA_PRFORM_20,
                   ISNULL(SPAFILE.SPA_PRFLAG_20,''),
                   ISNULL(SPAFILE.SPA_IMED_REC,''),
                   SPAFILE.SPA_SCFRMLA,
                   SPAFILE.SPA_SCRATE,
                   SPAFILE.SPA_SCMIN,
                   SPAFILE.SPA_SCMAX,
                   SPAFILE.SPA_MFFRMLA,
                   SPAFILE.SPA_MFRATE,
                   SPAFILE.SPA_MFMIN,
                   SPAFILE.SPA_MFMAX,
                   ISNULL(SPAFILE.SPA_INTMETHOD,''),
                   SPAFILE.SPA_YEARTYPE,
                   SPAFILE.SPA_PYEXFRMLA,
                   SPAFILE.SPA_PYEXSPCODE,
                   SPAFILE.SPA_PYEXYEARTP,
                   ISNULL(SPAFILE.SPA_PYEXFMDATE,''),
                   ISNULL(SPAFILE.SPA_PYEXBASECD,''),
                   SPAFILE.SPA_PYEXBASE,
                   SPAFILE.SPA_PYEXDAYS,
                   SPAFILE.SPA_CAL_SPFRMLA,
                   ISNULL(SPAFILE.SPA_CAL_RATETYPE_1,''),
                   ISNULL(SPAFILE.SPA_CAL_BREAKTYPE_1,''),
                   ISNULL(SPAFILE.SPA_CAL_CHGABLE_1,''),
                   SPAFILE.SPA_CAL_NORATES_1,
                   SPAFILE.SPA_CAL_TBFRMLA_1,
                   SPAFILE.SPA_CAL_RATE_1_1,
                   SPAFILE.SPA_CAL_BREAK_1_1,
                   SPAFILE.SPA_CAL_RATE_1_2,
                   SPAFILE.SPA_CAL_BREAK_1_2,
                   SPAFILE.SPA_CAL_RATE_1_3,
                   SPAFILE.SPA_CAL_BREAK_1_3,
                   SPAFILE.SPA_CAL_RATE_1_4,
                   SPAFILE.SPA_CAL_BREAK_1_4,
                   SPAFILE.SPA_CAL_RATE_1_5,
                   SPAFILE.SPA_CAL_BREAK_1_5,
                   ISNULL(SPAFILE.SPA_CAL_RATETYPE_2,''),
                   ISNULL(SPAFILE.SPA_CAL_BREAKTYPE_2,''),
                   ISNULL(SPAFILE.SPA_CAL_CHGABLE_2,''),
                   SPAFILE.SPA_CAL_NORATES_2,
                   SPAFILE.SPA_CAL_TBFRMLA_2,
                   SPAFILE.SPA_CAL_RATE_2_1,
                   SPAFILE.SPA_CAL_BREAK_2_1,
                   SPAFILE.SPA_CAL_RATE_2_2,
                   SPAFILE.SPA_CAL_BREAK_2_2,
                   SPAFILE.SPA_CAL_RATE_2_3,
                   SPAFILE.SPA_CAL_BREAK_2_3,
                   SPAFILE.SPA_CAL_RATE_2_4,
                   SPAFILE.SPA_CAL_BREAK_2_4,
                   SPAFILE.SPA_CAL_RATE_2_5,
                   SPAFILE.SPA_CAL_BREAK_2_5,
                   SPAFILE.SPA_MINSF_FRMLA,
                   SPAFILE.SPA_MINSF_CHG,
                   SPAFILE.SPA_MAXAPR_FRMLA,
                   SPAFILE.SPA_EDT_NOEDITS_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_1,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_1,''),
                   SPAFILE.SPA_EDT_RATE_1_1,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_1,''),
                   SPAFILE.SPA_EDT_AMT_1_1,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_1,''),
                   SPAFILE.SPA_EDT_TERM_1_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_2,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_2,''),
                   SPAFILE.SPA_EDT_RATE_1_2,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_2,''),
                   SPAFILE.SPA_EDT_AMT_1_2,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_2,''),
                   SPAFILE.SPA_EDT_TERM_1_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_3,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_3,''),
                   SPAFILE.SPA_EDT_RATE_1_3,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_3,''),
                   SPAFILE.SPA_EDT_AMT_1_3,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_3,''),
                   SPAFILE.SPA_EDT_TERM_1_3,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_4,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_4,''),
                   SPAFILE.SPA_EDT_RATE_1_4,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_4,''),
                   SPAFILE.SPA_EDT_AMT_1_4,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_4,''),
                   SPAFILE.SPA_EDT_TERM_1_4,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_5,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_5,''),
                   SPAFILE.SPA_EDT_RATE_1_5,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_5,''),
                   SPAFILE.SPA_EDT_AMT_1_5,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_5,''),
                   SPAFILE.SPA_EDT_TERM_1_5,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_1_6,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_1_6,''),
                   SPAFILE.SPA_EDT_RATE_1_6,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_1_6,''),
                   SPAFILE.SPA_EDT_AMT_1_6,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_1_6,''),
                   SPAFILE.SPA_EDT_TERM_1_6,
                   SPAFILE.SPA_EDT_NOEDITS_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_1,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_1,''),
                   SPAFILE.SPA_EDT_RATE_2_1,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_1,''),
                   SPAFILE.SPA_EDT_AMT_2_1,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_1,''),
                   SPAFILE.SPA_EDT_TERM_2_1,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_2,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_2,''),
                   SPAFILE.SPA_EDT_RATE_2_2,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_2,''),
                   SPAFILE.SPA_EDT_AMT_2_2,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_2,''),
                   SPAFILE.SPA_EDT_TERM_2_2,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_3,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_3,''),
                   SPAFILE.SPA_EDT_RATE_2_3,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_3,''),
                   SPAFILE.SPA_EDT_AMT_2_3,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_3,''),
                   SPAFILE.SPA_EDT_TERM_2_3,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_4,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_4,''),
                   SPAFILE.SPA_EDT_RATE_2_4,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_4,''),
                   SPAFILE.SPA_EDT_AMT_2_4,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_4,''),
                   SPAFILE.SPA_EDT_TERM_2_4,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_5,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_5,''),
                   SPAFILE.SPA_EDT_RATE_2_5,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_5,''),
                   SPAFILE.SPA_EDT_AMT_2_5,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_5,''),
                   SPAFILE.SPA_EDT_TERM_2_5,
                   ISNULL(SPAFILE.SPA_EDT_TYPE_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_HL_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_COLL_2_6,''),
                   ISNULL(SPAFILE.SPA_EDT_CD_2_6,''),
                   SPAFILE.SPA_EDT_RATE_2_6,
                   ISNULL(SPAFILE.SPA_EDT_RATETYPE_2_6,''),
                   SPAFILE.SPA_EDT_AMT_2_6,
                   ISNULL(SPAFILE.SPA_EDT_AMTYPE_2_6,''),
                   SPAFILE.SPA_EDT_TERM_2_6
            INTO :QSPA-REC
            FROM DBO.SPAFILE
            WHERE SPAFILE.SPA_ORGST = :QSPA-ORGST
              AND SPAFILE.SPA_SPRCLASS = :QSPA-SPRCLASS
              AND SPAFILE.SPA_SUBCLASS = :QSPA-SUBCLASS
              AND SPAFILE.SPA_LAWCODE = :QSPA-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-SPA1-FILE.

           IF ( IO-FG = 0 )
              PERFORM GET-SPA-FIELDS.

      *-----------------------------------------------------------------
       READ-SPA1-FILE-NEXT.
           PERFORM READ-IT.
           MOVE SPA-PATH-SQL TO E-FILE.
           MOVE SPA1-KEY TO E-KEYX.
           INITIALIZE QSPA-REC.

           IF ( SPA1-CURSOR-STAT-GOOD )
              EXEC SQL
                   FETCH SPA1_CURSOR INTO :QSPA-REC
              END-EXEC
           ELSE
              MOVE 9        TO SQLCODE
              MOVE "RDNXCR" TO SQLSTATE.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-SPA1-FILE-NEXT.

           IF ( IO-FG = 0 )
              PERFORM GET-SPA-FIELDS.


      *-----------------------------------------------------------------
       READ-SPA1-FILE-PREVIOUS.
           PERFORM READ-IT.
           MOVE SPA-PATH-SQL TO E-FILE.
           MOVE SPA1-KEY TO E-KEYX.
           INITIALIZE QSPA-REC.

           IF ( SPA1-CURSOR-NG-STAT-GOOD )
              EXEC SQL
                   FETCH SPA1_CURSOR_NG INTO :QSPA-REC
              END-EXEC
           ELSE
              MOVE 9        TO SQLCODE
              MOVE "RDPVCR" TO SQLSTATE.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-SPA1-FILE-PREVIOUS.

           IF ( IO-FG = 0 )
              PERFORM GET-SPA-FIELDS.

      *--------------------------------------------------------
       WRITE-SPA1-FILE.
           ACCEPT SPA-LTOUCH-DATE FROM CENTURY-DATE.
           PERFORM WRITE-IT.
           MOVE SPA-PATH-SQL    TO E-FILE.
           MOVE SPA1-KEY        TO E-KEYX.
           PERFORM SET-SPA-FIELDS.

           EXEC SQL
            INSERT INTO DBO.SPAFILE
             (SPAFILE.SPA_ORGST,
              SPAFILE.SPA_SPRCLASS,
              SPAFILE.SPA_SUBCLASS,
              SPAFILE.SPA_LAWCODE,
              SPAFILE.SPA_LTOUCH_DATE,
              SPAFILE.SPA_DESC,
              SPAFILE.SPA_NOTES,
              SPAFILE.SPA_EFFDATE,
              SPAFILE.SPA_EXPDATE,
              SPAFILE.SPA_EXPD_MONTHS,
              SPAFILE.SPA_EXPD_DAYS,
              SPAFILE.SPA_EXPD_FRMLA,
              SPAFILE.SPA_EXPD_EXCEPT,
              SPAFILE.SPA_EXPR_FRMLA,
              SPAFILE.SPA_EXPR_REDU_FRMLA,
              SPAFILE.SPA_EXPR_RATE_1,
              SPAFILE.SPA_EXPR_BREAK_1,
              SPAFILE.SPA_EXPR_YRTYPE_1,
              SPAFILE.SPA_EXPR_INTMETH_1,
              SPAFILE.SPA_EXPR_RATE_2,
              SPAFILE.SPA_EXPR_BREAK_2,
              SPAFILE.SPA_EXPR_YRTYPE_2,
              SPAFILE.SPA_EXPR_INTMETH_2,
              SPAFILE.SPA_EXPR_RATE_3,
              SPAFILE.SPA_EXPR_BREAK_3,
              SPAFILE.SPA_EXPR_YRTYPE_3,
              SPAFILE.SPA_EXPR_INTMETH_3,
              SPAFILE.SPA_EXPR_RATE_4,
              SPAFILE.SPA_EXPR_BREAK_4,
              SPAFILE.SPA_EXPR_YRTYPE_4,
              SPAFILE.SPA_EXPR_INTMETH_4,
              SPAFILE.SPA_EXPR_RATE_5,
              SPAFILE.SPA_EXPR_BREAK_5,
              SPAFILE.SPA_EXPR_YRTYPE_5,
              SPAFILE.SPA_EXPR_INTMETH_5,
              SPAFILE.SPA_EXPR_LCHG,
              SPAFILE.SPA_JUDGFRMLA,
              SPAFILE.SPA_JUDGRATE,
              SPAFILE.SPA_JUDGYRTYPE,
              SPAFILE.SPA_JUDGINTMETH,
              SPAFILE.SPA_ACC_FRMLA,
              SPAFILE.SPA_ACC_YRTYPE,
              SPAFILE.SPA_ACC_INTMETH,
              SPAFILE.SPA_ACC_RATE_1,
              SPAFILE.SPA_ACC_BREAK_1,
              SPAFILE.SPA_ACC_RATE_2,
              SPAFILE.SPA_ACC_BREAK_2,
              SPAFILE.SPA_ACC_RATE_3,
              SPAFILE.SPA_ACC_BREAK_3,
              SPAFILE.SPA_ACC_RATE_4,
              SPAFILE.SPA_ACC_BREAK_4,
              SPAFILE.SPA_ACC_RATE_5,
              SPAFILE.SPA_ACC_BREAK_5,
              SPAFILE.SPA_1098FRMLA,
              SPAFILE.SPA_DISFRMLA,
              SPAFILE.SPA_CONTRFRMLA,
              SPAFILE.SPA_BANKRULE,
              SPAFILE.SPA_CONTPDTH,
              SPAFILE.SPA_FINCHG,
              SPAFILE.SPA_BANKUNITPER_CD,
              SPAFILE.SPA_TRWBANKRULE,
              SPAFILE.SPA_TRWCONTPDTH,
              SPAFILE.SPA_TRWBANKUNITPER_CD,
              SPAFILE.SPA_RECFRMLA,
              SPAFILE.SPA_RECPAYCD,
              SPAFILE.SPA_RECPDTH,
              SPAFILE.SPA_DISFRMLA_SPAY_FG,
              SPAFILE.SPA_ERNFRMLA_1,
              SPAFILE.SPA_ERNAMT_1,
              SPAFILE.SPA_ERNPERCT_1,
              SPAFILE.SPA_ERNPERCD_1,
              SPAFILE.SPA_ERNACCRL_FG_1,
              SPAFILE.SPA_ERNACCRL_START_CD_1,
              SPAFILE.SPA_ERNACCRL_DFCD_1,
              SPAFILE.SPA_ERN_DAYS_1,
              SPAFILE.SPA_ERN_TERM_1,
              SPAFILE.SPA_ERN_TYPE_1,
              SPAFILE.SPA_ERNFRMLA_2,
              SPAFILE.SPA_ERNAMT_2,
              SPAFILE.SPA_ERNPERCT_2,
              SPAFILE.SPA_ERNPERCD_2,
              SPAFILE.SPA_ERNACCRL_FG_2,
              SPAFILE.SPA_ERNACCRL_START_CD_2,
              SPAFILE.SPA_ERNACCRL_DFCD_2,
              SPAFILE.SPA_ERN_DAYS_2,
              SPAFILE.SPA_ERN_TERM_2,
              SPAFILE.SPA_ERN_TYPE_2,
              SPAFILE.SPA_ERNFRMLA_3,
              SPAFILE.SPA_ERNAMT_3,
              SPAFILE.SPA_ERNPERCT_3,
              SPAFILE.SPA_ERNPERCD_3,
              SPAFILE.SPA_ERNACCRL_FG_3,
              SPAFILE.SPA_ERNACCRL_START_CD_3,
              SPAFILE.SPA_ERNACCRL_DFCD_3,
              SPAFILE.SPA_ERN_DAYS_3,
              SPAFILE.SPA_ERN_TERM_3,
              SPAFILE.SPA_ERN_TYPE_3,
              SPAFILE.SPA_ERNFRMLA_4,
              SPAFILE.SPA_ERNAMT_4,
              SPAFILE.SPA_ERNPERCT_4,
              SPAFILE.SPA_ERNPERCD_4,
              SPAFILE.SPA_ERNACCRL_FG_4,
              SPAFILE.SPA_ERNACCRL_START_CD_4,
              SPAFILE.SPA_ERNACCRL_DFCD_4,
              SPAFILE.SPA_ERN_DAYS_4,
              SPAFILE.SPA_ERN_TERM_4,
              SPAFILE.SPA_ERN_TYPE_4,
              SPAFILE.SPA_ERNFRMLA_5,
              SPAFILE.SPA_ERNAMT_5,
              SPAFILE.SPA_ERNPERCT_5,
              SPAFILE.SPA_ERNPERCD_5,
              SPAFILE.SPA_ERNACCRL_FG_5,
              SPAFILE.SPA_ERNACCRL_START_CD_5,
              SPAFILE.SPA_ERNACCRL_DFCD_5,
              SPAFILE.SPA_ERN_DAYS_5,
              SPAFILE.SPA_ERN_TERM_5,
              SPAFILE.SPA_ERN_TYPE_5,
              SPAFILE.SPA_ERNFRMLA_6,
              SPAFILE.SPA_ERNAMT_6,
              SPAFILE.SPA_ERNPERCT_6,
              SPAFILE.SPA_ERNPERCD_6,
              SPAFILE.SPA_ERNACCRL_FG_6,
              SPAFILE.SPA_ERNACCRL_START_CD_6,
              SPAFILE.SPA_ERNACCRL_DFCD_6,
              SPAFILE.SPA_ERN_DAYS_6,
              SPAFILE.SPA_ERN_TERM_6,
              SPAFILE.SPA_ERN_TYPE_6,
              SPAFILE.SPA_ERNFRMLA_7,
              SPAFILE.SPA_ERNAMT_7,
              SPAFILE.SPA_ERNPERCT_7,
              SPAFILE.SPA_ERNPERCD_7,
              SPAFILE.SPA_ERNACCRL_FG_7,
              SPAFILE.SPA_ERNACCRL_START_CD_7,
              SPAFILE.SPA_ERNACCRL_DFCD_7,
              SPAFILE.SPA_ERN_DAYS_7,
              SPAFILE.SPA_ERN_TERM_7,
              SPAFILE.SPA_ERN_TYPE_7,
              SPAFILE.SPA_ERNFRMLA_8,
              SPAFILE.SPA_ERNAMT_8,
              SPAFILE.SPA_ERNPERCT_8,
              SPAFILE.SPA_ERNPERCD_8,
              SPAFILE.SPA_ERNACCRL_FG_8,
              SPAFILE.SPA_ERNACCRL_START_CD_8,
              SPAFILE.SPA_ERNACCRL_DFCD_8,
              SPAFILE.SPA_ERN_DAYS_8,
              SPAFILE.SPA_ERN_TERM_8,
              SPAFILE.SPA_ERN_TYPE_8,
              SPAFILE.SPA_ERNFRMLA_9,
              SPAFILE.SPA_ERNAMT_9,
              SPAFILE.SPA_ERNPERCT_9,
              SPAFILE.SPA_ERNPERCD_9,
              SPAFILE.SPA_ERNACCRL_FG_9,
              SPAFILE.SPA_ERNACCRL_START_CD_9,
              SPAFILE.SPA_ERNACCRL_DFCD_9,
              SPAFILE.SPA_ERN_DAYS_9,
              SPAFILE.SPA_ERN_TERM_9,
              SPAFILE.SPA_ERN_TYPE_9,
              SPAFILE.SPA_ERNFRMLA_10,
              SPAFILE.SPA_ERNAMT_10,
              SPAFILE.SPA_ERNPERCT_10,
              SPAFILE.SPA_ERNPERCD_10,
              SPAFILE.SPA_ERNACCRL_FG_10,
              SPAFILE.SPA_ERNACCRL_START_CD_10,
              SPAFILE.SPA_ERNACCRL_DFCD_10,
              SPAFILE.SPA_ERN_DAYS_10,
              SPAFILE.SPA_ERN_TERM_10,
              SPAFILE.SPA_ERN_TYPE_10,
              SPAFILE.SPA_ERNACCEL_CD,
              SPAFILE.SPA_ERNJD_CD,
              SPAFILE.SPA_MIDSTRERNCD,
              SPAFILE.SPA_EARN_ORDER_1,
              SPAFILE.SPA_EARN_ORDER_2,
              SPAFILE.SPA_EARN_ORDER_3,
              SPAFILE.SPA_EARN_ORDER_4,
              SPAFILE.SPA_EARN_ORDER_5,
              SPAFILE.SPA_EARN_ORDER_6,
              SPAFILE.SPA_EARN_ORDER_7,
              SPAFILE.SPA_EARN_ORDER_8,
              SPAFILE.SPA_EARN_ORDER_9,
              SPAFILE.SPA_EARN_ORDER_10,
              SPAFILE.SPA_ERNDELQFRMLA,
              SPAFILE.SPA_ERNDELQ_START,
              SPAFILE.SPA_ERNDELQ_STOP,
              SPAFILE.SPA_1098_INC_LC,
              SPAFILE.SPA_MAX_IB_ACR_DAYS,
              SPAFILE.SPA_LCGRACE,
              SPAFILE.SPA_LCGRACECD,
              SPAFILE.SPA_LCTYPE,
              SPAFILE.SPA_LCRATE,
              SPAFILE.SPA_LCFRMLA,
              SPAFILE.SPA_LCMINCHG,
              SPAFILE.SPA_LCMAXAMT,
              SPAFILE.SPA_LCDELFAC,
              SPAFILE.SPA_LCYRTYPE,
              SPAFILE.SPA_LC_CODE,
              SPAFILE.SPA_LCUNITPER_CD,
              SPAFILE.SPA_DEFFRMLA,
              SPAFILE.SPA_DEFEXCEPT,
              SPAFILE.SPA_DEFWORKER,
              SPAFILE.SPA_DEFPERCD,
              SPAFILE.SPA_DEFBASE,
              SPAFILE.SPA_DEFPOLCD,
              SPAFILE.SPA_DEFPOLMX_1,
              SPAFILE.SPA_DEFPOLMX_2,
              SPAFILE.SPA_DEFPOLMX_3,
              SPAFILE.SPA_DEFMIN,
              SPAFILE.SPA_DEFMAX,
              SPAFILE.SPA_DEFUNITPER_CD,
              SPAFILE.SPA_PRFORM_1,
              SPAFILE.SPA_PRFLAG_1,
              SPAFILE.SPA_PRFORM_2,
              SPAFILE.SPA_PRFLAG_2,
              SPAFILE.SPA_PRFORM_3,
              SPAFILE.SPA_PRFLAG_3,
              SPAFILE.SPA_PRFORM_4,
              SPAFILE.SPA_PRFLAG_4,
              SPAFILE.SPA_PRFORM_5,
              SPAFILE.SPA_PRFLAG_5,
              SPAFILE.SPA_PRFORM_6,
              SPAFILE.SPA_PRFLAG_6,
              SPAFILE.SPA_PRFORM_7,
              SPAFILE.SPA_PRFLAG_7,
              SPAFILE.SPA_PRFORM_8,
              SPAFILE.SPA_PRFLAG_8,
              SPAFILE.SPA_PRFORM_9,
              SPAFILE.SPA_PRFLAG_9,
              SPAFILE.SPA_PRFORM_10,
              SPAFILE.SPA_PRFLAG_10,
              SPAFILE.SPA_PRFORM_11,
              SPAFILE.SPA_PRFLAG_11,
              SPAFILE.SPA_PRFORM_12,
              SPAFILE.SPA_PRFLAG_12,
              SPAFILE.SPA_PRFORM_13,
              SPAFILE.SPA_PRFLAG_13,
              SPAFILE.SPA_PRFORM_14,
              SPAFILE.SPA_PRFLAG_14,
              SPAFILE.SPA_PRFORM_15,
              SPAFILE.SPA_PRFLAG_15,
              SPAFILE.SPA_PRFORM_16,
              SPAFILE.SPA_PRFLAG_16,
              SPAFILE.SPA_PRFORM_17,
              SPAFILE.SPA_PRFLAG_17,
              SPAFILE.SPA_PRFORM_18,
              SPAFILE.SPA_PRFLAG_18,
              SPAFILE.SPA_PRFORM_19,
              SPAFILE.SPA_PRFLAG_19,
              SPAFILE.SPA_PRFORM_20,
              SPAFILE.SPA_PRFLAG_20,
              SPAFILE.SPA_IMED_REC,
              SPAFILE.SPA_SCFRMLA,
              SPAFILE.SPA_SCRATE,
              SPAFILE.SPA_SCMIN,
              SPAFILE.SPA_SCMAX,
              SPAFILE.SPA_MFFRMLA,
              SPAFILE.SPA_MFRATE,
              SPAFILE.SPA_MFMIN,
              SPAFILE.SPA_MFMAX,
              SPAFILE.SPA_INTMETHOD,
              SPAFILE.SPA_YEARTYPE,
              SPAFILE.SPA_PYEXFRMLA,
              SPAFILE.SPA_PYEXSPCODE,
              SPAFILE.SPA_PYEXYEARTP,
              SPAFILE.SPA_PYEXFMDATE,
              SPAFILE.SPA_PYEXBASECD,
              SPAFILE.SPA_PYEXBASE,
              SPAFILE.SPA_PYEXDAYS,
              SPAFILE.SPA_CAL_SPFRMLA,
              SPAFILE.SPA_CAL_RATETYPE_1,
              SPAFILE.SPA_CAL_BREAKTYPE_1,
              SPAFILE.SPA_CAL_CHGABLE_1,
              SPAFILE.SPA_CAL_NORATES_1,
              SPAFILE.SPA_CAL_TBFRMLA_1,
              SPAFILE.SPA_CAL_RATE_1_1,
              SPAFILE.SPA_CAL_BREAK_1_1,
              SPAFILE.SPA_CAL_RATE_1_2,
              SPAFILE.SPA_CAL_BREAK_1_2,
              SPAFILE.SPA_CAL_RATE_1_3,
              SPAFILE.SPA_CAL_BREAK_1_3,
              SPAFILE.SPA_CAL_RATE_1_4,
              SPAFILE.SPA_CAL_BREAK_1_4,
              SPAFILE.SPA_CAL_RATE_1_5,
              SPAFILE.SPA_CAL_BREAK_1_5,
              SPAFILE.SPA_CAL_RATETYPE_2,
              SPAFILE.SPA_CAL_BREAKTYPE_2,
              SPAFILE.SPA_CAL_CHGABLE_2,
              SPAFILE.SPA_CAL_NORATES_2,
              SPAFILE.SPA_CAL_TBFRMLA_2,
              SPAFILE.SPA_CAL_RATE_2_1,
              SPAFILE.SPA_CAL_BREAK_2_1,
              SPAFILE.SPA_CAL_RATE_2_2,
              SPAFILE.SPA_CAL_BREAK_2_2,
              SPAFILE.SPA_CAL_RATE_2_3,
              SPAFILE.SPA_CAL_BREAK_2_3,
              SPAFILE.SPA_CAL_RATE_2_4,
              SPAFILE.SPA_CAL_BREAK_2_4,
              SPAFILE.SPA_CAL_RATE_2_5,
              SPAFILE.SPA_CAL_BREAK_2_5,
              SPAFILE.SPA_MINSF_FRMLA,
              SPAFILE.SPA_MINSF_CHG,
              SPAFILE.SPA_MAXAPR_FRMLA,
              SPAFILE.SPA_EDT_NOEDITS_1,
              SPAFILE.SPA_EDT_TYPE_1_1,
              SPAFILE.SPA_EDT_HL_1_1,
              SPAFILE.SPA_EDT_COLL_1_1,
              SPAFILE.SPA_EDT_CD_1_1,
              SPAFILE.SPA_EDT_RATE_1_1,
              SPAFILE.SPA_EDT_RATETYPE_1_1,
              SPAFILE.SPA_EDT_AMT_1_1,
              SPAFILE.SPA_EDT_AMTYPE_1_1,
              SPAFILE.SPA_EDT_TERM_1_1,
              SPAFILE.SPA_EDT_TYPE_1_2,
              SPAFILE.SPA_EDT_HL_1_2,
              SPAFILE.SPA_EDT_COLL_1_2,
              SPAFILE.SPA_EDT_CD_1_2,
              SPAFILE.SPA_EDT_RATE_1_2,
              SPAFILE.SPA_EDT_RATETYPE_1_2,
              SPAFILE.SPA_EDT_AMT_1_2,
              SPAFILE.SPA_EDT_AMTYPE_1_2,
              SPAFILE.SPA_EDT_TERM_1_2,
              SPAFILE.SPA_EDT_TYPE_1_3,
              SPAFILE.SPA_EDT_HL_1_3,
              SPAFILE.SPA_EDT_COLL_1_3,
              SPAFILE.SPA_EDT_CD_1_3,
              SPAFILE.SPA_EDT_RATE_1_3,
              SPAFILE.SPA_EDT_RATETYPE_1_3,
              SPAFILE.SPA_EDT_AMT_1_3,
              SPAFILE.SPA_EDT_AMTYPE_1_3,
              SPAFILE.SPA_EDT_TERM_1_3,
              SPAFILE.SPA_EDT_TYPE_1_4,
              SPAFILE.SPA_EDT_HL_1_4,
              SPAFILE.SPA_EDT_COLL_1_4,
              SPAFILE.SPA_EDT_CD_1_4,
              SPAFILE.SPA_EDT_RATE_1_4,
              SPAFILE.SPA_EDT_RATETYPE_1_4,
              SPAFILE.SPA_EDT_AMT_1_4,
              SPAFILE.SPA_EDT_AMTYPE_1_4,
              SPAFILE.SPA_EDT_TERM_1_4,
              SPAFILE.SPA_EDT_TYPE_1_5,
              SPAFILE.SPA_EDT_HL_1_5,
              SPAFILE.SPA_EDT_COLL_1_5,
              SPAFILE.SPA_EDT_CD_1_5,
              SPAFILE.SPA_EDT_RATE_1_5,
              SPAFILE.SPA_EDT_RATETYPE_1_5,
              SPAFILE.SPA_EDT_AMT_1_5,
              SPAFILE.SPA_EDT_AMTYPE_1_5,
              SPAFILE.SPA_EDT_TERM_1_5,
              SPAFILE.SPA_EDT_TYPE_1_6,
              SPAFILE.SPA_EDT_HL_1_6,
              SPAFILE.SPA_EDT_COLL_1_6,
              SPAFILE.SPA_EDT_CD_1_6,
              SPAFILE.SPA_EDT_RATE_1_6,
              SPAFILE.SPA_EDT_RATETYPE_1_6,
              SPAFILE.SPA_EDT_AMT_1_6,
              SPAFILE.SPA_EDT_AMTYPE_1_6,
              SPAFILE.SPA_EDT_TERM_1_6,
              SPAFILE.SPA_EDT_NOEDITS_2,
              SPAFILE.SPA_EDT_TYPE_2_1,
              SPAFILE.SPA_EDT_HL_2_1,
              SPAFILE.SPA_EDT_COLL_2_1,
              SPAFILE.SPA_EDT_CD_2_1,
              SPAFILE.SPA_EDT_RATE_2_1,
              SPAFILE.SPA_EDT_RATETYPE_2_1,
              SPAFILE.SPA_EDT_AMT_2_1,
              SPAFILE.SPA_EDT_AMTYPE_2_1,
              SPAFILE.SPA_EDT_TERM_2_1,
              SPAFILE.SPA_EDT_TYPE_2_2,
              SPAFILE.SPA_EDT_HL_2_2,
              SPAFILE.SPA_EDT_COLL_2_2,
              SPAFILE.SPA_EDT_CD_2_2,
              SPAFILE.SPA_EDT_RATE_2_2,
              SPAFILE.SPA_EDT_RATETYPE_2_2,
              SPAFILE.SPA_EDT_AMT_2_2,
              SPAFILE.SPA_EDT_AMTYPE_2_2,
              SPAFILE.SPA_EDT_TERM_2_2,
              SPAFILE.SPA_EDT_TYPE_2_3,
              SPAFILE.SPA_EDT_HL_2_3,
              SPAFILE.SPA_EDT_COLL_2_3,
              SPAFILE.SPA_EDT_CD_2_3,
              SPAFILE.SPA_EDT_RATE_2_3,
              SPAFILE.SPA_EDT_RATETYPE_2_3,
              SPAFILE.SPA_EDT_AMT_2_3,
              SPAFILE.SPA_EDT_AMTYPE_2_3,
              SPAFILE.SPA_EDT_TERM_2_3,
              SPAFILE.SPA_EDT_TYPE_2_4,
              SPAFILE.SPA_EDT_HL_2_4,
              SPAFILE.SPA_EDT_COLL_2_4,
              SPAFILE.SPA_EDT_CD_2_4,
              SPAFILE.SPA_EDT_RATE_2_4,
              SPAFILE.SPA_EDT_RATETYPE_2_4,
              SPAFILE.SPA_EDT_AMT_2_4,
              SPAFILE.SPA_EDT_AMTYPE_2_4,
              SPAFILE.SPA_EDT_TERM_2_4,
              SPAFILE.SPA_EDT_TYPE_2_5,
              SPAFILE.SPA_EDT_HL_2_5,
              SPAFILE.SPA_EDT_COLL_2_5,
              SPAFILE.SPA_EDT_CD_2_5,
              SPAFILE.SPA_EDT_RATE_2_5,
              SPAFILE.SPA_EDT_RATETYPE_2_5,
              SPAFILE.SPA_EDT_AMT_2_5,
              SPAFILE.SPA_EDT_AMTYPE_2_5,
              SPAFILE.SPA_EDT_TERM_2_5,
              SPAFILE.SPA_EDT_TYPE_2_6,
              SPAFILE.SPA_EDT_HL_2_6,
              SPAFILE.SPA_EDT_COLL_2_6,
              SPAFILE.SPA_EDT_CD_2_6,
              SPAFILE.SPA_EDT_RATE_2_6,
              SPAFILE.SPA_EDT_RATETYPE_2_6,
              SPAFILE.SPA_EDT_AMT_2_6,
              SPAFILE.SPA_EDT_AMTYPE_2_6,
              SPAFILE.SPA_EDT_TERM_2_6)
            VALUES
             (:QSPA-ORGST,
              :QSPA-SPRCLASS,
              :QSPA-SUBCLASS,
              :QSPA-LAWCODE,
              :QSPA-LTOUCH-DATE,
              :QSPA-DESC,
              :QSPA-NOTES,
              :QSPA-EFFDATE,
              :QSPA-EXPDATE,
              :QSPA-EXPD-MONTHS,
              :QSPA-EXPD-DAYS,
              :QSPA-EXPD-FRMLA,
              :QSPA-EXPD-EXCEPT,
              :QSPA-EXPR-FRMLA,
              :QSPA-EXPR-REDU-FRMLA,
              :QSPA-EXPR-RATE-1,
              :QSPA-EXPR-BREAK-1,
              :QSPA-EXPR-YRTYPE-1,
              :QSPA-EXPR-INTMETH-1,
              :QSPA-EXPR-RATE-2,
              :QSPA-EXPR-BREAK-2,
              :QSPA-EXPR-YRTYPE-2,
              :QSPA-EXPR-INTMETH-2,
              :QSPA-EXPR-RATE-3,
              :QSPA-EXPR-BREAK-3,
              :QSPA-EXPR-YRTYPE-3,
              :QSPA-EXPR-INTMETH-3,
              :QSPA-EXPR-RATE-4,
              :QSPA-EXPR-BREAK-4,
              :QSPA-EXPR-YRTYPE-4,
              :QSPA-EXPR-INTMETH-4,
              :QSPA-EXPR-RATE-5,
              :QSPA-EXPR-BREAK-5,
              :QSPA-EXPR-YRTYPE-5,
              :QSPA-EXPR-INTMETH-5,
              :QSPA-EXPR-LCHG,
              :QSPA-JUDGFRMLA,
              :QSPA-JUDGRATE,
              :QSPA-JUDGYRTYPE,
              :QSPA-JUDGINTMETH,
              :QSPA-ACC-FRMLA,
              :QSPA-ACC-YRTYPE,
              :QSPA-ACC-INTMETH,
              :QSPA-ACC-RATE-1,
              :QSPA-ACC-BREAK-1,
              :QSPA-ACC-RATE-2,
              :QSPA-ACC-BREAK-2,
              :QSPA-ACC-RATE-3,
              :QSPA-ACC-BREAK-3,
              :QSPA-ACC-RATE-4,
              :QSPA-ACC-BREAK-4,
              :QSPA-ACC-RATE-5,
              :QSPA-ACC-BREAK-5,
              :QSPA-1098FRMLA,
              :QSPA-DISFRMLA,
              :QSPA-CONTRFRMLA,
              :QSPA-BANKRULE,
              :QSPA-CONTPDTH,
              :QSPA-FINCHG,
              :QSPA-BANKUNITPER-CD,
              :QSPA-TRWBANKRULE,
              :QSPA-TRWCONTPDTH,
              :QSPA-TRWBANKUNITPER-CD,
              :QSPA-RECFRMLA,
              :QSPA-RECPAYCD,
              :QSPA-RECPDTH,
              :QSPA-DISFRMLA-SPAY-FG,
              :QSPA-ERNFRMLA-1,
              :QSPA-ERNAMT-1,
              :QSPA-ERNPERCT-1,
              :QSPA-ERNPERCD-1,
              :QSPA-ERNACCRL-FG-1,
              :QSPA-ERNACCRL-START-CD-1,
              :QSPA-ERNACCRL-DFCD-1,
              :QSPA-ERN-DAYS-1,
              :QSPA-ERN-TERM-1,
              :QSPA-ERN-TYPE-1,
              :QSPA-ERNFRMLA-2,
              :QSPA-ERNAMT-2,
              :QSPA-ERNPERCT-2,
              :QSPA-ERNPERCD-2,
              :QSPA-ERNACCRL-FG-2,
              :QSPA-ERNACCRL-START-CD-2,
              :QSPA-ERNACCRL-DFCD-2,
              :QSPA-ERN-DAYS-2,
              :QSPA-ERN-TERM-2,
              :QSPA-ERN-TYPE-2,
              :QSPA-ERNFRMLA-3,
              :QSPA-ERNAMT-3,
              :QSPA-ERNPERCT-3,
              :QSPA-ERNPERCD-3,
              :QSPA-ERNACCRL-FG-3,
              :QSPA-ERNACCRL-START-CD-3,
              :QSPA-ERNACCRL-DFCD-3,
              :QSPA-ERN-DAYS-3,
              :QSPA-ERN-TERM-3,
              :QSPA-ERN-TYPE-3,
              :QSPA-ERNFRMLA-4,
              :QSPA-ERNAMT-4,
              :QSPA-ERNPERCT-4,
              :QSPA-ERNPERCD-4,
              :QSPA-ERNACCRL-FG-4,
              :QSPA-ERNACCRL-START-CD-4,
              :QSPA-ERNACCRL-DFCD-4,
              :QSPA-ERN-DAYS-4,
              :QSPA-ERN-TERM-4,
              :QSPA-ERN-TYPE-4,
              :QSPA-ERNFRMLA-5,
              :QSPA-ERNAMT-5,
              :QSPA-ERNPERCT-5,
              :QSPA-ERNPERCD-5,
              :QSPA-ERNACCRL-FG-5,
              :QSPA-ERNACCRL-START-CD-5,
              :QSPA-ERNACCRL-DFCD-5,
              :QSPA-ERN-DAYS-5,
              :QSPA-ERN-TERM-5,
              :QSPA-ERN-TYPE-5,
              :QSPA-ERNFRMLA-6,
              :QSPA-ERNAMT-6,
              :QSPA-ERNPERCT-6,
              :QSPA-ERNPERCD-6,
              :QSPA-ERNACCRL-FG-6,
              :QSPA-ERNACCRL-START-CD-6,
              :QSPA-ERNACCRL-DFCD-6,
              :QSPA-ERN-DAYS-6,
              :QSPA-ERN-TERM-6,
              :QSPA-ERN-TYPE-6,
              :QSPA-ERNFRMLA-7,
              :QSPA-ERNAMT-7,
              :QSPA-ERNPERCT-7,
              :QSPA-ERNPERCD-7,
              :QSPA-ERNACCRL-FG-7,
              :QSPA-ERNACCRL-START-CD-7,
              :QSPA-ERNACCRL-DFCD-7,
              :QSPA-ERN-DAYS-7,
              :QSPA-ERN-TERM-7,
              :QSPA-ERN-TYPE-7,
              :QSPA-ERNFRMLA-8,
              :QSPA-ERNAMT-8,
              :QSPA-ERNPERCT-8,
              :QSPA-ERNPERCD-8,
              :QSPA-ERNACCRL-FG-8,
              :QSPA-ERNACCRL-START-CD-8,
              :QSPA-ERNACCRL-DFCD-8,
              :QSPA-ERN-DAYS-8,
              :QSPA-ERN-TERM-8,
              :QSPA-ERN-TYPE-8,
              :QSPA-ERNFRMLA-9,
              :QSPA-ERNAMT-9,
              :QSPA-ERNPERCT-9,
              :QSPA-ERNPERCD-9,
              :QSPA-ERNACCRL-FG-9,
              :QSPA-ERNACCRL-START-CD-9,
              :QSPA-ERNACCRL-DFCD-9,
              :QSPA-ERN-DAYS-9,
              :QSPA-ERN-TERM-9,
              :QSPA-ERN-TYPE-9,
              :QSPA-ERNFRMLA-10,
              :QSPA-ERNAMT-10,
              :QSPA-ERNPERCT-10,
              :QSPA-ERNPERCD-10,
              :QSPA-ERNACCRL-FG-10,
              :QSPA-ERNACCRL-START-CD-10,
              :QSPA-ERNACCRL-DFCD-10,
              :QSPA-ERN-DAYS-10,
              :QSPA-ERN-TERM-10,
              :QSPA-ERN-TYPE-10,
              :QSPA-ERNACCEL-CD,
              :QSPA-ERNJD-CD,
              :QSPA-MIDSTRERNCD,
              :QSPA-EARN-ORDER-1,
              :QSPA-EARN-ORDER-2,
              :QSPA-EARN-ORDER-3,
              :QSPA-EARN-ORDER-4,
              :QSPA-EARN-ORDER-5,
              :QSPA-EARN-ORDER-6,
              :QSPA-EARN-ORDER-7,
              :QSPA-EARN-ORDER-8,
              :QSPA-EARN-ORDER-9,
              :QSPA-EARN-ORDER-10,
              :QSPA-ERNDELQFRMLA,
              :QSPA-ERNDELQ-START,
              :QSPA-ERNDELQ-STOP,
              :QSPA-1098-INC-LC,
              :QSPA-MAX-IB-ACR-DAYS,
              :QSPA-LCGRACE,
              :QSPA-LCGRACECD,
              :QSPA-LCTYPE,
              :QSPA-LCRATE,
              :QSPA-LCFRMLA,
              :QSPA-LCMINCHG,
              :QSPA-LCMAXAMT,
              :QSPA-LCDELFAC,
              :QSPA-LCYRTYPE,
              :QSPA-LC-CODE,
              :QSPA-LCUNITPER-CD,
              :QSPA-DEFFRMLA,
              :QSPA-DEFEXCEPT,
              :QSPA-DEFWORKER,
              :QSPA-DEFPERCD,
              :QSPA-DEFBASE,
              :QSPA-DEFPOLCD,
              :QSPA-DEFPOLMX-1,
              :QSPA-DEFPOLMX-2,
              :QSPA-DEFPOLMX-3,
              :QSPA-DEFMIN,
              :QSPA-DEFMAX,
              :QSPA-DEFUNITPER-CD,
              :QSPA-PRFORM-1,
              :QSPA-PRFLAG-1,
              :QSPA-PRFORM-2,
              :QSPA-PRFLAG-2,
              :QSPA-PRFORM-3,
              :QSPA-PRFLAG-3,
              :QSPA-PRFORM-4,
              :QSPA-PRFLAG-4,
              :QSPA-PRFORM-5,
              :QSPA-PRFLAG-5,
              :QSPA-PRFORM-6,
              :QSPA-PRFLAG-6,
              :QSPA-PRFORM-7,
              :QSPA-PRFLAG-7,
              :QSPA-PRFORM-8,
              :QSPA-PRFLAG-8,
              :QSPA-PRFORM-9,
              :QSPA-PRFLAG-9,
              :QSPA-PRFORM-10,
              :QSPA-PRFLAG-10,
              :QSPA-PRFORM-11,
              :QSPA-PRFLAG-11,
              :QSPA-PRFORM-12,
              :QSPA-PRFLAG-12,
              :QSPA-PRFORM-13,
              :QSPA-PRFLAG-13,
              :QSPA-PRFORM-14,
              :QSPA-PRFLAG-14,
              :QSPA-PRFORM-15,
              :QSPA-PRFLAG-15,
              :QSPA-PRFORM-16,
              :QSPA-PRFLAG-16,
              :QSPA-PRFORM-17,
              :QSPA-PRFLAG-17,
              :QSPA-PRFORM-18,
              :QSPA-PRFLAG-18,
              :QSPA-PRFORM-19,
              :QSPA-PRFLAG-19,
              :QSPA-PRFORM-20,
              :QSPA-PRFLAG-20,
              :QSPA-IMED-REC,
              :QSPA-SCFRMLA,
              :QSPA-SCRATE,
              :QSPA-SCMIN,
              :QSPA-SCMAX,
              :QSPA-MFFRMLA,
              :QSPA-MFRATE,
              :QSPA-MFMIN,
              :QSPA-MFMAX,
              :QSPA-INTMETHOD,
              :QSPA-YEARTYPE,
              :QSPA-PYEXFRMLA,
              :QSPA-PYEXSPCODE,
              :QSPA-PYEXYEARTP,
              :QSPA-PYEXFMDATE,
              :QSPA-PYEXBASECD,
              :QSPA-PYEXBASE,
              :QSPA-PYEXDAYS,
              :QSPA-CAL-SPFRMLA,
              :QSPA-CAL-RATETYPE-1,
              :QSPA-CAL-BREAKTYPE-1,
              :QSPA-CAL-CHGABLE-1,
              :QSPA-CAL-NORATES-1,
              :QSPA-CAL-TBFRMLA-1,
              :QSPA-CAL-RATE-1-1,
              :QSPA-CAL-BREAK-1-1,
              :QSPA-CAL-RATE-1-2,
              :QSPA-CAL-BREAK-1-2,
              :QSPA-CAL-RATE-1-3,
              :QSPA-CAL-BREAK-1-3,
              :QSPA-CAL-RATE-1-4,
              :QSPA-CAL-BREAK-1-4,
              :QSPA-CAL-RATE-1-5,
              :QSPA-CAL-BREAK-1-5,
              :QSPA-CAL-RATETYPE-2,
              :QSPA-CAL-BREAKTYPE-2,
              :QSPA-CAL-CHGABLE-2,
              :QSPA-CAL-NORATES-2,
              :QSPA-CAL-TBFRMLA-2,
              :QSPA-CAL-RATE-2-1,
              :QSPA-CAL-BREAK-2-1,
              :QSPA-CAL-RATE-2-2,
              :QSPA-CAL-BREAK-2-2,
              :QSPA-CAL-RATE-2-3,
              :QSPA-CAL-BREAK-2-3,
              :QSPA-CAL-RATE-2-4,
              :QSPA-CAL-BREAK-2-4,
              :QSPA-CAL-RATE-2-5,
              :QSPA-CAL-BREAK-2-5,
              :QSPA-MINSF-FRMLA,
              :QSPA-MINSF-CHG,
              :QSPA-MAXAPR-FRMLA,
              :QSPA-EDT-NOEDITS-1,
              :QSPA-EDT-TYPE-1-1,
              :QSPA-EDT-HL-1-1,
              :QSPA-EDT-COLL-1-1,
              :QSPA-EDT-CD-1-1,
              :QSPA-EDT-RATE-1-1,
              :QSPA-EDT-RATETYPE-1-1,
              :QSPA-EDT-AMT-1-1,
              :QSPA-EDT-AMTYPE-1-1,
              :QSPA-EDT-TERM-1-1,
              :QSPA-EDT-TYPE-1-2,
              :QSPA-EDT-HL-1-2,
              :QSPA-EDT-COLL-1-2,
              :QSPA-EDT-CD-1-2,
              :QSPA-EDT-RATE-1-2,
              :QSPA-EDT-RATETYPE-1-2,
              :QSPA-EDT-AMT-1-2,
              :QSPA-EDT-AMTYPE-1-2,
              :QSPA-EDT-TERM-1-2,
              :QSPA-EDT-TYPE-1-3,
              :QSPA-EDT-HL-1-3,
              :QSPA-EDT-COLL-1-3,
              :QSPA-EDT-CD-1-3,
              :QSPA-EDT-RATE-1-3,
              :QSPA-EDT-RATETYPE-1-3,
              :QSPA-EDT-AMT-1-3,
              :QSPA-EDT-AMTYPE-1-3,
              :QSPA-EDT-TERM-1-3,
              :QSPA-EDT-TYPE-1-4,
              :QSPA-EDT-HL-1-4,
              :QSPA-EDT-COLL-1-4,
              :QSPA-EDT-CD-1-4,
              :QSPA-EDT-RATE-1-4,
              :QSPA-EDT-RATETYPE-1-4,
              :QSPA-EDT-AMT-1-4,
              :QSPA-EDT-AMTYPE-1-4,
              :QSPA-EDT-TERM-1-4,
              :QSPA-EDT-TYPE-1-5,
              :QSPA-EDT-HL-1-5,
              :QSPA-EDT-COLL-1-5,
              :QSPA-EDT-CD-1-5,
              :QSPA-EDT-RATE-1-5,
              :QSPA-EDT-RATETYPE-1-5,
              :QSPA-EDT-AMT-1-5,
              :QSPA-EDT-AMTYPE-1-5,
              :QSPA-EDT-TERM-1-5,
              :QSPA-EDT-TYPE-1-6,
              :QSPA-EDT-HL-1-6,
              :QSPA-EDT-COLL-1-6,
              :QSPA-EDT-CD-1-6,
              :QSPA-EDT-RATE-1-6,
              :QSPA-EDT-RATETYPE-1-6,
              :QSPA-EDT-AMT-1-6,
              :QSPA-EDT-AMTYPE-1-6,
              :QSPA-EDT-TERM-1-6,
              :QSPA-EDT-NOEDITS-2,
              :QSPA-EDT-TYPE-2-1,
              :QSPA-EDT-HL-2-1,
              :QSPA-EDT-COLL-2-1,
              :QSPA-EDT-CD-2-1,
              :QSPA-EDT-RATE-2-1,
              :QSPA-EDT-RATETYPE-2-1,
              :QSPA-EDT-AMT-2-1,
              :QSPA-EDT-AMTYPE-2-1,
              :QSPA-EDT-TERM-2-1,
              :QSPA-EDT-TYPE-2-2,
              :QSPA-EDT-HL-2-2,
              :QSPA-EDT-COLL-2-2,
              :QSPA-EDT-CD-2-2,
              :QSPA-EDT-RATE-2-2,
              :QSPA-EDT-RATETYPE-2-2,
              :QSPA-EDT-AMT-2-2,
              :QSPA-EDT-AMTYPE-2-2,
              :QSPA-EDT-TERM-2-2,
              :QSPA-EDT-TYPE-2-3,
              :QSPA-EDT-HL-2-3,
              :QSPA-EDT-COLL-2-3,
              :QSPA-EDT-CD-2-3,
              :QSPA-EDT-RATE-2-3,
              :QSPA-EDT-RATETYPE-2-3,
              :QSPA-EDT-AMT-2-3,
              :QSPA-EDT-AMTYPE-2-3,
              :QSPA-EDT-TERM-2-3,
              :QSPA-EDT-TYPE-2-4,
              :QSPA-EDT-HL-2-4,
              :QSPA-EDT-COLL-2-4,
              :QSPA-EDT-CD-2-4,
              :QSPA-EDT-RATE-2-4,
              :QSPA-EDT-RATETYPE-2-4,
              :QSPA-EDT-AMT-2-4,
              :QSPA-EDT-AMTYPE-2-4,
              :QSPA-EDT-TERM-2-4,
              :QSPA-EDT-TYPE-2-5,
              :QSPA-EDT-HL-2-5,
              :QSPA-EDT-COLL-2-5,
              :QSPA-EDT-CD-2-5,
              :QSPA-EDT-RATE-2-5,
              :QSPA-EDT-RATETYPE-2-5,
              :QSPA-EDT-AMT-2-5,
              :QSPA-EDT-AMTYPE-2-5,
              :QSPA-EDT-TERM-2-5,
              :QSPA-EDT-TYPE-2-6,
              :QSPA-EDT-HL-2-6,
              :QSPA-EDT-COLL-2-6,
              :QSPA-EDT-CD-2-6,
              :QSPA-EDT-RATE-2-6,
              :QSPA-EDT-RATETYPE-2-6,
              :QSPA-EDT-AMT-2-6,
              :QSPA-EDT-AMTYPE-2-6,
              :QSPA-EDT-TERM-2-6)
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO WRITE-SPA1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-----------------------------------------------------------------
       REWRITE-SPA1-FILE.

           ACCEPT SPA-LTOUCH-DATE FROM CENTURY-DATE.
           PERFORM REWRITE-IT.
           MOVE SPA-PATH-SQL    TO E-FILE.
           MOVE SPA1-KEY        TO E-KEYX.
           PERFORM SET-SPA-FIELDS.

           EXEC SQL
            UPDATE DBO.SPAFILE
             SET
              SPAFILE.SPA_ORGST = :QSPA-ORGST,
              SPAFILE.SPA_SPRCLASS = :QSPA-SPRCLASS,
              SPAFILE.SPA_SUBCLASS = :QSPA-SUBCLASS,
              SPAFILE.SPA_LAWCODE = :QSPA-LAWCODE,
              SPAFILE.SPA_LTOUCH_DATE =
                 :QSPA-LTOUCH-DATE,
              SPAFILE.SPA_DESC = :QSPA-DESC,
              SPAFILE.SPA_NOTES = :QSPA-NOTES,
              SPAFILE.SPA_EFFDATE = :QSPA-EFFDATE,
              SPAFILE.SPA_EXPDATE = :QSPA-EXPDATE,
              SPAFILE.SPA_EXPD_MONTHS = :QSPA-EXPD-MONTHS,
              SPAFILE.SPA_EXPD_DAYS = :QSPA-EXPD-DAYS,
              SPAFILE.SPA_EXPD_FRMLA = :QSPA-EXPD-FRMLA,
              SPAFILE.SPA_EXPD_EXCEPT = :QSPA-EXPD-EXCEPT,
              SPAFILE.SPA_EXPR_FRMLA = :QSPA-EXPR-FRMLA,
              SPAFILE.SPA_EXPR_REDU_FRMLA = :QSPA-EXPR-REDU-FRMLA,
              SPAFILE.SPA_EXPR_RATE_1 = :QSPA-EXPR-RATE-1,
              SPAFILE.SPA_EXPR_BREAK_1 = :QSPA-EXPR-BREAK-1,
              SPAFILE.SPA_EXPR_YRTYPE_1 = :QSPA-EXPR-YRTYPE-1,
              SPAFILE.SPA_EXPR_INTMETH_1 = :QSPA-EXPR-INTMETH-1,
              SPAFILE.SPA_EXPR_RATE_2 = :QSPA-EXPR-RATE-2,
              SPAFILE.SPA_EXPR_BREAK_2 = :QSPA-EXPR-BREAK-2,
              SPAFILE.SPA_EXPR_YRTYPE_2 = :QSPA-EXPR-YRTYPE-2,
              SPAFILE.SPA_EXPR_INTMETH_2 = :QSPA-EXPR-INTMETH-2,
              SPAFILE.SPA_EXPR_RATE_3 = :QSPA-EXPR-RATE-3,
              SPAFILE.SPA_EXPR_BREAK_3 = :QSPA-EXPR-BREAK-3,
              SPAFILE.SPA_EXPR_YRTYPE_3 = :QSPA-EXPR-YRTYPE-3,
              SPAFILE.SPA_EXPR_INTMETH_3 = :QSPA-EXPR-INTMETH-3,
              SPAFILE.SPA_EXPR_RATE_4 = :QSPA-EXPR-RATE-4,
              SPAFILE.SPA_EXPR_BREAK_4 = :QSPA-EXPR-BREAK-4,
              SPAFILE.SPA_EXPR_YRTYPE_4 = :QSPA-EXPR-YRTYPE-4,
              SPAFILE.SPA_EXPR_INTMETH_4 = :QSPA-EXPR-INTMETH-4,
              SPAFILE.SPA_EXPR_RATE_5 = :QSPA-EXPR-RATE-5,
              SPAFILE.SPA_EXPR_BREAK_5 = :QSPA-EXPR-BREAK-5,
              SPAFILE.SPA_EXPR_YRTYPE_5 = :QSPA-EXPR-YRTYPE-5,
              SPAFILE.SPA_EXPR_INTMETH_5 = :QSPA-EXPR-INTMETH-5,
              SPAFILE.SPA_EXPR_LCHG = :QSPA-EXPR-LCHG,
              SPAFILE.SPA_JUDGFRMLA = :QSPA-JUDGFRMLA,
              SPAFILE.SPA_JUDGRATE = :QSPA-JUDGRATE,
              SPAFILE.SPA_JUDGYRTYPE = :QSPA-JUDGYRTYPE,
              SPAFILE.SPA_JUDGINTMETH = :QSPA-JUDGINTMETH,
              SPAFILE.SPA_ACC_FRMLA = :QSPA-ACC-FRMLA,
              SPAFILE.SPA_ACC_YRTYPE = :QSPA-ACC-YRTYPE,
              SPAFILE.SPA_ACC_INTMETH = :QSPA-ACC-INTMETH,
              SPAFILE.SPA_ACC_RATE_1 = :QSPA-ACC-RATE-1,
              SPAFILE.SPA_ACC_BREAK_1 = :QSPA-ACC-BREAK-1,
              SPAFILE.SPA_ACC_RATE_2 = :QSPA-ACC-RATE-2,
              SPAFILE.SPA_ACC_BREAK_2 = :QSPA-ACC-BREAK-2,
              SPAFILE.SPA_ACC_RATE_3 = :QSPA-ACC-RATE-3,
              SPAFILE.SPA_ACC_BREAK_3 = :QSPA-ACC-BREAK-3,
              SPAFILE.SPA_ACC_RATE_4 = :QSPA-ACC-RATE-4,
              SPAFILE.SPA_ACC_BREAK_4 = :QSPA-ACC-BREAK-4,
              SPAFILE.SPA_ACC_RATE_5 = :QSPA-ACC-RATE-5,
              SPAFILE.SPA_ACC_BREAK_5 = :QSPA-ACC-BREAK-5,
              SPAFILE.SPA_1098FRMLA = :QSPA-1098FRMLA,
              SPAFILE.SPA_DISFRMLA = :QSPA-DISFRMLA,
              SPAFILE.SPA_CONTRFRMLA = :QSPA-CONTRFRMLA,
              SPAFILE.SPA_BANKRULE = :QSPA-BANKRULE,
              SPAFILE.SPA_CONTPDTH = :QSPA-CONTPDTH,
              SPAFILE.SPA_FINCHG = :QSPA-FINCHG,
              SPAFILE.SPA_BANKUNITPER_CD = :QSPA-BANKUNITPER-CD,
              SPAFILE.SPA_TRWBANKRULE = :QSPA-TRWBANKRULE,
              SPAFILE.SPA_TRWCONTPDTH = :QSPA-TRWCONTPDTH,
              SPAFILE.SPA_TRWBANKUNITPER_CD =
                   :QSPA-TRWBANKUNITPER-CD,
              SPAFILE.SPA_RECFRMLA = :QSPA-RECFRMLA,
              SPAFILE.SPA_RECPAYCD = :QSPA-RECPAYCD,
              SPAFILE.SPA_RECPDTH = :QSPA-RECPDTH,
              SPAFILE.SPA_DISFRMLA_SPAY_FG =
                   :QSPA-DISFRMLA-SPAY-FG,
              SPAFILE.SPA_ERNFRMLA_1 = :QSPA-ERNFRMLA-1,
              SPAFILE.SPA_ERNAMT_1 = :QSPA-ERNAMT-1,
              SPAFILE.SPA_ERNPERCT_1 = :QSPA-ERNPERCT-1,
              SPAFILE.SPA_ERNPERCD_1 = :QSPA-ERNPERCD-1,
              SPAFILE.SPA_ERNACCRL_FG_1 = :QSPA-ERNACCRL-FG-1,
              SPAFILE.SPA_ERNACCRL_START_CD_1 =
                   :QSPA-ERNACCRL-START-CD-1,
              SPAFILE.SPA_ERNACCRL_DFCD_1 = :QSPA-ERNACCRL-DFCD-1,
              SPAFILE.SPA_ERN_DAYS_1 = :QSPA-ERN-DAYS-1,
              SPAFILE.SPA_ERN_TERM_1 = :QSPA-ERN-TERM-1,
              SPAFILE.SPA_ERN_TYPE_1 = :QSPA-ERN-TYPE-1,
              SPAFILE.SPA_ERNFRMLA_2 = :QSPA-ERNFRMLA-2,
              SPAFILE.SPA_ERNAMT_2 = :QSPA-ERNAMT-2,
              SPAFILE.SPA_ERNPERCT_2 = :QSPA-ERNPERCT-2,
              SPAFILE.SPA_ERNPERCD_2 = :QSPA-ERNPERCD-2,
              SPAFILE.SPA_ERNACCRL_FG_2 = :QSPA-ERNACCRL-FG-2,
              SPAFILE.SPA_ERNACCRL_START_CD_2 =
                   :QSPA-ERNACCRL-START-CD-2,
              SPAFILE.SPA_ERNACCRL_DFCD_2 = :QSPA-ERNACCRL-DFCD-2,
              SPAFILE.SPA_ERN_DAYS_2 = :QSPA-ERN-DAYS-2,
              SPAFILE.SPA_ERN_TERM_2 = :QSPA-ERN-TERM-2,
              SPAFILE.SPA_ERN_TYPE_2 = :QSPA-ERN-TYPE-2,
              SPAFILE.SPA_ERNFRMLA_3 = :QSPA-ERNFRMLA-3,
              SPAFILE.SPA_ERNAMT_3 = :QSPA-ERNAMT-3,
              SPAFILE.SPA_ERNPERCT_3 = :QSPA-ERNPERCT-3,
              SPAFILE.SPA_ERNPERCD_3 = :QSPA-ERNPERCD-3,
              SPAFILE.SPA_ERNACCRL_FG_3 = :QSPA-ERNACCRL-FG-3,
              SPAFILE.SPA_ERNACCRL_START_CD_3 =
                   :QSPA-ERNACCRL-START-CD-3,
              SPAFILE.SPA_ERNACCRL_DFCD_3 = :QSPA-ERNACCRL-DFCD-3,
              SPAFILE.SPA_ERN_DAYS_3 = :QSPA-ERN-DAYS-3,
              SPAFILE.SPA_ERN_TERM_3 = :QSPA-ERN-TERM-3,
              SPAFILE.SPA_ERN_TYPE_3 = :QSPA-ERN-TYPE-3,
              SPAFILE.SPA_ERNFRMLA_4 = :QSPA-ERNFRMLA-4,
              SPAFILE.SPA_ERNAMT_4 = :QSPA-ERNAMT-4,
              SPAFILE.SPA_ERNPERCT_4 = :QSPA-ERNPERCT-4,
              SPAFILE.SPA_ERNPERCD_4 = :QSPA-ERNPERCD-4,
              SPAFILE.SPA_ERNACCRL_FG_4 = :QSPA-ERNACCRL-FG-4,
              SPAFILE.SPA_ERNACCRL_START_CD_4 =
                   :QSPA-ERNACCRL-START-CD-4,
              SPAFILE.SPA_ERNACCRL_DFCD_4 = :QSPA-ERNACCRL-DFCD-4,
              SPAFILE.SPA_ERN_DAYS_4 = :QSPA-ERN-DAYS-4,
              SPAFILE.SPA_ERN_TERM_4 = :QSPA-ERN-TERM-4,
              SPAFILE.SPA_ERN_TYPE_4 = :QSPA-ERN-TYPE-4,
              SPAFILE.SPA_ERNFRMLA_5 = :QSPA-ERNFRMLA-5,
              SPAFILE.SPA_ERNAMT_5 = :QSPA-ERNAMT-5,
              SPAFILE.SPA_ERNPERCT_5 = :QSPA-ERNPERCT-5,
              SPAFILE.SPA_ERNPERCD_5 = :QSPA-ERNPERCD-5,
              SPAFILE.SPA_ERNACCRL_FG_5 = :QSPA-ERNACCRL-FG-5,
              SPAFILE.SPA_ERNACCRL_START_CD_5 =
                   :QSPA-ERNACCRL-START-CD-5,
              SPAFILE.SPA_ERNACCRL_DFCD_5 = :QSPA-ERNACCRL-DFCD-5,
              SPAFILE.SPA_ERN_DAYS_5 = :QSPA-ERN-DAYS-5,
              SPAFILE.SPA_ERN_TERM_5 = :QSPA-ERN-TERM-5,
              SPAFILE.SPA_ERN_TYPE_5 = :QSPA-ERN-TYPE-5,
              SPAFILE.SPA_ERNFRMLA_6 = :QSPA-ERNFRMLA-6,
              SPAFILE.SPA_ERNAMT_6 = :QSPA-ERNAMT-6,
              SPAFILE.SPA_ERNPERCT_6 = :QSPA-ERNPERCT-6,
              SPAFILE.SPA_ERNPERCD_6 = :QSPA-ERNPERCD-6,
              SPAFILE.SPA_ERNACCRL_FG_6 = :QSPA-ERNACCRL-FG-6,
              SPAFILE.SPA_ERNACCRL_START_CD_6 =
                   :QSPA-ERNACCRL-START-CD-6,
              SPAFILE.SPA_ERNACCRL_DFCD_6 = :QSPA-ERNACCRL-DFCD-6,
              SPAFILE.SPA_ERN_DAYS_6 = :QSPA-ERN-DAYS-6,
              SPAFILE.SPA_ERN_TERM_6 = :QSPA-ERN-TERM-6,
              SPAFILE.SPA_ERN_TYPE_6 = :QSPA-ERN-TYPE-6,
              SPAFILE.SPA_ERNFRMLA_7 = :QSPA-ERNFRMLA-7,
              SPAFILE.SPA_ERNAMT_7 = :QSPA-ERNAMT-7,
              SPAFILE.SPA_ERNPERCT_7 = :QSPA-ERNPERCT-7,
              SPAFILE.SPA_ERNPERCD_7 = :QSPA-ERNPERCD-7,
              SPAFILE.SPA_ERNACCRL_FG_7 = :QSPA-ERNACCRL-FG-7,
              SPAFILE.SPA_ERNACCRL_START_CD_7 =
                   :QSPA-ERNACCRL-START-CD-7,
              SPAFILE.SPA_ERNACCRL_DFCD_7 = :QSPA-ERNACCRL-DFCD-7,
              SPAFILE.SPA_ERN_DAYS_7 = :QSPA-ERN-DAYS-7,
              SPAFILE.SPA_ERN_TERM_7 = :QSPA-ERN-TERM-7,
              SPAFILE.SPA_ERN_TYPE_7 = :QSPA-ERN-TYPE-7,
              SPAFILE.SPA_ERNFRMLA_8 = :QSPA-ERNFRMLA-8,
              SPAFILE.SPA_ERNAMT_8 = :QSPA-ERNAMT-8,
              SPAFILE.SPA_ERNPERCT_8 = :QSPA-ERNPERCT-8,
              SPAFILE.SPA_ERNPERCD_8 = :QSPA-ERNPERCD-8,
              SPAFILE.SPA_ERNACCRL_FG_8 = :QSPA-ERNACCRL-FG-8,
              SPAFILE.SPA_ERNACCRL_START_CD_8 =
                   :QSPA-ERNACCRL-START-CD-8,
              SPAFILE.SPA_ERNACCRL_DFCD_8 = :QSPA-ERNACCRL-DFCD-8,
              SPAFILE.SPA_ERN_DAYS_8 = :QSPA-ERN-DAYS-8,
              SPAFILE.SPA_ERN_TERM_8 = :QSPA-ERN-TERM-8,
              SPAFILE.SPA_ERN_TYPE_8 = :QSPA-ERN-TYPE-8,
              SPAFILE.SPA_ERNFRMLA_9 = :QSPA-ERNFRMLA-9,
              SPAFILE.SPA_ERNAMT_9 = :QSPA-ERNAMT-9,
              SPAFILE.SPA_ERNPERCT_9 = :QSPA-ERNPERCT-9,
              SPAFILE.SPA_ERNPERCD_9 = :QSPA-ERNPERCD-9,
              SPAFILE.SPA_ERNACCRL_FG_9 = :QSPA-ERNACCRL-FG-9,
              SPAFILE.SPA_ERNACCRL_START_CD_9 =
                   :QSPA-ERNACCRL-START-CD-9,
              SPAFILE.SPA_ERNACCRL_DFCD_9 = :QSPA-ERNACCRL-DFCD-9,
              SPAFILE.SPA_ERN_DAYS_9 = :QSPA-ERN-DAYS-9,
              SPAFILE.SPA_ERN_TERM_9 = :QSPA-ERN-TERM-9,
              SPAFILE.SPA_ERN_TYPE_9 = :QSPA-ERN-TYPE-9,
              SPAFILE.SPA_ERNFRMLA_10 = :QSPA-ERNFRMLA-10,
              SPAFILE.SPA_ERNAMT_10 = :QSPA-ERNAMT-10,
              SPAFILE.SPA_ERNPERCT_10 = :QSPA-ERNPERCT-10,
              SPAFILE.SPA_ERNPERCD_10 = :QSPA-ERNPERCD-10,
              SPAFILE.SPA_ERNACCRL_FG_10 = :QSPA-ERNACCRL-FG-10,
              SPAFILE.SPA_ERNACCRL_START_CD_10 =
                   :QSPA-ERNACCRL-START-CD-10,
              SPAFILE.SPA_ERNACCRL_DFCD_10 =
                   :QSPA-ERNACCRL-DFCD-10,
              SPAFILE.SPA_ERN_DAYS_10 = :QSPA-ERN-DAYS-10,
              SPAFILE.SPA_ERN_TERM_10 = :QSPA-ERN-TERM-10,
              SPAFILE.SPA_ERN_TYPE_10 = :QSPA-ERN-TYPE-10,
              SPAFILE.SPA_ERNACCEL_CD = :QSPA-ERNACCEL-CD,
              SPAFILE.SPA_ERNJD_CD = :QSPA-ERNJD-CD,
              SPAFILE.SPA_MIDSTRERNCD = :QSPA-MIDSTRERNCD,
              SPAFILE.SPA_EARN_ORDER_1 = :QSPA-EARN-ORDER-1,
              SPAFILE.SPA_EARN_ORDER_2 = :QSPA-EARN-ORDER-2,
              SPAFILE.SPA_EARN_ORDER_3 = :QSPA-EARN-ORDER-3,
              SPAFILE.SPA_EARN_ORDER_4 = :QSPA-EARN-ORDER-4,
              SPAFILE.SPA_EARN_ORDER_5 = :QSPA-EARN-ORDER-5,
              SPAFILE.SPA_EARN_ORDER_6 = :QSPA-EARN-ORDER-6,
              SPAFILE.SPA_EARN_ORDER_7 = :QSPA-EARN-ORDER-7,
              SPAFILE.SPA_EARN_ORDER_8 = :QSPA-EARN-ORDER-8,
              SPAFILE.SPA_EARN_ORDER_9 = :QSPA-EARN-ORDER-9,
              SPAFILE.SPA_EARN_ORDER_10 = :QSPA-EARN-ORDER-10,
              SPAFILE.SPA_ERNDELQFRMLA = :QSPA-ERNDELQFRMLA,
              SPAFILE.SPA_ERNDELQ_START = :QSPA-ERNDELQ-START,
              SPAFILE.SPA_ERNDELQ_STOP = :QSPA-ERNDELQ-STOP,
              SPAFILE.SPA_1098_INC_LC = :QSPA-1098-INC-LC,
              SPAFILE.SPA_MAX_IB_ACR_DAYS = :QSPA-MAX-IB-ACR-DAYS,
              SPAFILE.SPA_LCGRACE = :QSPA-LCGRACE,
              SPAFILE.SPA_LCGRACECD = :QSPA-LCGRACECD,
              SPAFILE.SPA_LCTYPE = :QSPA-LCTYPE,
              SPAFILE.SPA_LCRATE = :QSPA-LCRATE,
              SPAFILE.SPA_LCFRMLA = :QSPA-LCFRMLA,
              SPAFILE.SPA_LCMINCHG = :QSPA-LCMINCHG,
              SPAFILE.SPA_LCMAXAMT = :QSPA-LCMAXAMT,
              SPAFILE.SPA_LCDELFAC = :QSPA-LCDELFAC,
              SPAFILE.SPA_LCYRTYPE = :QSPA-LCYRTYPE,
              SPAFILE.SPA_LC_CODE = :QSPA-LC-CODE,
              SPAFILE.SPA_LCUNITPER_CD = :QSPA-LCUNITPER-CD,
              SPAFILE.SPA_DEFFRMLA = :QSPA-DEFFRMLA,
              SPAFILE.SPA_DEFEXCEPT = :QSPA-DEFEXCEPT,
              SPAFILE.SPA_DEFWORKER = :QSPA-DEFWORKER,
              SPAFILE.SPA_DEFPERCD = :QSPA-DEFPERCD,
              SPAFILE.SPA_DEFBASE = :QSPA-DEFBASE,
              SPAFILE.SPA_DEFPOLCD = :QSPA-DEFPOLCD,
              SPAFILE.SPA_DEFPOLMX_1 = :QSPA-DEFPOLMX-1,
              SPAFILE.SPA_DEFPOLMX_2 = :QSPA-DEFPOLMX-2,
              SPAFILE.SPA_DEFPOLMX_3 = :QSPA-DEFPOLMX-3,
              SPAFILE.SPA_DEFMIN = :QSPA-DEFMIN,
              SPAFILE.SPA_DEFMAX = :QSPA-DEFMAX,
              SPAFILE.SPA_DEFUNITPER_CD = :QSPA-DEFUNITPER-CD,
              SPAFILE.SPA_PRFORM_1 = :QSPA-PRFORM-1,
              SPAFILE.SPA_PRFLAG_1 = :QSPA-PRFLAG-1,
              SPAFILE.SPA_PRFORM_2 = :QSPA-PRFORM-2,
              SPAFILE.SPA_PRFLAG_2 = :QSPA-PRFLAG-2,
              SPAFILE.SPA_PRFORM_3 = :QSPA-PRFORM-3,
              SPAFILE.SPA_PRFLAG_3 = :QSPA-PRFLAG-3,
              SPAFILE.SPA_PRFORM_4 = :QSPA-PRFORM-4,
              SPAFILE.SPA_PRFLAG_4 = :QSPA-PRFLAG-4,
              SPAFILE.SPA_PRFORM_5 = :QSPA-PRFORM-5,
              SPAFILE.SPA_PRFLAG_5 = :QSPA-PRFLAG-5,
              SPAFILE.SPA_PRFORM_6 = :QSPA-PRFORM-6,
              SPAFILE.SPA_PRFLAG_6 = :QSPA-PRFLAG-6,
              SPAFILE.SPA_PRFORM_7 = :QSPA-PRFORM-7,
              SPAFILE.SPA_PRFLAG_7 = :QSPA-PRFLAG-7,
              SPAFILE.SPA_PRFORM_8 = :QSPA-PRFORM-8,
              SPAFILE.SPA_PRFLAG_8 = :QSPA-PRFLAG-8,
              SPAFILE.SPA_PRFORM_9 = :QSPA-PRFORM-9,
              SPAFILE.SPA_PRFLAG_9 = :QSPA-PRFLAG-9,
              SPAFILE.SPA_PRFORM_10 = :QSPA-PRFORM-10,
              SPAFILE.SPA_PRFLAG_10 = :QSPA-PRFLAG-10,
              SPAFILE.SPA_PRFORM_11 = :QSPA-PRFORM-11,
              SPAFILE.SPA_PRFLAG_11 = :QSPA-PRFLAG-11,
              SPAFILE.SPA_PRFORM_12 = :QSPA-PRFORM-12,
              SPAFILE.SPA_PRFLAG_12 = :QSPA-PRFLAG-12,
              SPAFILE.SPA_PRFORM_13 = :QSPA-PRFORM-13,
              SPAFILE.SPA_PRFLAG_13 = :QSPA-PRFLAG-13,
              SPAFILE.SPA_PRFORM_14 = :QSPA-PRFORM-14,
              SPAFILE.SPA_PRFLAG_14 = :QSPA-PRFLAG-14,
              SPAFILE.SPA_PRFORM_15 = :QSPA-PRFORM-15,
              SPAFILE.SPA_PRFLAG_15 = :QSPA-PRFLAG-15,
              SPAFILE.SPA_PRFORM_16 = :QSPA-PRFORM-16,
              SPAFILE.SPA_PRFLAG_16 = :QSPA-PRFLAG-16,
              SPAFILE.SPA_PRFORM_17 = :QSPA-PRFORM-17,
              SPAFILE.SPA_PRFLAG_17 = :QSPA-PRFLAG-17,
              SPAFILE.SPA_PRFORM_18 = :QSPA-PRFORM-18,
              SPAFILE.SPA_PRFLAG_18 = :QSPA-PRFLAG-18,
              SPAFILE.SPA_PRFORM_19 = :QSPA-PRFORM-19,
              SPAFILE.SPA_PRFLAG_19 = :QSPA-PRFLAG-19,
              SPAFILE.SPA_PRFORM_20 = :QSPA-PRFORM-20,
              SPAFILE.SPA_PRFLAG_20 = :QSPA-PRFLAG-20,
              SPAFILE.SPA_IMED_REC = :QSPA-IMED-REC,
              SPAFILE.SPA_SCFRMLA = :QSPA-SCFRMLA,
              SPAFILE.SPA_SCRATE = :QSPA-SCRATE,
              SPAFILE.SPA_SCMIN = :QSPA-SCMIN,
              SPAFILE.SPA_SCMAX = :QSPA-SCMAX,
              SPAFILE.SPA_MFFRMLA = :QSPA-MFFRMLA,
              SPAFILE.SPA_MFRATE = :QSPA-MFRATE,
              SPAFILE.SPA_MFMIN = :QSPA-MFMIN,
              SPAFILE.SPA_MFMAX = :QSPA-MFMAX,
              SPAFILE.SPA_INTMETHOD = :QSPA-INTMETHOD,
              SPAFILE.SPA_YEARTYPE = :QSPA-YEARTYPE,
              SPAFILE.SPA_PYEXFRMLA = :QSPA-PYEXFRMLA,
              SPAFILE.SPA_PYEXSPCODE = :QSPA-PYEXSPCODE,
              SPAFILE.SPA_PYEXYEARTP = :QSPA-PYEXYEARTP,
              SPAFILE.SPA_PYEXFMDATE = :QSPA-PYEXFMDATE,
              SPAFILE.SPA_PYEXBASECD = :QSPA-PYEXBASECD,
              SPAFILE.SPA_PYEXBASE = :QSPA-PYEXBASE,
              SPAFILE.SPA_PYEXDAYS = :QSPA-PYEXDAYS,
              SPAFILE.SPA_CAL_SPFRMLA = :QSPA-CAL-SPFRMLA,
              SPAFILE.SPA_CAL_RATETYPE_1 = :QSPA-CAL-RATETYPE-1,
              SPAFILE.SPA_CAL_BREAKTYPE_1 = :QSPA-CAL-BREAKTYPE-1,
              SPAFILE.SPA_CAL_CHGABLE_1 = :QSPA-CAL-CHGABLE-1,
              SPAFILE.SPA_CAL_NORATES_1 = :QSPA-CAL-NORATES-1,
              SPAFILE.SPA_CAL_TBFRMLA_1 = :QSPA-CAL-TBFRMLA-1,
              SPAFILE.SPA_CAL_RATE_1_1 = :QSPA-CAL-RATE-1-1,
              SPAFILE.SPA_CAL_BREAK_1_1 = :QSPA-CAL-BREAK-1-1,
              SPAFILE.SPA_CAL_RATE_1_2 = :QSPA-CAL-RATE-1-2,
              SPAFILE.SPA_CAL_BREAK_1_2 = :QSPA-CAL-BREAK-1-2,
              SPAFILE.SPA_CAL_RATE_1_3 = :QSPA-CAL-RATE-1-3,
              SPAFILE.SPA_CAL_BREAK_1_3 = :QSPA-CAL-BREAK-1-3,
              SPAFILE.SPA_CAL_RATE_1_4 = :QSPA-CAL-RATE-1-4,
              SPAFILE.SPA_CAL_BREAK_1_4 = :QSPA-CAL-BREAK-1-4,
              SPAFILE.SPA_CAL_RATE_1_5 = :QSPA-CAL-RATE-1-5,
              SPAFILE.SPA_CAL_BREAK_1_5 = :QSPA-CAL-BREAK-1-5,
              SPAFILE.SPA_CAL_RATETYPE_2 = :QSPA-CAL-RATETYPE-2,
              SPAFILE.SPA_CAL_BREAKTYPE_2 = :QSPA-CAL-BREAKTYPE-2,
              SPAFILE.SPA_CAL_CHGABLE_2 = :QSPA-CAL-CHGABLE-2,
              SPAFILE.SPA_CAL_NORATES_2 = :QSPA-CAL-NORATES-2,
              SPAFILE.SPA_CAL_TBFRMLA_2 = :QSPA-CAL-TBFRMLA-2,
              SPAFILE.SPA_CAL_RATE_2_1 = :QSPA-CAL-RATE-2-1,
              SPAFILE.SPA_CAL_BREAK_2_1 = :QSPA-CAL-BREAK-2-1,
              SPAFILE.SPA_CAL_RATE_2_2 = :QSPA-CAL-RATE-2-2,
              SPAFILE.SPA_CAL_BREAK_2_2 = :QSPA-CAL-BREAK-2-2,
              SPAFILE.SPA_CAL_RATE_2_3 = :QSPA-CAL-RATE-2-3,
              SPAFILE.SPA_CAL_BREAK_2_3 = :QSPA-CAL-BREAK-2-3,
              SPAFILE.SPA_CAL_RATE_2_4 = :QSPA-CAL-RATE-2-4,
              SPAFILE.SPA_CAL_BREAK_2_4 = :QSPA-CAL-BREAK-2-4,
              SPAFILE.SPA_CAL_RATE_2_5 = :QSPA-CAL-RATE-2-5,
              SPAFILE.SPA_CAL_BREAK_2_5 = :QSPA-CAL-BREAK-2-5,
              SPAFILE.SPA_MINSF_FRMLA = :QSPA-MINSF-FRMLA,
              SPAFILE.SPA_MINSF_CHG = :QSPA-MINSF-CHG,
              SPAFILE.SPA_MAXAPR_FRMLA = :QSPA-MAXAPR-FRMLA,
              SPAFILE.SPA_EDT_NOEDITS_1 = :QSPA-EDT-NOEDITS-1,
              SPAFILE.SPA_EDT_TYPE_1_1 = :QSPA-EDT-TYPE-1-1,
              SPAFILE.SPA_EDT_HL_1_1 = :QSPA-EDT-HL-1-1,
              SPAFILE.SPA_EDT_COLL_1_1 = :QSPA-EDT-COLL-1-1,
              SPAFILE.SPA_EDT_CD_1_1 = :QSPA-EDT-CD-1-1,
              SPAFILE.SPA_EDT_RATE_1_1 = :QSPA-EDT-RATE-1-1,
              SPAFILE.SPA_EDT_RATETYPE_1_1 =
                   :QSPA-EDT-RATETYPE-1-1,
              SPAFILE.SPA_EDT_AMT_1_1 = :QSPA-EDT-AMT-1-1,
              SPAFILE.SPA_EDT_AMTYPE_1_1 = :QSPA-EDT-AMTYPE-1-1,
              SPAFILE.SPA_EDT_TERM_1_1 = :QSPA-EDT-TERM-1-1,
              SPAFILE.SPA_EDT_TYPE_1_2 = :QSPA-EDT-TYPE-1-2,
              SPAFILE.SPA_EDT_HL_1_2 = :QSPA-EDT-HL-1-2,
              SPAFILE.SPA_EDT_COLL_1_2 = :QSPA-EDT-COLL-1-2,
              SPAFILE.SPA_EDT_CD_1_2 = :QSPA-EDT-CD-1-2,
              SPAFILE.SPA_EDT_RATE_1_2 = :QSPA-EDT-RATE-1-2,
              SPAFILE.SPA_EDT_RATETYPE_1_2 =
                   :QSPA-EDT-RATETYPE-1-2,
              SPAFILE.SPA_EDT_AMT_1_2 = :QSPA-EDT-AMT-1-2,
              SPAFILE.SPA_EDT_AMTYPE_1_2 = :QSPA-EDT-AMTYPE-1-2,
              SPAFILE.SPA_EDT_TERM_1_2 = :QSPA-EDT-TERM-1-2,
              SPAFILE.SPA_EDT_TYPE_1_3 = :QSPA-EDT-TYPE-1-3,
              SPAFILE.SPA_EDT_HL_1_3 = :QSPA-EDT-HL-1-3,
              SPAFILE.SPA_EDT_COLL_1_3 = :QSPA-EDT-COLL-1-3,
              SPAFILE.SPA_EDT_CD_1_3 = :QSPA-EDT-CD-1-3,
              SPAFILE.SPA_EDT_RATE_1_3 = :QSPA-EDT-RATE-1-3,
              SPAFILE.SPA_EDT_RATETYPE_1_3 =
                   :QSPA-EDT-RATETYPE-1-3,
              SPAFILE.SPA_EDT_AMT_1_3 = :QSPA-EDT-AMT-1-3,
              SPAFILE.SPA_EDT_AMTYPE_1_3 = :QSPA-EDT-AMTYPE-1-3,
              SPAFILE.SPA_EDT_TERM_1_3 = :QSPA-EDT-TERM-1-3,
              SPAFILE.SPA_EDT_TYPE_1_4 = :QSPA-EDT-TYPE-1-4,
              SPAFILE.SPA_EDT_HL_1_4 = :QSPA-EDT-HL-1-4,
              SPAFILE.SPA_EDT_COLL_1_4 = :QSPA-EDT-COLL-1-4,
              SPAFILE.SPA_EDT_CD_1_4 = :QSPA-EDT-CD-1-4,
              SPAFILE.SPA_EDT_RATE_1_4 = :QSPA-EDT-RATE-1-4,
              SPAFILE.SPA_EDT_RATETYPE_1_4 =
                   :QSPA-EDT-RATETYPE-1-4,
              SPAFILE.SPA_EDT_AMT_1_4 = :QSPA-EDT-AMT-1-4,
              SPAFILE.SPA_EDT_AMTYPE_1_4 = :QSPA-EDT-AMTYPE-1-4,
              SPAFILE.SPA_EDT_TERM_1_4 = :QSPA-EDT-TERM-1-4,
              SPAFILE.SPA_EDT_TYPE_1_5 = :QSPA-EDT-TYPE-1-5,
              SPAFILE.SPA_EDT_HL_1_5 = :QSPA-EDT-HL-1-5,
              SPAFILE.SPA_EDT_COLL_1_5 = :QSPA-EDT-COLL-1-5,
              SPAFILE.SPA_EDT_CD_1_5 = :QSPA-EDT-CD-1-5,
              SPAFILE.SPA_EDT_RATE_1_5 = :QSPA-EDT-RATE-1-5,
              SPAFILE.SPA_EDT_RATETYPE_1_5 =
                   :QSPA-EDT-RATETYPE-1-5,
              SPAFILE.SPA_EDT_AMT_1_5 = :QSPA-EDT-AMT-1-5,
              SPAFILE.SPA_EDT_AMTYPE_1_5 = :QSPA-EDT-AMTYPE-1-5,
              SPAFILE.SPA_EDT_TERM_1_5 = :QSPA-EDT-TERM-1-5,
              SPAFILE.SPA_EDT_TYPE_1_6 = :QSPA-EDT-TYPE-1-6,
              SPAFILE.SPA_EDT_HL_1_6 = :QSPA-EDT-HL-1-6,
              SPAFILE.SPA_EDT_COLL_1_6 = :QSPA-EDT-COLL-1-6,
              SPAFILE.SPA_EDT_CD_1_6 = :QSPA-EDT-CD-1-6,
              SPAFILE.SPA_EDT_RATE_1_6 = :QSPA-EDT-RATE-1-6,
              SPAFILE.SPA_EDT_RATETYPE_1_6 =
                   :QSPA-EDT-RATETYPE-1-6,
              SPAFILE.SPA_EDT_AMT_1_6 = :QSPA-EDT-AMT-1-6,
              SPAFILE.SPA_EDT_AMTYPE_1_6 = :QSPA-EDT-AMTYPE-1-6,
              SPAFILE.SPA_EDT_TERM_1_6 = :QSPA-EDT-TERM-1-6,
              SPAFILE.SPA_EDT_NOEDITS_2 = :QSPA-EDT-NOEDITS-2,
              SPAFILE.SPA_EDT_TYPE_2_1 = :QSPA-EDT-TYPE-2-1,
              SPAFILE.SPA_EDT_HL_2_1 = :QSPA-EDT-HL-2-1,
              SPAFILE.SPA_EDT_COLL_2_1 = :QSPA-EDT-COLL-2-1,
              SPAFILE.SPA_EDT_CD_2_1 = :QSPA-EDT-CD-2-1,
              SPAFILE.SPA_EDT_RATE_2_1 = :QSPA-EDT-RATE-2-1,
              SPAFILE.SPA_EDT_RATETYPE_2_1 =
                   :QSPA-EDT-RATETYPE-2-1,
              SPAFILE.SPA_EDT_AMT_2_1 = :QSPA-EDT-AMT-2-1,
              SPAFILE.SPA_EDT_AMTYPE_2_1 = :QSPA-EDT-AMTYPE-2-1,
              SPAFILE.SPA_EDT_TERM_2_1 = :QSPA-EDT-TERM-2-1,
              SPAFILE.SPA_EDT_TYPE_2_2 = :QSPA-EDT-TYPE-2-2,
              SPAFILE.SPA_EDT_HL_2_2 = :QSPA-EDT-HL-2-2,
              SPAFILE.SPA_EDT_COLL_2_2 = :QSPA-EDT-COLL-2-2,
              SPAFILE.SPA_EDT_CD_2_2 = :QSPA-EDT-CD-2-2,
              SPAFILE.SPA_EDT_RATE_2_2 = :QSPA-EDT-RATE-2-2,
              SPAFILE.SPA_EDT_RATETYPE_2_2 =
                   :QSPA-EDT-RATETYPE-2-2,
              SPAFILE.SPA_EDT_AMT_2_2 = :QSPA-EDT-AMT-2-2,
              SPAFILE.SPA_EDT_AMTYPE_2_2 = :QSPA-EDT-AMTYPE-2-2,
              SPAFILE.SPA_EDT_TERM_2_2 = :QSPA-EDT-TERM-2-2,
              SPAFILE.SPA_EDT_TYPE_2_3 = :QSPA-EDT-TYPE-2-3,
              SPAFILE.SPA_EDT_HL_2_3 = :QSPA-EDT-HL-2-3,
              SPAFILE.SPA_EDT_COLL_2_3 = :QSPA-EDT-COLL-2-3,
              SPAFILE.SPA_EDT_CD_2_3 = :QSPA-EDT-CD-2-3,
              SPAFILE.SPA_EDT_RATE_2_3 = :QSPA-EDT-RATE-2-3,
              SPAFILE.SPA_EDT_RATETYPE_2_3 =
                   :QSPA-EDT-RATETYPE-2-3,
              SPAFILE.SPA_EDT_AMT_2_3 = :QSPA-EDT-AMT-2-3,
              SPAFILE.SPA_EDT_AMTYPE_2_3 = :QSPA-EDT-AMTYPE-2-3,
              SPAFILE.SPA_EDT_TERM_2_3 = :QSPA-EDT-TERM-2-3,
              SPAFILE.SPA_EDT_TYPE_2_4 = :QSPA-EDT-TYPE-2-4,
              SPAFILE.SPA_EDT_HL_2_4 = :QSPA-EDT-HL-2-4,
              SPAFILE.SPA_EDT_COLL_2_4 = :QSPA-EDT-COLL-2-4,
              SPAFILE.SPA_EDT_CD_2_4 = :QSPA-EDT-CD-2-4,
              SPAFILE.SPA_EDT_RATE_2_4 = :QSPA-EDT-RATE-2-4,
              SPAFILE.SPA_EDT_RATETYPE_2_4 =
                   :QSPA-EDT-RATETYPE-2-4,
              SPAFILE.SPA_EDT_AMT_2_4 = :QSPA-EDT-AMT-2-4,
              SPAFILE.SPA_EDT_AMTYPE_2_4 = :QSPA-EDT-AMTYPE-2-4,
              SPAFILE.SPA_EDT_TERM_2_4 = :QSPA-EDT-TERM-2-4,
              SPAFILE.SPA_EDT_TYPE_2_5 = :QSPA-EDT-TYPE-2-5,
              SPAFILE.SPA_EDT_HL_2_5 = :QSPA-EDT-HL-2-5,
              SPAFILE.SPA_EDT_COLL_2_5 = :QSPA-EDT-COLL-2-5,
              SPAFILE.SPA_EDT_CD_2_5 = :QSPA-EDT-CD-2-5,
              SPAFILE.SPA_EDT_RATE_2_5 = :QSPA-EDT-RATE-2-5,
              SPAFILE.SPA_EDT_RATETYPE_2_5 =
                   :QSPA-EDT-RATETYPE-2-5,
              SPAFILE.SPA_EDT_AMT_2_5 = :QSPA-EDT-AMT-2-5,
              SPAFILE.SPA_EDT_AMTYPE_2_5 = :QSPA-EDT-AMTYPE-2-5,
              SPAFILE.SPA_EDT_TERM_2_5 = :QSPA-EDT-TERM-2-5,
              SPAFILE.SPA_EDT_TYPE_2_6 = :QSPA-EDT-TYPE-2-6,
              SPAFILE.SPA_EDT_HL_2_6 = :QSPA-EDT-HL-2-6,
              SPAFILE.SPA_EDT_COLL_2_6 = :QSPA-EDT-COLL-2-6,
              SPAFILE.SPA_EDT_CD_2_6 = :QSPA-EDT-CD-2-6,
              SPAFILE.SPA_EDT_RATE_2_6 = :QSPA-EDT-RATE-2-6,
              SPAFILE.SPA_EDT_RATETYPE_2_6 =
                   :QSPA-EDT-RATETYPE-2-6,
              SPAFILE.SPA_EDT_AMT_2_6 = :QSPA-EDT-AMT-2-6,
              SPAFILE.SPA_EDT_AMTYPE_2_6 = :QSPA-EDT-AMTYPE-2-6,
              SPAFILE.SPA_EDT_TERM_2_6 = :QSPA-EDT-TERM-2-6
            WHERE SPAFILE.SPA_ORGST = :QSPA-ORGST
              AND SPAFILE.SPA_SPRCLASS = :QSPA-SPRCLASS
              AND SPAFILE.SPA_SUBCLASS = :QSPA-SUBCLASS
              AND SPAFILE.SPA_LAWCODE = :QSPA-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO REWRITE-SPA1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-----------------------------------------------------------------
       DELETE-SPA1-FILE.

           PERFORM DELETE-IT.
           MOVE SPA-PATH-SQL   TO E-FILE.
           MOVE SPA1-KEY       TO E-KEYX.
           PERFORM SET-SPA-FIELDS.

           EXEC SQL
            DELETE FROM DBO.SPAFILE
            WHERE SPAFILE.SPA_ORGST = :QSPA-ORGST
              AND SPAFILE.SPA_SPRCLASS = :QSPA-SPRCLASS
              AND SPAFILE.SPA_SUBCLASS = :QSPA-SUBCLASS
              AND SPAFILE.SPA_LAWCODE = :QSPA-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO DELETE-SPA1-FILE.

      *-----------------------------------------------------------------
       CLOSE-SPA1-FILE.
           IF ( SPA1-CURSOR-STAT-GOOD )
              EXEC SQL
                   CLOSE SPA1_CURSOR
              END-EXEC
              MOVE STAT---BAD TO SPA1-CURSOR-STAT.

           IF ( SPA1-CURSOR-NG-STAT-GOOD )
              EXEC SQL
                   CLOSE SPA1_CURSOR_NG
              END-EXEC
              MOVE STAT---BAD TO SPA1-CURSOR-NG-STAT.


      *=================================================================
       LOAD-SPB1-FILE.
      *- - - -{ SET OVERRIDE TO A "Y" TO NOT TOUCH THE PATH AT ALL  }- -
           IF ( SP-PATH-OVERRIDE = "Y" )
              NEXT SENTENCE
           ELSE
      *- - - -{ SPACES IS THE DEFAULT, NO CROSSING BRANCHES }- - - - - -
           IF ( SP-PATH-OVERRIDE = SPACES )
              MOVE EXT-FILPATH-BASE        TO SPB-ALL-BASE
              MOVE EXT-FILPATH-MACHINE     TO SPB-ALL-MACHINE
              MOVE SPB-ALL-PATH             TO SPB-PATH
           ELSE
      *- - - -{ USE BRANCH VALUES }- - - - - - - - - - - - - - - - - - -
           IF ( SP-PATH-OVERRIDE = "B" )
              MOVE FILPATH-BASE            TO SPB-ALL-BASE
              MOVE FILPATH-MACHINE         TO SPB-ALL-MACHINE
              MOVE SPB-ALL-PATH             TO SPB-PATH.

      *-----------------------------------------------------------------
       OPEN-SPB1-FILE.
           PERFORM LOAD-SPB1-FILE.
           PERFORM OPEN-IT.
           MOVE SPB-PATH-SQL TO E-FILE.

      *-----------------------------------------------------------------
       READ-SPB1-FILE.
           PERFORM READ-IT.
           MOVE SPB-PATH-SQL TO E-FILE.
           MOVE SPB1-KEY TO E-KEYX.

           MOVE SPB-ORGST            TO QSPB-ORGST.
           MOVE SPB-SPRCLASS         TO QSPB-SPRCLASS.
           MOVE SPB-SUBCLASS         TO QSPB-SUBCLASS.
           MOVE SPB-LAWCODE          TO QSPB-LAWCODE.

           EXEC SQL
            SELECT ISNULL(SPBFILE.SPB_ORGST,''),
                   SPBFILE.SPB_SPRCLASS,
                   SPBFILE.SPB_SUBCLASS,
                   SPBFILE.SPB_LAWCODE,
                   SPBFILE.SPB_INSCOM_1,
                   SPBFILE.SPB_INSRATECD_1,
                   SPBFILE.SPB_INSJFAC_1,
                   SPBFILE.SPB_INSDISCNT_1,
                   ISNULL(SPBFILE.SPB_INSCHGABL_1,''),
                   SPBFILE.SPB_INSTERM_1_1,
                   SPBFILE.SPB_INSRATE_1_1,
                   SPBFILE.SPB_INSTERM_1_2,
                   SPBFILE.SPB_INSRATE_1_2,
                   SPBFILE.SPB_INSTERM_1_3,
                   SPBFILE.SPB_INSRATE_1_3,
                   SPBFILE.SPB_INSTERM_1_4,
                   SPBFILE.SPB_INSRATE_1_4,
                   SPBFILE.SPB_INSTERM_1_5,
                   SPBFILE.SPB_INSRATE_1_5,
                   SPBFILE.SPB_INSTERM_1_6,
                   SPBFILE.SPB_INSRATE_1_6,
                   SPBFILE.SPB_INSTERM_1_7,
                   SPBFILE.SPB_INSRATE_1_7,
                   SPBFILE.SPB_INSTERM_1_8,
                   SPBFILE.SPB_INSRATE_1_8,
                   SPBFILE.SPB_INSTERM_1_9,
                   SPBFILE.SPB_INSRATE_1_9,
                   SPBFILE.SPB_INSTERM_1_10,
                   SPBFILE.SPB_INSRATE_1_10,
                   SPBFILE.SPB_INSTERM_1_11,
                   SPBFILE.SPB_INSRATE_1_11,
                   SPBFILE.SPB_INSTERM_1_12,
                   SPBFILE.SPB_INSRATE_1_12,
                   SPBFILE.SPB_INSTERM_1_13,
                   SPBFILE.SPB_INSRATE_1_13,
                   SPBFILE.SPB_INSTERM_1_14,
                   SPBFILE.SPB_INSRATE_1_14,
                   SPBFILE.SPB_INSTERM_1_15,
                   SPBFILE.SPB_INSRATE_1_15,
                   SPBFILE.SPB_INSTERM_1_16,
                   SPBFILE.SPB_INSRATE_1_16,
                   SPBFILE.SPB_INSTERM_1_17,
                   SPBFILE.SPB_INSRATE_1_17,
                   SPBFILE.SPB_INSTERM_1_18,
                   SPBFILE.SPB_INSRATE_1_18,
                   SPBFILE.SPB_INSTERM_1_19,
                   SPBFILE.SPB_INSRATE_1_19,
                   SPBFILE.SPB_INSTERM_1_20,
                   SPBFILE.SPB_INSRATE_1_20,
                   SPBFILE.SPB_INSMINPREM_1,
                   SPBFILE.SPB_INSMINCHGABL_1,
                   SPBFILE.SPB_INSMAXCHGABL_1,
                   SPBFILE.SPB_INSMAXBENIF_1,
                   SPBFILE.SPB_INSMAXTERM_1,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_1,''),
                   SPBFILE.SPB_INSEXCEPT_1,
                   SPBFILE.SPB_INSNOVER_1,
                   SPBFILE.SPB_INSMINAGE_1_1,
                   SPBFILE.SPB_INSMAXAGE_1_1,
                   SPBFILE.SPB_INSMAXCOV_1_1,
                   SPBFILE.SPB_INSMAXTRM_1_1,
                   SPBFILE.SPB_INSMINAGE_1_2,
                   SPBFILE.SPB_INSMAXAGE_1_2,
                   SPBFILE.SPB_INSMAXCOV_1_2,
                   SPBFILE.SPB_INSMAXTRM_1_2,
                   SPBFILE.SPB_INSMINAGE_1_3,
                   SPBFILE.SPB_INSMAXAGE_1_3,
                   SPBFILE.SPB_INSMAXCOV_1_3,
                   SPBFILE.SPB_INSMAXTRM_1_3,
                   SPBFILE.SPB_INSMINAGE_1_4,
                   SPBFILE.SPB_INSMAXAGE_1_4,
                   SPBFILE.SPB_INSMAXCOV_1_4,
                   SPBFILE.SPB_INSMAXTRM_1_4,
                   SPBFILE.SPB_INSMINAGE_1_5,
                   SPBFILE.SPB_INSMAXAGE_1_5,
                   SPBFILE.SPB_INSMAXCOV_1_5,
                   SPBFILE.SPB_INSMAXTRM_1_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_1,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_1,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_1,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_1,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_1,''),
                   SPBFILE.SPB_INSCOM_2,
                   SPBFILE.SPB_INSRATECD_2,
                   SPBFILE.SPB_INSJFAC_2,
                   SPBFILE.SPB_INSDISCNT_2,
                   ISNULL(SPBFILE.SPB_INSCHGABL_2,''),
                   SPBFILE.SPB_INSTERM_2_1,
                   SPBFILE.SPB_INSRATE_2_1,
                   SPBFILE.SPB_INSTERM_2_2,
                   SPBFILE.SPB_INSRATE_2_2,
                   SPBFILE.SPB_INSTERM_2_3,
                   SPBFILE.SPB_INSRATE_2_3,
                   SPBFILE.SPB_INSTERM_2_4,
                   SPBFILE.SPB_INSRATE_2_4,
                   SPBFILE.SPB_INSTERM_2_5,
                   SPBFILE.SPB_INSRATE_2_5,
                   SPBFILE.SPB_INSTERM_2_6,
                   SPBFILE.SPB_INSRATE_2_6,
                   SPBFILE.SPB_INSTERM_2_7,
                   SPBFILE.SPB_INSRATE_2_7,
                   SPBFILE.SPB_INSTERM_2_8,
                   SPBFILE.SPB_INSRATE_2_8,
                   SPBFILE.SPB_INSTERM_2_9,
                   SPBFILE.SPB_INSRATE_2_9,
                   SPBFILE.SPB_INSTERM_2_10,
                   SPBFILE.SPB_INSRATE_2_10,
                   SPBFILE.SPB_INSTERM_2_11,
                   SPBFILE.SPB_INSRATE_2_11,
                   SPBFILE.SPB_INSTERM_2_12,
                   SPBFILE.SPB_INSRATE_2_12,
                   SPBFILE.SPB_INSTERM_2_13,
                   SPBFILE.SPB_INSRATE_2_13,
                   SPBFILE.SPB_INSTERM_2_14,
                   SPBFILE.SPB_INSRATE_2_14,
                   SPBFILE.SPB_INSTERM_2_15,
                   SPBFILE.SPB_INSRATE_2_15,
                   SPBFILE.SPB_INSTERM_2_16,
                   SPBFILE.SPB_INSRATE_2_16,
                   SPBFILE.SPB_INSTERM_2_17,
                   SPBFILE.SPB_INSRATE_2_17,
                   SPBFILE.SPB_INSTERM_2_18,
                   SPBFILE.SPB_INSRATE_2_18,
                   SPBFILE.SPB_INSTERM_2_19,
                   SPBFILE.SPB_INSRATE_2_19,
                   SPBFILE.SPB_INSTERM_2_20,
                   SPBFILE.SPB_INSRATE_2_20,
                   SPBFILE.SPB_INSMINPREM_2,
                   SPBFILE.SPB_INSMINCHGABL_2,
                   SPBFILE.SPB_INSMAXCHGABL_2,
                   SPBFILE.SPB_INSMAXBENIF_2,
                   SPBFILE.SPB_INSMAXTERM_2,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_2,''),
                   SPBFILE.SPB_INSEXCEPT_2,
                   SPBFILE.SPB_INSNOVER_2,
                   SPBFILE.SPB_INSMINAGE_2_1,
                   SPBFILE.SPB_INSMAXAGE_2_1,
                   SPBFILE.SPB_INSMAXCOV_2_1,
                   SPBFILE.SPB_INSMAXTRM_2_1,
                   SPBFILE.SPB_INSMINAGE_2_2,
                   SPBFILE.SPB_INSMAXAGE_2_2,
                   SPBFILE.SPB_INSMAXCOV_2_2,
                   SPBFILE.SPB_INSMAXTRM_2_2,
                   SPBFILE.SPB_INSMINAGE_2_3,
                   SPBFILE.SPB_INSMAXAGE_2_3,
                   SPBFILE.SPB_INSMAXCOV_2_3,
                   SPBFILE.SPB_INSMAXTRM_2_3,
                   SPBFILE.SPB_INSMINAGE_2_4,
                   SPBFILE.SPB_INSMAXAGE_2_4,
                   SPBFILE.SPB_INSMAXCOV_2_4,
                   SPBFILE.SPB_INSMAXTRM_2_4,
                   SPBFILE.SPB_INSMINAGE_2_5,
                   SPBFILE.SPB_INSMAXAGE_2_5,
                   SPBFILE.SPB_INSMAXCOV_2_5,
                   SPBFILE.SPB_INSMAXTRM_2_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_2,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_2,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_2,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_2,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_2,''),
                   SPBFILE.SPB_INSCOM_3,
                   SPBFILE.SPB_INSRATECD_3,
                   SPBFILE.SPB_INSJFAC_3,
                   SPBFILE.SPB_INSDISCNT_3,
                   ISNULL(SPBFILE.SPB_INSCHGABL_3,''),
                   SPBFILE.SPB_INSTERM_3_1,
                   SPBFILE.SPB_INSRATE_3_1,
                   SPBFILE.SPB_INSTERM_3_2,
                   SPBFILE.SPB_INSRATE_3_2,
                   SPBFILE.SPB_INSTERM_3_3,
                   SPBFILE.SPB_INSRATE_3_3,
                   SPBFILE.SPB_INSTERM_3_4,
                   SPBFILE.SPB_INSRATE_3_4,
                   SPBFILE.SPB_INSTERM_3_5,
                   SPBFILE.SPB_INSRATE_3_5,
                   SPBFILE.SPB_INSTERM_3_6,
                   SPBFILE.SPB_INSRATE_3_6,
                   SPBFILE.SPB_INSTERM_3_7,
                   SPBFILE.SPB_INSRATE_3_7,
                   SPBFILE.SPB_INSTERM_3_8,
                   SPBFILE.SPB_INSRATE_3_8,
                   SPBFILE.SPB_INSTERM_3_9,
                   SPBFILE.SPB_INSRATE_3_9,
                   SPBFILE.SPB_INSTERM_3_10,
                   SPBFILE.SPB_INSRATE_3_10,
                   SPBFILE.SPB_INSTERM_3_11,
                   SPBFILE.SPB_INSRATE_3_11,
                   SPBFILE.SPB_INSTERM_3_12,
                   SPBFILE.SPB_INSRATE_3_12,
                   SPBFILE.SPB_INSTERM_3_13,
                   SPBFILE.SPB_INSRATE_3_13,
                   SPBFILE.SPB_INSTERM_3_14,
                   SPBFILE.SPB_INSRATE_3_14,
                   SPBFILE.SPB_INSTERM_3_15,
                   SPBFILE.SPB_INSRATE_3_15,
                   SPBFILE.SPB_INSTERM_3_16,
                   SPBFILE.SPB_INSRATE_3_16,
                   SPBFILE.SPB_INSTERM_3_17,
                   SPBFILE.SPB_INSRATE_3_17,
                   SPBFILE.SPB_INSTERM_3_18,
                   SPBFILE.SPB_INSRATE_3_18,
                   SPBFILE.SPB_INSTERM_3_19,
                   SPBFILE.SPB_INSRATE_3_19,
                   SPBFILE.SPB_INSTERM_3_20,
                   SPBFILE.SPB_INSRATE_3_20,
                   SPBFILE.SPB_INSMINPREM_3,
                   SPBFILE.SPB_INSMINCHGABL_3,
                   SPBFILE.SPB_INSMAXCHGABL_3,
                   SPBFILE.SPB_INSMAXBENIF_3,
                   SPBFILE.SPB_INSMAXTERM_3,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_3,''),
                   SPBFILE.SPB_INSEXCEPT_3,
                   SPBFILE.SPB_INSNOVER_3,
                   SPBFILE.SPB_INSMINAGE_3_1,
                   SPBFILE.SPB_INSMAXAGE_3_1,
                   SPBFILE.SPB_INSMAXCOV_3_1,
                   SPBFILE.SPB_INSMAXTRM_3_1,
                   SPBFILE.SPB_INSMINAGE_3_2,
                   SPBFILE.SPB_INSMAXAGE_3_2,
                   SPBFILE.SPB_INSMAXCOV_3_2,
                   SPBFILE.SPB_INSMAXTRM_3_2,
                   SPBFILE.SPB_INSMINAGE_3_3,
                   SPBFILE.SPB_INSMAXAGE_3_3,
                   SPBFILE.SPB_INSMAXCOV_3_3,
                   SPBFILE.SPB_INSMAXTRM_3_3,
                   SPBFILE.SPB_INSMINAGE_3_4,
                   SPBFILE.SPB_INSMAXAGE_3_4,
                   SPBFILE.SPB_INSMAXCOV_3_4,
                   SPBFILE.SPB_INSMAXTRM_3_4,
                   SPBFILE.SPB_INSMINAGE_3_5,
                   SPBFILE.SPB_INSMAXAGE_3_5,
                   SPBFILE.SPB_INSMAXCOV_3_5,
                   SPBFILE.SPB_INSMAXTRM_3_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_3,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_3,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_3,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_3,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_3,''),
                   SPBFILE.SPB_INSCOM_4,
                   SPBFILE.SPB_INSRATECD_4,
                   SPBFILE.SPB_INSJFAC_4,
                   SPBFILE.SPB_INSDISCNT_4,
                   ISNULL(SPBFILE.SPB_INSCHGABL_4,''),
                   SPBFILE.SPB_INSTERM_4_1,
                   SPBFILE.SPB_INSRATE_4_1,
                   SPBFILE.SPB_INSTERM_4_2,
                   SPBFILE.SPB_INSRATE_4_2,
                   SPBFILE.SPB_INSTERM_4_3,
                   SPBFILE.SPB_INSRATE_4_3,
                   SPBFILE.SPB_INSTERM_4_4,
                   SPBFILE.SPB_INSRATE_4_4,
                   SPBFILE.SPB_INSTERM_4_5,
                   SPBFILE.SPB_INSRATE_4_5,
                   SPBFILE.SPB_INSTERM_4_6,
                   SPBFILE.SPB_INSRATE_4_6,
                   SPBFILE.SPB_INSTERM_4_7,
                   SPBFILE.SPB_INSRATE_4_7,
                   SPBFILE.SPB_INSTERM_4_8,
                   SPBFILE.SPB_INSRATE_4_8,
                   SPBFILE.SPB_INSTERM_4_9,
                   SPBFILE.SPB_INSRATE_4_9,
                   SPBFILE.SPB_INSTERM_4_10,
                   SPBFILE.SPB_INSRATE_4_10,
                   SPBFILE.SPB_INSTERM_4_11,
                   SPBFILE.SPB_INSRATE_4_11,
                   SPBFILE.SPB_INSTERM_4_12,
                   SPBFILE.SPB_INSRATE_4_12,
                   SPBFILE.SPB_INSTERM_4_13,
                   SPBFILE.SPB_INSRATE_4_13,
                   SPBFILE.SPB_INSTERM_4_14,
                   SPBFILE.SPB_INSRATE_4_14,
                   SPBFILE.SPB_INSTERM_4_15,
                   SPBFILE.SPB_INSRATE_4_15,
                   SPBFILE.SPB_INSTERM_4_16,
                   SPBFILE.SPB_INSRATE_4_16,
                   SPBFILE.SPB_INSTERM_4_17,
                   SPBFILE.SPB_INSRATE_4_17,
                   SPBFILE.SPB_INSTERM_4_18,
                   SPBFILE.SPB_INSRATE_4_18,
                   SPBFILE.SPB_INSTERM_4_19,
                   SPBFILE.SPB_INSRATE_4_19,
                   SPBFILE.SPB_INSTERM_4_20,
                   SPBFILE.SPB_INSRATE_4_20,
                   SPBFILE.SPB_INSMINPREM_4,
                   SPBFILE.SPB_INSMINCHGABL_4,
                   SPBFILE.SPB_INSMAXCHGABL_4,
                   SPBFILE.SPB_INSMAXBENIF_4,
                   SPBFILE.SPB_INSMAXTERM_4,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_4,''),
                   SPBFILE.SPB_INSEXCEPT_4,
                   SPBFILE.SPB_INSNOVER_4,
                   SPBFILE.SPB_INSMINAGE_4_1,
                   SPBFILE.SPB_INSMAXAGE_4_1,
                   SPBFILE.SPB_INSMAXCOV_4_1,
                   SPBFILE.SPB_INSMAXTRM_4_1,
                   SPBFILE.SPB_INSMINAGE_4_2,
                   SPBFILE.SPB_INSMAXAGE_4_2,
                   SPBFILE.SPB_INSMAXCOV_4_2,
                   SPBFILE.SPB_INSMAXTRM_4_2,
                   SPBFILE.SPB_INSMINAGE_4_3,
                   SPBFILE.SPB_INSMAXAGE_4_3,
                   SPBFILE.SPB_INSMAXCOV_4_3,
                   SPBFILE.SPB_INSMAXTRM_4_3,
                   SPBFILE.SPB_INSMINAGE_4_4,
                   SPBFILE.SPB_INSMAXAGE_4_4,
                   SPBFILE.SPB_INSMAXCOV_4_4,
                   SPBFILE.SPB_INSMAXTRM_4_4,
                   SPBFILE.SPB_INSMINAGE_4_5,
                   SPBFILE.SPB_INSMAXAGE_4_5,
                   SPBFILE.SPB_INSMAXCOV_4_5,
                   SPBFILE.SPB_INSMAXTRM_4_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_4,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_4,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_4,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_4,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_4,''),
                   SPBFILE.SPB_INSCOM_5,
                   SPBFILE.SPB_INSRATECD_5,
                   SPBFILE.SPB_INSJFAC_5,
                   SPBFILE.SPB_INSDISCNT_5,
                   ISNULL(SPBFILE.SPB_INSCHGABL_5,''),
                   SPBFILE.SPB_INSTERM_5_1,
                   SPBFILE.SPB_INSRATE_5_1,
                   SPBFILE.SPB_INSTERM_5_2,
                   SPBFILE.SPB_INSRATE_5_2,
                   SPBFILE.SPB_INSTERM_5_3,
                   SPBFILE.SPB_INSRATE_5_3,
                   SPBFILE.SPB_INSTERM_5_4,
                   SPBFILE.SPB_INSRATE_5_4,
                   SPBFILE.SPB_INSTERM_5_5,
                   SPBFILE.SPB_INSRATE_5_5,
                   SPBFILE.SPB_INSTERM_5_6,
                   SPBFILE.SPB_INSRATE_5_6,
                   SPBFILE.SPB_INSTERM_5_7,
                   SPBFILE.SPB_INSRATE_5_7,
                   SPBFILE.SPB_INSTERM_5_8,
                   SPBFILE.SPB_INSRATE_5_8,
                   SPBFILE.SPB_INSTERM_5_9,
                   SPBFILE.SPB_INSRATE_5_9,
                   SPBFILE.SPB_INSTERM_5_10,
                   SPBFILE.SPB_INSRATE_5_10,
                   SPBFILE.SPB_INSTERM_5_11,
                   SPBFILE.SPB_INSRATE_5_11,
                   SPBFILE.SPB_INSTERM_5_12,
                   SPBFILE.SPB_INSRATE_5_12,
                   SPBFILE.SPB_INSTERM_5_13,
                   SPBFILE.SPB_INSRATE_5_13,
                   SPBFILE.SPB_INSTERM_5_14,
                   SPBFILE.SPB_INSRATE_5_14,
                   SPBFILE.SPB_INSTERM_5_15,
                   SPBFILE.SPB_INSRATE_5_15,
                   SPBFILE.SPB_INSTERM_5_16,
                   SPBFILE.SPB_INSRATE_5_16,
                   SPBFILE.SPB_INSTERM_5_17,
                   SPBFILE.SPB_INSRATE_5_17,
                   SPBFILE.SPB_INSTERM_5_18,
                   SPBFILE.SPB_INSRATE_5_18,
                   SPBFILE.SPB_INSTERM_5_19,
                   SPBFILE.SPB_INSRATE_5_19,
                   SPBFILE.SPB_INSTERM_5_20,
                   SPBFILE.SPB_INSRATE_5_20,
                   SPBFILE.SPB_INSMINPREM_5,
                   SPBFILE.SPB_INSMINCHGABL_5,
                   SPBFILE.SPB_INSMAXCHGABL_5,
                   SPBFILE.SPB_INSMAXBENIF_5,
                   SPBFILE.SPB_INSMAXTERM_5,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_5,''),
                   SPBFILE.SPB_INSEXCEPT_5,
                   SPBFILE.SPB_INSNOVER_5,
                   SPBFILE.SPB_INSMINAGE_5_1,
                   SPBFILE.SPB_INSMAXAGE_5_1,
                   SPBFILE.SPB_INSMAXCOV_5_1,
                   SPBFILE.SPB_INSMAXTRM_5_1,
                   SPBFILE.SPB_INSMINAGE_5_2,
                   SPBFILE.SPB_INSMAXAGE_5_2,
                   SPBFILE.SPB_INSMAXCOV_5_2,
                   SPBFILE.SPB_INSMAXTRM_5_2,
                   SPBFILE.SPB_INSMINAGE_5_3,
                   SPBFILE.SPB_INSMAXAGE_5_3,
                   SPBFILE.SPB_INSMAXCOV_5_3,
                   SPBFILE.SPB_INSMAXTRM_5_3,
                   SPBFILE.SPB_INSMINAGE_5_4,
                   SPBFILE.SPB_INSMAXAGE_5_4,
                   SPBFILE.SPB_INSMAXCOV_5_4,
                   SPBFILE.SPB_INSMAXTRM_5_4,
                   SPBFILE.SPB_INSMINAGE_5_5,
                   SPBFILE.SPB_INSMAXAGE_5_5,
                   SPBFILE.SPB_INSMAXCOV_5_5,
                   SPBFILE.SPB_INSMAXTRM_5_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_5,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_5,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_5,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_5,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_5,''),
                   SPBFILE.SPB_INSCOM_6,
                   SPBFILE.SPB_INSRATECD_6,
                   SPBFILE.SPB_INSJFAC_6,
                   SPBFILE.SPB_INSDISCNT_6,
                   ISNULL(SPBFILE.SPB_INSCHGABL_6,''),
                   SPBFILE.SPB_INSTERM_6_1,
                   SPBFILE.SPB_INSRATE_6_1,
                   SPBFILE.SPB_INSTERM_6_2,
                   SPBFILE.SPB_INSRATE_6_2,
                   SPBFILE.SPB_INSTERM_6_3,
                   SPBFILE.SPB_INSRATE_6_3,
                   SPBFILE.SPB_INSTERM_6_4,
                   SPBFILE.SPB_INSRATE_6_4,
                   SPBFILE.SPB_INSTERM_6_5,
                   SPBFILE.SPB_INSRATE_6_5,
                   SPBFILE.SPB_INSTERM_6_6,
                   SPBFILE.SPB_INSRATE_6_6,
                   SPBFILE.SPB_INSTERM_6_7,
                   SPBFILE.SPB_INSRATE_6_7,
                   SPBFILE.SPB_INSTERM_6_8,
                   SPBFILE.SPB_INSRATE_6_8,
                   SPBFILE.SPB_INSTERM_6_9,
                   SPBFILE.SPB_INSRATE_6_9,
                   SPBFILE.SPB_INSTERM_6_10,
                   SPBFILE.SPB_INSRATE_6_10,
                   SPBFILE.SPB_INSTERM_6_11,
                   SPBFILE.SPB_INSRATE_6_11,
                   SPBFILE.SPB_INSTERM_6_12,
                   SPBFILE.SPB_INSRATE_6_12,
                   SPBFILE.SPB_INSTERM_6_13,
                   SPBFILE.SPB_INSRATE_6_13,
                   SPBFILE.SPB_INSTERM_6_14,
                   SPBFILE.SPB_INSRATE_6_14,
                   SPBFILE.SPB_INSTERM_6_15,
                   SPBFILE.SPB_INSRATE_6_15,
                   SPBFILE.SPB_INSTERM_6_16,
                   SPBFILE.SPB_INSRATE_6_16,
                   SPBFILE.SPB_INSTERM_6_17,
                   SPBFILE.SPB_INSRATE_6_17,
                   SPBFILE.SPB_INSTERM_6_18,
                   SPBFILE.SPB_INSRATE_6_18,
                   SPBFILE.SPB_INSTERM_6_19,
                   SPBFILE.SPB_INSRATE_6_19,
                   SPBFILE.SPB_INSTERM_6_20,
                   SPBFILE.SPB_INSRATE_6_20,
                   SPBFILE.SPB_INSMINPREM_6,
                   SPBFILE.SPB_INSMINCHGABL_6,
                   SPBFILE.SPB_INSMAXCHGABL_6,
                   SPBFILE.SPB_INSMAXBENIF_6,
                   SPBFILE.SPB_INSMAXTERM_6,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_6,''),
                   SPBFILE.SPB_INSEXCEPT_6,
                   SPBFILE.SPB_INSNOVER_6,
                   SPBFILE.SPB_INSMINAGE_6_1,
                   SPBFILE.SPB_INSMAXAGE_6_1,
                   SPBFILE.SPB_INSMAXCOV_6_1,
                   SPBFILE.SPB_INSMAXTRM_6_1,
                   SPBFILE.SPB_INSMINAGE_6_2,
                   SPBFILE.SPB_INSMAXAGE_6_2,
                   SPBFILE.SPB_INSMAXCOV_6_2,
                   SPBFILE.SPB_INSMAXTRM_6_2,
                   SPBFILE.SPB_INSMINAGE_6_3,
                   SPBFILE.SPB_INSMAXAGE_6_3,
                   SPBFILE.SPB_INSMAXCOV_6_3,
                   SPBFILE.SPB_INSMAXTRM_6_3,
                   SPBFILE.SPB_INSMINAGE_6_4,
                   SPBFILE.SPB_INSMAXAGE_6_4,
                   SPBFILE.SPB_INSMAXCOV_6_4,
                   SPBFILE.SPB_INSMAXTRM_6_4,
                   SPBFILE.SPB_INSMINAGE_6_5,
                   SPBFILE.SPB_INSMAXAGE_6_5,
                   SPBFILE.SPB_INSMAXCOV_6_5,
                   SPBFILE.SPB_INSMAXTRM_6_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_6,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_6,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_6,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_6,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_6,''),
                   SPBFILE.SPB_INSCOM_7,
                   SPBFILE.SPB_INSRATECD_7,
                   SPBFILE.SPB_INSJFAC_7,
                   SPBFILE.SPB_INSDISCNT_7,
                   ISNULL(SPBFILE.SPB_INSCHGABL_7,''),
                   SPBFILE.SPB_INSTERM_7_1,
                   SPBFILE.SPB_INSRATE_7_1,
                   SPBFILE.SPB_INSTERM_7_2,
                   SPBFILE.SPB_INSRATE_7_2,
                   SPBFILE.SPB_INSTERM_7_3,
                   SPBFILE.SPB_INSRATE_7_3,
                   SPBFILE.SPB_INSTERM_7_4,
                   SPBFILE.SPB_INSRATE_7_4,
                   SPBFILE.SPB_INSTERM_7_5,
                   SPBFILE.SPB_INSRATE_7_5,
                   SPBFILE.SPB_INSTERM_7_6,
                   SPBFILE.SPB_INSRATE_7_6,
                   SPBFILE.SPB_INSTERM_7_7,
                   SPBFILE.SPB_INSRATE_7_7,
                   SPBFILE.SPB_INSTERM_7_8,
                   SPBFILE.SPB_INSRATE_7_8,
                   SPBFILE.SPB_INSTERM_7_9,
                   SPBFILE.SPB_INSRATE_7_9,
                   SPBFILE.SPB_INSTERM_7_10,
                   SPBFILE.SPB_INSRATE_7_10,
                   SPBFILE.SPB_INSTERM_7_11,
                   SPBFILE.SPB_INSRATE_7_11,
                   SPBFILE.SPB_INSTERM_7_12,
                   SPBFILE.SPB_INSRATE_7_12,
                   SPBFILE.SPB_INSTERM_7_13,
                   SPBFILE.SPB_INSRATE_7_13,
                   SPBFILE.SPB_INSTERM_7_14,
                   SPBFILE.SPB_INSRATE_7_14,
                   SPBFILE.SPB_INSTERM_7_15,
                   SPBFILE.SPB_INSRATE_7_15,
                   SPBFILE.SPB_INSTERM_7_16,
                   SPBFILE.SPB_INSRATE_7_16,
                   SPBFILE.SPB_INSTERM_7_17,
                   SPBFILE.SPB_INSRATE_7_17,
                   SPBFILE.SPB_INSTERM_7_18,
                   SPBFILE.SPB_INSRATE_7_18,
                   SPBFILE.SPB_INSTERM_7_19,
                   SPBFILE.SPB_INSRATE_7_19,
                   SPBFILE.SPB_INSTERM_7_20,
                   SPBFILE.SPB_INSRATE_7_20,
                   SPBFILE.SPB_INSMINPREM_7,
                   SPBFILE.SPB_INSMINCHGABL_7,
                   SPBFILE.SPB_INSMAXCHGABL_7,
                   SPBFILE.SPB_INSMAXBENIF_7,
                   SPBFILE.SPB_INSMAXTERM_7,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_7,''),
                   SPBFILE.SPB_INSEXCEPT_7,
                   SPBFILE.SPB_INSNOVER_7,
                   SPBFILE.SPB_INSMINAGE_7_1,
                   SPBFILE.SPB_INSMAXAGE_7_1,
                   SPBFILE.SPB_INSMAXCOV_7_1,
                   SPBFILE.SPB_INSMAXTRM_7_1,
                   SPBFILE.SPB_INSMINAGE_7_2,
                   SPBFILE.SPB_INSMAXAGE_7_2,
                   SPBFILE.SPB_INSMAXCOV_7_2,
                   SPBFILE.SPB_INSMAXTRM_7_2,
                   SPBFILE.SPB_INSMINAGE_7_3,
                   SPBFILE.SPB_INSMAXAGE_7_3,
                   SPBFILE.SPB_INSMAXCOV_7_3,
                   SPBFILE.SPB_INSMAXTRM_7_3,
                   SPBFILE.SPB_INSMINAGE_7_4,
                   SPBFILE.SPB_INSMAXAGE_7_4,
                   SPBFILE.SPB_INSMAXCOV_7_4,
                   SPBFILE.SPB_INSMAXTRM_7_4,
                   SPBFILE.SPB_INSMINAGE_7_5,
                   SPBFILE.SPB_INSMAXAGE_7_5,
                   SPBFILE.SPB_INSMAXCOV_7_5,
                   SPBFILE.SPB_INSMAXTRM_7_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_7,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_7,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_7,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_7,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_7,''),
                   SPBFILE.SPB_INSCOM_8,
                   SPBFILE.SPB_INSRATECD_8,
                   SPBFILE.SPB_INSJFAC_8,
                   SPBFILE.SPB_INSDISCNT_8,
                   ISNULL(SPBFILE.SPB_INSCHGABL_8,''),
                   SPBFILE.SPB_INSTERM_8_1,
                   SPBFILE.SPB_INSRATE_8_1,
                   SPBFILE.SPB_INSTERM_8_2,
                   SPBFILE.SPB_INSRATE_8_2,
                   SPBFILE.SPB_INSTERM_8_3,
                   SPBFILE.SPB_INSRATE_8_3,
                   SPBFILE.SPB_INSTERM_8_4,
                   SPBFILE.SPB_INSRATE_8_4,
                   SPBFILE.SPB_INSTERM_8_5,
                   SPBFILE.SPB_INSRATE_8_5,
                   SPBFILE.SPB_INSTERM_8_6,
                   SPBFILE.SPB_INSRATE_8_6,
                   SPBFILE.SPB_INSTERM_8_7,
                   SPBFILE.SPB_INSRATE_8_7,
                   SPBFILE.SPB_INSTERM_8_8,
                   SPBFILE.SPB_INSRATE_8_8,
                   SPBFILE.SPB_INSTERM_8_9,
                   SPBFILE.SPB_INSRATE_8_9,
                   SPBFILE.SPB_INSTERM_8_10,
                   SPBFILE.SPB_INSRATE_8_10,
                   SPBFILE.SPB_INSTERM_8_11,
                   SPBFILE.SPB_INSRATE_8_11,
                   SPBFILE.SPB_INSTERM_8_12,
                   SPBFILE.SPB_INSRATE_8_12,
                   SPBFILE.SPB_INSTERM_8_13,
                   SPBFILE.SPB_INSRATE_8_13,
                   SPBFILE.SPB_INSTERM_8_14,
                   SPBFILE.SPB_INSRATE_8_14,
                   SPBFILE.SPB_INSTERM_8_15,
                   SPBFILE.SPB_INSRATE_8_15,
                   SPBFILE.SPB_INSTERM_8_16,
                   SPBFILE.SPB_INSRATE_8_16,
                   SPBFILE.SPB_INSTERM_8_17,
                   SPBFILE.SPB_INSRATE_8_17,
                   SPBFILE.SPB_INSTERM_8_18,
                   SPBFILE.SPB_INSRATE_8_18,
                   SPBFILE.SPB_INSTERM_8_19,
                   SPBFILE.SPB_INSRATE_8_19,
                   SPBFILE.SPB_INSTERM_8_20,
                   SPBFILE.SPB_INSRATE_8_20,
                   SPBFILE.SPB_INSMINPREM_8,
                   SPBFILE.SPB_INSMINCHGABL_8,
                   SPBFILE.SPB_INSMAXCHGABL_8,
                   SPBFILE.SPB_INSMAXBENIF_8,
                   SPBFILE.SPB_INSMAXTERM_8,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_8,''),
                   SPBFILE.SPB_INSEXCEPT_8,
                   SPBFILE.SPB_INSNOVER_8,
                   SPBFILE.SPB_INSMINAGE_8_1,
                   SPBFILE.SPB_INSMAXAGE_8_1,
                   SPBFILE.SPB_INSMAXCOV_8_1,
                   SPBFILE.SPB_INSMAXTRM_8_1,
                   SPBFILE.SPB_INSMINAGE_8_2,
                   SPBFILE.SPB_INSMAXAGE_8_2,
                   SPBFILE.SPB_INSMAXCOV_8_2,
                   SPBFILE.SPB_INSMAXTRM_8_2,
                   SPBFILE.SPB_INSMINAGE_8_3,
                   SPBFILE.SPB_INSMAXAGE_8_3,
                   SPBFILE.SPB_INSMAXCOV_8_3,
                   SPBFILE.SPB_INSMAXTRM_8_3,
                   SPBFILE.SPB_INSMINAGE_8_4,
                   SPBFILE.SPB_INSMAXAGE_8_4,
                   SPBFILE.SPB_INSMAXCOV_8_4,
                   SPBFILE.SPB_INSMAXTRM_8_4,
                   SPBFILE.SPB_INSMINAGE_8_5,
                   SPBFILE.SPB_INSMAXAGE_8_5,
                   SPBFILE.SPB_INSMAXCOV_8_5,
                   SPBFILE.SPB_INSMAXTRM_8_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_8,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_8,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_8,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_8,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_8,''),
                   SPBFILE.SPB_INSCOM_9,
                   SPBFILE.SPB_INSRATECD_9,
                   SPBFILE.SPB_INSJFAC_9,
                   SPBFILE.SPB_INSDISCNT_9,
                   ISNULL(SPBFILE.SPB_INSCHGABL_9,''),
                   SPBFILE.SPB_INSTERM_9_1,
                   SPBFILE.SPB_INSRATE_9_1,
                   SPBFILE.SPB_INSTERM_9_2,
                   SPBFILE.SPB_INSRATE_9_2,
                   SPBFILE.SPB_INSTERM_9_3,
                   SPBFILE.SPB_INSRATE_9_3,
                   SPBFILE.SPB_INSTERM_9_4,
                   SPBFILE.SPB_INSRATE_9_4,
                   SPBFILE.SPB_INSTERM_9_5,
                   SPBFILE.SPB_INSRATE_9_5,
                   SPBFILE.SPB_INSTERM_9_6,
                   SPBFILE.SPB_INSRATE_9_6,
                   SPBFILE.SPB_INSTERM_9_7,
                   SPBFILE.SPB_INSRATE_9_7,
                   SPBFILE.SPB_INSTERM_9_8,
                   SPBFILE.SPB_INSRATE_9_8,
                   SPBFILE.SPB_INSTERM_9_9,
                   SPBFILE.SPB_INSRATE_9_9,
                   SPBFILE.SPB_INSTERM_9_10,
                   SPBFILE.SPB_INSRATE_9_10,
                   SPBFILE.SPB_INSTERM_9_11,
                   SPBFILE.SPB_INSRATE_9_11,
                   SPBFILE.SPB_INSTERM_9_12,
                   SPBFILE.SPB_INSRATE_9_12,
                   SPBFILE.SPB_INSTERM_9_13,
                   SPBFILE.SPB_INSRATE_9_13,
                   SPBFILE.SPB_INSTERM_9_14,
                   SPBFILE.SPB_INSRATE_9_14,
                   SPBFILE.SPB_INSTERM_9_15,
                   SPBFILE.SPB_INSRATE_9_15,
                   SPBFILE.SPB_INSTERM_9_16,
                   SPBFILE.SPB_INSRATE_9_16,
                   SPBFILE.SPB_INSTERM_9_17,
                   SPBFILE.SPB_INSRATE_9_17,
                   SPBFILE.SPB_INSTERM_9_18,
                   SPBFILE.SPB_INSRATE_9_18,
                   SPBFILE.SPB_INSTERM_9_19,
                   SPBFILE.SPB_INSRATE_9_19,
                   SPBFILE.SPB_INSTERM_9_20,
                   SPBFILE.SPB_INSRATE_9_20,
                   SPBFILE.SPB_INSMINPREM_9,
                   SPBFILE.SPB_INSMINCHGABL_9,
                   SPBFILE.SPB_INSMAXCHGABL_9,
                   SPBFILE.SPB_INSMAXBENIF_9,
                   SPBFILE.SPB_INSMAXTERM_9,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_9,''),
                   SPBFILE.SPB_INSEXCEPT_9,
                   SPBFILE.SPB_INSNOVER_9,
                   SPBFILE.SPB_INSMINAGE_9_1,
                   SPBFILE.SPB_INSMAXAGE_9_1,
                   SPBFILE.SPB_INSMAXCOV_9_1,
                   SPBFILE.SPB_INSMAXTRM_9_1,
                   SPBFILE.SPB_INSMINAGE_9_2,
                   SPBFILE.SPB_INSMAXAGE_9_2,
                   SPBFILE.SPB_INSMAXCOV_9_2,
                   SPBFILE.SPB_INSMAXTRM_9_2,
                   SPBFILE.SPB_INSMINAGE_9_3,
                   SPBFILE.SPB_INSMAXAGE_9_3,
                   SPBFILE.SPB_INSMAXCOV_9_3,
                   SPBFILE.SPB_INSMAXTRM_9_3,
                   SPBFILE.SPB_INSMINAGE_9_4,
                   SPBFILE.SPB_INSMAXAGE_9_4,
                   SPBFILE.SPB_INSMAXCOV_9_4,
                   SPBFILE.SPB_INSMAXTRM_9_4,
                   SPBFILE.SPB_INSMINAGE_9_5,
                   SPBFILE.SPB_INSMAXAGE_9_5,
                   SPBFILE.SPB_INSMAXCOV_9_5,
                   SPBFILE.SPB_INSMAXTRM_9_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_9,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_9,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_9,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_9,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_9,''),
                   SPBFILE.SPB_INSCOM_10,
                   SPBFILE.SPB_INSRATECD_10,
                   SPBFILE.SPB_INSJFAC_10,
                   SPBFILE.SPB_INSDISCNT_10,
                   ISNULL(SPBFILE.SPB_INSCHGABL_10,''),
                   SPBFILE.SPB_INSTERM_10_1,
                   SPBFILE.SPB_INSRATE_10_1,
                   SPBFILE.SPB_INSTERM_10_2,
                   SPBFILE.SPB_INSRATE_10_2,
                   SPBFILE.SPB_INSTERM_10_3,
                   SPBFILE.SPB_INSRATE_10_3,
                   SPBFILE.SPB_INSTERM_10_4,
                   SPBFILE.SPB_INSRATE_10_4,
                   SPBFILE.SPB_INSTERM_10_5,
                   SPBFILE.SPB_INSRATE_10_5,
                   SPBFILE.SPB_INSTERM_10_6,
                   SPBFILE.SPB_INSRATE_10_6,
                   SPBFILE.SPB_INSTERM_10_7,
                   SPBFILE.SPB_INSRATE_10_7,
                   SPBFILE.SPB_INSTERM_10_8,
                   SPBFILE.SPB_INSRATE_10_8,
                   SPBFILE.SPB_INSTERM_10_9,
                   SPBFILE.SPB_INSRATE_10_9,
                   SPBFILE.SPB_INSTERM_10_10,
                   SPBFILE.SPB_INSRATE_10_10,
                   SPBFILE.SPB_INSTERM_10_11,
                   SPBFILE.SPB_INSRATE_10_11,
                   SPBFILE.SPB_INSTERM_10_12,
                   SPBFILE.SPB_INSRATE_10_12,
                   SPBFILE.SPB_INSTERM_10_13,
                   SPBFILE.SPB_INSRATE_10_13,
                   SPBFILE.SPB_INSTERM_10_14,
                   SPBFILE.SPB_INSRATE_10_14,
                   SPBFILE.SPB_INSTERM_10_15,
                   SPBFILE.SPB_INSRATE_10_15,
                   SPBFILE.SPB_INSTERM_10_16,
                   SPBFILE.SPB_INSRATE_10_16,
                   SPBFILE.SPB_INSTERM_10_17,
                   SPBFILE.SPB_INSRATE_10_17,
                   SPBFILE.SPB_INSTERM_10_18,
                   SPBFILE.SPB_INSRATE_10_18,
                   SPBFILE.SPB_INSTERM_10_19,
                   SPBFILE.SPB_INSRATE_10_19,
                   SPBFILE.SPB_INSTERM_10_20,
                   SPBFILE.SPB_INSRATE_10_20,
                   SPBFILE.SPB_INSMINPREM_10,
                   SPBFILE.SPB_INSMINCHGABL_10,
                   SPBFILE.SPB_INSMAXCHGABL_10,
                   SPBFILE.SPB_INSMAXBENIF_10,
                   SPBFILE.SPB_INSMAXTERM_10,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_10,''),
                   SPBFILE.SPB_INSEXCEPT_10,
                   SPBFILE.SPB_INSNOVER_10,
                   SPBFILE.SPB_INSMINAGE_10_1,
                   SPBFILE.SPB_INSMAXAGE_10_1,
                   SPBFILE.SPB_INSMAXCOV_10_1,
                   SPBFILE.SPB_INSMAXTRM_10_1,
                   SPBFILE.SPB_INSMINAGE_10_2,
                   SPBFILE.SPB_INSMAXAGE_10_2,
                   SPBFILE.SPB_INSMAXCOV_10_2,
                   SPBFILE.SPB_INSMAXTRM_10_2,
                   SPBFILE.SPB_INSMINAGE_10_3,
                   SPBFILE.SPB_INSMAXAGE_10_3,
                   SPBFILE.SPB_INSMAXCOV_10_3,
                   SPBFILE.SPB_INSMAXTRM_10_3,
                   SPBFILE.SPB_INSMINAGE_10_4,
                   SPBFILE.SPB_INSMAXAGE_10_4,
                   SPBFILE.SPB_INSMAXCOV_10_4,
                   SPBFILE.SPB_INSMAXTRM_10_4,
                   SPBFILE.SPB_INSMINAGE_10_5,
                   SPBFILE.SPB_INSMAXAGE_10_5,
                   SPBFILE.SPB_INSMAXCOV_10_5,
                   SPBFILE.SPB_INSMAXTRM_10_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_10,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_10,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_10,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_10,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_10,''),
                   SPBFILE.SPB_INSCOM_11,
                   SPBFILE.SPB_INSRATECD_11,
                   SPBFILE.SPB_INSJFAC_11,
                   SPBFILE.SPB_INSDISCNT_11,
                   ISNULL(SPBFILE.SPB_INSCHGABL_11,''),
                   SPBFILE.SPB_INSTERM_11_1,
                   SPBFILE.SPB_INSRATE_11_1,
                   SPBFILE.SPB_INSTERM_11_2,
                   SPBFILE.SPB_INSRATE_11_2,
                   SPBFILE.SPB_INSTERM_11_3,
                   SPBFILE.SPB_INSRATE_11_3,
                   SPBFILE.SPB_INSTERM_11_4,
                   SPBFILE.SPB_INSRATE_11_4,
                   SPBFILE.SPB_INSTERM_11_5,
                   SPBFILE.SPB_INSRATE_11_5,
                   SPBFILE.SPB_INSTERM_11_6,
                   SPBFILE.SPB_INSRATE_11_6,
                   SPBFILE.SPB_INSTERM_11_7,
                   SPBFILE.SPB_INSRATE_11_7,
                   SPBFILE.SPB_INSTERM_11_8,
                   SPBFILE.SPB_INSRATE_11_8,
                   SPBFILE.SPB_INSTERM_11_9,
                   SPBFILE.SPB_INSRATE_11_9,
                   SPBFILE.SPB_INSTERM_11_10,
                   SPBFILE.SPB_INSRATE_11_10,
                   SPBFILE.SPB_INSTERM_11_11,
                   SPBFILE.SPB_INSRATE_11_11,
                   SPBFILE.SPB_INSTERM_11_12,
                   SPBFILE.SPB_INSRATE_11_12,
                   SPBFILE.SPB_INSTERM_11_13,
                   SPBFILE.SPB_INSRATE_11_13,
                   SPBFILE.SPB_INSTERM_11_14,
                   SPBFILE.SPB_INSRATE_11_14,
                   SPBFILE.SPB_INSTERM_11_15,
                   SPBFILE.SPB_INSRATE_11_15,
                   SPBFILE.SPB_INSTERM_11_16,
                   SPBFILE.SPB_INSRATE_11_16,
                   SPBFILE.SPB_INSTERM_11_17,
                   SPBFILE.SPB_INSRATE_11_17,
                   SPBFILE.SPB_INSTERM_11_18,
                   SPBFILE.SPB_INSRATE_11_18,
                   SPBFILE.SPB_INSTERM_11_19,
                   SPBFILE.SPB_INSRATE_11_19,
                   SPBFILE.SPB_INSTERM_11_20,
                   SPBFILE.SPB_INSRATE_11_20,
                   SPBFILE.SPB_INSMINPREM_11,
                   SPBFILE.SPB_INSMINCHGABL_11,
                   SPBFILE.SPB_INSMAXCHGABL_11,
                   SPBFILE.SPB_INSMAXBENIF_11,
                   SPBFILE.SPB_INSMAXTERM_11,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_11,''),
                   SPBFILE.SPB_INSEXCEPT_11,
                   SPBFILE.SPB_INSNOVER_11,
                   SPBFILE.SPB_INSMINAGE_11_1,
                   SPBFILE.SPB_INSMAXAGE_11_1,
                   SPBFILE.SPB_INSMAXCOV_11_1,
                   SPBFILE.SPB_INSMAXTRM_11_1,
                   SPBFILE.SPB_INSMINAGE_11_2,
                   SPBFILE.SPB_INSMAXAGE_11_2,
                   SPBFILE.SPB_INSMAXCOV_11_2,
                   SPBFILE.SPB_INSMAXTRM_11_2,
                   SPBFILE.SPB_INSMINAGE_11_3,
                   SPBFILE.SPB_INSMAXAGE_11_3,
                   SPBFILE.SPB_INSMAXCOV_11_3,
                   SPBFILE.SPB_INSMAXTRM_11_3,
                   SPBFILE.SPB_INSMINAGE_11_4,
                   SPBFILE.SPB_INSMAXAGE_11_4,
                   SPBFILE.SPB_INSMAXCOV_11_4,
                   SPBFILE.SPB_INSMAXTRM_11_4,
                   SPBFILE.SPB_INSMINAGE_11_5,
                   SPBFILE.SPB_INSMAXAGE_11_5,
                   SPBFILE.SPB_INSMAXCOV_11_5,
                   SPBFILE.SPB_INSMAXTRM_11_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_11,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_11,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_11,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_11,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_11,''),
                   SPBFILE.SPB_INSCOM_12,
                   SPBFILE.SPB_INSRATECD_12,
                   SPBFILE.SPB_INSJFAC_12,
                   SPBFILE.SPB_INSDISCNT_12,
                   ISNULL(SPBFILE.SPB_INSCHGABL_12,''),
                   SPBFILE.SPB_INSTERM_12_1,
                   SPBFILE.SPB_INSRATE_12_1,
                   SPBFILE.SPB_INSTERM_12_2,
                   SPBFILE.SPB_INSRATE_12_2,
                   SPBFILE.SPB_INSTERM_12_3,
                   SPBFILE.SPB_INSRATE_12_3,
                   SPBFILE.SPB_INSTERM_12_4,
                   SPBFILE.SPB_INSRATE_12_4,
                   SPBFILE.SPB_INSTERM_12_5,
                   SPBFILE.SPB_INSRATE_12_5,
                   SPBFILE.SPB_INSTERM_12_6,
                   SPBFILE.SPB_INSRATE_12_6,
                   SPBFILE.SPB_INSTERM_12_7,
                   SPBFILE.SPB_INSRATE_12_7,
                   SPBFILE.SPB_INSTERM_12_8,
                   SPBFILE.SPB_INSRATE_12_8,
                   SPBFILE.SPB_INSTERM_12_9,
                   SPBFILE.SPB_INSRATE_12_9,
                   SPBFILE.SPB_INSTERM_12_10,
                   SPBFILE.SPB_INSRATE_12_10,
                   SPBFILE.SPB_INSTERM_12_11,
                   SPBFILE.SPB_INSRATE_12_11,
                   SPBFILE.SPB_INSTERM_12_12,
                   SPBFILE.SPB_INSRATE_12_12,
                   SPBFILE.SPB_INSTERM_12_13,
                   SPBFILE.SPB_INSRATE_12_13,
                   SPBFILE.SPB_INSTERM_12_14,
                   SPBFILE.SPB_INSRATE_12_14,
                   SPBFILE.SPB_INSTERM_12_15,
                   SPBFILE.SPB_INSRATE_12_15,
                   SPBFILE.SPB_INSTERM_12_16,
                   SPBFILE.SPB_INSRATE_12_16,
                   SPBFILE.SPB_INSTERM_12_17,
                   SPBFILE.SPB_INSRATE_12_17,
                   SPBFILE.SPB_INSTERM_12_18,
                   SPBFILE.SPB_INSRATE_12_18,
                   SPBFILE.SPB_INSTERM_12_19,
                   SPBFILE.SPB_INSRATE_12_19,
                   SPBFILE.SPB_INSTERM_12_20,
                   SPBFILE.SPB_INSRATE_12_20,
                   SPBFILE.SPB_INSMINPREM_12,
                   SPBFILE.SPB_INSMINCHGABL_12,
                   SPBFILE.SPB_INSMAXCHGABL_12,
                   SPBFILE.SPB_INSMAXBENIF_12,
                   SPBFILE.SPB_INSMAXTERM_12,
                   ISNULL(SPBFILE.SPB_INSCHGBEN_12,''),
                   SPBFILE.SPB_INSEXCEPT_12,
                   SPBFILE.SPB_INSNOVER_12,
                   SPBFILE.SPB_INSMINAGE_12_1,
                   SPBFILE.SPB_INSMAXAGE_12_1,
                   SPBFILE.SPB_INSMAXCOV_12_1,
                   SPBFILE.SPB_INSMAXTRM_12_1,
                   SPBFILE.SPB_INSMINAGE_12_2,
                   SPBFILE.SPB_INSMAXAGE_12_2,
                   SPBFILE.SPB_INSMAXCOV_12_2,
                   SPBFILE.SPB_INSMAXTRM_12_2,
                   SPBFILE.SPB_INSMINAGE_12_3,
                   SPBFILE.SPB_INSMAXAGE_12_3,
                   SPBFILE.SPB_INSMAXCOV_12_3,
                   SPBFILE.SPB_INSMAXTRM_12_3,
                   SPBFILE.SPB_INSMINAGE_12_4,
                   SPBFILE.SPB_INSMAXAGE_12_4,
                   SPBFILE.SPB_INSMAXCOV_12_4,
                   SPBFILE.SPB_INSMAXTRM_12_4,
                   SPBFILE.SPB_INSMINAGE_12_5,
                   SPBFILE.SPB_INSMAXAGE_12_5,
                   SPBFILE.SPB_INSMAXCOV_12_5,
                   SPBFILE.SPB_INSMAXTRM_12_5,
                   ISNULL(SPBFILE.SPB_INSFEECD_12,''),
                   ISNULL(SPBFILE.SPB_INSFEE_FRMLA_12,''),
                   ISNULL(SPBFILE.SPB_INSCHGABL_FG_12,''),
                   ISNULL(SPBFILE.SPB_INSREJECT_FG_12,''),
                   ISNULL(SPBFILE.SPB_INSFINCHG_12,'')
            INTO :QSPB-REC
            FROM DBO.SPBFILE
            WHERE SPBFILE.SPB_ORGST = :QSPB-ORGST
              AND SPBFILE.SPB_SPRCLASS = :QSPB-SPRCLASS
              AND SPBFILE.SPB_SUBCLASS = :QSPB-SUBCLASS
              AND SPBFILE.SPB_LAWCODE = :QSPB-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-SPB1-FILE.

           IF ( IO-FG = 0 )
              PERFORM GET-SPB-FIELDS.

      *----------------------------------------------------------
       WRITE-SPB1-FILE.
           PERFORM WRITE-IT.
           MOVE SPB-PATH-SQL    TO E-FILE.
           MOVE SPB1-KEY        TO E-KEYX.
           PERFORM SET-SPB-FIELDS.

           EXEC SQL
            INSERT INTO DBO.SPBFILE
             (SPBFILE.SPB_ORGST,
              SPBFILE.SPB_SPRCLASS,
              SPBFILE.SPB_SUBCLASS,
              SPBFILE.SPB_LAWCODE,
              SPBFILE.SPB_INSCOM_1,
              SPBFILE.SPB_INSRATECD_1,
              SPBFILE.SPB_INSJFAC_1,
              SPBFILE.SPB_INSDISCNT_1,
              SPBFILE.SPB_INSCHGABL_1,
              SPBFILE.SPB_INSTERM_1_1,
              SPBFILE.SPB_INSRATE_1_1,
              SPBFILE.SPB_INSTERM_1_2,
              SPBFILE.SPB_INSRATE_1_2,
              SPBFILE.SPB_INSTERM_1_3,
              SPBFILE.SPB_INSRATE_1_3,
              SPBFILE.SPB_INSTERM_1_4,
              SPBFILE.SPB_INSRATE_1_4,
              SPBFILE.SPB_INSTERM_1_5,
              SPBFILE.SPB_INSRATE_1_5,
              SPBFILE.SPB_INSTERM_1_6,
              SPBFILE.SPB_INSRATE_1_6,
              SPBFILE.SPB_INSTERM_1_7,
              SPBFILE.SPB_INSRATE_1_7,
              SPBFILE.SPB_INSTERM_1_8,
              SPBFILE.SPB_INSRATE_1_8,
              SPBFILE.SPB_INSTERM_1_9,
              SPBFILE.SPB_INSRATE_1_9,
              SPBFILE.SPB_INSTERM_1_10,
              SPBFILE.SPB_INSRATE_1_10,
              SPBFILE.SPB_INSTERM_1_11,
              SPBFILE.SPB_INSRATE_1_11,
              SPBFILE.SPB_INSTERM_1_12,
              SPBFILE.SPB_INSRATE_1_12,
              SPBFILE.SPB_INSTERM_1_13,
              SPBFILE.SPB_INSRATE_1_13,
              SPBFILE.SPB_INSTERM_1_14,
              SPBFILE.SPB_INSRATE_1_14,
              SPBFILE.SPB_INSTERM_1_15,
              SPBFILE.SPB_INSRATE_1_15,
              SPBFILE.SPB_INSTERM_1_16,
              SPBFILE.SPB_INSRATE_1_16,
              SPBFILE.SPB_INSTERM_1_17,
              SPBFILE.SPB_INSRATE_1_17,
              SPBFILE.SPB_INSTERM_1_18,
              SPBFILE.SPB_INSRATE_1_18,
              SPBFILE.SPB_INSTERM_1_19,
              SPBFILE.SPB_INSRATE_1_19,
              SPBFILE.SPB_INSTERM_1_20,
              SPBFILE.SPB_INSRATE_1_20,
              SPBFILE.SPB_INSMINPREM_1,
              SPBFILE.SPB_INSMINCHGABL_1,
              SPBFILE.SPB_INSMAXCHGABL_1,
              SPBFILE.SPB_INSMAXBENIF_1,
              SPBFILE.SPB_INSMAXTERM_1,
              SPBFILE.SPB_INSCHGBEN_1,
              SPBFILE.SPB_INSEXCEPT_1,
              SPBFILE.SPB_INSNOVER_1,
              SPBFILE.SPB_INSMINAGE_1_1,
              SPBFILE.SPB_INSMAXAGE_1_1,
              SPBFILE.SPB_INSMAXCOV_1_1,
              SPBFILE.SPB_INSMAXTRM_1_1,
              SPBFILE.SPB_INSMINAGE_1_2,
              SPBFILE.SPB_INSMAXAGE_1_2,
              SPBFILE.SPB_INSMAXCOV_1_2,
              SPBFILE.SPB_INSMAXTRM_1_2,
              SPBFILE.SPB_INSMINAGE_1_3,
              SPBFILE.SPB_INSMAXAGE_1_3,
              SPBFILE.SPB_INSMAXCOV_1_3,
              SPBFILE.SPB_INSMAXTRM_1_3,
              SPBFILE.SPB_INSMINAGE_1_4,
              SPBFILE.SPB_INSMAXAGE_1_4,
              SPBFILE.SPB_INSMAXCOV_1_4,
              SPBFILE.SPB_INSMAXTRM_1_4,
              SPBFILE.SPB_INSMINAGE_1_5,
              SPBFILE.SPB_INSMAXAGE_1_5,
              SPBFILE.SPB_INSMAXCOV_1_5,
              SPBFILE.SPB_INSMAXTRM_1_5,
              SPBFILE.SPB_INSFEECD_1,
              SPBFILE.SPB_INSFEE_FRMLA_1,
              SPBFILE.SPB_INSCHGABL_FG_1,
              SPBFILE.SPB_INSREJECT_FG_1,
              SPBFILE.SPB_INSFINCHG_1,
              SPBFILE.SPB_INSCOM_2,
              SPBFILE.SPB_INSRATECD_2,
              SPBFILE.SPB_INSJFAC_2,
              SPBFILE.SPB_INSDISCNT_2,
              SPBFILE.SPB_INSCHGABL_2,
              SPBFILE.SPB_INSTERM_2_1,
              SPBFILE.SPB_INSRATE_2_1,
              SPBFILE.SPB_INSTERM_2_2,
              SPBFILE.SPB_INSRATE_2_2,
              SPBFILE.SPB_INSTERM_2_3,
              SPBFILE.SPB_INSRATE_2_3,
              SPBFILE.SPB_INSTERM_2_4,
              SPBFILE.SPB_INSRATE_2_4,
              SPBFILE.SPB_INSTERM_2_5,
              SPBFILE.SPB_INSRATE_2_5,
              SPBFILE.SPB_INSTERM_2_6,
              SPBFILE.SPB_INSRATE_2_6,
              SPBFILE.SPB_INSTERM_2_7,
              SPBFILE.SPB_INSRATE_2_7,
              SPBFILE.SPB_INSTERM_2_8,
              SPBFILE.SPB_INSRATE_2_8,
              SPBFILE.SPB_INSTERM_2_9,
              SPBFILE.SPB_INSRATE_2_9,
              SPBFILE.SPB_INSTERM_2_10,
              SPBFILE.SPB_INSRATE_2_10,
              SPBFILE.SPB_INSTERM_2_11,
              SPBFILE.SPB_INSRATE_2_11,
              SPBFILE.SPB_INSTERM_2_12,
              SPBFILE.SPB_INSRATE_2_12,
              SPBFILE.SPB_INSTERM_2_13,
              SPBFILE.SPB_INSRATE_2_13,
              SPBFILE.SPB_INSTERM_2_14,
              SPBFILE.SPB_INSRATE_2_14,
              SPBFILE.SPB_INSTERM_2_15,
              SPBFILE.SPB_INSRATE_2_15,
              SPBFILE.SPB_INSTERM_2_16,
              SPBFILE.SPB_INSRATE_2_16,
              SPBFILE.SPB_INSTERM_2_17,
              SPBFILE.SPB_INSRATE_2_17,
              SPBFILE.SPB_INSTERM_2_18,
              SPBFILE.SPB_INSRATE_2_18,
              SPBFILE.SPB_INSTERM_2_19,
              SPBFILE.SPB_INSRATE_2_19,
              SPBFILE.SPB_INSTERM_2_20,
              SPBFILE.SPB_INSRATE_2_20,
              SPBFILE.SPB_INSMINPREM_2,
              SPBFILE.SPB_INSMINCHGABL_2,
              SPBFILE.SPB_INSMAXCHGABL_2,
              SPBFILE.SPB_INSMAXBENIF_2,
              SPBFILE.SPB_INSMAXTERM_2,
              SPBFILE.SPB_INSCHGBEN_2,
              SPBFILE.SPB_INSEXCEPT_2,
              SPBFILE.SPB_INSNOVER_2,
              SPBFILE.SPB_INSMINAGE_2_1,
              SPBFILE.SPB_INSMAXAGE_2_1,
              SPBFILE.SPB_INSMAXCOV_2_1,
              SPBFILE.SPB_INSMAXTRM_2_1,
              SPBFILE.SPB_INSMINAGE_2_2,
              SPBFILE.SPB_INSMAXAGE_2_2,
              SPBFILE.SPB_INSMAXCOV_2_2,
              SPBFILE.SPB_INSMAXTRM_2_2,
              SPBFILE.SPB_INSMINAGE_2_3,
              SPBFILE.SPB_INSMAXAGE_2_3,
              SPBFILE.SPB_INSMAXCOV_2_3,
              SPBFILE.SPB_INSMAXTRM_2_3,
              SPBFILE.SPB_INSMINAGE_2_4,
              SPBFILE.SPB_INSMAXAGE_2_4,
              SPBFILE.SPB_INSMAXCOV_2_4,
              SPBFILE.SPB_INSMAXTRM_2_4,
              SPBFILE.SPB_INSMINAGE_2_5,
              SPBFILE.SPB_INSMAXAGE_2_5,
              SPBFILE.SPB_INSMAXCOV_2_5,
              SPBFILE.SPB_INSMAXTRM_2_5,
              SPBFILE.SPB_INSFEECD_2,
              SPBFILE.SPB_INSFEE_FRMLA_2,
              SPBFILE.SPB_INSCHGABL_FG_2,
              SPBFILE.SPB_INSREJECT_FG_2,
              SPBFILE.SPB_INSFINCHG_2,
              SPBFILE.SPB_INSCOM_3,
              SPBFILE.SPB_INSRATECD_3,
              SPBFILE.SPB_INSJFAC_3,
              SPBFILE.SPB_INSDISCNT_3,
              SPBFILE.SPB_INSCHGABL_3,
              SPBFILE.SPB_INSTERM_3_1,
              SPBFILE.SPB_INSRATE_3_1,
              SPBFILE.SPB_INSTERM_3_2,
              SPBFILE.SPB_INSRATE_3_2,
              SPBFILE.SPB_INSTERM_3_3,
              SPBFILE.SPB_INSRATE_3_3,
              SPBFILE.SPB_INSTERM_3_4,
              SPBFILE.SPB_INSRATE_3_4,
              SPBFILE.SPB_INSTERM_3_5,
              SPBFILE.SPB_INSRATE_3_5,
              SPBFILE.SPB_INSTERM_3_6,
              SPBFILE.SPB_INSRATE_3_6,
              SPBFILE.SPB_INSTERM_3_7,
              SPBFILE.SPB_INSRATE_3_7,
              SPBFILE.SPB_INSTERM_3_8,
              SPBFILE.SPB_INSRATE_3_8,
              SPBFILE.SPB_INSTERM_3_9,
              SPBFILE.SPB_INSRATE_3_9,
              SPBFILE.SPB_INSTERM_3_10,
              SPBFILE.SPB_INSRATE_3_10,
              SPBFILE.SPB_INSTERM_3_11,
              SPBFILE.SPB_INSRATE_3_11,
              SPBFILE.SPB_INSTERM_3_12,
              SPBFILE.SPB_INSRATE_3_12,
              SPBFILE.SPB_INSTERM_3_13,
              SPBFILE.SPB_INSRATE_3_13,
              SPBFILE.SPB_INSTERM_3_14,
              SPBFILE.SPB_INSRATE_3_14,
              SPBFILE.SPB_INSTERM_3_15,
              SPBFILE.SPB_INSRATE_3_15,
              SPBFILE.SPB_INSTERM_3_16,
              SPBFILE.SPB_INSRATE_3_16,
              SPBFILE.SPB_INSTERM_3_17,
              SPBFILE.SPB_INSRATE_3_17,
              SPBFILE.SPB_INSTERM_3_18,
              SPBFILE.SPB_INSRATE_3_18,
              SPBFILE.SPB_INSTERM_3_19,
              SPBFILE.SPB_INSRATE_3_19,
              SPBFILE.SPB_INSTERM_3_20,
              SPBFILE.SPB_INSRATE_3_20,
              SPBFILE.SPB_INSMINPREM_3,
              SPBFILE.SPB_INSMINCHGABL_3,
              SPBFILE.SPB_INSMAXCHGABL_3,
              SPBFILE.SPB_INSMAXBENIF_3,
              SPBFILE.SPB_INSMAXTERM_3,
              SPBFILE.SPB_INSCHGBEN_3,
              SPBFILE.SPB_INSEXCEPT_3,
              SPBFILE.SPB_INSNOVER_3,
              SPBFILE.SPB_INSMINAGE_3_1,
              SPBFILE.SPB_INSMAXAGE_3_1,
              SPBFILE.SPB_INSMAXCOV_3_1,
              SPBFILE.SPB_INSMAXTRM_3_1,
              SPBFILE.SPB_INSMINAGE_3_2,
              SPBFILE.SPB_INSMAXAGE_3_2,
              SPBFILE.SPB_INSMAXCOV_3_2,
              SPBFILE.SPB_INSMAXTRM_3_2,
              SPBFILE.SPB_INSMINAGE_3_3,
              SPBFILE.SPB_INSMAXAGE_3_3,
              SPBFILE.SPB_INSMAXCOV_3_3,
              SPBFILE.SPB_INSMAXTRM_3_3,
              SPBFILE.SPB_INSMINAGE_3_4,
              SPBFILE.SPB_INSMAXAGE_3_4,
              SPBFILE.SPB_INSMAXCOV_3_4,
              SPBFILE.SPB_INSMAXTRM_3_4,
              SPBFILE.SPB_INSMINAGE_3_5,
              SPBFILE.SPB_INSMAXAGE_3_5,
              SPBFILE.SPB_INSMAXCOV_3_5,
              SPBFILE.SPB_INSMAXTRM_3_5,
              SPBFILE.SPB_INSFEECD_3,
              SPBFILE.SPB_INSFEE_FRMLA_3,
              SPBFILE.SPB_INSCHGABL_FG_3,
              SPBFILE.SPB_INSREJECT_FG_3,
              SPBFILE.SPB_INSFINCHG_3,
              SPBFILE.SPB_INSCOM_4,
              SPBFILE.SPB_INSRATECD_4,
              SPBFILE.SPB_INSJFAC_4,
              SPBFILE.SPB_INSDISCNT_4,
              SPBFILE.SPB_INSCHGABL_4,
              SPBFILE.SPB_INSTERM_4_1,
              SPBFILE.SPB_INSRATE_4_1,
              SPBFILE.SPB_INSTERM_4_2,
              SPBFILE.SPB_INSRATE_4_2,
              SPBFILE.SPB_INSTERM_4_3,
              SPBFILE.SPB_INSRATE_4_3,
              SPBFILE.SPB_INSTERM_4_4,
              SPBFILE.SPB_INSRATE_4_4,
              SPBFILE.SPB_INSTERM_4_5,
              SPBFILE.SPB_INSRATE_4_5,
              SPBFILE.SPB_INSTERM_4_6,
              SPBFILE.SPB_INSRATE_4_6,
              SPBFILE.SPB_INSTERM_4_7,
              SPBFILE.SPB_INSRATE_4_7,
              SPBFILE.SPB_INSTERM_4_8,
              SPBFILE.SPB_INSRATE_4_8,
              SPBFILE.SPB_INSTERM_4_9,
              SPBFILE.SPB_INSRATE_4_9,
              SPBFILE.SPB_INSTERM_4_10,
              SPBFILE.SPB_INSRATE_4_10,
              SPBFILE.SPB_INSTERM_4_11,
              SPBFILE.SPB_INSRATE_4_11,
              SPBFILE.SPB_INSTERM_4_12,
              SPBFILE.SPB_INSRATE_4_12,
              SPBFILE.SPB_INSTERM_4_13,
              SPBFILE.SPB_INSRATE_4_13,
              SPBFILE.SPB_INSTERM_4_14,
              SPBFILE.SPB_INSRATE_4_14,
              SPBFILE.SPB_INSTERM_4_15,
              SPBFILE.SPB_INSRATE_4_15,
              SPBFILE.SPB_INSTERM_4_16,
              SPBFILE.SPB_INSRATE_4_16,
              SPBFILE.SPB_INSTERM_4_17,
              SPBFILE.SPB_INSRATE_4_17,
              SPBFILE.SPB_INSTERM_4_18,
              SPBFILE.SPB_INSRATE_4_18,
              SPBFILE.SPB_INSTERM_4_19,
              SPBFILE.SPB_INSRATE_4_19,
              SPBFILE.SPB_INSTERM_4_20,
              SPBFILE.SPB_INSRATE_4_20,
              SPBFILE.SPB_INSMINPREM_4,
              SPBFILE.SPB_INSMINCHGABL_4,
              SPBFILE.SPB_INSMAXCHGABL_4,
              SPBFILE.SPB_INSMAXBENIF_4,
              SPBFILE.SPB_INSMAXTERM_4,
              SPBFILE.SPB_INSCHGBEN_4,
              SPBFILE.SPB_INSEXCEPT_4,
              SPBFILE.SPB_INSNOVER_4,
              SPBFILE.SPB_INSMINAGE_4_1,
              SPBFILE.SPB_INSMAXAGE_4_1,
              SPBFILE.SPB_INSMAXCOV_4_1,
              SPBFILE.SPB_INSMAXTRM_4_1,
              SPBFILE.SPB_INSMINAGE_4_2,
              SPBFILE.SPB_INSMAXAGE_4_2,
              SPBFILE.SPB_INSMAXCOV_4_2,
              SPBFILE.SPB_INSMAXTRM_4_2,
              SPBFILE.SPB_INSMINAGE_4_3,
              SPBFILE.SPB_INSMAXAGE_4_3,
              SPBFILE.SPB_INSMAXCOV_4_3,
              SPBFILE.SPB_INSMAXTRM_4_3,
              SPBFILE.SPB_INSMINAGE_4_4,
              SPBFILE.SPB_INSMAXAGE_4_4,
              SPBFILE.SPB_INSMAXCOV_4_4,
              SPBFILE.SPB_INSMAXTRM_4_4,
              SPBFILE.SPB_INSMINAGE_4_5,
              SPBFILE.SPB_INSMAXAGE_4_5,
              SPBFILE.SPB_INSMAXCOV_4_5,
              SPBFILE.SPB_INSMAXTRM_4_5,
              SPBFILE.SPB_INSFEECD_4,
              SPBFILE.SPB_INSFEE_FRMLA_4,
              SPBFILE.SPB_INSCHGABL_FG_4,
              SPBFILE.SPB_INSREJECT_FG_4,
              SPBFILE.SPB_INSFINCHG_4,
              SPBFILE.SPB_INSCOM_5,
              SPBFILE.SPB_INSRATECD_5,
              SPBFILE.SPB_INSJFAC_5,
              SPBFILE.SPB_INSDISCNT_5,
              SPBFILE.SPB_INSCHGABL_5,
              SPBFILE.SPB_INSTERM_5_1,
              SPBFILE.SPB_INSRATE_5_1,
              SPBFILE.SPB_INSTERM_5_2,
              SPBFILE.SPB_INSRATE_5_2,
              SPBFILE.SPB_INSTERM_5_3,
              SPBFILE.SPB_INSRATE_5_3,
              SPBFILE.SPB_INSTERM_5_4,
              SPBFILE.SPB_INSRATE_5_4,
              SPBFILE.SPB_INSTERM_5_5,
              SPBFILE.SPB_INSRATE_5_5,
              SPBFILE.SPB_INSTERM_5_6,
              SPBFILE.SPB_INSRATE_5_6,
              SPBFILE.SPB_INSTERM_5_7,
              SPBFILE.SPB_INSRATE_5_7,
              SPBFILE.SPB_INSTERM_5_8,
              SPBFILE.SPB_INSRATE_5_8,
              SPBFILE.SPB_INSTERM_5_9,
              SPBFILE.SPB_INSRATE_5_9,
              SPBFILE.SPB_INSTERM_5_10,
              SPBFILE.SPB_INSRATE_5_10,
              SPBFILE.SPB_INSTERM_5_11,
              SPBFILE.SPB_INSRATE_5_11,
              SPBFILE.SPB_INSTERM_5_12,
              SPBFILE.SPB_INSRATE_5_12,
              SPBFILE.SPB_INSTERM_5_13,
              SPBFILE.SPB_INSRATE_5_13,
              SPBFILE.SPB_INSTERM_5_14,
              SPBFILE.SPB_INSRATE_5_14,
              SPBFILE.SPB_INSTERM_5_15,
              SPBFILE.SPB_INSRATE_5_15,
              SPBFILE.SPB_INSTERM_5_16,
              SPBFILE.SPB_INSRATE_5_16,
              SPBFILE.SPB_INSTERM_5_17,
              SPBFILE.SPB_INSRATE_5_17,
              SPBFILE.SPB_INSTERM_5_18,
              SPBFILE.SPB_INSRATE_5_18,
              SPBFILE.SPB_INSTERM_5_19,
              SPBFILE.SPB_INSRATE_5_19,
              SPBFILE.SPB_INSTERM_5_20,
              SPBFILE.SPB_INSRATE_5_20,
              SPBFILE.SPB_INSMINPREM_5,
              SPBFILE.SPB_INSMINCHGABL_5,
              SPBFILE.SPB_INSMAXCHGABL_5,
              SPBFILE.SPB_INSMAXBENIF_5,
              SPBFILE.SPB_INSMAXTERM_5,
              SPBFILE.SPB_INSCHGBEN_5,
              SPBFILE.SPB_INSEXCEPT_5,
              SPBFILE.SPB_INSNOVER_5,
              SPBFILE.SPB_INSMINAGE_5_1,
              SPBFILE.SPB_INSMAXAGE_5_1,
              SPBFILE.SPB_INSMAXCOV_5_1,
              SPBFILE.SPB_INSMAXTRM_5_1,
              SPBFILE.SPB_INSMINAGE_5_2,
              SPBFILE.SPB_INSMAXAGE_5_2,
              SPBFILE.SPB_INSMAXCOV_5_2,
              SPBFILE.SPB_INSMAXTRM_5_2,
              SPBFILE.SPB_INSMINAGE_5_3,
              SPBFILE.SPB_INSMAXAGE_5_3,
              SPBFILE.SPB_INSMAXCOV_5_3,
              SPBFILE.SPB_INSMAXTRM_5_3,
              SPBFILE.SPB_INSMINAGE_5_4,
              SPBFILE.SPB_INSMAXAGE_5_4,
              SPBFILE.SPB_INSMAXCOV_5_4,
              SPBFILE.SPB_INSMAXTRM_5_4,
              SPBFILE.SPB_INSMINAGE_5_5,
              SPBFILE.SPB_INSMAXAGE_5_5,
              SPBFILE.SPB_INSMAXCOV_5_5,
              SPBFILE.SPB_INSMAXTRM_5_5,
              SPBFILE.SPB_INSFEECD_5,
              SPBFILE.SPB_INSFEE_FRMLA_5,
              SPBFILE.SPB_INSCHGABL_FG_5,
              SPBFILE.SPB_INSREJECT_FG_5,
              SPBFILE.SPB_INSFINCHG_5,
              SPBFILE.SPB_INSCOM_6,
              SPBFILE.SPB_INSRATECD_6,
              SPBFILE.SPB_INSJFAC_6,
              SPBFILE.SPB_INSDISCNT_6,
              SPBFILE.SPB_INSCHGABL_6,
              SPBFILE.SPB_INSTERM_6_1,
              SPBFILE.SPB_INSRATE_6_1,
              SPBFILE.SPB_INSTERM_6_2,
              SPBFILE.SPB_INSRATE_6_2,
              SPBFILE.SPB_INSTERM_6_3,
              SPBFILE.SPB_INSRATE_6_3,
              SPBFILE.SPB_INSTERM_6_4,
              SPBFILE.SPB_INSRATE_6_4,
              SPBFILE.SPB_INSTERM_6_5,
              SPBFILE.SPB_INSRATE_6_5,
              SPBFILE.SPB_INSTERM_6_6,
              SPBFILE.SPB_INSRATE_6_6,
              SPBFILE.SPB_INSTERM_6_7,
              SPBFILE.SPB_INSRATE_6_7,
              SPBFILE.SPB_INSTERM_6_8,
              SPBFILE.SPB_INSRATE_6_8,
              SPBFILE.SPB_INSTERM_6_9,
              SPBFILE.SPB_INSRATE_6_9,
              SPBFILE.SPB_INSTERM_6_10,
              SPBFILE.SPB_INSRATE_6_10,
              SPBFILE.SPB_INSTERM_6_11,
              SPBFILE.SPB_INSRATE_6_11,
              SPBFILE.SPB_INSTERM_6_12,
              SPBFILE.SPB_INSRATE_6_12,
              SPBFILE.SPB_INSTERM_6_13,
              SPBFILE.SPB_INSRATE_6_13,
              SPBFILE.SPB_INSTERM_6_14,
              SPBFILE.SPB_INSRATE_6_14,
              SPBFILE.SPB_INSTERM_6_15,
              SPBFILE.SPB_INSRATE_6_15,
              SPBFILE.SPB_INSTERM_6_16,
              SPBFILE.SPB_INSRATE_6_16,
              SPBFILE.SPB_INSTERM_6_17,
              SPBFILE.SPB_INSRATE_6_17,
              SPBFILE.SPB_INSTERM_6_18,
              SPBFILE.SPB_INSRATE_6_18,
              SPBFILE.SPB_INSTERM_6_19,
              SPBFILE.SPB_INSRATE_6_19,
              SPBFILE.SPB_INSTERM_6_20,
              SPBFILE.SPB_INSRATE_6_20,
              SPBFILE.SPB_INSMINPREM_6,
              SPBFILE.SPB_INSMINCHGABL_6,
              SPBFILE.SPB_INSMAXCHGABL_6,
              SPBFILE.SPB_INSMAXBENIF_6,
              SPBFILE.SPB_INSMAXTERM_6,
              SPBFILE.SPB_INSCHGBEN_6,
              SPBFILE.SPB_INSEXCEPT_6,
              SPBFILE.SPB_INSNOVER_6,
              SPBFILE.SPB_INSMINAGE_6_1,
              SPBFILE.SPB_INSMAXAGE_6_1,
              SPBFILE.SPB_INSMAXCOV_6_1,
              SPBFILE.SPB_INSMAXTRM_6_1,
              SPBFILE.SPB_INSMINAGE_6_2,
              SPBFILE.SPB_INSMAXAGE_6_2,
              SPBFILE.SPB_INSMAXCOV_6_2,
              SPBFILE.SPB_INSMAXTRM_6_2,
              SPBFILE.SPB_INSMINAGE_6_3,
              SPBFILE.SPB_INSMAXAGE_6_3,
              SPBFILE.SPB_INSMAXCOV_6_3,
              SPBFILE.SPB_INSMAXTRM_6_3,
              SPBFILE.SPB_INSMINAGE_6_4,
              SPBFILE.SPB_INSMAXAGE_6_4,
              SPBFILE.SPB_INSMAXCOV_6_4,
              SPBFILE.SPB_INSMAXTRM_6_4,
              SPBFILE.SPB_INSMINAGE_6_5,
              SPBFILE.SPB_INSMAXAGE_6_5,
              SPBFILE.SPB_INSMAXCOV_6_5,
              SPBFILE.SPB_INSMAXTRM_6_5,
              SPBFILE.SPB_INSFEECD_6,
              SPBFILE.SPB_INSFEE_FRMLA_6,
              SPBFILE.SPB_INSCHGABL_FG_6,
              SPBFILE.SPB_INSREJECT_FG_6,
              SPBFILE.SPB_INSFINCHG_6,
              SPBFILE.SPB_INSCOM_7,
              SPBFILE.SPB_INSRATECD_7,
              SPBFILE.SPB_INSJFAC_7,
              SPBFILE.SPB_INSDISCNT_7,
              SPBFILE.SPB_INSCHGABL_7,
              SPBFILE.SPB_INSTERM_7_1,
              SPBFILE.SPB_INSRATE_7_1,
              SPBFILE.SPB_INSTERM_7_2,
              SPBFILE.SPB_INSRATE_7_2,
              SPBFILE.SPB_INSTERM_7_3,
              SPBFILE.SPB_INSRATE_7_3,
              SPBFILE.SPB_INSTERM_7_4,
              SPBFILE.SPB_INSRATE_7_4,
              SPBFILE.SPB_INSTERM_7_5,
              SPBFILE.SPB_INSRATE_7_5,
              SPBFILE.SPB_INSTERM_7_6,
              SPBFILE.SPB_INSRATE_7_6,
              SPBFILE.SPB_INSTERM_7_7,
              SPBFILE.SPB_INSRATE_7_7,
              SPBFILE.SPB_INSTERM_7_8,
              SPBFILE.SPB_INSRATE_7_8,
              SPBFILE.SPB_INSTERM_7_9,
              SPBFILE.SPB_INSRATE_7_9,
              SPBFILE.SPB_INSTERM_7_10,
              SPBFILE.SPB_INSRATE_7_10,
              SPBFILE.SPB_INSTERM_7_11,
              SPBFILE.SPB_INSRATE_7_11,
              SPBFILE.SPB_INSTERM_7_12,
              SPBFILE.SPB_INSRATE_7_12,
              SPBFILE.SPB_INSTERM_7_13,
              SPBFILE.SPB_INSRATE_7_13,
              SPBFILE.SPB_INSTERM_7_14,
              SPBFILE.SPB_INSRATE_7_14,
              SPBFILE.SPB_INSTERM_7_15,
              SPBFILE.SPB_INSRATE_7_15,
              SPBFILE.SPB_INSTERM_7_16,
              SPBFILE.SPB_INSRATE_7_16,
              SPBFILE.SPB_INSTERM_7_17,
              SPBFILE.SPB_INSRATE_7_17,
              SPBFILE.SPB_INSTERM_7_18,
              SPBFILE.SPB_INSRATE_7_18,
              SPBFILE.SPB_INSTERM_7_19,
              SPBFILE.SPB_INSRATE_7_19,
              SPBFILE.SPB_INSTERM_7_20,
              SPBFILE.SPB_INSRATE_7_20,
              SPBFILE.SPB_INSMINPREM_7,
              SPBFILE.SPB_INSMINCHGABL_7,
              SPBFILE.SPB_INSMAXCHGABL_7,
              SPBFILE.SPB_INSMAXBENIF_7,
              SPBFILE.SPB_INSMAXTERM_7,
              SPBFILE.SPB_INSCHGBEN_7,
              SPBFILE.SPB_INSEXCEPT_7,
              SPBFILE.SPB_INSNOVER_7,
              SPBFILE.SPB_INSMINAGE_7_1,
              SPBFILE.SPB_INSMAXAGE_7_1,
              SPBFILE.SPB_INSMAXCOV_7_1,
              SPBFILE.SPB_INSMAXTRM_7_1,
              SPBFILE.SPB_INSMINAGE_7_2,
              SPBFILE.SPB_INSMAXAGE_7_2,
              SPBFILE.SPB_INSMAXCOV_7_2,
              SPBFILE.SPB_INSMAXTRM_7_2,
              SPBFILE.SPB_INSMINAGE_7_3,
              SPBFILE.SPB_INSMAXAGE_7_3,
              SPBFILE.SPB_INSMAXCOV_7_3,
              SPBFILE.SPB_INSMAXTRM_7_3,
              SPBFILE.SPB_INSMINAGE_7_4,
              SPBFILE.SPB_INSMAXAGE_7_4,
              SPBFILE.SPB_INSMAXCOV_7_4,
              SPBFILE.SPB_INSMAXTRM_7_4,
              SPBFILE.SPB_INSMINAGE_7_5,
              SPBFILE.SPB_INSMAXAGE_7_5,
              SPBFILE.SPB_INSMAXCOV_7_5,
              SPBFILE.SPB_INSMAXTRM_7_5,
              SPBFILE.SPB_INSFEECD_7,
              SPBFILE.SPB_INSFEE_FRMLA_7,
              SPBFILE.SPB_INSCHGABL_FG_7,
              SPBFILE.SPB_INSREJECT_FG_7,
              SPBFILE.SPB_INSFINCHG_7,
              SPBFILE.SPB_INSCOM_8,
              SPBFILE.SPB_INSRATECD_8,
              SPBFILE.SPB_INSJFAC_8,
              SPBFILE.SPB_INSDISCNT_8,
              SPBFILE.SPB_INSCHGABL_8,
              SPBFILE.SPB_INSTERM_8_1,
              SPBFILE.SPB_INSRATE_8_1,
              SPBFILE.SPB_INSTERM_8_2,
              SPBFILE.SPB_INSRATE_8_2,
              SPBFILE.SPB_INSTERM_8_3,
              SPBFILE.SPB_INSRATE_8_3,
              SPBFILE.SPB_INSTERM_8_4,
              SPBFILE.SPB_INSRATE_8_4,
              SPBFILE.SPB_INSTERM_8_5,
              SPBFILE.SPB_INSRATE_8_5,
              SPBFILE.SPB_INSTERM_8_6,
              SPBFILE.SPB_INSRATE_8_6,
              SPBFILE.SPB_INSTERM_8_7,
              SPBFILE.SPB_INSRATE_8_7,
              SPBFILE.SPB_INSTERM_8_8,
              SPBFILE.SPB_INSRATE_8_8,
              SPBFILE.SPB_INSTERM_8_9,
              SPBFILE.SPB_INSRATE_8_9,
              SPBFILE.SPB_INSTERM_8_10,
              SPBFILE.SPB_INSRATE_8_10,
              SPBFILE.SPB_INSTERM_8_11,
              SPBFILE.SPB_INSRATE_8_11,
              SPBFILE.SPB_INSTERM_8_12,
              SPBFILE.SPB_INSRATE_8_12,
              SPBFILE.SPB_INSTERM_8_13,
              SPBFILE.SPB_INSRATE_8_13,
              SPBFILE.SPB_INSTERM_8_14,
              SPBFILE.SPB_INSRATE_8_14,
              SPBFILE.SPB_INSTERM_8_15,
              SPBFILE.SPB_INSRATE_8_15,
              SPBFILE.SPB_INSTERM_8_16,
              SPBFILE.SPB_INSRATE_8_16,
              SPBFILE.SPB_INSTERM_8_17,
              SPBFILE.SPB_INSRATE_8_17,
              SPBFILE.SPB_INSTERM_8_18,
              SPBFILE.SPB_INSRATE_8_18,
              SPBFILE.SPB_INSTERM_8_19,
              SPBFILE.SPB_INSRATE_8_19,
              SPBFILE.SPB_INSTERM_8_20,
              SPBFILE.SPB_INSRATE_8_20,
              SPBFILE.SPB_INSMINPREM_8,
              SPBFILE.SPB_INSMINCHGABL_8,
              SPBFILE.SPB_INSMAXCHGABL_8,
              SPBFILE.SPB_INSMAXBENIF_8,
              SPBFILE.SPB_INSMAXTERM_8,
              SPBFILE.SPB_INSCHGBEN_8,
              SPBFILE.SPB_INSEXCEPT_8,
              SPBFILE.SPB_INSNOVER_8,
              SPBFILE.SPB_INSMINAGE_8_1,
              SPBFILE.SPB_INSMAXAGE_8_1,
              SPBFILE.SPB_INSMAXCOV_8_1,
              SPBFILE.SPB_INSMAXTRM_8_1,
              SPBFILE.SPB_INSMINAGE_8_2,
              SPBFILE.SPB_INSMAXAGE_8_2,
              SPBFILE.SPB_INSMAXCOV_8_2,
              SPBFILE.SPB_INSMAXTRM_8_2,
              SPBFILE.SPB_INSMINAGE_8_3,
              SPBFILE.SPB_INSMAXAGE_8_3,
              SPBFILE.SPB_INSMAXCOV_8_3,
              SPBFILE.SPB_INSMAXTRM_8_3,
              SPBFILE.SPB_INSMINAGE_8_4,
              SPBFILE.SPB_INSMAXAGE_8_4,
              SPBFILE.SPB_INSMAXCOV_8_4,
              SPBFILE.SPB_INSMAXTRM_8_4,
              SPBFILE.SPB_INSMINAGE_8_5,
              SPBFILE.SPB_INSMAXAGE_8_5,
              SPBFILE.SPB_INSMAXCOV_8_5,
              SPBFILE.SPB_INSMAXTRM_8_5,
              SPBFILE.SPB_INSFEECD_8,
              SPBFILE.SPB_INSFEE_FRMLA_8,
              SPBFILE.SPB_INSCHGABL_FG_8,
              SPBFILE.SPB_INSREJECT_FG_8,
              SPBFILE.SPB_INSFINCHG_8,
              SPBFILE.SPB_INSCOM_9,
              SPBFILE.SPB_INSRATECD_9,
              SPBFILE.SPB_INSJFAC_9,
              SPBFILE.SPB_INSDISCNT_9,
              SPBFILE.SPB_INSCHGABL_9,
              SPBFILE.SPB_INSTERM_9_1,
              SPBFILE.SPB_INSRATE_9_1,
              SPBFILE.SPB_INSTERM_9_2,
              SPBFILE.SPB_INSRATE_9_2,
              SPBFILE.SPB_INSTERM_9_3,
              SPBFILE.SPB_INSRATE_9_3,
              SPBFILE.SPB_INSTERM_9_4,
              SPBFILE.SPB_INSRATE_9_4,
              SPBFILE.SPB_INSTERM_9_5,
              SPBFILE.SPB_INSRATE_9_5,
              SPBFILE.SPB_INSTERM_9_6,
              SPBFILE.SPB_INSRATE_9_6,
              SPBFILE.SPB_INSTERM_9_7,
              SPBFILE.SPB_INSRATE_9_7,
              SPBFILE.SPB_INSTERM_9_8,
              SPBFILE.SPB_INSRATE_9_8,
              SPBFILE.SPB_INSTERM_9_9,
              SPBFILE.SPB_INSRATE_9_9,
              SPBFILE.SPB_INSTERM_9_10,
              SPBFILE.SPB_INSRATE_9_10,
              SPBFILE.SPB_INSTERM_9_11,
              SPBFILE.SPB_INSRATE_9_11,
              SPBFILE.SPB_INSTERM_9_12,
              SPBFILE.SPB_INSRATE_9_12,
              SPBFILE.SPB_INSTERM_9_13,
              SPBFILE.SPB_INSRATE_9_13,
              SPBFILE.SPB_INSTERM_9_14,
              SPBFILE.SPB_INSRATE_9_14,
              SPBFILE.SPB_INSTERM_9_15,
              SPBFILE.SPB_INSRATE_9_15,
              SPBFILE.SPB_INSTERM_9_16,
              SPBFILE.SPB_INSRATE_9_16,
              SPBFILE.SPB_INSTERM_9_17,
              SPBFILE.SPB_INSRATE_9_17,
              SPBFILE.SPB_INSTERM_9_18,
              SPBFILE.SPB_INSRATE_9_18,
              SPBFILE.SPB_INSTERM_9_19,
              SPBFILE.SPB_INSRATE_9_19,
              SPBFILE.SPB_INSTERM_9_20,
              SPBFILE.SPB_INSRATE_9_20,
              SPBFILE.SPB_INSMINPREM_9,
              SPBFILE.SPB_INSMINCHGABL_9,
              SPBFILE.SPB_INSMAXCHGABL_9,
              SPBFILE.SPB_INSMAXBENIF_9,
              SPBFILE.SPB_INSMAXTERM_9,
              SPBFILE.SPB_INSCHGBEN_9,
              SPBFILE.SPB_INSEXCEPT_9,
              SPBFILE.SPB_INSNOVER_9,
              SPBFILE.SPB_INSMINAGE_9_1,
              SPBFILE.SPB_INSMAXAGE_9_1,
              SPBFILE.SPB_INSMAXCOV_9_1,
              SPBFILE.SPB_INSMAXTRM_9_1,
              SPBFILE.SPB_INSMINAGE_9_2,
              SPBFILE.SPB_INSMAXAGE_9_2,
              SPBFILE.SPB_INSMAXCOV_9_2,
              SPBFILE.SPB_INSMAXTRM_9_2,
              SPBFILE.SPB_INSMINAGE_9_3,
              SPBFILE.SPB_INSMAXAGE_9_3,
              SPBFILE.SPB_INSMAXCOV_9_3,
              SPBFILE.SPB_INSMAXTRM_9_3,
              SPBFILE.SPB_INSMINAGE_9_4,
              SPBFILE.SPB_INSMAXAGE_9_4,
              SPBFILE.SPB_INSMAXCOV_9_4,
              SPBFILE.SPB_INSMAXTRM_9_4,
              SPBFILE.SPB_INSMINAGE_9_5,
              SPBFILE.SPB_INSMAXAGE_9_5,
              SPBFILE.SPB_INSMAXCOV_9_5,
              SPBFILE.SPB_INSMAXTRM_9_5,
              SPBFILE.SPB_INSFEECD_9,
              SPBFILE.SPB_INSFEE_FRMLA_9,
              SPBFILE.SPB_INSCHGABL_FG_9,
              SPBFILE.SPB_INSREJECT_FG_9,
              SPBFILE.SPB_INSFINCHG_9,
              SPBFILE.SPB_INSCOM_10,
              SPBFILE.SPB_INSRATECD_10,
              SPBFILE.SPB_INSJFAC_10,
              SPBFILE.SPB_INSDISCNT_10,
              SPBFILE.SPB_INSCHGABL_10,
              SPBFILE.SPB_INSTERM_10_1,
              SPBFILE.SPB_INSRATE_10_1,
              SPBFILE.SPB_INSTERM_10_2,
              SPBFILE.SPB_INSRATE_10_2,
              SPBFILE.SPB_INSTERM_10_3,
              SPBFILE.SPB_INSRATE_10_3,
              SPBFILE.SPB_INSTERM_10_4,
              SPBFILE.SPB_INSRATE_10_4,
              SPBFILE.SPB_INSTERM_10_5,
              SPBFILE.SPB_INSRATE_10_5,
              SPBFILE.SPB_INSTERM_10_6,
              SPBFILE.SPB_INSRATE_10_6,
              SPBFILE.SPB_INSTERM_10_7,
              SPBFILE.SPB_INSRATE_10_7,
              SPBFILE.SPB_INSTERM_10_8,
              SPBFILE.SPB_INSRATE_10_8,
              SPBFILE.SPB_INSTERM_10_9,
              SPBFILE.SPB_INSRATE_10_9,
              SPBFILE.SPB_INSTERM_10_10,
              SPBFILE.SPB_INSRATE_10_10,
              SPBFILE.SPB_INSTERM_10_11,
              SPBFILE.SPB_INSRATE_10_11,
              SPBFILE.SPB_INSTERM_10_12,
              SPBFILE.SPB_INSRATE_10_12,
              SPBFILE.SPB_INSTERM_10_13,
              SPBFILE.SPB_INSRATE_10_13,
              SPBFILE.SPB_INSTERM_10_14,
              SPBFILE.SPB_INSRATE_10_14,
              SPBFILE.SPB_INSTERM_10_15,
              SPBFILE.SPB_INSRATE_10_15,
              SPBFILE.SPB_INSTERM_10_16,
              SPBFILE.SPB_INSRATE_10_16,
              SPBFILE.SPB_INSTERM_10_17,
              SPBFILE.SPB_INSRATE_10_17,
              SPBFILE.SPB_INSTERM_10_18,
              SPBFILE.SPB_INSRATE_10_18,
              SPBFILE.SPB_INSTERM_10_19,
              SPBFILE.SPB_INSRATE_10_19,
              SPBFILE.SPB_INSTERM_10_20,
              SPBFILE.SPB_INSRATE_10_20,
              SPBFILE.SPB_INSMINPREM_10,
              SPBFILE.SPB_INSMINCHGABL_10,
              SPBFILE.SPB_INSMAXCHGABL_10,
              SPBFILE.SPB_INSMAXBENIF_10,
              SPBFILE.SPB_INSMAXTERM_10,
              SPBFILE.SPB_INSCHGBEN_10,
              SPBFILE.SPB_INSEXCEPT_10,
              SPBFILE.SPB_INSNOVER_10,
              SPBFILE.SPB_INSMINAGE_10_1,
              SPBFILE.SPB_INSMAXAGE_10_1,
              SPBFILE.SPB_INSMAXCOV_10_1,
              SPBFILE.SPB_INSMAXTRM_10_1,
              SPBFILE.SPB_INSMINAGE_10_2,
              SPBFILE.SPB_INSMAXAGE_10_2,
              SPBFILE.SPB_INSMAXCOV_10_2,
              SPBFILE.SPB_INSMAXTRM_10_2,
              SPBFILE.SPB_INSMINAGE_10_3,
              SPBFILE.SPB_INSMAXAGE_10_3,
              SPBFILE.SPB_INSMAXCOV_10_3,
              SPBFILE.SPB_INSMAXTRM_10_3,
              SPBFILE.SPB_INSMINAGE_10_4,
              SPBFILE.SPB_INSMAXAGE_10_4,
              SPBFILE.SPB_INSMAXCOV_10_4,
              SPBFILE.SPB_INSMAXTRM_10_4,
              SPBFILE.SPB_INSMINAGE_10_5,
              SPBFILE.SPB_INSMAXAGE_10_5,
              SPBFILE.SPB_INSMAXCOV_10_5,
              SPBFILE.SPB_INSMAXTRM_10_5,
              SPBFILE.SPB_INSFEECD_10,
              SPBFILE.SPB_INSFEE_FRMLA_10,
              SPBFILE.SPB_INSCHGABL_FG_10,
              SPBFILE.SPB_INSREJECT_FG_10,
              SPBFILE.SPB_INSFINCHG_10,
              SPBFILE.SPB_INSCOM_11,
              SPBFILE.SPB_INSRATECD_11,
              SPBFILE.SPB_INSJFAC_11,
              SPBFILE.SPB_INSDISCNT_11,
              SPBFILE.SPB_INSCHGABL_11,
              SPBFILE.SPB_INSTERM_11_1,
              SPBFILE.SPB_INSRATE_11_1,
              SPBFILE.SPB_INSTERM_11_2,
              SPBFILE.SPB_INSRATE_11_2,
              SPBFILE.SPB_INSTERM_11_3,
              SPBFILE.SPB_INSRATE_11_3,
              SPBFILE.SPB_INSTERM_11_4,
              SPBFILE.SPB_INSRATE_11_4,
              SPBFILE.SPB_INSTERM_11_5,
              SPBFILE.SPB_INSRATE_11_5,
              SPBFILE.SPB_INSTERM_11_6,
              SPBFILE.SPB_INSRATE_11_6,
              SPBFILE.SPB_INSTERM_11_7,
              SPBFILE.SPB_INSRATE_11_7,
              SPBFILE.SPB_INSTERM_11_8,
              SPBFILE.SPB_INSRATE_11_8,
              SPBFILE.SPB_INSTERM_11_9,
              SPBFILE.SPB_INSRATE_11_9,
              SPBFILE.SPB_INSTERM_11_10,
              SPBFILE.SPB_INSRATE_11_10,
              SPBFILE.SPB_INSTERM_11_11,
              SPBFILE.SPB_INSRATE_11_11,
              SPBFILE.SPB_INSTERM_11_12,
              SPBFILE.SPB_INSRATE_11_12,
              SPBFILE.SPB_INSTERM_11_13,
              SPBFILE.SPB_INSRATE_11_13,
              SPBFILE.SPB_INSTERM_11_14,
              SPBFILE.SPB_INSRATE_11_14,
              SPBFILE.SPB_INSTERM_11_15,
              SPBFILE.SPB_INSRATE_11_15,
              SPBFILE.SPB_INSTERM_11_16,
              SPBFILE.SPB_INSRATE_11_16,
              SPBFILE.SPB_INSTERM_11_17,
              SPBFILE.SPB_INSRATE_11_17,
              SPBFILE.SPB_INSTERM_11_18,
              SPBFILE.SPB_INSRATE_11_18,
              SPBFILE.SPB_INSTERM_11_19,
              SPBFILE.SPB_INSRATE_11_19,
              SPBFILE.SPB_INSTERM_11_20,
              SPBFILE.SPB_INSRATE_11_20,
              SPBFILE.SPB_INSMINPREM_11,
              SPBFILE.SPB_INSMINCHGABL_11,
              SPBFILE.SPB_INSMAXCHGABL_11,
              SPBFILE.SPB_INSMAXBENIF_11,
              SPBFILE.SPB_INSMAXTERM_11,
              SPBFILE.SPB_INSCHGBEN_11,
              SPBFILE.SPB_INSEXCEPT_11,
              SPBFILE.SPB_INSNOVER_11,
              SPBFILE.SPB_INSMINAGE_11_1,
              SPBFILE.SPB_INSMAXAGE_11_1,
              SPBFILE.SPB_INSMAXCOV_11_1,
              SPBFILE.SPB_INSMAXTRM_11_1,
              SPBFILE.SPB_INSMINAGE_11_2,
              SPBFILE.SPB_INSMAXAGE_11_2,
              SPBFILE.SPB_INSMAXCOV_11_2,
              SPBFILE.SPB_INSMAXTRM_11_2,
              SPBFILE.SPB_INSMINAGE_11_3,
              SPBFILE.SPB_INSMAXAGE_11_3,
              SPBFILE.SPB_INSMAXCOV_11_3,
              SPBFILE.SPB_INSMAXTRM_11_3,
              SPBFILE.SPB_INSMINAGE_11_4,
              SPBFILE.SPB_INSMAXAGE_11_4,
              SPBFILE.SPB_INSMAXCOV_11_4,
              SPBFILE.SPB_INSMAXTRM_11_4,
              SPBFILE.SPB_INSMINAGE_11_5,
              SPBFILE.SPB_INSMAXAGE_11_5,
              SPBFILE.SPB_INSMAXCOV_11_5,
              SPBFILE.SPB_INSMAXTRM_11_5,
              SPBFILE.SPB_INSFEECD_11,
              SPBFILE.SPB_INSFEE_FRMLA_11,
              SPBFILE.SPB_INSCHGABL_FG_11,
              SPBFILE.SPB_INSREJECT_FG_11,
              SPBFILE.SPB_INSFINCHG_11,
              SPBFILE.SPB_INSCOM_12,
              SPBFILE.SPB_INSRATECD_12,
              SPBFILE.SPB_INSJFAC_12,
              SPBFILE.SPB_INSDISCNT_12,
              SPBFILE.SPB_INSCHGABL_12,
              SPBFILE.SPB_INSTERM_12_1,
              SPBFILE.SPB_INSRATE_12_1,
              SPBFILE.SPB_INSTERM_12_2,
              SPBFILE.SPB_INSRATE_12_2,
              SPBFILE.SPB_INSTERM_12_3,
              SPBFILE.SPB_INSRATE_12_3,
              SPBFILE.SPB_INSTERM_12_4,
              SPBFILE.SPB_INSRATE_12_4,
              SPBFILE.SPB_INSTERM_12_5,
              SPBFILE.SPB_INSRATE_12_5,
              SPBFILE.SPB_INSTERM_12_6,
              SPBFILE.SPB_INSRATE_12_6,
              SPBFILE.SPB_INSTERM_12_7,
              SPBFILE.SPB_INSRATE_12_7,
              SPBFILE.SPB_INSTERM_12_8,
              SPBFILE.SPB_INSRATE_12_8,
              SPBFILE.SPB_INSTERM_12_9,
              SPBFILE.SPB_INSRATE_12_9,
              SPBFILE.SPB_INSTERM_12_10,
              SPBFILE.SPB_INSRATE_12_10,
              SPBFILE.SPB_INSTERM_12_11,
              SPBFILE.SPB_INSRATE_12_11,
              SPBFILE.SPB_INSTERM_12_12,
              SPBFILE.SPB_INSRATE_12_12,
              SPBFILE.SPB_INSTERM_12_13,
              SPBFILE.SPB_INSRATE_12_13,
              SPBFILE.SPB_INSTERM_12_14,
              SPBFILE.SPB_INSRATE_12_14,
              SPBFILE.SPB_INSTERM_12_15,
              SPBFILE.SPB_INSRATE_12_15,
              SPBFILE.SPB_INSTERM_12_16,
              SPBFILE.SPB_INSRATE_12_16,
              SPBFILE.SPB_INSTERM_12_17,
              SPBFILE.SPB_INSRATE_12_17,
              SPBFILE.SPB_INSTERM_12_18,
              SPBFILE.SPB_INSRATE_12_18,
              SPBFILE.SPB_INSTERM_12_19,
              SPBFILE.SPB_INSRATE_12_19,
              SPBFILE.SPB_INSTERM_12_20,
              SPBFILE.SPB_INSRATE_12_20,
              SPBFILE.SPB_INSMINPREM_12,
              SPBFILE.SPB_INSMINCHGABL_12,
              SPBFILE.SPB_INSMAXCHGABL_12,
              SPBFILE.SPB_INSMAXBENIF_12,
              SPBFILE.SPB_INSMAXTERM_12,
              SPBFILE.SPB_INSCHGBEN_12,
              SPBFILE.SPB_INSEXCEPT_12,
              SPBFILE.SPB_INSNOVER_12,
              SPBFILE.SPB_INSMINAGE_12_1,
              SPBFILE.SPB_INSMAXAGE_12_1,
              SPBFILE.SPB_INSMAXCOV_12_1,
              SPBFILE.SPB_INSMAXTRM_12_1,
              SPBFILE.SPB_INSMINAGE_12_2,
              SPBFILE.SPB_INSMAXAGE_12_2,
              SPBFILE.SPB_INSMAXCOV_12_2,
              SPBFILE.SPB_INSMAXTRM_12_2,
              SPBFILE.SPB_INSMINAGE_12_3,
              SPBFILE.SPB_INSMAXAGE_12_3,
              SPBFILE.SPB_INSMAXCOV_12_3,
              SPBFILE.SPB_INSMAXTRM_12_3,
              SPBFILE.SPB_INSMINAGE_12_4,
              SPBFILE.SPB_INSMAXAGE_12_4,
              SPBFILE.SPB_INSMAXCOV_12_4,
              SPBFILE.SPB_INSMAXTRM_12_4,
              SPBFILE.SPB_INSMINAGE_12_5,
              SPBFILE.SPB_INSMAXAGE_12_5,
              SPBFILE.SPB_INSMAXCOV_12_5,
              SPBFILE.SPB_INSMAXTRM_12_5,
              SPBFILE.SPB_INSFEECD_12,
              SPBFILE.SPB_INSFEE_FRMLA_12,
              SPBFILE.SPB_INSCHGABL_FG_12,
              SPBFILE.SPB_INSREJECT_FG_12,
              SPBFILE.SPB_INSFINCHG_12)
            VALUES
             (:QSPB-ORGST,
              :QSPB-SPRCLASS,
              :QSPB-SUBCLASS,
              :QSPB-LAWCODE,
              :QSPB-INSCOM-1,
              :QSPB-INSRATECD-1,
              :QSPB-INSJFAC-1,
              :QSPB-INSDISCNT-1,
              :QSPB-INSCHGABL-1,
              :QSPB-INSTERM-1-1,
              :QSPB-INSRATE-1-1,
              :QSPB-INSTERM-1-2,
              :QSPB-INSRATE-1-2,
              :QSPB-INSTERM-1-3,
              :QSPB-INSRATE-1-3,
              :QSPB-INSTERM-1-4,
              :QSPB-INSRATE-1-4,
              :QSPB-INSTERM-1-5,
              :QSPB-INSRATE-1-5,
              :QSPB-INSTERM-1-6,
              :QSPB-INSRATE-1-6,
              :QSPB-INSTERM-1-7,
              :QSPB-INSRATE-1-7,
              :QSPB-INSTERM-1-8,
              :QSPB-INSRATE-1-8,
              :QSPB-INSTERM-1-9,
              :QSPB-INSRATE-1-9,
              :QSPB-INSTERM-1-10,
              :QSPB-INSRATE-1-10,
              :QSPB-INSTERM-1-11,
              :QSPB-INSRATE-1-11,
              :QSPB-INSTERM-1-12,
              :QSPB-INSRATE-1-12,
              :QSPB-INSTERM-1-13,
              :QSPB-INSRATE-1-13,
              :QSPB-INSTERM-1-14,
              :QSPB-INSRATE-1-14,
              :QSPB-INSTERM-1-15,
              :QSPB-INSRATE-1-15,
              :QSPB-INSTERM-1-16,
              :QSPB-INSRATE-1-16,
              :QSPB-INSTERM-1-17,
              :QSPB-INSRATE-1-17,
              :QSPB-INSTERM-1-18,
              :QSPB-INSRATE-1-18,
              :QSPB-INSTERM-1-19,
              :QSPB-INSRATE-1-19,
              :QSPB-INSTERM-1-20,
              :QSPB-INSRATE-1-20,
              :QSPB-INSMINPREM-1,
              :QSPB-INSMINCHGABL-1,
              :QSPB-INSMAXCHGABL-1,
              :QSPB-INSMAXBENIF-1,
              :QSPB-INSMAXTERM-1,
              :QSPB-INSCHGBEN-1,
              :QSPB-INSEXCEPT-1,
              :QSPB-INSNOVER-1,
              :QSPB-INSMINAGE-1-1,
              :QSPB-INSMAXAGE-1-1,
              :QSPB-INSMAXCOV-1-1,
              :QSPB-INSMAXTRM-1-1,
              :QSPB-INSMINAGE-1-2,
              :QSPB-INSMAXAGE-1-2,
              :QSPB-INSMAXCOV-1-2,
              :QSPB-INSMAXTRM-1-2,
              :QSPB-INSMINAGE-1-3,
              :QSPB-INSMAXAGE-1-3,
              :QSPB-INSMAXCOV-1-3,
              :QSPB-INSMAXTRM-1-3,
              :QSPB-INSMINAGE-1-4,
              :QSPB-INSMAXAGE-1-4,
              :QSPB-INSMAXCOV-1-4,
              :QSPB-INSMAXTRM-1-4,
              :QSPB-INSMINAGE-1-5,
              :QSPB-INSMAXAGE-1-5,
              :QSPB-INSMAXCOV-1-5,
              :QSPB-INSMAXTRM-1-5,
              :QSPB-INSFEECD-1,
              :QSPB-INSFEE-FRMLA-1,
              :QSPB-INSCHGABL-FG-1,
              :QSPB-INSREJECT-FG-1,
              :QSPB-INSFINCHG-1,
              :QSPB-INSCOM-2,
              :QSPB-INSRATECD-2,
              :QSPB-INSJFAC-2,
              :QSPB-INSDISCNT-2,
              :QSPB-INSCHGABL-2,
              :QSPB-INSTERM-2-1,
              :QSPB-INSRATE-2-1,
              :QSPB-INSTERM-2-2,
              :QSPB-INSRATE-2-2,
              :QSPB-INSTERM-2-3,
              :QSPB-INSRATE-2-3,
              :QSPB-INSTERM-2-4,
              :QSPB-INSRATE-2-4,
              :QSPB-INSTERM-2-5,
              :QSPB-INSRATE-2-5,
              :QSPB-INSTERM-2-6,
              :QSPB-INSRATE-2-6,
              :QSPB-INSTERM-2-7,
              :QSPB-INSRATE-2-7,
              :QSPB-INSTERM-2-8,
              :QSPB-INSRATE-2-8,
              :QSPB-INSTERM-2-9,
              :QSPB-INSRATE-2-9,
              :QSPB-INSTERM-2-10,
              :QSPB-INSRATE-2-10,
              :QSPB-INSTERM-2-11,
              :QSPB-INSRATE-2-11,
              :QSPB-INSTERM-2-12,
              :QSPB-INSRATE-2-12,
              :QSPB-INSTERM-2-13,
              :QSPB-INSRATE-2-13,
              :QSPB-INSTERM-2-14,
              :QSPB-INSRATE-2-14,
              :QSPB-INSTERM-2-15,
              :QSPB-INSRATE-2-15,
              :QSPB-INSTERM-2-16,
              :QSPB-INSRATE-2-16,
              :QSPB-INSTERM-2-17,
              :QSPB-INSRATE-2-17,
              :QSPB-INSTERM-2-18,
              :QSPB-INSRATE-2-18,
              :QSPB-INSTERM-2-19,
              :QSPB-INSRATE-2-19,
              :QSPB-INSTERM-2-20,
              :QSPB-INSRATE-2-20,
              :QSPB-INSMINPREM-2,
              :QSPB-INSMINCHGABL-2,
              :QSPB-INSMAXCHGABL-2,
              :QSPB-INSMAXBENIF-2,
              :QSPB-INSMAXTERM-2,
              :QSPB-INSCHGBEN-2,
              :QSPB-INSEXCEPT-2,
              :QSPB-INSNOVER-2,
              :QSPB-INSMINAGE-2-1,
              :QSPB-INSMAXAGE-2-1,
              :QSPB-INSMAXCOV-2-1,
              :QSPB-INSMAXTRM-2-1,
              :QSPB-INSMINAGE-2-2,
              :QSPB-INSMAXAGE-2-2,
              :QSPB-INSMAXCOV-2-2,
              :QSPB-INSMAXTRM-2-2,
              :QSPB-INSMINAGE-2-3,
              :QSPB-INSMAXAGE-2-3,
              :QSPB-INSMAXCOV-2-3,
              :QSPB-INSMAXTRM-2-3,
              :QSPB-INSMINAGE-2-4,
              :QSPB-INSMAXAGE-2-4,
              :QSPB-INSMAXCOV-2-4,
              :QSPB-INSMAXTRM-2-4,
              :QSPB-INSMINAGE-2-5,
              :QSPB-INSMAXAGE-2-5,
              :QSPB-INSMAXCOV-2-5,
              :QSPB-INSMAXTRM-2-5,
              :QSPB-INSFEECD-2,
              :QSPB-INSFEE-FRMLA-2,
              :QSPB-INSCHGABL-FG-2,
              :QSPB-INSREJECT-FG-2,
              :QSPB-INSFINCHG-2,
              :QSPB-INSCOM-3,
              :QSPB-INSRATECD-3,
              :QSPB-INSJFAC-3,
              :QSPB-INSDISCNT-3,
              :QSPB-INSCHGABL-3,
              :QSPB-INSTERM-3-1,
              :QSPB-INSRATE-3-1,
              :QSPB-INSTERM-3-2,
              :QSPB-INSRATE-3-2,
              :QSPB-INSTERM-3-3,
              :QSPB-INSRATE-3-3,
              :QSPB-INSTERM-3-4,
              :QSPB-INSRATE-3-4,
              :QSPB-INSTERM-3-5,
              :QSPB-INSRATE-3-5,
              :QSPB-INSTERM-3-6,
              :QSPB-INSRATE-3-6,
              :QSPB-INSTERM-3-7,
              :QSPB-INSRATE-3-7,
              :QSPB-INSTERM-3-8,
              :QSPB-INSRATE-3-8,
              :QSPB-INSTERM-3-9,
              :QSPB-INSRATE-3-9,
              :QSPB-INSTERM-3-10,
              :QSPB-INSRATE-3-10,
              :QSPB-INSTERM-3-11,
              :QSPB-INSRATE-3-11,
              :QSPB-INSTERM-3-12,
              :QSPB-INSRATE-3-12,
              :QSPB-INSTERM-3-13,
              :QSPB-INSRATE-3-13,
              :QSPB-INSTERM-3-14,
              :QSPB-INSRATE-3-14,
              :QSPB-INSTERM-3-15,
              :QSPB-INSRATE-3-15,
              :QSPB-INSTERM-3-16,
              :QSPB-INSRATE-3-16,
              :QSPB-INSTERM-3-17,
              :QSPB-INSRATE-3-17,
              :QSPB-INSTERM-3-18,
              :QSPB-INSRATE-3-18,
              :QSPB-INSTERM-3-19,
              :QSPB-INSRATE-3-19,
              :QSPB-INSTERM-3-20,
              :QSPB-INSRATE-3-20,
              :QSPB-INSMINPREM-3,
              :QSPB-INSMINCHGABL-3,
              :QSPB-INSMAXCHGABL-3,
              :QSPB-INSMAXBENIF-3,
              :QSPB-INSMAXTERM-3,
              :QSPB-INSCHGBEN-3,
              :QSPB-INSEXCEPT-3,
              :QSPB-INSNOVER-3,
              :QSPB-INSMINAGE-3-1,
              :QSPB-INSMAXAGE-3-1,
              :QSPB-INSMAXCOV-3-1,
              :QSPB-INSMAXTRM-3-1,
              :QSPB-INSMINAGE-3-2,
              :QSPB-INSMAXAGE-3-2,
              :QSPB-INSMAXCOV-3-2,
              :QSPB-INSMAXTRM-3-2,
              :QSPB-INSMINAGE-3-3,
              :QSPB-INSMAXAGE-3-3,
              :QSPB-INSMAXCOV-3-3,
              :QSPB-INSMAXTRM-3-3,
              :QSPB-INSMINAGE-3-4,
              :QSPB-INSMAXAGE-3-4,
              :QSPB-INSMAXCOV-3-4,
              :QSPB-INSMAXTRM-3-4,
              :QSPB-INSMINAGE-3-5,
              :QSPB-INSMAXAGE-3-5,
              :QSPB-INSMAXCOV-3-5,
              :QSPB-INSMAXTRM-3-5,
              :QSPB-INSFEECD-3,
              :QSPB-INSFEE-FRMLA-3,
              :QSPB-INSCHGABL-FG-3,
              :QSPB-INSREJECT-FG-3,
              :QSPB-INSFINCHG-3,
              :QSPB-INSCOM-4,
              :QSPB-INSRATECD-4,
              :QSPB-INSJFAC-4,
              :QSPB-INSDISCNT-4,
              :QSPB-INSCHGABL-4,
              :QSPB-INSTERM-4-1,
              :QSPB-INSRATE-4-1,
              :QSPB-INSTERM-4-2,
              :QSPB-INSRATE-4-2,
              :QSPB-INSTERM-4-3,
              :QSPB-INSRATE-4-3,
              :QSPB-INSTERM-4-4,
              :QSPB-INSRATE-4-4,
              :QSPB-INSTERM-4-5,
              :QSPB-INSRATE-4-5,
              :QSPB-INSTERM-4-6,
              :QSPB-INSRATE-4-6,
              :QSPB-INSTERM-4-7,
              :QSPB-INSRATE-4-7,
              :QSPB-INSTERM-4-8,
              :QSPB-INSRATE-4-8,
              :QSPB-INSTERM-4-9,
              :QSPB-INSRATE-4-9,
              :QSPB-INSTERM-4-10,
              :QSPB-INSRATE-4-10,
              :QSPB-INSTERM-4-11,
              :QSPB-INSRATE-4-11,
              :QSPB-INSTERM-4-12,
              :QSPB-INSRATE-4-12,
              :QSPB-INSTERM-4-13,
              :QSPB-INSRATE-4-13,
              :QSPB-INSTERM-4-14,
              :QSPB-INSRATE-4-14,
              :QSPB-INSTERM-4-15,
              :QSPB-INSRATE-4-15,
              :QSPB-INSTERM-4-16,
              :QSPB-INSRATE-4-16,
              :QSPB-INSTERM-4-17,
              :QSPB-INSRATE-4-17,
              :QSPB-INSTERM-4-18,
              :QSPB-INSRATE-4-18,
              :QSPB-INSTERM-4-19,
              :QSPB-INSRATE-4-19,
              :QSPB-INSTERM-4-20,
              :QSPB-INSRATE-4-20,
              :QSPB-INSMINPREM-4,
              :QSPB-INSMINCHGABL-4,
              :QSPB-INSMAXCHGABL-4,
              :QSPB-INSMAXBENIF-4,
              :QSPB-INSMAXTERM-4,
              :QSPB-INSCHGBEN-4,
              :QSPB-INSEXCEPT-4,
              :QSPB-INSNOVER-4,
              :QSPB-INSMINAGE-4-1,
              :QSPB-INSMAXAGE-4-1,
              :QSPB-INSMAXCOV-4-1,
              :QSPB-INSMAXTRM-4-1,
              :QSPB-INSMINAGE-4-2,
              :QSPB-INSMAXAGE-4-2,
              :QSPB-INSMAXCOV-4-2,
              :QSPB-INSMAXTRM-4-2,
              :QSPB-INSMINAGE-4-3,
              :QSPB-INSMAXAGE-4-3,
              :QSPB-INSMAXCOV-4-3,
              :QSPB-INSMAXTRM-4-3,
              :QSPB-INSMINAGE-4-4,
              :QSPB-INSMAXAGE-4-4,
              :QSPB-INSMAXCOV-4-4,
              :QSPB-INSMAXTRM-4-4,
              :QSPB-INSMINAGE-4-5,
              :QSPB-INSMAXAGE-4-5,
              :QSPB-INSMAXCOV-4-5,
              :QSPB-INSMAXTRM-4-5,
              :QSPB-INSFEECD-4,
              :QSPB-INSFEE-FRMLA-4,
              :QSPB-INSCHGABL-FG-4,
              :QSPB-INSREJECT-FG-4,
              :QSPB-INSFINCHG-4,
              :QSPB-INSCOM-5,
              :QSPB-INSRATECD-5,
              :QSPB-INSJFAC-5,
              :QSPB-INSDISCNT-5,
              :QSPB-INSCHGABL-5,
              :QSPB-INSTERM-5-1,
              :QSPB-INSRATE-5-1,
              :QSPB-INSTERM-5-2,
              :QSPB-INSRATE-5-2,
              :QSPB-INSTERM-5-3,
              :QSPB-INSRATE-5-3,
              :QSPB-INSTERM-5-4,
              :QSPB-INSRATE-5-4,
              :QSPB-INSTERM-5-5,
              :QSPB-INSRATE-5-5,
              :QSPB-INSTERM-5-6,
              :QSPB-INSRATE-5-6,
              :QSPB-INSTERM-5-7,
              :QSPB-INSRATE-5-7,
              :QSPB-INSTERM-5-8,
              :QSPB-INSRATE-5-8,
              :QSPB-INSTERM-5-9,
              :QSPB-INSRATE-5-9,
              :QSPB-INSTERM-5-10,
              :QSPB-INSRATE-5-10,
              :QSPB-INSTERM-5-11,
              :QSPB-INSRATE-5-11,
              :QSPB-INSTERM-5-12,
              :QSPB-INSRATE-5-12,
              :QSPB-INSTERM-5-13,
              :QSPB-INSRATE-5-13,
              :QSPB-INSTERM-5-14,
              :QSPB-INSRATE-5-14,
              :QSPB-INSTERM-5-15,
              :QSPB-INSRATE-5-15,
              :QSPB-INSTERM-5-16,
              :QSPB-INSRATE-5-16,
              :QSPB-INSTERM-5-17,
              :QSPB-INSRATE-5-17,
              :QSPB-INSTERM-5-18,
              :QSPB-INSRATE-5-18,
              :QSPB-INSTERM-5-19,
              :QSPB-INSRATE-5-19,
              :QSPB-INSTERM-5-20,
              :QSPB-INSRATE-5-20,
              :QSPB-INSMINPREM-5,
              :QSPB-INSMINCHGABL-5,
              :QSPB-INSMAXCHGABL-5,
              :QSPB-INSMAXBENIF-5,
              :QSPB-INSMAXTERM-5,
              :QSPB-INSCHGBEN-5,
              :QSPB-INSEXCEPT-5,
              :QSPB-INSNOVER-5,
              :QSPB-INSMINAGE-5-1,
              :QSPB-INSMAXAGE-5-1,
              :QSPB-INSMAXCOV-5-1,
              :QSPB-INSMAXTRM-5-1,
              :QSPB-INSMINAGE-5-2,
              :QSPB-INSMAXAGE-5-2,
              :QSPB-INSMAXCOV-5-2,
              :QSPB-INSMAXTRM-5-2,
              :QSPB-INSMINAGE-5-3,
              :QSPB-INSMAXAGE-5-3,
              :QSPB-INSMAXCOV-5-3,
              :QSPB-INSMAXTRM-5-3,
              :QSPB-INSMINAGE-5-4,
              :QSPB-INSMAXAGE-5-4,
              :QSPB-INSMAXCOV-5-4,
              :QSPB-INSMAXTRM-5-4,
              :QSPB-INSMINAGE-5-5,
              :QSPB-INSMAXAGE-5-5,
              :QSPB-INSMAXCOV-5-5,
              :QSPB-INSMAXTRM-5-5,
              :QSPB-INSFEECD-5,
              :QSPB-INSFEE-FRMLA-5,
              :QSPB-INSCHGABL-FG-5,
              :QSPB-INSREJECT-FG-5,
              :QSPB-INSFINCHG-5,
              :QSPB-INSCOM-6,
              :QSPB-INSRATECD-6,
              :QSPB-INSJFAC-6,
              :QSPB-INSDISCNT-6,
              :QSPB-INSCHGABL-6,
              :QSPB-INSTERM-6-1,
              :QSPB-INSRATE-6-1,
              :QSPB-INSTERM-6-2,
              :QSPB-INSRATE-6-2,
              :QSPB-INSTERM-6-3,
              :QSPB-INSRATE-6-3,
              :QSPB-INSTERM-6-4,
              :QSPB-INSRATE-6-4,
              :QSPB-INSTERM-6-5,
              :QSPB-INSRATE-6-5,
              :QSPB-INSTERM-6-6,
              :QSPB-INSRATE-6-6,
              :QSPB-INSTERM-6-7,
              :QSPB-INSRATE-6-7,
              :QSPB-INSTERM-6-8,
              :QSPB-INSRATE-6-8,
              :QSPB-INSTERM-6-9,
              :QSPB-INSRATE-6-9,
              :QSPB-INSTERM-6-10,
              :QSPB-INSRATE-6-10,
              :QSPB-INSTERM-6-11,
              :QSPB-INSRATE-6-11,
              :QSPB-INSTERM-6-12,
              :QSPB-INSRATE-6-12,
              :QSPB-INSTERM-6-13,
              :QSPB-INSRATE-6-13,
              :QSPB-INSTERM-6-14,
              :QSPB-INSRATE-6-14,
              :QSPB-INSTERM-6-15,
              :QSPB-INSRATE-6-15,
              :QSPB-INSTERM-6-16,
              :QSPB-INSRATE-6-16,
              :QSPB-INSTERM-6-17,
              :QSPB-INSRATE-6-17,
              :QSPB-INSTERM-6-18,
              :QSPB-INSRATE-6-18,
              :QSPB-INSTERM-6-19,
              :QSPB-INSRATE-6-19,
              :QSPB-INSTERM-6-20,
              :QSPB-INSRATE-6-20,
              :QSPB-INSMINPREM-6,
              :QSPB-INSMINCHGABL-6,
              :QSPB-INSMAXCHGABL-6,
              :QSPB-INSMAXBENIF-6,
              :QSPB-INSMAXTERM-6,
              :QSPB-INSCHGBEN-6,
              :QSPB-INSEXCEPT-6,
              :QSPB-INSNOVER-6,
              :QSPB-INSMINAGE-6-1,
              :QSPB-INSMAXAGE-6-1,
              :QSPB-INSMAXCOV-6-1,
              :QSPB-INSMAXTRM-6-1,
              :QSPB-INSMINAGE-6-2,
              :QSPB-INSMAXAGE-6-2,
              :QSPB-INSMAXCOV-6-2,
              :QSPB-INSMAXTRM-6-2,
              :QSPB-INSMINAGE-6-3,
              :QSPB-INSMAXAGE-6-3,
              :QSPB-INSMAXCOV-6-3,
              :QSPB-INSMAXTRM-6-3,
              :QSPB-INSMINAGE-6-4,
              :QSPB-INSMAXAGE-6-4,
              :QSPB-INSMAXCOV-6-4,
              :QSPB-INSMAXTRM-6-4,
              :QSPB-INSMINAGE-6-5,
              :QSPB-INSMAXAGE-6-5,
              :QSPB-INSMAXCOV-6-5,
              :QSPB-INSMAXTRM-6-5,
              :QSPB-INSFEECD-6,
              :QSPB-INSFEE-FRMLA-6,
              :QSPB-INSCHGABL-FG-6,
              :QSPB-INSREJECT-FG-6,
              :QSPB-INSFINCHG-6,
              :QSPB-INSCOM-7,
              :QSPB-INSRATECD-7,
              :QSPB-INSJFAC-7,
              :QSPB-INSDISCNT-7,
              :QSPB-INSCHGABL-7,
              :QSPB-INSTERM-7-1,
              :QSPB-INSRATE-7-1,
              :QSPB-INSTERM-7-2,
              :QSPB-INSRATE-7-2,
              :QSPB-INSTERM-7-3,
              :QSPB-INSRATE-7-3,
              :QSPB-INSTERM-7-4,
              :QSPB-INSRATE-7-4,
              :QSPB-INSTERM-7-5,
              :QSPB-INSRATE-7-5,
              :QSPB-INSTERM-7-6,
              :QSPB-INSRATE-7-6,
              :QSPB-INSTERM-7-7,
              :QSPB-INSRATE-7-7,
              :QSPB-INSTERM-7-8,
              :QSPB-INSRATE-7-8,
              :QSPB-INSTERM-7-9,
              :QSPB-INSRATE-7-9,
              :QSPB-INSTERM-7-10,
              :QSPB-INSRATE-7-10,
              :QSPB-INSTERM-7-11,
              :QSPB-INSRATE-7-11,
              :QSPB-INSTERM-7-12,
              :QSPB-INSRATE-7-12,
              :QSPB-INSTERM-7-13,
              :QSPB-INSRATE-7-13,
              :QSPB-INSTERM-7-14,
              :QSPB-INSRATE-7-14,
              :QSPB-INSTERM-7-15,
              :QSPB-INSRATE-7-15,
              :QSPB-INSTERM-7-16,
              :QSPB-INSRATE-7-16,
              :QSPB-INSTERM-7-17,
              :QSPB-INSRATE-7-17,
              :QSPB-INSTERM-7-18,
              :QSPB-INSRATE-7-18,
              :QSPB-INSTERM-7-19,
              :QSPB-INSRATE-7-19,
              :QSPB-INSTERM-7-20,
              :QSPB-INSRATE-7-20,
              :QSPB-INSMINPREM-7,
              :QSPB-INSMINCHGABL-7,
              :QSPB-INSMAXCHGABL-7,
              :QSPB-INSMAXBENIF-7,
              :QSPB-INSMAXTERM-7,
              :QSPB-INSCHGBEN-7,
              :QSPB-INSEXCEPT-7,
              :QSPB-INSNOVER-7,
              :QSPB-INSMINAGE-7-1,
              :QSPB-INSMAXAGE-7-1,
              :QSPB-INSMAXCOV-7-1,
              :QSPB-INSMAXTRM-7-1,
              :QSPB-INSMINAGE-7-2,
              :QSPB-INSMAXAGE-7-2,
              :QSPB-INSMAXCOV-7-2,
              :QSPB-INSMAXTRM-7-2,
              :QSPB-INSMINAGE-7-3,
              :QSPB-INSMAXAGE-7-3,
              :QSPB-INSMAXCOV-7-3,
              :QSPB-INSMAXTRM-7-3,
              :QSPB-INSMINAGE-7-4,
              :QSPB-INSMAXAGE-7-4,
              :QSPB-INSMAXCOV-7-4,
              :QSPB-INSMAXTRM-7-4,
              :QSPB-INSMINAGE-7-5,
              :QSPB-INSMAXAGE-7-5,
              :QSPB-INSMAXCOV-7-5,
              :QSPB-INSMAXTRM-7-5,
              :QSPB-INSFEECD-7,
              :QSPB-INSFEE-FRMLA-7,
              :QSPB-INSCHGABL-FG-7,
              :QSPB-INSREJECT-FG-7,
              :QSPB-INSFINCHG-7,
              :QSPB-INSCOM-8,
              :QSPB-INSRATECD-8,
              :QSPB-INSJFAC-8,
              :QSPB-INSDISCNT-8,
              :QSPB-INSCHGABL-8,
              :QSPB-INSTERM-8-1,
              :QSPB-INSRATE-8-1,
              :QSPB-INSTERM-8-2,
              :QSPB-INSRATE-8-2,
              :QSPB-INSTERM-8-3,
              :QSPB-INSRATE-8-3,
              :QSPB-INSTERM-8-4,
              :QSPB-INSRATE-8-4,
              :QSPB-INSTERM-8-5,
              :QSPB-INSRATE-8-5,
              :QSPB-INSTERM-8-6,
              :QSPB-INSRATE-8-6,
              :QSPB-INSTERM-8-7,
              :QSPB-INSRATE-8-7,
              :QSPB-INSTERM-8-8,
              :QSPB-INSRATE-8-8,
              :QSPB-INSTERM-8-9,
              :QSPB-INSRATE-8-9,
              :QSPB-INSTERM-8-10,
              :QSPB-INSRATE-8-10,
              :QSPB-INSTERM-8-11,
              :QSPB-INSRATE-8-11,
              :QSPB-INSTERM-8-12,
              :QSPB-INSRATE-8-12,
              :QSPB-INSTERM-8-13,
              :QSPB-INSRATE-8-13,
              :QSPB-INSTERM-8-14,
              :QSPB-INSRATE-8-14,
              :QSPB-INSTERM-8-15,
              :QSPB-INSRATE-8-15,
              :QSPB-INSTERM-8-16,
              :QSPB-INSRATE-8-16,
              :QSPB-INSTERM-8-17,
              :QSPB-INSRATE-8-17,
              :QSPB-INSTERM-8-18,
              :QSPB-INSRATE-8-18,
              :QSPB-INSTERM-8-19,
              :QSPB-INSRATE-8-19,
              :QSPB-INSTERM-8-20,
              :QSPB-INSRATE-8-20,
              :QSPB-INSMINPREM-8,
              :QSPB-INSMINCHGABL-8,
              :QSPB-INSMAXCHGABL-8,
              :QSPB-INSMAXBENIF-8,
              :QSPB-INSMAXTERM-8,
              :QSPB-INSCHGBEN-8,
              :QSPB-INSEXCEPT-8,
              :QSPB-INSNOVER-8,
              :QSPB-INSMINAGE-8-1,
              :QSPB-INSMAXAGE-8-1,
              :QSPB-INSMAXCOV-8-1,
              :QSPB-INSMAXTRM-8-1,
              :QSPB-INSMINAGE-8-2,
              :QSPB-INSMAXAGE-8-2,
              :QSPB-INSMAXCOV-8-2,
              :QSPB-INSMAXTRM-8-2,
              :QSPB-INSMINAGE-8-3,
              :QSPB-INSMAXAGE-8-3,
              :QSPB-INSMAXCOV-8-3,
              :QSPB-INSMAXTRM-8-3,
              :QSPB-INSMINAGE-8-4,
              :QSPB-INSMAXAGE-8-4,
              :QSPB-INSMAXCOV-8-4,
              :QSPB-INSMAXTRM-8-4,
              :QSPB-INSMINAGE-8-5,
              :QSPB-INSMAXAGE-8-5,
              :QSPB-INSMAXCOV-8-5,
              :QSPB-INSMAXTRM-8-5,
              :QSPB-INSFEECD-8,
              :QSPB-INSFEE-FRMLA-8,
              :QSPB-INSCHGABL-FG-8,
              :QSPB-INSREJECT-FG-8,
              :QSPB-INSFINCHG-8,
              :QSPB-INSCOM-9,
              :QSPB-INSRATECD-9,
              :QSPB-INSJFAC-9,
              :QSPB-INSDISCNT-9,
              :QSPB-INSCHGABL-9,
              :QSPB-INSTERM-9-1,
              :QSPB-INSRATE-9-1,
              :QSPB-INSTERM-9-2,
              :QSPB-INSRATE-9-2,
              :QSPB-INSTERM-9-3,
              :QSPB-INSRATE-9-3,
              :QSPB-INSTERM-9-4,
              :QSPB-INSRATE-9-4,
              :QSPB-INSTERM-9-5,
              :QSPB-INSRATE-9-5,
              :QSPB-INSTERM-9-6,
              :QSPB-INSRATE-9-6,
              :QSPB-INSTERM-9-7,
              :QSPB-INSRATE-9-7,
              :QSPB-INSTERM-9-8,
              :QSPB-INSRATE-9-8,
              :QSPB-INSTERM-9-9,
              :QSPB-INSRATE-9-9,
              :QSPB-INSTERM-9-10,
              :QSPB-INSRATE-9-10,
              :QSPB-INSTERM-9-11,
              :QSPB-INSRATE-9-11,
              :QSPB-INSTERM-9-12,
              :QSPB-INSRATE-9-12,
              :QSPB-INSTERM-9-13,
              :QSPB-INSRATE-9-13,
              :QSPB-INSTERM-9-14,
              :QSPB-INSRATE-9-14,
              :QSPB-INSTERM-9-15,
              :QSPB-INSRATE-9-15,
              :QSPB-INSTERM-9-16,
              :QSPB-INSRATE-9-16,
              :QSPB-INSTERM-9-17,
              :QSPB-INSRATE-9-17,
              :QSPB-INSTERM-9-18,
              :QSPB-INSRATE-9-18,
              :QSPB-INSTERM-9-19,
              :QSPB-INSRATE-9-19,
              :QSPB-INSTERM-9-20,
              :QSPB-INSRATE-9-20,
              :QSPB-INSMINPREM-9,
              :QSPB-INSMINCHGABL-9,
              :QSPB-INSMAXCHGABL-9,
              :QSPB-INSMAXBENIF-9,
              :QSPB-INSMAXTERM-9,
              :QSPB-INSCHGBEN-9,
              :QSPB-INSEXCEPT-9,
              :QSPB-INSNOVER-9,
              :QSPB-INSMINAGE-9-1,
              :QSPB-INSMAXAGE-9-1,
              :QSPB-INSMAXCOV-9-1,
              :QSPB-INSMAXTRM-9-1,
              :QSPB-INSMINAGE-9-2,
              :QSPB-INSMAXAGE-9-2,
              :QSPB-INSMAXCOV-9-2,
              :QSPB-INSMAXTRM-9-2,
              :QSPB-INSMINAGE-9-3,
              :QSPB-INSMAXAGE-9-3,
              :QSPB-INSMAXCOV-9-3,
              :QSPB-INSMAXTRM-9-3,
              :QSPB-INSMINAGE-9-4,
              :QSPB-INSMAXAGE-9-4,
              :QSPB-INSMAXCOV-9-4,
              :QSPB-INSMAXTRM-9-4,
              :QSPB-INSMINAGE-9-5,
              :QSPB-INSMAXAGE-9-5,
              :QSPB-INSMAXCOV-9-5,
              :QSPB-INSMAXTRM-9-5,
              :QSPB-INSFEECD-9,
              :QSPB-INSFEE-FRMLA-9,
              :QSPB-INSCHGABL-FG-9,
              :QSPB-INSREJECT-FG-9,
              :QSPB-INSFINCHG-9,
              :QSPB-INSCOM-10,
              :QSPB-INSRATECD-10,
              :QSPB-INSJFAC-10,
              :QSPB-INSDISCNT-10,
              :QSPB-INSCHGABL-10,
              :QSPB-INSTERM-10-1,
              :QSPB-INSRATE-10-1,
              :QSPB-INSTERM-10-2,
              :QSPB-INSRATE-10-2,
              :QSPB-INSTERM-10-3,
              :QSPB-INSRATE-10-3,
              :QSPB-INSTERM-10-4,
              :QSPB-INSRATE-10-4,
              :QSPB-INSTERM-10-5,
              :QSPB-INSRATE-10-5,
              :QSPB-INSTERM-10-6,
              :QSPB-INSRATE-10-6,
              :QSPB-INSTERM-10-7,
              :QSPB-INSRATE-10-7,
              :QSPB-INSTERM-10-8,
              :QSPB-INSRATE-10-8,
              :QSPB-INSTERM-10-9,
              :QSPB-INSRATE-10-9,
              :QSPB-INSTERM-10-10,
              :QSPB-INSRATE-10-10,
              :QSPB-INSTERM-10-11,
              :QSPB-INSRATE-10-11,
              :QSPB-INSTERM-10-12,
              :QSPB-INSRATE-10-12,
              :QSPB-INSTERM-10-13,
              :QSPB-INSRATE-10-13,
              :QSPB-INSTERM-10-14,
              :QSPB-INSRATE-10-14,
              :QSPB-INSTERM-10-15,
              :QSPB-INSRATE-10-15,
              :QSPB-INSTERM-10-16,
              :QSPB-INSRATE-10-16,
              :QSPB-INSTERM-10-17,
              :QSPB-INSRATE-10-17,
              :QSPB-INSTERM-10-18,
              :QSPB-INSRATE-10-18,
              :QSPB-INSTERM-10-19,
              :QSPB-INSRATE-10-19,
              :QSPB-INSTERM-10-20,
              :QSPB-INSRATE-10-20,
              :QSPB-INSMINPREM-10,
              :QSPB-INSMINCHGABL-10,
              :QSPB-INSMAXCHGABL-10,
              :QSPB-INSMAXBENIF-10,
              :QSPB-INSMAXTERM-10,
              :QSPB-INSCHGBEN-10,
              :QSPB-INSEXCEPT-10,
              :QSPB-INSNOVER-10,
              :QSPB-INSMINAGE-10-1,
              :QSPB-INSMAXAGE-10-1,
              :QSPB-INSMAXCOV-10-1,
              :QSPB-INSMAXTRM-10-1,
              :QSPB-INSMINAGE-10-2,
              :QSPB-INSMAXAGE-10-2,
              :QSPB-INSMAXCOV-10-2,
              :QSPB-INSMAXTRM-10-2,
              :QSPB-INSMINAGE-10-3,
              :QSPB-INSMAXAGE-10-3,
              :QSPB-INSMAXCOV-10-3,
              :QSPB-INSMAXTRM-10-3,
              :QSPB-INSMINAGE-10-4,
              :QSPB-INSMAXAGE-10-4,
              :QSPB-INSMAXCOV-10-4,
              :QSPB-INSMAXTRM-10-4,
              :QSPB-INSMINAGE-10-5,
              :QSPB-INSMAXAGE-10-5,
              :QSPB-INSMAXCOV-10-5,
              :QSPB-INSMAXTRM-10-5,
              :QSPB-INSFEECD-10,
              :QSPB-INSFEE-FRMLA-10,
              :QSPB-INSCHGABL-FG-10,
              :QSPB-INSREJECT-FG-10,
              :QSPB-INSFINCHG-10,
              :QSPB-INSCOM-11,
              :QSPB-INSRATECD-11,
              :QSPB-INSJFAC-11,
              :QSPB-INSDISCNT-11,
              :QSPB-INSCHGABL-11,
              :QSPB-INSTERM-11-1,
              :QSPB-INSRATE-11-1,
              :QSPB-INSTERM-11-2,
              :QSPB-INSRATE-11-2,
              :QSPB-INSTERM-11-3,
              :QSPB-INSRATE-11-3,
              :QSPB-INSTERM-11-4,
              :QSPB-INSRATE-11-4,
              :QSPB-INSTERM-11-5,
              :QSPB-INSRATE-11-5,
              :QSPB-INSTERM-11-6,
              :QSPB-INSRATE-11-6,
              :QSPB-INSTERM-11-7,
              :QSPB-INSRATE-11-7,
              :QSPB-INSTERM-11-8,
              :QSPB-INSRATE-11-8,
              :QSPB-INSTERM-11-9,
              :QSPB-INSRATE-11-9,
              :QSPB-INSTERM-11-10,
              :QSPB-INSRATE-11-10,
              :QSPB-INSTERM-11-11,
              :QSPB-INSRATE-11-11,
              :QSPB-INSTERM-11-12,
              :QSPB-INSRATE-11-12,
              :QSPB-INSTERM-11-13,
              :QSPB-INSRATE-11-13,
              :QSPB-INSTERM-11-14,
              :QSPB-INSRATE-11-14,
              :QSPB-INSTERM-11-15,
              :QSPB-INSRATE-11-15,
              :QSPB-INSTERM-11-16,
              :QSPB-INSRATE-11-16,
              :QSPB-INSTERM-11-17,
              :QSPB-INSRATE-11-17,
              :QSPB-INSTERM-11-18,
              :QSPB-INSRATE-11-18,
              :QSPB-INSTERM-11-19,
              :QSPB-INSRATE-11-19,
              :QSPB-INSTERM-11-20,
              :QSPB-INSRATE-11-20,
              :QSPB-INSMINPREM-11,
              :QSPB-INSMINCHGABL-11,
              :QSPB-INSMAXCHGABL-11,
              :QSPB-INSMAXBENIF-11,
              :QSPB-INSMAXTERM-11,
              :QSPB-INSCHGBEN-11,
              :QSPB-INSEXCEPT-11,
              :QSPB-INSNOVER-11,
              :QSPB-INSMINAGE-11-1,
              :QSPB-INSMAXAGE-11-1,
              :QSPB-INSMAXCOV-11-1,
              :QSPB-INSMAXTRM-11-1,
              :QSPB-INSMINAGE-11-2,
              :QSPB-INSMAXAGE-11-2,
              :QSPB-INSMAXCOV-11-2,
              :QSPB-INSMAXTRM-11-2,
              :QSPB-INSMINAGE-11-3,
              :QSPB-INSMAXAGE-11-3,
              :QSPB-INSMAXCOV-11-3,
              :QSPB-INSMAXTRM-11-3,
              :QSPB-INSMINAGE-11-4,
              :QSPB-INSMAXAGE-11-4,
              :QSPB-INSMAXCOV-11-4,
              :QSPB-INSMAXTRM-11-4,
              :QSPB-INSMINAGE-11-5,
              :QSPB-INSMAXAGE-11-5,
              :QSPB-INSMAXCOV-11-5,
              :QSPB-INSMAXTRM-11-5,
              :QSPB-INSFEECD-11,
              :QSPB-INSFEE-FRMLA-11,
              :QSPB-INSCHGABL-FG-11,
              :QSPB-INSREJECT-FG-11,
              :QSPB-INSFINCHG-11,
              :QSPB-INSCOM-12,
              :QSPB-INSRATECD-12,
              :QSPB-INSJFAC-12,
              :QSPB-INSDISCNT-12,
              :QSPB-INSCHGABL-12,
              :QSPB-INSTERM-12-1,
              :QSPB-INSRATE-12-1,
              :QSPB-INSTERM-12-2,
              :QSPB-INSRATE-12-2,
              :QSPB-INSTERM-12-3,
              :QSPB-INSRATE-12-3,
              :QSPB-INSTERM-12-4,
              :QSPB-INSRATE-12-4,
              :QSPB-INSTERM-12-5,
              :QSPB-INSRATE-12-5,
              :QSPB-INSTERM-12-6,
              :QSPB-INSRATE-12-6,
              :QSPB-INSTERM-12-7,
              :QSPB-INSRATE-12-7,
              :QSPB-INSTERM-12-8,
              :QSPB-INSRATE-12-8,
              :QSPB-INSTERM-12-9,
              :QSPB-INSRATE-12-9,
              :QSPB-INSTERM-12-10,
              :QSPB-INSRATE-12-10,
              :QSPB-INSTERM-12-11,
              :QSPB-INSRATE-12-11,
              :QSPB-INSTERM-12-12,
              :QSPB-INSRATE-12-12,
              :QSPB-INSTERM-12-13,
              :QSPB-INSRATE-12-13,
              :QSPB-INSTERM-12-14,
              :QSPB-INSRATE-12-14,
              :QSPB-INSTERM-12-15,
              :QSPB-INSRATE-12-15,
              :QSPB-INSTERM-12-16,
              :QSPB-INSRATE-12-16,
              :QSPB-INSTERM-12-17,
              :QSPB-INSRATE-12-17,
              :QSPB-INSTERM-12-18,
              :QSPB-INSRATE-12-18,
              :QSPB-INSTERM-12-19,
              :QSPB-INSRATE-12-19,
              :QSPB-INSTERM-12-20,
              :QSPB-INSRATE-12-20,
              :QSPB-INSMINPREM-12,
              :QSPB-INSMINCHGABL-12,
              :QSPB-INSMAXCHGABL-12,
              :QSPB-INSMAXBENIF-12,
              :QSPB-INSMAXTERM-12,
              :QSPB-INSCHGBEN-12,
              :QSPB-INSEXCEPT-12,
              :QSPB-INSNOVER-12,
              :QSPB-INSMINAGE-12-1,
              :QSPB-INSMAXAGE-12-1,
              :QSPB-INSMAXCOV-12-1,
              :QSPB-INSMAXTRM-12-1,
              :QSPB-INSMINAGE-12-2,
              :QSPB-INSMAXAGE-12-2,
              :QSPB-INSMAXCOV-12-2,
              :QSPB-INSMAXTRM-12-2,
              :QSPB-INSMINAGE-12-3,
              :QSPB-INSMAXAGE-12-3,
              :QSPB-INSMAXCOV-12-3,
              :QSPB-INSMAXTRM-12-3,
              :QSPB-INSMINAGE-12-4,
              :QSPB-INSMAXAGE-12-4,
              :QSPB-INSMAXCOV-12-4,
              :QSPB-INSMAXTRM-12-4,
              :QSPB-INSMINAGE-12-5,
              :QSPB-INSMAXAGE-12-5,
              :QSPB-INSMAXCOV-12-5,
              :QSPB-INSMAXTRM-12-5,
              :QSPB-INSFEECD-12,
              :QSPB-INSFEE-FRMLA-12,
              :QSPB-INSCHGABL-FG-12,
              :QSPB-INSREJECT-FG-12,
              :QSPB-INSFINCHG-12)
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO WRITE-SPB1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-------------------------------------------------------
       REWRITE-SPB1-FILE.

           PERFORM REWRITE-IT.
           MOVE SPB-PATH-SQL    TO E-FILE.
           MOVE SPB1-KEY        TO E-KEYX.
           PERFORM SET-SPB-FIELDS.

           EXEC SQL
            UPDATE DBO.SPBFILE
             SET
              SPBFILE.SPB_ORGST = :QSPB-ORGST,
              SPBFILE.SPB_SPRCLASS = :QSPB-SPRCLASS,
              SPBFILE.SPB_SUBCLASS = :QSPB-SUBCLASS,
              SPBFILE.SPB_LAWCODE = :QSPB-LAWCODE,
              SPBFILE.SPB_INSCOM_1 = :QSPB-INSCOM-1,
              SPBFILE.SPB_INSRATECD_1 = :QSPB-INSRATECD-1,
              SPBFILE.SPB_INSJFAC_1 = :QSPB-INSJFAC-1,
              SPBFILE.SPB_INSDISCNT_1 = :QSPB-INSDISCNT-1,
              SPBFILE.SPB_INSCHGABL_1 = :QSPB-INSCHGABL-1,
              SPBFILE.SPB_INSTERM_1_1 = :QSPB-INSTERM-1-1,
              SPBFILE.SPB_INSRATE_1_1 = :QSPB-INSRATE-1-1,
              SPBFILE.SPB_INSTERM_1_2 = :QSPB-INSTERM-1-2,
              SPBFILE.SPB_INSRATE_1_2 = :QSPB-INSRATE-1-2,
              SPBFILE.SPB_INSTERM_1_3 = :QSPB-INSTERM-1-3,
              SPBFILE.SPB_INSRATE_1_3 = :QSPB-INSRATE-1-3,
              SPBFILE.SPB_INSTERM_1_4 = :QSPB-INSTERM-1-4,
              SPBFILE.SPB_INSRATE_1_4 = :QSPB-INSRATE-1-4,
              SPBFILE.SPB_INSTERM_1_5 = :QSPB-INSTERM-1-5,
              SPBFILE.SPB_INSRATE_1_5 = :QSPB-INSRATE-1-5,
              SPBFILE.SPB_INSTERM_1_6 = :QSPB-INSTERM-1-6,
              SPBFILE.SPB_INSRATE_1_6 = :QSPB-INSRATE-1-6,
              SPBFILE.SPB_INSTERM_1_7 = :QSPB-INSTERM-1-7,
              SPBFILE.SPB_INSRATE_1_7 = :QSPB-INSRATE-1-7,
              SPBFILE.SPB_INSTERM_1_8 = :QSPB-INSTERM-1-8,
              SPBFILE.SPB_INSRATE_1_8 = :QSPB-INSRATE-1-8,
              SPBFILE.SPB_INSTERM_1_9 = :QSPB-INSTERM-1-9,
              SPBFILE.SPB_INSRATE_1_9 = :QSPB-INSRATE-1-9,
              SPBFILE.SPB_INSTERM_1_10 = :QSPB-INSTERM-1-10,
              SPBFILE.SPB_INSRATE_1_10 = :QSPB-INSRATE-1-10,
              SPBFILE.SPB_INSTERM_1_11 = :QSPB-INSTERM-1-11,
              SPBFILE.SPB_INSRATE_1_11 = :QSPB-INSRATE-1-11,
              SPBFILE.SPB_INSTERM_1_12 = :QSPB-INSTERM-1-12,
              SPBFILE.SPB_INSRATE_1_12 = :QSPB-INSRATE-1-12,
              SPBFILE.SPB_INSTERM_1_13 = :QSPB-INSTERM-1-13,
              SPBFILE.SPB_INSRATE_1_13 = :QSPB-INSRATE-1-13,
              SPBFILE.SPB_INSTERM_1_14 = :QSPB-INSTERM-1-14,
              SPBFILE.SPB_INSRATE_1_14 = :QSPB-INSRATE-1-14,
              SPBFILE.SPB_INSTERM_1_15 = :QSPB-INSTERM-1-15,
              SPBFILE.SPB_INSRATE_1_15 = :QSPB-INSRATE-1-15,
              SPBFILE.SPB_INSTERM_1_16 = :QSPB-INSTERM-1-16,
              SPBFILE.SPB_INSRATE_1_16 = :QSPB-INSRATE-1-16,
              SPBFILE.SPB_INSTERM_1_17 = :QSPB-INSTERM-1-17,
              SPBFILE.SPB_INSRATE_1_17 = :QSPB-INSRATE-1-17,
              SPBFILE.SPB_INSTERM_1_18 = :QSPB-INSTERM-1-18,
              SPBFILE.SPB_INSRATE_1_18 = :QSPB-INSRATE-1-18,
              SPBFILE.SPB_INSTERM_1_19 = :QSPB-INSTERM-1-19,
              SPBFILE.SPB_INSRATE_1_19 = :QSPB-INSRATE-1-19,
              SPBFILE.SPB_INSTERM_1_20 = :QSPB-INSTERM-1-20,
              SPBFILE.SPB_INSRATE_1_20 = :QSPB-INSRATE-1-20,
              SPBFILE.SPB_INSMINPREM_1 = :QSPB-INSMINPREM-1,
              SPBFILE.SPB_INSMINCHGABL_1 = :QSPB-INSMINCHGABL-1,
              SPBFILE.SPB_INSMAXCHGABL_1 = :QSPB-INSMAXCHGABL-1,
              SPBFILE.SPB_INSMAXBENIF_1 = :QSPB-INSMAXBENIF-1,
              SPBFILE.SPB_INSMAXTERM_1 = :QSPB-INSMAXTERM-1,
              SPBFILE.SPB_INSCHGBEN_1 = :QSPB-INSCHGBEN-1,
              SPBFILE.SPB_INSEXCEPT_1 = :QSPB-INSEXCEPT-1,
              SPBFILE.SPB_INSNOVER_1 = :QSPB-INSNOVER-1,
              SPBFILE.SPB_INSMINAGE_1_1 = :QSPB-INSMINAGE-1-1,
              SPBFILE.SPB_INSMAXAGE_1_1 = :QSPB-INSMAXAGE-1-1,
              SPBFILE.SPB_INSMAXCOV_1_1 = :QSPB-INSMAXCOV-1-1,
              SPBFILE.SPB_INSMAXTRM_1_1 = :QSPB-INSMAXTRM-1-1,
              SPBFILE.SPB_INSMINAGE_1_2 = :QSPB-INSMINAGE-1-2,
              SPBFILE.SPB_INSMAXAGE_1_2 = :QSPB-INSMAXAGE-1-2,
              SPBFILE.SPB_INSMAXCOV_1_2 = :QSPB-INSMAXCOV-1-2,
              SPBFILE.SPB_INSMAXTRM_1_2 = :QSPB-INSMAXTRM-1-2,
              SPBFILE.SPB_INSMINAGE_1_3 = :QSPB-INSMINAGE-1-3,
              SPBFILE.SPB_INSMAXAGE_1_3 = :QSPB-INSMAXAGE-1-3,
              SPBFILE.SPB_INSMAXCOV_1_3 = :QSPB-INSMAXCOV-1-3,
              SPBFILE.SPB_INSMAXTRM_1_3 = :QSPB-INSMAXTRM-1-3,
              SPBFILE.SPB_INSMINAGE_1_4 = :QSPB-INSMINAGE-1-4,
              SPBFILE.SPB_INSMAXAGE_1_4 = :QSPB-INSMAXAGE-1-4,
              SPBFILE.SPB_INSMAXCOV_1_4 = :QSPB-INSMAXCOV-1-4,
              SPBFILE.SPB_INSMAXTRM_1_4 = :QSPB-INSMAXTRM-1-4,
              SPBFILE.SPB_INSMINAGE_1_5 = :QSPB-INSMINAGE-1-5,
              SPBFILE.SPB_INSMAXAGE_1_5 = :QSPB-INSMAXAGE-1-5,
              SPBFILE.SPB_INSMAXCOV_1_5 = :QSPB-INSMAXCOV-1-5,
              SPBFILE.SPB_INSMAXTRM_1_5 = :QSPB-INSMAXTRM-1-5,
              SPBFILE.SPB_INSFEECD_1 = :QSPB-INSFEECD-1,
              SPBFILE.SPB_INSFEE_FRMLA_1 = :QSPB-INSFEE-FRMLA-1,
              SPBFILE.SPB_INSCHGABL_FG_1 = :QSPB-INSCHGABL-FG-1,
              SPBFILE.SPB_INSREJECT_FG_1 = :QSPB-INSREJECT-FG-1,
              SPBFILE.SPB_INSFINCHG_1 = :QSPB-INSFINCHG-1,
              SPBFILE.SPB_INSCOM_2 = :QSPB-INSCOM-2,
              SPBFILE.SPB_INSRATECD_2 = :QSPB-INSRATECD-2,
              SPBFILE.SPB_INSJFAC_2 = :QSPB-INSJFAC-2,
              SPBFILE.SPB_INSDISCNT_2 = :QSPB-INSDISCNT-2,
              SPBFILE.SPB_INSCHGABL_2 = :QSPB-INSCHGABL-2,
              SPBFILE.SPB_INSTERM_2_1 = :QSPB-INSTERM-2-1,
              SPBFILE.SPB_INSRATE_2_1 = :QSPB-INSRATE-2-1,
              SPBFILE.SPB_INSTERM_2_2 = :QSPB-INSTERM-2-2,
              SPBFILE.SPB_INSRATE_2_2 = :QSPB-INSRATE-2-2,
              SPBFILE.SPB_INSTERM_2_3 = :QSPB-INSTERM-2-3,
              SPBFILE.SPB_INSRATE_2_3 = :QSPB-INSRATE-2-3,
              SPBFILE.SPB_INSTERM_2_4 = :QSPB-INSTERM-2-4,
              SPBFILE.SPB_INSRATE_2_4 = :QSPB-INSRATE-2-4,
              SPBFILE.SPB_INSTERM_2_5 = :QSPB-INSTERM-2-5,
              SPBFILE.SPB_INSRATE_2_5 = :QSPB-INSRATE-2-5,
              SPBFILE.SPB_INSTERM_2_6 = :QSPB-INSTERM-2-6,
              SPBFILE.SPB_INSRATE_2_6 = :QSPB-INSRATE-2-6,
              SPBFILE.SPB_INSTERM_2_7 = :QSPB-INSTERM-2-7,
              SPBFILE.SPB_INSRATE_2_7 = :QSPB-INSRATE-2-7,
              SPBFILE.SPB_INSTERM_2_8 = :QSPB-INSTERM-2-8,
              SPBFILE.SPB_INSRATE_2_8 = :QSPB-INSRATE-2-8,
              SPBFILE.SPB_INSTERM_2_9 = :QSPB-INSTERM-2-9,
              SPBFILE.SPB_INSRATE_2_9 = :QSPB-INSRATE-2-9,
              SPBFILE.SPB_INSTERM_2_10 = :QSPB-INSTERM-2-10,
              SPBFILE.SPB_INSRATE_2_10 = :QSPB-INSRATE-2-10,
              SPBFILE.SPB_INSTERM_2_11 = :QSPB-INSTERM-2-11,
              SPBFILE.SPB_INSRATE_2_11 = :QSPB-INSRATE-2-11,
              SPBFILE.SPB_INSTERM_2_12 = :QSPB-INSTERM-2-12,
              SPBFILE.SPB_INSRATE_2_12 = :QSPB-INSRATE-2-12,
              SPBFILE.SPB_INSTERM_2_13 = :QSPB-INSTERM-2-13,
              SPBFILE.SPB_INSRATE_2_13 = :QSPB-INSRATE-2-13,
              SPBFILE.SPB_INSTERM_2_14 = :QSPB-INSTERM-2-14,
              SPBFILE.SPB_INSRATE_2_14 = :QSPB-INSRATE-2-14,
              SPBFILE.SPB_INSTERM_2_15 = :QSPB-INSTERM-2-15,
              SPBFILE.SPB_INSRATE_2_15 = :QSPB-INSRATE-2-15,
              SPBFILE.SPB_INSTERM_2_16 = :QSPB-INSTERM-2-16,
              SPBFILE.SPB_INSRATE_2_16 = :QSPB-INSRATE-2-16,
              SPBFILE.SPB_INSTERM_2_17 = :QSPB-INSTERM-2-17,
              SPBFILE.SPB_INSRATE_2_17 = :QSPB-INSRATE-2-17,
              SPBFILE.SPB_INSTERM_2_18 = :QSPB-INSTERM-2-18,
              SPBFILE.SPB_INSRATE_2_18 = :QSPB-INSRATE-2-18,
              SPBFILE.SPB_INSTERM_2_19 = :QSPB-INSTERM-2-19,
              SPBFILE.SPB_INSRATE_2_19 = :QSPB-INSRATE-2-19,
              SPBFILE.SPB_INSTERM_2_20 = :QSPB-INSTERM-2-20,
              SPBFILE.SPB_INSRATE_2_20 = :QSPB-INSRATE-2-20,
              SPBFILE.SPB_INSMINPREM_2 = :QSPB-INSMINPREM-2,
              SPBFILE.SPB_INSMINCHGABL_2 = :QSPB-INSMINCHGABL-2,
              SPBFILE.SPB_INSMAXCHGABL_2 = :QSPB-INSMAXCHGABL-2,
              SPBFILE.SPB_INSMAXBENIF_2 = :QSPB-INSMAXBENIF-2,
              SPBFILE.SPB_INSMAXTERM_2 = :QSPB-INSMAXTERM-2,
              SPBFILE.SPB_INSCHGBEN_2 = :QSPB-INSCHGBEN-2,
              SPBFILE.SPB_INSEXCEPT_2 = :QSPB-INSEXCEPT-2,
              SPBFILE.SPB_INSNOVER_2 = :QSPB-INSNOVER-2,
              SPBFILE.SPB_INSMINAGE_2_1 = :QSPB-INSMINAGE-2-1,
              SPBFILE.SPB_INSMAXAGE_2_1 = :QSPB-INSMAXAGE-2-1,
              SPBFILE.SPB_INSMAXCOV_2_1 = :QSPB-INSMAXCOV-2-1,
              SPBFILE.SPB_INSMAXTRM_2_1 = :QSPB-INSMAXTRM-2-1,
              SPBFILE.SPB_INSMINAGE_2_2 = :QSPB-INSMINAGE-2-2,
              SPBFILE.SPB_INSMAXAGE_2_2 = :QSPB-INSMAXAGE-2-2,
              SPBFILE.SPB_INSMAXCOV_2_2 = :QSPB-INSMAXCOV-2-2,
              SPBFILE.SPB_INSMAXTRM_2_2 = :QSPB-INSMAXTRM-2-2,
              SPBFILE.SPB_INSMINAGE_2_3 = :QSPB-INSMINAGE-2-3,
              SPBFILE.SPB_INSMAXAGE_2_3 = :QSPB-INSMAXAGE-2-3,
              SPBFILE.SPB_INSMAXCOV_2_3 = :QSPB-INSMAXCOV-2-3,
              SPBFILE.SPB_INSMAXTRM_2_3 = :QSPB-INSMAXTRM-2-3,
              SPBFILE.SPB_INSMINAGE_2_4 = :QSPB-INSMINAGE-2-4,
              SPBFILE.SPB_INSMAXAGE_2_4 = :QSPB-INSMAXAGE-2-4,
              SPBFILE.SPB_INSMAXCOV_2_4 = :QSPB-INSMAXCOV-2-4,
              SPBFILE.SPB_INSMAXTRM_2_4 = :QSPB-INSMAXTRM-2-4,
              SPBFILE.SPB_INSMINAGE_2_5 = :QSPB-INSMINAGE-2-5,
              SPBFILE.SPB_INSMAXAGE_2_5 = :QSPB-INSMAXAGE-2-5,
              SPBFILE.SPB_INSMAXCOV_2_5 = :QSPB-INSMAXCOV-2-5,
              SPBFILE.SPB_INSMAXTRM_2_5 = :QSPB-INSMAXTRM-2-5,
              SPBFILE.SPB_INSFEECD_2 = :QSPB-INSFEECD-2,
              SPBFILE.SPB_INSFEE_FRMLA_2 = :QSPB-INSFEE-FRMLA-2,
              SPBFILE.SPB_INSCHGABL_FG_2 = :QSPB-INSCHGABL-FG-2,
              SPBFILE.SPB_INSREJECT_FG_2 = :QSPB-INSREJECT-FG-2,
              SPBFILE.SPB_INSFINCHG_2 = :QSPB-INSFINCHG-2,
              SPBFILE.SPB_INSCOM_3 = :QSPB-INSCOM-3,
              SPBFILE.SPB_INSRATECD_3 = :QSPB-INSRATECD-3,
              SPBFILE.SPB_INSJFAC_3 = :QSPB-INSJFAC-3,
              SPBFILE.SPB_INSDISCNT_3 = :QSPB-INSDISCNT-3,
              SPBFILE.SPB_INSCHGABL_3 = :QSPB-INSCHGABL-3,
              SPBFILE.SPB_INSTERM_3_1 = :QSPB-INSTERM-3-1,
              SPBFILE.SPB_INSRATE_3_1 = :QSPB-INSRATE-3-1,
              SPBFILE.SPB_INSTERM_3_2 = :QSPB-INSTERM-3-2,
              SPBFILE.SPB_INSRATE_3_2 = :QSPB-INSRATE-3-2,
              SPBFILE.SPB_INSTERM_3_3 = :QSPB-INSTERM-3-3,
              SPBFILE.SPB_INSRATE_3_3 = :QSPB-INSRATE-3-3,
              SPBFILE.SPB_INSTERM_3_4 = :QSPB-INSTERM-3-4,
              SPBFILE.SPB_INSRATE_3_4 = :QSPB-INSRATE-3-4,
              SPBFILE.SPB_INSTERM_3_5 = :QSPB-INSTERM-3-5,
              SPBFILE.SPB_INSRATE_3_5 = :QSPB-INSRATE-3-5,
              SPBFILE.SPB_INSTERM_3_6 = :QSPB-INSTERM-3-6,
              SPBFILE.SPB_INSRATE_3_6 = :QSPB-INSRATE-3-6,
              SPBFILE.SPB_INSTERM_3_7 = :QSPB-INSTERM-3-7,
              SPBFILE.SPB_INSRATE_3_7 = :QSPB-INSRATE-3-7,
              SPBFILE.SPB_INSTERM_3_8 = :QSPB-INSTERM-3-8,
              SPBFILE.SPB_INSRATE_3_8 = :QSPB-INSRATE-3-8,
              SPBFILE.SPB_INSTERM_3_9 = :QSPB-INSTERM-3-9,
              SPBFILE.SPB_INSRATE_3_9 = :QSPB-INSRATE-3-9,
              SPBFILE.SPB_INSTERM_3_10 = :QSPB-INSTERM-3-10,
              SPBFILE.SPB_INSRATE_3_10 = :QSPB-INSRATE-3-10,
              SPBFILE.SPB_INSTERM_3_11 = :QSPB-INSTERM-3-11,
              SPBFILE.SPB_INSRATE_3_11 = :QSPB-INSRATE-3-11,
              SPBFILE.SPB_INSTERM_3_12 = :QSPB-INSTERM-3-12,
              SPBFILE.SPB_INSRATE_3_12 = :QSPB-INSRATE-3-12,
              SPBFILE.SPB_INSTERM_3_13 = :QSPB-INSTERM-3-13,
              SPBFILE.SPB_INSRATE_3_13 = :QSPB-INSRATE-3-13,
              SPBFILE.SPB_INSTERM_3_14 = :QSPB-INSTERM-3-14,
              SPBFILE.SPB_INSRATE_3_14 = :QSPB-INSRATE-3-14,
              SPBFILE.SPB_INSTERM_3_15 = :QSPB-INSTERM-3-15,
              SPBFILE.SPB_INSRATE_3_15 = :QSPB-INSRATE-3-15,
              SPBFILE.SPB_INSTERM_3_16 = :QSPB-INSTERM-3-16,
              SPBFILE.SPB_INSRATE_3_16 = :QSPB-INSRATE-3-16,
              SPBFILE.SPB_INSTERM_3_17 = :QSPB-INSTERM-3-17,
              SPBFILE.SPB_INSRATE_3_17 = :QSPB-INSRATE-3-17,
              SPBFILE.SPB_INSTERM_3_18 = :QSPB-INSTERM-3-18,
              SPBFILE.SPB_INSRATE_3_18 = :QSPB-INSRATE-3-18,
              SPBFILE.SPB_INSTERM_3_19 = :QSPB-INSTERM-3-19,
              SPBFILE.SPB_INSRATE_3_19 = :QSPB-INSRATE-3-19,
              SPBFILE.SPB_INSTERM_3_20 = :QSPB-INSTERM-3-20,
              SPBFILE.SPB_INSRATE_3_20 = :QSPB-INSRATE-3-20,
              SPBFILE.SPB_INSMINPREM_3 = :QSPB-INSMINPREM-3,
              SPBFILE.SPB_INSMINCHGABL_3 = :QSPB-INSMINCHGABL-3,
              SPBFILE.SPB_INSMAXCHGABL_3 = :QSPB-INSMAXCHGABL-3,
              SPBFILE.SPB_INSMAXBENIF_3 = :QSPB-INSMAXBENIF-3,
              SPBFILE.SPB_INSMAXTERM_3 = :QSPB-INSMAXTERM-3,
              SPBFILE.SPB_INSCHGBEN_3 = :QSPB-INSCHGBEN-3,
              SPBFILE.SPB_INSEXCEPT_3 = :QSPB-INSEXCEPT-3,
              SPBFILE.SPB_INSNOVER_3 = :QSPB-INSNOVER-3,
              SPBFILE.SPB_INSMINAGE_3_1 = :QSPB-INSMINAGE-3-1,
              SPBFILE.SPB_INSMAXAGE_3_1 = :QSPB-INSMAXAGE-3-1,
              SPBFILE.SPB_INSMAXCOV_3_1 = :QSPB-INSMAXCOV-3-1,
              SPBFILE.SPB_INSMAXTRM_3_1 = :QSPB-INSMAXTRM-3-1,
              SPBFILE.SPB_INSMINAGE_3_2 = :QSPB-INSMINAGE-3-2,
              SPBFILE.SPB_INSMAXAGE_3_2 = :QSPB-INSMAXAGE-3-2,
              SPBFILE.SPB_INSMAXCOV_3_2 = :QSPB-INSMAXCOV-3-2,
              SPBFILE.SPB_INSMAXTRM_3_2 = :QSPB-INSMAXTRM-3-2,
              SPBFILE.SPB_INSMINAGE_3_3 = :QSPB-INSMINAGE-3-3,
              SPBFILE.SPB_INSMAXAGE_3_3 = :QSPB-INSMAXAGE-3-3,
              SPBFILE.SPB_INSMAXCOV_3_3 = :QSPB-INSMAXCOV-3-3,
              SPBFILE.SPB_INSMAXTRM_3_3 = :QSPB-INSMAXTRM-3-3,
              SPBFILE.SPB_INSMINAGE_3_4 = :QSPB-INSMINAGE-3-4,
              SPBFILE.SPB_INSMAXAGE_3_4 = :QSPB-INSMAXAGE-3-4,
              SPBFILE.SPB_INSMAXCOV_3_4 = :QSPB-INSMAXCOV-3-4,
              SPBFILE.SPB_INSMAXTRM_3_4 = :QSPB-INSMAXTRM-3-4,
              SPBFILE.SPB_INSMINAGE_3_5 = :QSPB-INSMINAGE-3-5,
              SPBFILE.SPB_INSMAXAGE_3_5 = :QSPB-INSMAXAGE-3-5,
              SPBFILE.SPB_INSMAXCOV_3_5 = :QSPB-INSMAXCOV-3-5,
              SPBFILE.SPB_INSMAXTRM_3_5 = :QSPB-INSMAXTRM-3-5,
              SPBFILE.SPB_INSFEECD_3 = :QSPB-INSFEECD-3,
              SPBFILE.SPB_INSFEE_FRMLA_3 = :QSPB-INSFEE-FRMLA-3,
              SPBFILE.SPB_INSCHGABL_FG_3 = :QSPB-INSCHGABL-FG-3,
              SPBFILE.SPB_INSREJECT_FG_3 = :QSPB-INSREJECT-FG-3,
              SPBFILE.SPB_INSFINCHG_3 = :QSPB-INSFINCHG-3,
              SPBFILE.SPB_INSCOM_4 = :QSPB-INSCOM-4,
              SPBFILE.SPB_INSRATECD_4 = :QSPB-INSRATECD-4,
              SPBFILE.SPB_INSJFAC_4 = :QSPB-INSJFAC-4,
              SPBFILE.SPB_INSDISCNT_4 = :QSPB-INSDISCNT-4,
              SPBFILE.SPB_INSCHGABL_4 = :QSPB-INSCHGABL-4,
              SPBFILE.SPB_INSTERM_4_1 = :QSPB-INSTERM-4-1,
              SPBFILE.SPB_INSRATE_4_1 = :QSPB-INSRATE-4-1,
              SPBFILE.SPB_INSTERM_4_2 = :QSPB-INSTERM-4-2,
              SPBFILE.SPB_INSRATE_4_2 = :QSPB-INSRATE-4-2,
              SPBFILE.SPB_INSTERM_4_3 = :QSPB-INSTERM-4-3,
              SPBFILE.SPB_INSRATE_4_3 = :QSPB-INSRATE-4-3,
              SPBFILE.SPB_INSTERM_4_4 = :QSPB-INSTERM-4-4,
              SPBFILE.SPB_INSRATE_4_4 = :QSPB-INSRATE-4-4,
              SPBFILE.SPB_INSTERM_4_5 = :QSPB-INSTERM-4-5,
              SPBFILE.SPB_INSRATE_4_5 = :QSPB-INSRATE-4-5,
              SPBFILE.SPB_INSTERM_4_6 = :QSPB-INSTERM-4-6,
              SPBFILE.SPB_INSRATE_4_6 = :QSPB-INSRATE-4-6,
              SPBFILE.SPB_INSTERM_4_7 = :QSPB-INSTERM-4-7,
              SPBFILE.SPB_INSRATE_4_7 = :QSPB-INSRATE-4-7,
              SPBFILE.SPB_INSTERM_4_8 = :QSPB-INSTERM-4-8,
              SPBFILE.SPB_INSRATE_4_8 = :QSPB-INSRATE-4-8,
              SPBFILE.SPB_INSTERM_4_9 = :QSPB-INSTERM-4-9,
              SPBFILE.SPB_INSRATE_4_9 = :QSPB-INSRATE-4-9,
              SPBFILE.SPB_INSTERM_4_10 = :QSPB-INSTERM-4-10,
              SPBFILE.SPB_INSRATE_4_10 = :QSPB-INSRATE-4-10,
              SPBFILE.SPB_INSTERM_4_11 = :QSPB-INSTERM-4-11,
              SPBFILE.SPB_INSRATE_4_11 = :QSPB-INSRATE-4-11,
              SPBFILE.SPB_INSTERM_4_12 = :QSPB-INSTERM-4-12,
              SPBFILE.SPB_INSRATE_4_12 = :QSPB-INSRATE-4-12,
              SPBFILE.SPB_INSTERM_4_13 = :QSPB-INSTERM-4-13,
              SPBFILE.SPB_INSRATE_4_13 = :QSPB-INSRATE-4-13,
              SPBFILE.SPB_INSTERM_4_14 = :QSPB-INSTERM-4-14,
              SPBFILE.SPB_INSRATE_4_14 = :QSPB-INSRATE-4-14,
              SPBFILE.SPB_INSTERM_4_15 = :QSPB-INSTERM-4-15,
              SPBFILE.SPB_INSRATE_4_15 = :QSPB-INSRATE-4-15,
              SPBFILE.SPB_INSTERM_4_16 = :QSPB-INSTERM-4-16,
              SPBFILE.SPB_INSRATE_4_16 = :QSPB-INSRATE-4-16,
              SPBFILE.SPB_INSTERM_4_17 = :QSPB-INSTERM-4-17,
              SPBFILE.SPB_INSRATE_4_17 = :QSPB-INSRATE-4-17,
              SPBFILE.SPB_INSTERM_4_18 = :QSPB-INSTERM-4-18,
              SPBFILE.SPB_INSRATE_4_18 = :QSPB-INSRATE-4-18,
              SPBFILE.SPB_INSTERM_4_19 = :QSPB-INSTERM-4-19,
              SPBFILE.SPB_INSRATE_4_19 = :QSPB-INSRATE-4-19,
              SPBFILE.SPB_INSTERM_4_20 = :QSPB-INSTERM-4-20,
              SPBFILE.SPB_INSRATE_4_20 = :QSPB-INSRATE-4-20,
              SPBFILE.SPB_INSMINPREM_4 = :QSPB-INSMINPREM-4,
              SPBFILE.SPB_INSMINCHGABL_4 = :QSPB-INSMINCHGABL-4,
              SPBFILE.SPB_INSMAXCHGABL_4 = :QSPB-INSMAXCHGABL-4,
              SPBFILE.SPB_INSMAXBENIF_4 = :QSPB-INSMAXBENIF-4,
              SPBFILE.SPB_INSMAXTERM_4 = :QSPB-INSMAXTERM-4,
              SPBFILE.SPB_INSCHGBEN_4 = :QSPB-INSCHGBEN-4,
              SPBFILE.SPB_INSEXCEPT_4 = :QSPB-INSEXCEPT-4,
              SPBFILE.SPB_INSNOVER_4 = :QSPB-INSNOVER-4,
              SPBFILE.SPB_INSMINAGE_4_1 = :QSPB-INSMINAGE-4-1,
              SPBFILE.SPB_INSMAXAGE_4_1 = :QSPB-INSMAXAGE-4-1,
              SPBFILE.SPB_INSMAXCOV_4_1 = :QSPB-INSMAXCOV-4-1,
              SPBFILE.SPB_INSMAXTRM_4_1 = :QSPB-INSMAXTRM-4-1,
              SPBFILE.SPB_INSMINAGE_4_2 = :QSPB-INSMINAGE-4-2,
              SPBFILE.SPB_INSMAXAGE_4_2 = :QSPB-INSMAXAGE-4-2,
              SPBFILE.SPB_INSMAXCOV_4_2 = :QSPB-INSMAXCOV-4-2,
              SPBFILE.SPB_INSMAXTRM_4_2 = :QSPB-INSMAXTRM-4-2,
              SPBFILE.SPB_INSMINAGE_4_3 = :QSPB-INSMINAGE-4-3,
              SPBFILE.SPB_INSMAXAGE_4_3 = :QSPB-INSMAXAGE-4-3,
              SPBFILE.SPB_INSMAXCOV_4_3 = :QSPB-INSMAXCOV-4-3,
              SPBFILE.SPB_INSMAXTRM_4_3 = :QSPB-INSMAXTRM-4-3,
              SPBFILE.SPB_INSMINAGE_4_4 = :QSPB-INSMINAGE-4-4,
              SPBFILE.SPB_INSMAXAGE_4_4 = :QSPB-INSMAXAGE-4-4,
              SPBFILE.SPB_INSMAXCOV_4_4 = :QSPB-INSMAXCOV-4-4,
              SPBFILE.SPB_INSMAXTRM_4_4 = :QSPB-INSMAXTRM-4-4,
              SPBFILE.SPB_INSMINAGE_4_5 = :QSPB-INSMINAGE-4-5,
              SPBFILE.SPB_INSMAXAGE_4_5 = :QSPB-INSMAXAGE-4-5,
              SPBFILE.SPB_INSMAXCOV_4_5 = :QSPB-INSMAXCOV-4-5,
              SPBFILE.SPB_INSMAXTRM_4_5 = :QSPB-INSMAXTRM-4-5,
              SPBFILE.SPB_INSFEECD_4 = :QSPB-INSFEECD-4,
              SPBFILE.SPB_INSFEE_FRMLA_4 = :QSPB-INSFEE-FRMLA-4,
              SPBFILE.SPB_INSCHGABL_FG_4 = :QSPB-INSCHGABL-FG-4,
              SPBFILE.SPB_INSREJECT_FG_4 = :QSPB-INSREJECT-FG-4,
              SPBFILE.SPB_INSFINCHG_4 = :QSPB-INSFINCHG-4,
              SPBFILE.SPB_INSCOM_5 = :QSPB-INSCOM-5,
              SPBFILE.SPB_INSRATECD_5 = :QSPB-INSRATECD-5,
              SPBFILE.SPB_INSJFAC_5 = :QSPB-INSJFAC-5,
              SPBFILE.SPB_INSDISCNT_5 = :QSPB-INSDISCNT-5,
              SPBFILE.SPB_INSCHGABL_5 = :QSPB-INSCHGABL-5,
              SPBFILE.SPB_INSTERM_5_1 = :QSPB-INSTERM-5-1,
              SPBFILE.SPB_INSRATE_5_1 = :QSPB-INSRATE-5-1,
              SPBFILE.SPB_INSTERM_5_2 = :QSPB-INSTERM-5-2,
              SPBFILE.SPB_INSRATE_5_2 = :QSPB-INSRATE-5-2,
              SPBFILE.SPB_INSTERM_5_3 = :QSPB-INSTERM-5-3,
              SPBFILE.SPB_INSRATE_5_3 = :QSPB-INSRATE-5-3,
              SPBFILE.SPB_INSTERM_5_4 = :QSPB-INSTERM-5-4,
              SPBFILE.SPB_INSRATE_5_4 = :QSPB-INSRATE-5-4,
              SPBFILE.SPB_INSTERM_5_5 = :QSPB-INSTERM-5-5,
              SPBFILE.SPB_INSRATE_5_5 = :QSPB-INSRATE-5-5,
              SPBFILE.SPB_INSTERM_5_6 = :QSPB-INSTERM-5-6,
              SPBFILE.SPB_INSRATE_5_6 = :QSPB-INSRATE-5-6,
              SPBFILE.SPB_INSTERM_5_7 = :QSPB-INSTERM-5-7,
              SPBFILE.SPB_INSRATE_5_7 = :QSPB-INSRATE-5-7,
              SPBFILE.SPB_INSTERM_5_8 = :QSPB-INSTERM-5-8,
              SPBFILE.SPB_INSRATE_5_8 = :QSPB-INSRATE-5-8,
              SPBFILE.SPB_INSTERM_5_9 = :QSPB-INSTERM-5-9,
              SPBFILE.SPB_INSRATE_5_9 = :QSPB-INSRATE-5-9,
              SPBFILE.SPB_INSTERM_5_10 = :QSPB-INSTERM-5-10,
              SPBFILE.SPB_INSRATE_5_10 = :QSPB-INSRATE-5-10,
              SPBFILE.SPB_INSTERM_5_11 = :QSPB-INSTERM-5-11,
              SPBFILE.SPB_INSRATE_5_11 = :QSPB-INSRATE-5-11,
              SPBFILE.SPB_INSTERM_5_12 = :QSPB-INSTERM-5-12,
              SPBFILE.SPB_INSRATE_5_12 = :QSPB-INSRATE-5-12,
              SPBFILE.SPB_INSTERM_5_13 = :QSPB-INSTERM-5-13,
              SPBFILE.SPB_INSRATE_5_13 = :QSPB-INSRATE-5-13,
              SPBFILE.SPB_INSTERM_5_14 = :QSPB-INSTERM-5-14,
              SPBFILE.SPB_INSRATE_5_14 = :QSPB-INSRATE-5-14,
              SPBFILE.SPB_INSTERM_5_15 = :QSPB-INSTERM-5-15,
              SPBFILE.SPB_INSRATE_5_15 = :QSPB-INSRATE-5-15,
              SPBFILE.SPB_INSTERM_5_16 = :QSPB-INSTERM-5-16,
              SPBFILE.SPB_INSRATE_5_16 = :QSPB-INSRATE-5-16,
              SPBFILE.SPB_INSTERM_5_17 = :QSPB-INSTERM-5-17,
              SPBFILE.SPB_INSRATE_5_17 = :QSPB-INSRATE-5-17,
              SPBFILE.SPB_INSTERM_5_18 = :QSPB-INSTERM-5-18,
              SPBFILE.SPB_INSRATE_5_18 = :QSPB-INSRATE-5-18,
              SPBFILE.SPB_INSTERM_5_19 = :QSPB-INSTERM-5-19,
              SPBFILE.SPB_INSRATE_5_19 = :QSPB-INSRATE-5-19,
              SPBFILE.SPB_INSTERM_5_20 = :QSPB-INSTERM-5-20,
              SPBFILE.SPB_INSRATE_5_20 = :QSPB-INSRATE-5-20,
              SPBFILE.SPB_INSMINPREM_5 = :QSPB-INSMINPREM-5,
              SPBFILE.SPB_INSMINCHGABL_5 = :QSPB-INSMINCHGABL-5,
              SPBFILE.SPB_INSMAXCHGABL_5 = :QSPB-INSMAXCHGABL-5,
              SPBFILE.SPB_INSMAXBENIF_5 = :QSPB-INSMAXBENIF-5,
              SPBFILE.SPB_INSMAXTERM_5 = :QSPB-INSMAXTERM-5,
              SPBFILE.SPB_INSCHGBEN_5 = :QSPB-INSCHGBEN-5,
              SPBFILE.SPB_INSEXCEPT_5 = :QSPB-INSEXCEPT-5,
              SPBFILE.SPB_INSNOVER_5 = :QSPB-INSNOVER-5,
              SPBFILE.SPB_INSMINAGE_5_1 = :QSPB-INSMINAGE-5-1,
              SPBFILE.SPB_INSMAXAGE_5_1 = :QSPB-INSMAXAGE-5-1,
              SPBFILE.SPB_INSMAXCOV_5_1 = :QSPB-INSMAXCOV-5-1,
              SPBFILE.SPB_INSMAXTRM_5_1 = :QSPB-INSMAXTRM-5-1,
              SPBFILE.SPB_INSMINAGE_5_2 = :QSPB-INSMINAGE-5-2,
              SPBFILE.SPB_INSMAXAGE_5_2 = :QSPB-INSMAXAGE-5-2,
              SPBFILE.SPB_INSMAXCOV_5_2 = :QSPB-INSMAXCOV-5-2,
              SPBFILE.SPB_INSMAXTRM_5_2 = :QSPB-INSMAXTRM-5-2,
              SPBFILE.SPB_INSMINAGE_5_3 = :QSPB-INSMINAGE-5-3,
              SPBFILE.SPB_INSMAXAGE_5_3 = :QSPB-INSMAXAGE-5-3,
              SPBFILE.SPB_INSMAXCOV_5_3 = :QSPB-INSMAXCOV-5-3,
              SPBFILE.SPB_INSMAXTRM_5_3 = :QSPB-INSMAXTRM-5-3,
              SPBFILE.SPB_INSMINAGE_5_4 = :QSPB-INSMINAGE-5-4,
              SPBFILE.SPB_INSMAXAGE_5_4 = :QSPB-INSMAXAGE-5-4,
              SPBFILE.SPB_INSMAXCOV_5_4 = :QSPB-INSMAXCOV-5-4,
              SPBFILE.SPB_INSMAXTRM_5_4 = :QSPB-INSMAXTRM-5-4,
              SPBFILE.SPB_INSMINAGE_5_5 = :QSPB-INSMINAGE-5-5,
              SPBFILE.SPB_INSMAXAGE_5_5 = :QSPB-INSMAXAGE-5-5,
              SPBFILE.SPB_INSMAXCOV_5_5 = :QSPB-INSMAXCOV-5-5,
              SPBFILE.SPB_INSMAXTRM_5_5 = :QSPB-INSMAXTRM-5-5,
              SPBFILE.SPB_INSFEECD_5 = :QSPB-INSFEECD-5,
              SPBFILE.SPB_INSFEE_FRMLA_5 = :QSPB-INSFEE-FRMLA-5,
              SPBFILE.SPB_INSCHGABL_FG_5 = :QSPB-INSCHGABL-FG-5,
              SPBFILE.SPB_INSREJECT_FG_5 = :QSPB-INSREJECT-FG-5,
              SPBFILE.SPB_INSFINCHG_5 = :QSPB-INSFINCHG-5,
              SPBFILE.SPB_INSCOM_6 = :QSPB-INSCOM-6,
              SPBFILE.SPB_INSRATECD_6 = :QSPB-INSRATECD-6,
              SPBFILE.SPB_INSJFAC_6 = :QSPB-INSJFAC-6,
              SPBFILE.SPB_INSDISCNT_6 = :QSPB-INSDISCNT-6,
              SPBFILE.SPB_INSCHGABL_6 = :QSPB-INSCHGABL-6,
              SPBFILE.SPB_INSTERM_6_1 = :QSPB-INSTERM-6-1,
              SPBFILE.SPB_INSRATE_6_1 = :QSPB-INSRATE-6-1,
              SPBFILE.SPB_INSTERM_6_2 = :QSPB-INSTERM-6-2,
              SPBFILE.SPB_INSRATE_6_2 = :QSPB-INSRATE-6-2,
              SPBFILE.SPB_INSTERM_6_3 = :QSPB-INSTERM-6-3,
              SPBFILE.SPB_INSRATE_6_3 = :QSPB-INSRATE-6-3,
              SPBFILE.SPB_INSTERM_6_4 = :QSPB-INSTERM-6-4,
              SPBFILE.SPB_INSRATE_6_4 = :QSPB-INSRATE-6-4,
              SPBFILE.SPB_INSTERM_6_5 = :QSPB-INSTERM-6-5,
              SPBFILE.SPB_INSRATE_6_5 = :QSPB-INSRATE-6-5,
              SPBFILE.SPB_INSTERM_6_6 = :QSPB-INSTERM-6-6,
              SPBFILE.SPB_INSRATE_6_6 = :QSPB-INSRATE-6-6,
              SPBFILE.SPB_INSTERM_6_7 = :QSPB-INSTERM-6-7,
              SPBFILE.SPB_INSRATE_6_7 = :QSPB-INSRATE-6-7,
              SPBFILE.SPB_INSTERM_6_8 = :QSPB-INSTERM-6-8,
              SPBFILE.SPB_INSRATE_6_8 = :QSPB-INSRATE-6-8,
              SPBFILE.SPB_INSTERM_6_9 = :QSPB-INSTERM-6-9,
              SPBFILE.SPB_INSRATE_6_9 = :QSPB-INSRATE-6-9,
              SPBFILE.SPB_INSTERM_6_10 = :QSPB-INSTERM-6-10,
              SPBFILE.SPB_INSRATE_6_10 = :QSPB-INSRATE-6-10,
              SPBFILE.SPB_INSTERM_6_11 = :QSPB-INSTERM-6-11,
              SPBFILE.SPB_INSRATE_6_11 = :QSPB-INSRATE-6-11,
              SPBFILE.SPB_INSTERM_6_12 = :QSPB-INSTERM-6-12,
              SPBFILE.SPB_INSRATE_6_12 = :QSPB-INSRATE-6-12,
              SPBFILE.SPB_INSTERM_6_13 = :QSPB-INSTERM-6-13,
              SPBFILE.SPB_INSRATE_6_13 = :QSPB-INSRATE-6-13,
              SPBFILE.SPB_INSTERM_6_14 = :QSPB-INSTERM-6-14,
              SPBFILE.SPB_INSRATE_6_14 = :QSPB-INSRATE-6-14,
              SPBFILE.SPB_INSTERM_6_15 = :QSPB-INSTERM-6-15,
              SPBFILE.SPB_INSRATE_6_15 = :QSPB-INSRATE-6-15,
              SPBFILE.SPB_INSTERM_6_16 = :QSPB-INSTERM-6-16,
              SPBFILE.SPB_INSRATE_6_16 = :QSPB-INSRATE-6-16,
              SPBFILE.SPB_INSTERM_6_17 = :QSPB-INSTERM-6-17,
              SPBFILE.SPB_INSRATE_6_17 = :QSPB-INSRATE-6-17,
              SPBFILE.SPB_INSTERM_6_18 = :QSPB-INSTERM-6-18,
              SPBFILE.SPB_INSRATE_6_18 = :QSPB-INSRATE-6-18,
              SPBFILE.SPB_INSTERM_6_19 = :QSPB-INSTERM-6-19,
              SPBFILE.SPB_INSRATE_6_19 = :QSPB-INSRATE-6-19,
              SPBFILE.SPB_INSTERM_6_20 = :QSPB-INSTERM-6-20,
              SPBFILE.SPB_INSRATE_6_20 = :QSPB-INSRATE-6-20,
              SPBFILE.SPB_INSMINPREM_6 = :QSPB-INSMINPREM-6,
              SPBFILE.SPB_INSMINCHGABL_6 = :QSPB-INSMINCHGABL-6,
              SPBFILE.SPB_INSMAXCHGABL_6 = :QSPB-INSMAXCHGABL-6,
              SPBFILE.SPB_INSMAXBENIF_6 = :QSPB-INSMAXBENIF-6,
              SPBFILE.SPB_INSMAXTERM_6 = :QSPB-INSMAXTERM-6,
              SPBFILE.SPB_INSCHGBEN_6 = :QSPB-INSCHGBEN-6,
              SPBFILE.SPB_INSEXCEPT_6 = :QSPB-INSEXCEPT-6,
              SPBFILE.SPB_INSNOVER_6 = :QSPB-INSNOVER-6,
              SPBFILE.SPB_INSMINAGE_6_1 = :QSPB-INSMINAGE-6-1,
              SPBFILE.SPB_INSMAXAGE_6_1 = :QSPB-INSMAXAGE-6-1,
              SPBFILE.SPB_INSMAXCOV_6_1 = :QSPB-INSMAXCOV-6-1,
              SPBFILE.SPB_INSMAXTRM_6_1 = :QSPB-INSMAXTRM-6-1,
              SPBFILE.SPB_INSMINAGE_6_2 = :QSPB-INSMINAGE-6-2,
              SPBFILE.SPB_INSMAXAGE_6_2 = :QSPB-INSMAXAGE-6-2,
              SPBFILE.SPB_INSMAXCOV_6_2 = :QSPB-INSMAXCOV-6-2,
              SPBFILE.SPB_INSMAXTRM_6_2 = :QSPB-INSMAXTRM-6-2,
              SPBFILE.SPB_INSMINAGE_6_3 = :QSPB-INSMINAGE-6-3,
              SPBFILE.SPB_INSMAXAGE_6_3 = :QSPB-INSMAXAGE-6-3,
              SPBFILE.SPB_INSMAXCOV_6_3 = :QSPB-INSMAXCOV-6-3,
              SPBFILE.SPB_INSMAXTRM_6_3 = :QSPB-INSMAXTRM-6-3,
              SPBFILE.SPB_INSMINAGE_6_4 = :QSPB-INSMINAGE-6-4,
              SPBFILE.SPB_INSMAXAGE_6_4 = :QSPB-INSMAXAGE-6-4,
              SPBFILE.SPB_INSMAXCOV_6_4 = :QSPB-INSMAXCOV-6-4,
              SPBFILE.SPB_INSMAXTRM_6_4 = :QSPB-INSMAXTRM-6-4,
              SPBFILE.SPB_INSMINAGE_6_5 = :QSPB-INSMINAGE-6-5,
              SPBFILE.SPB_INSMAXAGE_6_5 = :QSPB-INSMAXAGE-6-5,
              SPBFILE.SPB_INSMAXCOV_6_5 = :QSPB-INSMAXCOV-6-5,
              SPBFILE.SPB_INSMAXTRM_6_5 = :QSPB-INSMAXTRM-6-5,
              SPBFILE.SPB_INSFEECD_6 = :QSPB-INSFEECD-6,
              SPBFILE.SPB_INSFEE_FRMLA_6 = :QSPB-INSFEE-FRMLA-6,
              SPBFILE.SPB_INSCHGABL_FG_6 = :QSPB-INSCHGABL-FG-6,
              SPBFILE.SPB_INSREJECT_FG_6 = :QSPB-INSREJECT-FG-6,
              SPBFILE.SPB_INSFINCHG_6 = :QSPB-INSFINCHG-6,
              SPBFILE.SPB_INSCOM_7 = :QSPB-INSCOM-7,
              SPBFILE.SPB_INSRATECD_7 = :QSPB-INSRATECD-7,
              SPBFILE.SPB_INSJFAC_7 = :QSPB-INSJFAC-7,
              SPBFILE.SPB_INSDISCNT_7 = :QSPB-INSDISCNT-7,
              SPBFILE.SPB_INSCHGABL_7 = :QSPB-INSCHGABL-7,
              SPBFILE.SPB_INSTERM_7_1 = :QSPB-INSTERM-7-1,
              SPBFILE.SPB_INSRATE_7_1 = :QSPB-INSRATE-7-1,
              SPBFILE.SPB_INSTERM_7_2 = :QSPB-INSTERM-7-2,
              SPBFILE.SPB_INSRATE_7_2 = :QSPB-INSRATE-7-2,
              SPBFILE.SPB_INSTERM_7_3 = :QSPB-INSTERM-7-3,
              SPBFILE.SPB_INSRATE_7_3 = :QSPB-INSRATE-7-3,
              SPBFILE.SPB_INSTERM_7_4 = :QSPB-INSTERM-7-4,
              SPBFILE.SPB_INSRATE_7_4 = :QSPB-INSRATE-7-4,
              SPBFILE.SPB_INSTERM_7_5 = :QSPB-INSTERM-7-5,
              SPBFILE.SPB_INSRATE_7_5 = :QSPB-INSRATE-7-5,
              SPBFILE.SPB_INSTERM_7_6 = :QSPB-INSTERM-7-6,
              SPBFILE.SPB_INSRATE_7_6 = :QSPB-INSRATE-7-6,
              SPBFILE.SPB_INSTERM_7_7 = :QSPB-INSTERM-7-7,
              SPBFILE.SPB_INSRATE_7_7 = :QSPB-INSRATE-7-7,
              SPBFILE.SPB_INSTERM_7_8 = :QSPB-INSTERM-7-8,
              SPBFILE.SPB_INSRATE_7_8 = :QSPB-INSRATE-7-8,
              SPBFILE.SPB_INSTERM_7_9 = :QSPB-INSTERM-7-9,
              SPBFILE.SPB_INSRATE_7_9 = :QSPB-INSRATE-7-9,
              SPBFILE.SPB_INSTERM_7_10 = :QSPB-INSTERM-7-10,
              SPBFILE.SPB_INSRATE_7_10 = :QSPB-INSRATE-7-10,
              SPBFILE.SPB_INSTERM_7_11 = :QSPB-INSTERM-7-11,
              SPBFILE.SPB_INSRATE_7_11 = :QSPB-INSRATE-7-11,
              SPBFILE.SPB_INSTERM_7_12 = :QSPB-INSTERM-7-12,
              SPBFILE.SPB_INSRATE_7_12 = :QSPB-INSRATE-7-12,
              SPBFILE.SPB_INSTERM_7_13 = :QSPB-INSTERM-7-13,
              SPBFILE.SPB_INSRATE_7_13 = :QSPB-INSRATE-7-13,
              SPBFILE.SPB_INSTERM_7_14 = :QSPB-INSTERM-7-14,
              SPBFILE.SPB_INSRATE_7_14 = :QSPB-INSRATE-7-14,
              SPBFILE.SPB_INSTERM_7_15 = :QSPB-INSTERM-7-15,
              SPBFILE.SPB_INSRATE_7_15 = :QSPB-INSRATE-7-15,
              SPBFILE.SPB_INSTERM_7_16 = :QSPB-INSTERM-7-16,
              SPBFILE.SPB_INSRATE_7_16 = :QSPB-INSRATE-7-16,
              SPBFILE.SPB_INSTERM_7_17 = :QSPB-INSTERM-7-17,
              SPBFILE.SPB_INSRATE_7_17 = :QSPB-INSRATE-7-17,
              SPBFILE.SPB_INSTERM_7_18 = :QSPB-INSTERM-7-18,
              SPBFILE.SPB_INSRATE_7_18 = :QSPB-INSRATE-7-18,
              SPBFILE.SPB_INSTERM_7_19 = :QSPB-INSTERM-7-19,
              SPBFILE.SPB_INSRATE_7_19 = :QSPB-INSRATE-7-19,
              SPBFILE.SPB_INSTERM_7_20 = :QSPB-INSTERM-7-20,
              SPBFILE.SPB_INSRATE_7_20 = :QSPB-INSRATE-7-20,
              SPBFILE.SPB_INSMINPREM_7 = :QSPB-INSMINPREM-7,
              SPBFILE.SPB_INSMINCHGABL_7 = :QSPB-INSMINCHGABL-7,
              SPBFILE.SPB_INSMAXCHGABL_7 = :QSPB-INSMAXCHGABL-7,
              SPBFILE.SPB_INSMAXBENIF_7 = :QSPB-INSMAXBENIF-7,
              SPBFILE.SPB_INSMAXTERM_7 = :QSPB-INSMAXTERM-7,
              SPBFILE.SPB_INSCHGBEN_7 = :QSPB-INSCHGBEN-7,
              SPBFILE.SPB_INSEXCEPT_7 = :QSPB-INSEXCEPT-7,
              SPBFILE.SPB_INSNOVER_7 = :QSPB-INSNOVER-7,
              SPBFILE.SPB_INSMINAGE_7_1 = :QSPB-INSMINAGE-7-1,
              SPBFILE.SPB_INSMAXAGE_7_1 = :QSPB-INSMAXAGE-7-1,
              SPBFILE.SPB_INSMAXCOV_7_1 = :QSPB-INSMAXCOV-7-1,
              SPBFILE.SPB_INSMAXTRM_7_1 = :QSPB-INSMAXTRM-7-1,
              SPBFILE.SPB_INSMINAGE_7_2 = :QSPB-INSMINAGE-7-2,
              SPBFILE.SPB_INSMAXAGE_7_2 = :QSPB-INSMAXAGE-7-2,
              SPBFILE.SPB_INSMAXCOV_7_2 = :QSPB-INSMAXCOV-7-2,
              SPBFILE.SPB_INSMAXTRM_7_2 = :QSPB-INSMAXTRM-7-2,
              SPBFILE.SPB_INSMINAGE_7_3 = :QSPB-INSMINAGE-7-3,
              SPBFILE.SPB_INSMAXAGE_7_3 = :QSPB-INSMAXAGE-7-3,
              SPBFILE.SPB_INSMAXCOV_7_3 = :QSPB-INSMAXCOV-7-3,
              SPBFILE.SPB_INSMAXTRM_7_3 = :QSPB-INSMAXTRM-7-3,
              SPBFILE.SPB_INSMINAGE_7_4 = :QSPB-INSMINAGE-7-4,
              SPBFILE.SPB_INSMAXAGE_7_4 = :QSPB-INSMAXAGE-7-4,
              SPBFILE.SPB_INSMAXCOV_7_4 = :QSPB-INSMAXCOV-7-4,
              SPBFILE.SPB_INSMAXTRM_7_4 = :QSPB-INSMAXTRM-7-4,
              SPBFILE.SPB_INSMINAGE_7_5 = :QSPB-INSMINAGE-7-5,
              SPBFILE.SPB_INSMAXAGE_7_5 = :QSPB-INSMAXAGE-7-5,
              SPBFILE.SPB_INSMAXCOV_7_5 = :QSPB-INSMAXCOV-7-5,
              SPBFILE.SPB_INSMAXTRM_7_5 = :QSPB-INSMAXTRM-7-5,
              SPBFILE.SPB_INSFEECD_7 = :QSPB-INSFEECD-7,
              SPBFILE.SPB_INSFEE_FRMLA_7 = :QSPB-INSFEE-FRMLA-7,
              SPBFILE.SPB_INSCHGABL_FG_7 = :QSPB-INSCHGABL-FG-7,
              SPBFILE.SPB_INSREJECT_FG_7 = :QSPB-INSREJECT-FG-7,
              SPBFILE.SPB_INSFINCHG_7 = :QSPB-INSFINCHG-7,
              SPBFILE.SPB_INSCOM_8 = :QSPB-INSCOM-8,
              SPBFILE.SPB_INSRATECD_8 = :QSPB-INSRATECD-8,
              SPBFILE.SPB_INSJFAC_8 = :QSPB-INSJFAC-8,
              SPBFILE.SPB_INSDISCNT_8 = :QSPB-INSDISCNT-8,
              SPBFILE.SPB_INSCHGABL_8 = :QSPB-INSCHGABL-8,
              SPBFILE.SPB_INSTERM_8_1 = :QSPB-INSTERM-8-1,
              SPBFILE.SPB_INSRATE_8_1 = :QSPB-INSRATE-8-1,
              SPBFILE.SPB_INSTERM_8_2 = :QSPB-INSTERM-8-2,
              SPBFILE.SPB_INSRATE_8_2 = :QSPB-INSRATE-8-2,
              SPBFILE.SPB_INSTERM_8_3 = :QSPB-INSTERM-8-3,
              SPBFILE.SPB_INSRATE_8_3 = :QSPB-INSRATE-8-3,
              SPBFILE.SPB_INSTERM_8_4 = :QSPB-INSTERM-8-4,
              SPBFILE.SPB_INSRATE_8_4 = :QSPB-INSRATE-8-4,
              SPBFILE.SPB_INSTERM_8_5 = :QSPB-INSTERM-8-5,
              SPBFILE.SPB_INSRATE_8_5 = :QSPB-INSRATE-8-5,
              SPBFILE.SPB_INSTERM_8_6 = :QSPB-INSTERM-8-6,
              SPBFILE.SPB_INSRATE_8_6 = :QSPB-INSRATE-8-6,
              SPBFILE.SPB_INSTERM_8_7 = :QSPB-INSTERM-8-7,
              SPBFILE.SPB_INSRATE_8_7 = :QSPB-INSRATE-8-7,
              SPBFILE.SPB_INSTERM_8_8 = :QSPB-INSTERM-8-8,
              SPBFILE.SPB_INSRATE_8_8 = :QSPB-INSRATE-8-8,
              SPBFILE.SPB_INSTERM_8_9 = :QSPB-INSTERM-8-9,
              SPBFILE.SPB_INSRATE_8_9 = :QSPB-INSRATE-8-9,
              SPBFILE.SPB_INSTERM_8_10 = :QSPB-INSTERM-8-10,
              SPBFILE.SPB_INSRATE_8_10 = :QSPB-INSRATE-8-10,
              SPBFILE.SPB_INSTERM_8_11 = :QSPB-INSTERM-8-11,
              SPBFILE.SPB_INSRATE_8_11 = :QSPB-INSRATE-8-11,
              SPBFILE.SPB_INSTERM_8_12 = :QSPB-INSTERM-8-12,
              SPBFILE.SPB_INSRATE_8_12 = :QSPB-INSRATE-8-12,
              SPBFILE.SPB_INSTERM_8_13 = :QSPB-INSTERM-8-13,
              SPBFILE.SPB_INSRATE_8_13 = :QSPB-INSRATE-8-13,
              SPBFILE.SPB_INSTERM_8_14 = :QSPB-INSTERM-8-14,
              SPBFILE.SPB_INSRATE_8_14 = :QSPB-INSRATE-8-14,
              SPBFILE.SPB_INSTERM_8_15 = :QSPB-INSTERM-8-15,
              SPBFILE.SPB_INSRATE_8_15 = :QSPB-INSRATE-8-15,
              SPBFILE.SPB_INSTERM_8_16 = :QSPB-INSTERM-8-16,
              SPBFILE.SPB_INSRATE_8_16 = :QSPB-INSRATE-8-16,
              SPBFILE.SPB_INSTERM_8_17 = :QSPB-INSTERM-8-17,
              SPBFILE.SPB_INSRATE_8_17 = :QSPB-INSRATE-8-17,
              SPBFILE.SPB_INSTERM_8_18 = :QSPB-INSTERM-8-18,
              SPBFILE.SPB_INSRATE_8_18 = :QSPB-INSRATE-8-18,
              SPBFILE.SPB_INSTERM_8_19 = :QSPB-INSTERM-8-19,
              SPBFILE.SPB_INSRATE_8_19 = :QSPB-INSRATE-8-19,
              SPBFILE.SPB_INSTERM_8_20 = :QSPB-INSTERM-8-20,
              SPBFILE.SPB_INSRATE_8_20 = :QSPB-INSRATE-8-20,
              SPBFILE.SPB_INSMINPREM_8 = :QSPB-INSMINPREM-8,
              SPBFILE.SPB_INSMINCHGABL_8 = :QSPB-INSMINCHGABL-8,
              SPBFILE.SPB_INSMAXCHGABL_8 = :QSPB-INSMAXCHGABL-8,
              SPBFILE.SPB_INSMAXBENIF_8 = :QSPB-INSMAXBENIF-8,
              SPBFILE.SPB_INSMAXTERM_8 = :QSPB-INSMAXTERM-8,
              SPBFILE.SPB_INSCHGBEN_8 = :QSPB-INSCHGBEN-8,
              SPBFILE.SPB_INSEXCEPT_8 = :QSPB-INSEXCEPT-8,
              SPBFILE.SPB_INSNOVER_8 = :QSPB-INSNOVER-8,
              SPBFILE.SPB_INSMINAGE_8_1 = :QSPB-INSMINAGE-8-1,
              SPBFILE.SPB_INSMAXAGE_8_1 = :QSPB-INSMAXAGE-8-1,
              SPBFILE.SPB_INSMAXCOV_8_1 = :QSPB-INSMAXCOV-8-1,
              SPBFILE.SPB_INSMAXTRM_8_1 = :QSPB-INSMAXTRM-8-1,
              SPBFILE.SPB_INSMINAGE_8_2 = :QSPB-INSMINAGE-8-2,
              SPBFILE.SPB_INSMAXAGE_8_2 = :QSPB-INSMAXAGE-8-2,
              SPBFILE.SPB_INSMAXCOV_8_2 = :QSPB-INSMAXCOV-8-2,
              SPBFILE.SPB_INSMAXTRM_8_2 = :QSPB-INSMAXTRM-8-2,
              SPBFILE.SPB_INSMINAGE_8_3 = :QSPB-INSMINAGE-8-3,
              SPBFILE.SPB_INSMAXAGE_8_3 = :QSPB-INSMAXAGE-8-3,
              SPBFILE.SPB_INSMAXCOV_8_3 = :QSPB-INSMAXCOV-8-3,
              SPBFILE.SPB_INSMAXTRM_8_3 = :QSPB-INSMAXTRM-8-3,
              SPBFILE.SPB_INSMINAGE_8_4 = :QSPB-INSMINAGE-8-4,
              SPBFILE.SPB_INSMAXAGE_8_4 = :QSPB-INSMAXAGE-8-4,
              SPBFILE.SPB_INSMAXCOV_8_4 = :QSPB-INSMAXCOV-8-4,
              SPBFILE.SPB_INSMAXTRM_8_4 = :QSPB-INSMAXTRM-8-4,
              SPBFILE.SPB_INSMINAGE_8_5 = :QSPB-INSMINAGE-8-5,
              SPBFILE.SPB_INSMAXAGE_8_5 = :QSPB-INSMAXAGE-8-5,
              SPBFILE.SPB_INSMAXCOV_8_5 = :QSPB-INSMAXCOV-8-5,
              SPBFILE.SPB_INSMAXTRM_8_5 = :QSPB-INSMAXTRM-8-5,
              SPBFILE.SPB_INSFEECD_8 = :QSPB-INSFEECD-8,
              SPBFILE.SPB_INSFEE_FRMLA_8 = :QSPB-INSFEE-FRMLA-8,
              SPBFILE.SPB_INSCHGABL_FG_8 = :QSPB-INSCHGABL-FG-8,
              SPBFILE.SPB_INSREJECT_FG_8 = :QSPB-INSREJECT-FG-8,
              SPBFILE.SPB_INSFINCHG_8 = :QSPB-INSFINCHG-8,
              SPBFILE.SPB_INSCOM_9 = :QSPB-INSCOM-9,
              SPBFILE.SPB_INSRATECD_9 = :QSPB-INSRATECD-9,
              SPBFILE.SPB_INSJFAC_9 = :QSPB-INSJFAC-9,
              SPBFILE.SPB_INSDISCNT_9 = :QSPB-INSDISCNT-9,
              SPBFILE.SPB_INSCHGABL_9 = :QSPB-INSCHGABL-9,
              SPBFILE.SPB_INSTERM_9_1 = :QSPB-INSTERM-9-1,
              SPBFILE.SPB_INSRATE_9_1 = :QSPB-INSRATE-9-1,
              SPBFILE.SPB_INSTERM_9_2 = :QSPB-INSTERM-9-2,
              SPBFILE.SPB_INSRATE_9_2 = :QSPB-INSRATE-9-2,
              SPBFILE.SPB_INSTERM_9_3 = :QSPB-INSTERM-9-3,
              SPBFILE.SPB_INSRATE_9_3 = :QSPB-INSRATE-9-3,
              SPBFILE.SPB_INSTERM_9_4 = :QSPB-INSTERM-9-4,
              SPBFILE.SPB_INSRATE_9_4 = :QSPB-INSRATE-9-4,
              SPBFILE.SPB_INSTERM_9_5 = :QSPB-INSTERM-9-5,
              SPBFILE.SPB_INSRATE_9_5 = :QSPB-INSRATE-9-5,
              SPBFILE.SPB_INSTERM_9_6 = :QSPB-INSTERM-9-6,
              SPBFILE.SPB_INSRATE_9_6 = :QSPB-INSRATE-9-6,
              SPBFILE.SPB_INSTERM_9_7 = :QSPB-INSTERM-9-7,
              SPBFILE.SPB_INSRATE_9_7 = :QSPB-INSRATE-9-7,
              SPBFILE.SPB_INSTERM_9_8 = :QSPB-INSTERM-9-8,
              SPBFILE.SPB_INSRATE_9_8 = :QSPB-INSRATE-9-8,
              SPBFILE.SPB_INSTERM_9_9 = :QSPB-INSTERM-9-9,
              SPBFILE.SPB_INSRATE_9_9 = :QSPB-INSRATE-9-9,
              SPBFILE.SPB_INSTERM_9_10 = :QSPB-INSTERM-9-10,
              SPBFILE.SPB_INSRATE_9_10 = :QSPB-INSRATE-9-10,
              SPBFILE.SPB_INSTERM_9_11 = :QSPB-INSTERM-9-11,
              SPBFILE.SPB_INSRATE_9_11 = :QSPB-INSRATE-9-11,
              SPBFILE.SPB_INSTERM_9_12 = :QSPB-INSTERM-9-12,
              SPBFILE.SPB_INSRATE_9_12 = :QSPB-INSRATE-9-12,
              SPBFILE.SPB_INSTERM_9_13 = :QSPB-INSTERM-9-13,
              SPBFILE.SPB_INSRATE_9_13 = :QSPB-INSRATE-9-13,
              SPBFILE.SPB_INSTERM_9_14 = :QSPB-INSTERM-9-14,
              SPBFILE.SPB_INSRATE_9_14 = :QSPB-INSRATE-9-14,
              SPBFILE.SPB_INSTERM_9_15 = :QSPB-INSTERM-9-15,
              SPBFILE.SPB_INSRATE_9_15 = :QSPB-INSRATE-9-15,
              SPBFILE.SPB_INSTERM_9_16 = :QSPB-INSTERM-9-16,
              SPBFILE.SPB_INSRATE_9_16 = :QSPB-INSRATE-9-16,
              SPBFILE.SPB_INSTERM_9_17 = :QSPB-INSTERM-9-17,
              SPBFILE.SPB_INSRATE_9_17 = :QSPB-INSRATE-9-17,
              SPBFILE.SPB_INSTERM_9_18 = :QSPB-INSTERM-9-18,
              SPBFILE.SPB_INSRATE_9_18 = :QSPB-INSRATE-9-18,
              SPBFILE.SPB_INSTERM_9_19 = :QSPB-INSTERM-9-19,
              SPBFILE.SPB_INSRATE_9_19 = :QSPB-INSRATE-9-19,
              SPBFILE.SPB_INSTERM_9_20 = :QSPB-INSTERM-9-20,
              SPBFILE.SPB_INSRATE_9_20 = :QSPB-INSRATE-9-20,
              SPBFILE.SPB_INSMINPREM_9 = :QSPB-INSMINPREM-9,
              SPBFILE.SPB_INSMINCHGABL_9 = :QSPB-INSMINCHGABL-9,
              SPBFILE.SPB_INSMAXCHGABL_9 = :QSPB-INSMAXCHGABL-9,
              SPBFILE.SPB_INSMAXBENIF_9 = :QSPB-INSMAXBENIF-9,
              SPBFILE.SPB_INSMAXTERM_9 = :QSPB-INSMAXTERM-9,
              SPBFILE.SPB_INSCHGBEN_9 = :QSPB-INSCHGBEN-9,
              SPBFILE.SPB_INSEXCEPT_9 = :QSPB-INSEXCEPT-9,
              SPBFILE.SPB_INSNOVER_9 = :QSPB-INSNOVER-9,
              SPBFILE.SPB_INSMINAGE_9_1 = :QSPB-INSMINAGE-9-1,
              SPBFILE.SPB_INSMAXAGE_9_1 = :QSPB-INSMAXAGE-9-1,
              SPBFILE.SPB_INSMAXCOV_9_1 = :QSPB-INSMAXCOV-9-1,
              SPBFILE.SPB_INSMAXTRM_9_1 = :QSPB-INSMAXTRM-9-1,
              SPBFILE.SPB_INSMINAGE_9_2 = :QSPB-INSMINAGE-9-2,
              SPBFILE.SPB_INSMAXAGE_9_2 = :QSPB-INSMAXAGE-9-2,
              SPBFILE.SPB_INSMAXCOV_9_2 = :QSPB-INSMAXCOV-9-2,
              SPBFILE.SPB_INSMAXTRM_9_2 = :QSPB-INSMAXTRM-9-2,
              SPBFILE.SPB_INSMINAGE_9_3 = :QSPB-INSMINAGE-9-3,
              SPBFILE.SPB_INSMAXAGE_9_3 = :QSPB-INSMAXAGE-9-3,
              SPBFILE.SPB_INSMAXCOV_9_3 = :QSPB-INSMAXCOV-9-3,
              SPBFILE.SPB_INSMAXTRM_9_3 = :QSPB-INSMAXTRM-9-3,
              SPBFILE.SPB_INSMINAGE_9_4 = :QSPB-INSMINAGE-9-4,
              SPBFILE.SPB_INSMAXAGE_9_4 = :QSPB-INSMAXAGE-9-4,
              SPBFILE.SPB_INSMAXCOV_9_4 = :QSPB-INSMAXCOV-9-4,
              SPBFILE.SPB_INSMAXTRM_9_4 = :QSPB-INSMAXTRM-9-4,
              SPBFILE.SPB_INSMINAGE_9_5 = :QSPB-INSMINAGE-9-5,
              SPBFILE.SPB_INSMAXAGE_9_5 = :QSPB-INSMAXAGE-9-5,
              SPBFILE.SPB_INSMAXCOV_9_5 = :QSPB-INSMAXCOV-9-5,
              SPBFILE.SPB_INSMAXTRM_9_5 = :QSPB-INSMAXTRM-9-5,
              SPBFILE.SPB_INSFEECD_9 = :QSPB-INSFEECD-9,
              SPBFILE.SPB_INSFEE_FRMLA_9 = :QSPB-INSFEE-FRMLA-9,
              SPBFILE.SPB_INSCHGABL_FG_9 = :QSPB-INSCHGABL-FG-9,
              SPBFILE.SPB_INSREJECT_FG_9 = :QSPB-INSREJECT-FG-9,
              SPBFILE.SPB_INSFINCHG_9 = :QSPB-INSFINCHG-9,
              SPBFILE.SPB_INSCOM_10 = :QSPB-INSCOM-10,
              SPBFILE.SPB_INSRATECD_10 = :QSPB-INSRATECD-10,
              SPBFILE.SPB_INSJFAC_10 = :QSPB-INSJFAC-10,
              SPBFILE.SPB_INSDISCNT_10 = :QSPB-INSDISCNT-10,
              SPBFILE.SPB_INSCHGABL_10 = :QSPB-INSCHGABL-10,
              SPBFILE.SPB_INSTERM_10_1 = :QSPB-INSTERM-10-1,
              SPBFILE.SPB_INSRATE_10_1 = :QSPB-INSRATE-10-1,
              SPBFILE.SPB_INSTERM_10_2 = :QSPB-INSTERM-10-2,
              SPBFILE.SPB_INSRATE_10_2 = :QSPB-INSRATE-10-2,
              SPBFILE.SPB_INSTERM_10_3 = :QSPB-INSTERM-10-3,
              SPBFILE.SPB_INSRATE_10_3 = :QSPB-INSRATE-10-3,
              SPBFILE.SPB_INSTERM_10_4 = :QSPB-INSTERM-10-4,
              SPBFILE.SPB_INSRATE_10_4 = :QSPB-INSRATE-10-4,
              SPBFILE.SPB_INSTERM_10_5 = :QSPB-INSTERM-10-5,
              SPBFILE.SPB_INSRATE_10_5 = :QSPB-INSRATE-10-5,
              SPBFILE.SPB_INSTERM_10_6 = :QSPB-INSTERM-10-6,
              SPBFILE.SPB_INSRATE_10_6 = :QSPB-INSRATE-10-6,
              SPBFILE.SPB_INSTERM_10_7 = :QSPB-INSTERM-10-7,
              SPBFILE.SPB_INSRATE_10_7 = :QSPB-INSRATE-10-7,
              SPBFILE.SPB_INSTERM_10_8 = :QSPB-INSTERM-10-8,
              SPBFILE.SPB_INSRATE_10_8 = :QSPB-INSRATE-10-8,
              SPBFILE.SPB_INSTERM_10_9 = :QSPB-INSTERM-10-9,
              SPBFILE.SPB_INSRATE_10_9 = :QSPB-INSRATE-10-9,
              SPBFILE.SPB_INSTERM_10_10 = :QSPB-INSTERM-10-10,
              SPBFILE.SPB_INSRATE_10_10 = :QSPB-INSRATE-10-10,
              SPBFILE.SPB_INSTERM_10_11 = :QSPB-INSTERM-10-11,
              SPBFILE.SPB_INSRATE_10_11 = :QSPB-INSRATE-10-11,
              SPBFILE.SPB_INSTERM_10_12 = :QSPB-INSTERM-10-12,
              SPBFILE.SPB_INSRATE_10_12 = :QSPB-INSRATE-10-12,
              SPBFILE.SPB_INSTERM_10_13 = :QSPB-INSTERM-10-13,
              SPBFILE.SPB_INSRATE_10_13 = :QSPB-INSRATE-10-13,
              SPBFILE.SPB_INSTERM_10_14 = :QSPB-INSTERM-10-14,
              SPBFILE.SPB_INSRATE_10_14 = :QSPB-INSRATE-10-14,
              SPBFILE.SPB_INSTERM_10_15 = :QSPB-INSTERM-10-15,
              SPBFILE.SPB_INSRATE_10_15 = :QSPB-INSRATE-10-15,
              SPBFILE.SPB_INSTERM_10_16 = :QSPB-INSTERM-10-16,
              SPBFILE.SPB_INSRATE_10_16 = :QSPB-INSRATE-10-16,
              SPBFILE.SPB_INSTERM_10_17 = :QSPB-INSTERM-10-17,
              SPBFILE.SPB_INSRATE_10_17 = :QSPB-INSRATE-10-17,
              SPBFILE.SPB_INSTERM_10_18 = :QSPB-INSTERM-10-18,
              SPBFILE.SPB_INSRATE_10_18 = :QSPB-INSRATE-10-18,
              SPBFILE.SPB_INSTERM_10_19 = :QSPB-INSTERM-10-19,
              SPBFILE.SPB_INSRATE_10_19 = :QSPB-INSRATE-10-19,
              SPBFILE.SPB_INSTERM_10_20 = :QSPB-INSTERM-10-20,
              SPBFILE.SPB_INSRATE_10_20 = :QSPB-INSRATE-10-20,
              SPBFILE.SPB_INSMINPREM_10 = :QSPB-INSMINPREM-10,
              SPBFILE.SPB_INSMINCHGABL_10 = :QSPB-INSMINCHGABL-10,
              SPBFILE.SPB_INSMAXCHGABL_10 = :QSPB-INSMAXCHGABL-10,
              SPBFILE.SPB_INSMAXBENIF_10 = :QSPB-INSMAXBENIF-10,
              SPBFILE.SPB_INSMAXTERM_10 = :QSPB-INSMAXTERM-10,
              SPBFILE.SPB_INSCHGBEN_10 = :QSPB-INSCHGBEN-10,
              SPBFILE.SPB_INSEXCEPT_10 = :QSPB-INSEXCEPT-10,
              SPBFILE.SPB_INSNOVER_10 = :QSPB-INSNOVER-10,
              SPBFILE.SPB_INSMINAGE_10_1 = :QSPB-INSMINAGE-10-1,
              SPBFILE.SPB_INSMAXAGE_10_1 = :QSPB-INSMAXAGE-10-1,
              SPBFILE.SPB_INSMAXCOV_10_1 = :QSPB-INSMAXCOV-10-1,
              SPBFILE.SPB_INSMAXTRM_10_1 = :QSPB-INSMAXTRM-10-1,
              SPBFILE.SPB_INSMINAGE_10_2 = :QSPB-INSMINAGE-10-2,
              SPBFILE.SPB_INSMAXAGE_10_2 = :QSPB-INSMAXAGE-10-2,
              SPBFILE.SPB_INSMAXCOV_10_2 = :QSPB-INSMAXCOV-10-2,
              SPBFILE.SPB_INSMAXTRM_10_2 = :QSPB-INSMAXTRM-10-2,
              SPBFILE.SPB_INSMINAGE_10_3 = :QSPB-INSMINAGE-10-3,
              SPBFILE.SPB_INSMAXAGE_10_3 = :QSPB-INSMAXAGE-10-3,
              SPBFILE.SPB_INSMAXCOV_10_3 = :QSPB-INSMAXCOV-10-3,
              SPBFILE.SPB_INSMAXTRM_10_3 = :QSPB-INSMAXTRM-10-3,
              SPBFILE.SPB_INSMINAGE_10_4 = :QSPB-INSMINAGE-10-4,
              SPBFILE.SPB_INSMAXAGE_10_4 = :QSPB-INSMAXAGE-10-4,
              SPBFILE.SPB_INSMAXCOV_10_4 = :QSPB-INSMAXCOV-10-4,
              SPBFILE.SPB_INSMAXTRM_10_4 = :QSPB-INSMAXTRM-10-4,
              SPBFILE.SPB_INSMINAGE_10_5 = :QSPB-INSMINAGE-10-5,
              SPBFILE.SPB_INSMAXAGE_10_5 = :QSPB-INSMAXAGE-10-5,
              SPBFILE.SPB_INSMAXCOV_10_5 = :QSPB-INSMAXCOV-10-5,
              SPBFILE.SPB_INSMAXTRM_10_5 = :QSPB-INSMAXTRM-10-5,
              SPBFILE.SPB_INSFEECD_10 = :QSPB-INSFEECD-10,
              SPBFILE.SPB_INSFEE_FRMLA_10 = :QSPB-INSFEE-FRMLA-10,
              SPBFILE.SPB_INSCHGABL_FG_10 = :QSPB-INSCHGABL-FG-10,
              SPBFILE.SPB_INSREJECT_FG_10 = :QSPB-INSREJECT-FG-10,
              SPBFILE.SPB_INSFINCHG_10 = :QSPB-INSFINCHG-10,
              SPBFILE.SPB_INSCOM_11 = :QSPB-INSCOM-11,
              SPBFILE.SPB_INSRATECD_11 = :QSPB-INSRATECD-11,
              SPBFILE.SPB_INSJFAC_11 = :QSPB-INSJFAC-11,
              SPBFILE.SPB_INSDISCNT_11 = :QSPB-INSDISCNT-11,
              SPBFILE.SPB_INSCHGABL_11 = :QSPB-INSCHGABL-11,
              SPBFILE.SPB_INSTERM_11_1 = :QSPB-INSTERM-11-1,
              SPBFILE.SPB_INSRATE_11_1 = :QSPB-INSRATE-11-1,
              SPBFILE.SPB_INSTERM_11_2 = :QSPB-INSTERM-11-2,
              SPBFILE.SPB_INSRATE_11_2 = :QSPB-INSRATE-11-2,
              SPBFILE.SPB_INSTERM_11_3 = :QSPB-INSTERM-11-3,
              SPBFILE.SPB_INSRATE_11_3 = :QSPB-INSRATE-11-3,
              SPBFILE.SPB_INSTERM_11_4 = :QSPB-INSTERM-11-4,
              SPBFILE.SPB_INSRATE_11_4 = :QSPB-INSRATE-11-4,
              SPBFILE.SPB_INSTERM_11_5 = :QSPB-INSTERM-11-5,
              SPBFILE.SPB_INSRATE_11_5 = :QSPB-INSRATE-11-5,
              SPBFILE.SPB_INSTERM_11_6 = :QSPB-INSTERM-11-6,
              SPBFILE.SPB_INSRATE_11_6 = :QSPB-INSRATE-11-6,
              SPBFILE.SPB_INSTERM_11_7 = :QSPB-INSTERM-11-7,
              SPBFILE.SPB_INSRATE_11_7 = :QSPB-INSRATE-11-7,
              SPBFILE.SPB_INSTERM_11_8 = :QSPB-INSTERM-11-8,
              SPBFILE.SPB_INSRATE_11_8 = :QSPB-INSRATE-11-8,
              SPBFILE.SPB_INSTERM_11_9 = :QSPB-INSTERM-11-9,
              SPBFILE.SPB_INSRATE_11_9 = :QSPB-INSRATE-11-9,
              SPBFILE.SPB_INSTERM_11_10 = :QSPB-INSTERM-11-10,
              SPBFILE.SPB_INSRATE_11_10 = :QSPB-INSRATE-11-10,
              SPBFILE.SPB_INSTERM_11_11 = :QSPB-INSTERM-11-11,
              SPBFILE.SPB_INSRATE_11_11 = :QSPB-INSRATE-11-11,
              SPBFILE.SPB_INSTERM_11_12 = :QSPB-INSTERM-11-12,
              SPBFILE.SPB_INSRATE_11_12 = :QSPB-INSRATE-11-12,
              SPBFILE.SPB_INSTERM_11_13 = :QSPB-INSTERM-11-13,
              SPBFILE.SPB_INSRATE_11_13 = :QSPB-INSRATE-11-13,
              SPBFILE.SPB_INSTERM_11_14 = :QSPB-INSTERM-11-14,
              SPBFILE.SPB_INSRATE_11_14 = :QSPB-INSRATE-11-14,
              SPBFILE.SPB_INSTERM_11_15 = :QSPB-INSTERM-11-15,
              SPBFILE.SPB_INSRATE_11_15 = :QSPB-INSRATE-11-15,
              SPBFILE.SPB_INSTERM_11_16 = :QSPB-INSTERM-11-16,
              SPBFILE.SPB_INSRATE_11_16 = :QSPB-INSRATE-11-16,
              SPBFILE.SPB_INSTERM_11_17 = :QSPB-INSTERM-11-17,
              SPBFILE.SPB_INSRATE_11_17 = :QSPB-INSRATE-11-17,
              SPBFILE.SPB_INSTERM_11_18 = :QSPB-INSTERM-11-18,
              SPBFILE.SPB_INSRATE_11_18 = :QSPB-INSRATE-11-18,
              SPBFILE.SPB_INSTERM_11_19 = :QSPB-INSTERM-11-19,
              SPBFILE.SPB_INSRATE_11_19 = :QSPB-INSRATE-11-19,
              SPBFILE.SPB_INSTERM_11_20 = :QSPB-INSTERM-11-20,
              SPBFILE.SPB_INSRATE_11_20 = :QSPB-INSRATE-11-20,
              SPBFILE.SPB_INSMINPREM_11 = :QSPB-INSMINPREM-11,
              SPBFILE.SPB_INSMINCHGABL_11 = :QSPB-INSMINCHGABL-11,
              SPBFILE.SPB_INSMAXCHGABL_11 = :QSPB-INSMAXCHGABL-11,
              SPBFILE.SPB_INSMAXBENIF_11 = :QSPB-INSMAXBENIF-11,
              SPBFILE.SPB_INSMAXTERM_11 = :QSPB-INSMAXTERM-11,
              SPBFILE.SPB_INSCHGBEN_11 = :QSPB-INSCHGBEN-11,
              SPBFILE.SPB_INSEXCEPT_11 = :QSPB-INSEXCEPT-11,
              SPBFILE.SPB_INSNOVER_11 = :QSPB-INSNOVER-11,
              SPBFILE.SPB_INSMINAGE_11_1 = :QSPB-INSMINAGE-11-1,
              SPBFILE.SPB_INSMAXAGE_11_1 = :QSPB-INSMAXAGE-11-1,
              SPBFILE.SPB_INSMAXCOV_11_1 = :QSPB-INSMAXCOV-11-1,
              SPBFILE.SPB_INSMAXTRM_11_1 = :QSPB-INSMAXTRM-11-1,
              SPBFILE.SPB_INSMINAGE_11_2 = :QSPB-INSMINAGE-11-2,
              SPBFILE.SPB_INSMAXAGE_11_2 = :QSPB-INSMAXAGE-11-2,
              SPBFILE.SPB_INSMAXCOV_11_2 = :QSPB-INSMAXCOV-11-2,
              SPBFILE.SPB_INSMAXTRM_11_2 = :QSPB-INSMAXTRM-11-2,
              SPBFILE.SPB_INSMINAGE_11_3 = :QSPB-INSMINAGE-11-3,
              SPBFILE.SPB_INSMAXAGE_11_3 = :QSPB-INSMAXAGE-11-3,
              SPBFILE.SPB_INSMAXCOV_11_3 = :QSPB-INSMAXCOV-11-3,
              SPBFILE.SPB_INSMAXTRM_11_3 = :QSPB-INSMAXTRM-11-3,
              SPBFILE.SPB_INSMINAGE_11_4 = :QSPB-INSMINAGE-11-4,
              SPBFILE.SPB_INSMAXAGE_11_4 = :QSPB-INSMAXAGE-11-4,
              SPBFILE.SPB_INSMAXCOV_11_4 = :QSPB-INSMAXCOV-11-4,
              SPBFILE.SPB_INSMAXTRM_11_4 = :QSPB-INSMAXTRM-11-4,
              SPBFILE.SPB_INSMINAGE_11_5 = :QSPB-INSMINAGE-11-5,
              SPBFILE.SPB_INSMAXAGE_11_5 = :QSPB-INSMAXAGE-11-5,
              SPBFILE.SPB_INSMAXCOV_11_5 = :QSPB-INSMAXCOV-11-5,
              SPBFILE.SPB_INSMAXTRM_11_5 = :QSPB-INSMAXTRM-11-5,
              SPBFILE.SPB_INSFEECD_11 = :QSPB-INSFEECD-11,
              SPBFILE.SPB_INSFEE_FRMLA_11 = :QSPB-INSFEE-FRMLA-11,
              SPBFILE.SPB_INSCHGABL_FG_11 = :QSPB-INSCHGABL-FG-11,
              SPBFILE.SPB_INSREJECT_FG_11 = :QSPB-INSREJECT-FG-11,
              SPBFILE.SPB_INSFINCHG_11 = :QSPB-INSFINCHG-11,
              SPBFILE.SPB_INSCOM_12 = :QSPB-INSCOM-12,
              SPBFILE.SPB_INSRATECD_12 = :QSPB-INSRATECD-12,
              SPBFILE.SPB_INSJFAC_12 = :QSPB-INSJFAC-12,
              SPBFILE.SPB_INSDISCNT_12 = :QSPB-INSDISCNT-12,
              SPBFILE.SPB_INSCHGABL_12 = :QSPB-INSCHGABL-12,
              SPBFILE.SPB_INSTERM_12_1 = :QSPB-INSTERM-12-1,
              SPBFILE.SPB_INSRATE_12_1 = :QSPB-INSRATE-12-1,
              SPBFILE.SPB_INSTERM_12_2 = :QSPB-INSTERM-12-2,
              SPBFILE.SPB_INSRATE_12_2 = :QSPB-INSRATE-12-2,
              SPBFILE.SPB_INSTERM_12_3 = :QSPB-INSTERM-12-3,
              SPBFILE.SPB_INSRATE_12_3 = :QSPB-INSRATE-12-3,
              SPBFILE.SPB_INSTERM_12_4 = :QSPB-INSTERM-12-4,
              SPBFILE.SPB_INSRATE_12_4 = :QSPB-INSRATE-12-4,
              SPBFILE.SPB_INSTERM_12_5 = :QSPB-INSTERM-12-5,
              SPBFILE.SPB_INSRATE_12_5 = :QSPB-INSRATE-12-5,
              SPBFILE.SPB_INSTERM_12_6 = :QSPB-INSTERM-12-6,
              SPBFILE.SPB_INSRATE_12_6 = :QSPB-INSRATE-12-6,
              SPBFILE.SPB_INSTERM_12_7 = :QSPB-INSTERM-12-7,
              SPBFILE.SPB_INSRATE_12_7 = :QSPB-INSRATE-12-7,
              SPBFILE.SPB_INSTERM_12_8 = :QSPB-INSTERM-12-8,
              SPBFILE.SPB_INSRATE_12_8 = :QSPB-INSRATE-12-8,
              SPBFILE.SPB_INSTERM_12_9 = :QSPB-INSTERM-12-9,
              SPBFILE.SPB_INSRATE_12_9 = :QSPB-INSRATE-12-9,
              SPBFILE.SPB_INSTERM_12_10 = :QSPB-INSTERM-12-10,
              SPBFILE.SPB_INSRATE_12_10 = :QSPB-INSRATE-12-10,
              SPBFILE.SPB_INSTERM_12_11 = :QSPB-INSTERM-12-11,
              SPBFILE.SPB_INSRATE_12_11 = :QSPB-INSRATE-12-11,
              SPBFILE.SPB_INSTERM_12_12 = :QSPB-INSTERM-12-12,
              SPBFILE.SPB_INSRATE_12_12 = :QSPB-INSRATE-12-12,
              SPBFILE.SPB_INSTERM_12_13 = :QSPB-INSTERM-12-13,
              SPBFILE.SPB_INSRATE_12_13 = :QSPB-INSRATE-12-13,
              SPBFILE.SPB_INSTERM_12_14 = :QSPB-INSTERM-12-14,
              SPBFILE.SPB_INSRATE_12_14 = :QSPB-INSRATE-12-14,
              SPBFILE.SPB_INSTERM_12_15 = :QSPB-INSTERM-12-15,
              SPBFILE.SPB_INSRATE_12_15 = :QSPB-INSRATE-12-15,
              SPBFILE.SPB_INSTERM_12_16 = :QSPB-INSTERM-12-16,
              SPBFILE.SPB_INSRATE_12_16 = :QSPB-INSRATE-12-16,
              SPBFILE.SPB_INSTERM_12_17 = :QSPB-INSTERM-12-17,
              SPBFILE.SPB_INSRATE_12_17 = :QSPB-INSRATE-12-17,
              SPBFILE.SPB_INSTERM_12_18 = :QSPB-INSTERM-12-18,
              SPBFILE.SPB_INSRATE_12_18 = :QSPB-INSRATE-12-18,
              SPBFILE.SPB_INSTERM_12_19 = :QSPB-INSTERM-12-19,
              SPBFILE.SPB_INSRATE_12_19 = :QSPB-INSRATE-12-19,
              SPBFILE.SPB_INSTERM_12_20 = :QSPB-INSTERM-12-20,
              SPBFILE.SPB_INSRATE_12_20 = :QSPB-INSRATE-12-20,
              SPBFILE.SPB_INSMINPREM_12 = :QSPB-INSMINPREM-12,
              SPBFILE.SPB_INSMINCHGABL_12 = :QSPB-INSMINCHGABL-12,
              SPBFILE.SPB_INSMAXCHGABL_12 = :QSPB-INSMAXCHGABL-12,
              SPBFILE.SPB_INSMAXBENIF_12 = :QSPB-INSMAXBENIF-12,
              SPBFILE.SPB_INSMAXTERM_12 = :QSPB-INSMAXTERM-12,
              SPBFILE.SPB_INSCHGBEN_12 = :QSPB-INSCHGBEN-12,
              SPBFILE.SPB_INSEXCEPT_12 = :QSPB-INSEXCEPT-12,
              SPBFILE.SPB_INSNOVER_12 = :QSPB-INSNOVER-12,
              SPBFILE.SPB_INSMINAGE_12_1 = :QSPB-INSMINAGE-12-1,
              SPBFILE.SPB_INSMAXAGE_12_1 = :QSPB-INSMAXAGE-12-1,
              SPBFILE.SPB_INSMAXCOV_12_1 = :QSPB-INSMAXCOV-12-1,
              SPBFILE.SPB_INSMAXTRM_12_1 = :QSPB-INSMAXTRM-12-1,
              SPBFILE.SPB_INSMINAGE_12_2 = :QSPB-INSMINAGE-12-2,
              SPBFILE.SPB_INSMAXAGE_12_2 = :QSPB-INSMAXAGE-12-2,
              SPBFILE.SPB_INSMAXCOV_12_2 = :QSPB-INSMAXCOV-12-2,
              SPBFILE.SPB_INSMAXTRM_12_2 = :QSPB-INSMAXTRM-12-2,
              SPBFILE.SPB_INSMINAGE_12_3 = :QSPB-INSMINAGE-12-3,
              SPBFILE.SPB_INSMAXAGE_12_3 = :QSPB-INSMAXAGE-12-3,
              SPBFILE.SPB_INSMAXCOV_12_3 = :QSPB-INSMAXCOV-12-3,
              SPBFILE.SPB_INSMAXTRM_12_3 = :QSPB-INSMAXTRM-12-3,
              SPBFILE.SPB_INSMINAGE_12_4 = :QSPB-INSMINAGE-12-4,
              SPBFILE.SPB_INSMAXAGE_12_4 = :QSPB-INSMAXAGE-12-4,
              SPBFILE.SPB_INSMAXCOV_12_4 = :QSPB-INSMAXCOV-12-4,
              SPBFILE.SPB_INSMAXTRM_12_4 = :QSPB-INSMAXTRM-12-4,
              SPBFILE.SPB_INSMINAGE_12_5 = :QSPB-INSMINAGE-12-5,
              SPBFILE.SPB_INSMAXAGE_12_5 = :QSPB-INSMAXAGE-12-5,
              SPBFILE.SPB_INSMAXCOV_12_5 = :QSPB-INSMAXCOV-12-5,
              SPBFILE.SPB_INSMAXTRM_12_5 = :QSPB-INSMAXTRM-12-5,
              SPBFILE.SPB_INSFEECD_12 = :QSPB-INSFEECD-12,
              SPBFILE.SPB_INSFEE_FRMLA_12 = :QSPB-INSFEE-FRMLA-12,
              SPBFILE.SPB_INSCHGABL_FG_12 = :QSPB-INSCHGABL-FG-12,
              SPBFILE.SPB_INSREJECT_FG_12 = :QSPB-INSREJECT-FG-12,
              SPBFILE.SPB_INSFINCHG_12 = :QSPB-INSFINCHG-12
            WHERE SPBFILE.SPB_ORGST = :QSPB-ORGST
              AND SPBFILE.SPB_SPRCLASS = :QSPB-SPRCLASS
              AND SPBFILE.SPB_SUBCLASS = :QSPB-SUBCLASS
              AND SPBFILE.SPB_LAWCODE = :QSPB-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO REWRITE-SPB1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-----------------------------------------------------------------
       DELETE-SPB1-FILE.

           PERFORM DELETE-IT.
           MOVE SPB-PATH-SQL   TO E-FILE.
           MOVE SPB1-KEY       TO E-KEYX.
           PERFORM SET-SPB-FIELDS.

           EXEC SQL
            DELETE FROM DBO.SPBFILE
            WHERE SPBFILE.SPB_ORGST = :QSPB-ORGST
              AND SPBFILE.SPB_SPRCLASS = :QSPB-SPRCLASS
              AND SPBFILE.SPB_SUBCLASS = :QSPB-SUBCLASS
              AND SPBFILE.SPB_LAWCODE = :QSPB-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO DELETE-SPB1-FILE.

      *-----------------------------------------------------------------
       CLOSE-SPB1-FILE.

      *=================================================================
       LOAD-SPC1-FILE.
      *- - - -{ SET OVERRIDE TO A "Y" TO NOT TOUCH THE PATH AT ALL  }- -
           IF ( SP-PATH-OVERRIDE = "Y" )
              NEXT SENTENCE
           ELSE
      *- - - -{ SPACES IS THE DEFAULT, NO CROSSING BRANCHES }- - - - - -
           IF ( SP-PATH-OVERRIDE = SPACES )
              MOVE EXT-FILPATH-BASE        TO SPC-ALL-BASE
              MOVE EXT-FILPATH-MACHINE     TO SPC-ALL-MACHINE
              MOVE SPC-ALL-PATH             TO SPC-PATH
           ELSE
      *- - - -{ USE BRANCH VALUES }- - - - - - - - - - - - - - - - - - -
           IF ( SP-PATH-OVERRIDE = "B" )
              MOVE FILPATH-BASE            TO SPC-ALL-BASE
              MOVE FILPATH-MACHINE         TO SPC-ALL-MACHINE
              MOVE SPC-ALL-PATH             TO SPC-PATH.

      *-----------------------------------------------------------------
       OPEN-SPC1-FILE.
           PERFORM LOAD-SPC1-FILE.
           PERFORM OPEN-IT.
           MOVE SPC-PATH-SQL TO E-FILE.

      *-----------------------------------------------------------------
       READ-SPC1-FILE.
           PERFORM READ-IT.
           MOVE SPC-PATH-SQL TO E-FILE.
           MOVE SPC1-KEY TO E-KEYX.

           MOVE SPC-ORGST            TO QSPC-ORGST.
           MOVE SPC-SPRCLASS         TO QSPC-SPRCLASS.
           MOVE SPC-SUBCLASS         TO QSPC-SUBCLASS.
           MOVE SPC-LAWCODE          TO QSPC-LAWCODE.

           EXEC SQL
            SELECT ISNULL(SPCFILE.SPC_ORGST,''),
                   SPCFILE.SPC_SPRCLASS,
                   SPCFILE.SPC_SUBCLASS,
                   SPCFILE.SPC_LAWCODE,
                   SPCFILE.SPC_INSEARN_ORDER_1,
                   SPCFILE.SPC_INSEARN_ORDER_2,
                   SPCFILE.SPC_INSEARN_ORDER_3,
                   SPCFILE.SPC_INSEARN_ORDER_4,
                   SPCFILE.SPC_INSEARN_ORDER_5,
                   SPCFILE.SPC_INSEARN_ORDER_6,
                   SPCFILE.SPC_INSEARN_ORDER_7,
                   SPCFILE.SPC_INSEARN_ORDER_8,
                   SPCFILE.SPC_INSEARN_ORDER_9,
                   SPCFILE.SPC_INSEARN_ORDER_10,
                   SPCFILE.SPC_INSEARN_ORDER_11,
                   SPCFILE.SPC_INSEARN_ORDER_12,
                   ISNULL(SPCFILE.SPC_INSAH_JOINT_FG,''),
                   ISNULL(SPCFILE.SPC_INS_O1_EDIT,''),
                   ISNULL(SPCFILE.SPC_INS_O2_EDIT,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_1,''),
                   ISNULL(SPCFILE.SPC_RBDTE_1_1,''),
                   SPCFILE.SPC_RBDAYS_1_1,
                   SPCFILE.SPC_RBYRTYPE_1_1,
                   ISNULL(SPCFILE.SPC_RBDTE_1_2,''),
                   SPCFILE.SPC_RBDAYS_1_2,
                   SPCFILE.SPC_RBYRTYPE_1_2,
                   SPCFILE.SPC_RBMINRET_1,
                   SPCFILE.SPC_RBNOMON_1,
                   SPCFILE.SPC_RBDEDCHG_1,
                   SPCFILE.SPC_RBRECAST_1,
                   SPCFILE.SPC_RBEARLY_1,
                   SPCFILE.SPC_RBDEFER_1,
                   SPCFILE.SPC_RBPCT_1,
                   SPCFILE.SPC_RBREDUC_1,
                   SPCFILE.SPC_RBMIN_1,
                   SPCFILE.SPC_RBSPOPT1_1,
                   SPCFILE.SPC_RBSPOPT2_1,
                   SPCFILE.SPC_RBMANAGER_1,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_1,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_1,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_2,''),
                   ISNULL(SPCFILE.SPC_RBDTE_2_1,''),
                   SPCFILE.SPC_RBDAYS_2_1,
                   SPCFILE.SPC_RBYRTYPE_2_1,
                   ISNULL(SPCFILE.SPC_RBDTE_2_2,''),
                   SPCFILE.SPC_RBDAYS_2_2,
                   SPCFILE.SPC_RBYRTYPE_2_2,
                   SPCFILE.SPC_RBMINRET_2,
                   SPCFILE.SPC_RBNOMON_2,
                   SPCFILE.SPC_RBDEDCHG_2,
                   SPCFILE.SPC_RBRECAST_2,
                   SPCFILE.SPC_RBEARLY_2,
                   SPCFILE.SPC_RBDEFER_2,
                   SPCFILE.SPC_RBPCT_2,
                   SPCFILE.SPC_RBREDUC_2,
                   SPCFILE.SPC_RBMIN_2,
                   SPCFILE.SPC_RBSPOPT1_2,
                   SPCFILE.SPC_RBSPOPT2_2,
                   SPCFILE.SPC_RBMANAGER_2,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_2,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_2,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_3,''),
                   ISNULL(SPCFILE.SPC_RBDTE_3_1,''),
                   SPCFILE.SPC_RBDAYS_3_1,
                   SPCFILE.SPC_RBYRTYPE_3_1,
                   ISNULL(SPCFILE.SPC_RBDTE_3_2,''),
                   SPCFILE.SPC_RBDAYS_3_2,
                   SPCFILE.SPC_RBYRTYPE_3_2,
                   SPCFILE.SPC_RBMINRET_3,
                   SPCFILE.SPC_RBNOMON_3,
                   SPCFILE.SPC_RBDEDCHG_3,
                   SPCFILE.SPC_RBRECAST_3,
                   SPCFILE.SPC_RBEARLY_3,
                   SPCFILE.SPC_RBDEFER_3,
                   SPCFILE.SPC_RBPCT_3,
                   SPCFILE.SPC_RBREDUC_3,
                   SPCFILE.SPC_RBMIN_3,
                   SPCFILE.SPC_RBSPOPT1_3,
                   SPCFILE.SPC_RBSPOPT2_3,
                   SPCFILE.SPC_RBMANAGER_3,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_3,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_3,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_4,''),
                   ISNULL(SPCFILE.SPC_RBDTE_4_1,''),
                   SPCFILE.SPC_RBDAYS_4_1,
                   SPCFILE.SPC_RBYRTYPE_4_1,
                   ISNULL(SPCFILE.SPC_RBDTE_4_2,''),
                   SPCFILE.SPC_RBDAYS_4_2,
                   SPCFILE.SPC_RBYRTYPE_4_2,
                   SPCFILE.SPC_RBMINRET_4,
                   SPCFILE.SPC_RBNOMON_4,
                   SPCFILE.SPC_RBDEDCHG_4,
                   SPCFILE.SPC_RBRECAST_4,
                   SPCFILE.SPC_RBEARLY_4,
                   SPCFILE.SPC_RBDEFER_4,
                   SPCFILE.SPC_RBPCT_4,
                   SPCFILE.SPC_RBREDUC_4,
                   SPCFILE.SPC_RBMIN_4,
                   SPCFILE.SPC_RBSPOPT1_4,
                   SPCFILE.SPC_RBSPOPT2_4,
                   SPCFILE.SPC_RBMANAGER_4,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_4,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_4,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_5,''),
                   ISNULL(SPCFILE.SPC_RBDTE_5_1,''),
                   SPCFILE.SPC_RBDAYS_5_1,
                   SPCFILE.SPC_RBYRTYPE_5_1,
                   ISNULL(SPCFILE.SPC_RBDTE_5_2,''),
                   SPCFILE.SPC_RBDAYS_5_2,
                   SPCFILE.SPC_RBYRTYPE_5_2,
                   SPCFILE.SPC_RBMINRET_5,
                   SPCFILE.SPC_RBNOMON_5,
                   SPCFILE.SPC_RBDEDCHG_5,
                   SPCFILE.SPC_RBRECAST_5,
                   SPCFILE.SPC_RBEARLY_5,
                   SPCFILE.SPC_RBDEFER_5,
                   SPCFILE.SPC_RBPCT_5,
                   SPCFILE.SPC_RBREDUC_5,
                   SPCFILE.SPC_RBMIN_5,
                   SPCFILE.SPC_RBSPOPT1_5,
                   SPCFILE.SPC_RBSPOPT2_5,
                   SPCFILE.SPC_RBMANAGER_5,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_5,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_5,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_6,''),
                   ISNULL(SPCFILE.SPC_RBDTE_6_1,''),
                   SPCFILE.SPC_RBDAYS_6_1,
                   SPCFILE.SPC_RBYRTYPE_6_1,
                   ISNULL(SPCFILE.SPC_RBDTE_6_2,''),
                   SPCFILE.SPC_RBDAYS_6_2,
                   SPCFILE.SPC_RBYRTYPE_6_2,
                   SPCFILE.SPC_RBMINRET_6,
                   SPCFILE.SPC_RBNOMON_6,
                   SPCFILE.SPC_RBDEDCHG_6,
                   SPCFILE.SPC_RBRECAST_6,
                   SPCFILE.SPC_RBEARLY_6,
                   SPCFILE.SPC_RBDEFER_6,
                   SPCFILE.SPC_RBPCT_6,
                   SPCFILE.SPC_RBREDUC_6,
                   SPCFILE.SPC_RBMIN_6,
                   SPCFILE.SPC_RBSPOPT1_6,
                   SPCFILE.SPC_RBSPOPT2_6,
                   SPCFILE.SPC_RBMANAGER_6,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_6,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_6,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_7,''),
                   ISNULL(SPCFILE.SPC_RBDTE_7_1,''),
                   SPCFILE.SPC_RBDAYS_7_1,
                   SPCFILE.SPC_RBYRTYPE_7_1,
                   ISNULL(SPCFILE.SPC_RBDTE_7_2,''),
                   SPCFILE.SPC_RBDAYS_7_2,
                   SPCFILE.SPC_RBYRTYPE_7_2,
                   SPCFILE.SPC_RBMINRET_7,
                   SPCFILE.SPC_RBNOMON_7,
                   SPCFILE.SPC_RBDEDCHG_7,
                   SPCFILE.SPC_RBRECAST_7,
                   SPCFILE.SPC_RBEARLY_7,
                   SPCFILE.SPC_RBDEFER_7,
                   SPCFILE.SPC_RBPCT_7,
                   SPCFILE.SPC_RBREDUC_7,
                   SPCFILE.SPC_RBMIN_7,
                   SPCFILE.SPC_RBSPOPT1_7,
                   SPCFILE.SPC_RBSPOPT2_7,
                   SPCFILE.SPC_RBMANAGER_7,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_7,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_7,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_8,''),
                   ISNULL(SPCFILE.SPC_RBDTE_8_1,''),
                   SPCFILE.SPC_RBDAYS_8_1,
                   SPCFILE.SPC_RBYRTYPE_8_1,
                   ISNULL(SPCFILE.SPC_RBDTE_8_2,''),
                   SPCFILE.SPC_RBDAYS_8_2,
                   SPCFILE.SPC_RBYRTYPE_8_2,
                   SPCFILE.SPC_RBMINRET_8,
                   SPCFILE.SPC_RBNOMON_8,
                   SPCFILE.SPC_RBDEDCHG_8,
                   SPCFILE.SPC_RBRECAST_8,
                   SPCFILE.SPC_RBEARLY_8,
                   SPCFILE.SPC_RBDEFER_8,
                   SPCFILE.SPC_RBPCT_8,
                   SPCFILE.SPC_RBREDUC_8,
                   SPCFILE.SPC_RBMIN_8,
                   SPCFILE.SPC_RBSPOPT1_8,
                   SPCFILE.SPC_RBSPOPT2_8,
                   SPCFILE.SPC_RBMANAGER_8,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_8,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_8,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_9,''),
                   ISNULL(SPCFILE.SPC_RBDTE_9_1,''),
                   SPCFILE.SPC_RBDAYS_9_1,
                   SPCFILE.SPC_RBYRTYPE_9_1,
                   ISNULL(SPCFILE.SPC_RBDTE_9_2,''),
                   SPCFILE.SPC_RBDAYS_9_2,
                   SPCFILE.SPC_RBYRTYPE_9_2,
                   SPCFILE.SPC_RBMINRET_9,
                   SPCFILE.SPC_RBNOMON_9,
                   SPCFILE.SPC_RBDEDCHG_9,
                   SPCFILE.SPC_RBRECAST_9,
                   SPCFILE.SPC_RBEARLY_9,
                   SPCFILE.SPC_RBDEFER_9,
                   SPCFILE.SPC_RBPCT_9,
                   SPCFILE.SPC_RBREDUC_9,
                   SPCFILE.SPC_RBMIN_9,
                   SPCFILE.SPC_RBSPOPT1_9,
                   SPCFILE.SPC_RBSPOPT2_9,
                   SPCFILE.SPC_RBMANAGER_9,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_9,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_9,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_10,''),
                   ISNULL(SPCFILE.SPC_RBDTE_10_1,''),
                   SPCFILE.SPC_RBDAYS_10_1,
                   SPCFILE.SPC_RBYRTYPE_10_1,
                   ISNULL(SPCFILE.SPC_RBDTE_10_2,''),
                   SPCFILE.SPC_RBDAYS_10_2,
                   SPCFILE.SPC_RBYRTYPE_10_2,
                   SPCFILE.SPC_RBMINRET_10,
                   SPCFILE.SPC_RBNOMON_10,
                   SPCFILE.SPC_RBDEDCHG_10,
                   SPCFILE.SPC_RBRECAST_10,
                   SPCFILE.SPC_RBEARLY_10,
                   SPCFILE.SPC_RBDEFER_10,
                   SPCFILE.SPC_RBPCT_10,
                   SPCFILE.SPC_RBREDUC_10,
                   SPCFILE.SPC_RBMIN_10,
                   SPCFILE.SPC_RBSPOPT1_10,
                   SPCFILE.SPC_RBSPOPT2_10,
                   SPCFILE.SPC_RBMANAGER_10,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_10,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_10,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_11,''),
                   ISNULL(SPCFILE.SPC_RBDTE_11_1,''),
                   SPCFILE.SPC_RBDAYS_11_1,
                   SPCFILE.SPC_RBYRTYPE_11_1,
                   ISNULL(SPCFILE.SPC_RBDTE_11_2,''),
                   SPCFILE.SPC_RBDAYS_11_2,
                   SPCFILE.SPC_RBYRTYPE_11_2,
                   SPCFILE.SPC_RBMINRET_11,
                   SPCFILE.SPC_RBNOMON_11,
                   SPCFILE.SPC_RBDEDCHG_11,
                   SPCFILE.SPC_RBRECAST_11,
                   SPCFILE.SPC_RBEARLY_11,
                   SPCFILE.SPC_RBDEFER_11,
                   SPCFILE.SPC_RBPCT_11,
                   SPCFILE.SPC_RBREDUC_11,
                   SPCFILE.SPC_RBMIN_11,
                   SPCFILE.SPC_RBSPOPT1_11,
                   SPCFILE.SPC_RBSPOPT2_11,
                   SPCFILE.SPC_RBMANAGER_11,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_11,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_11,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_12,''),
                   ISNULL(SPCFILE.SPC_RBDTE_12_1,''),
                   SPCFILE.SPC_RBDAYS_12_1,
                   SPCFILE.SPC_RBYRTYPE_12_1,
                   ISNULL(SPCFILE.SPC_RBDTE_12_2,''),
                   SPCFILE.SPC_RBDAYS_12_2,
                   SPCFILE.SPC_RBYRTYPE_12_2,
                   SPCFILE.SPC_RBMINRET_12,
                   SPCFILE.SPC_RBNOMON_12,
                   SPCFILE.SPC_RBDEDCHG_12,
                   SPCFILE.SPC_RBRECAST_12,
                   SPCFILE.SPC_RBEARLY_12,
                   SPCFILE.SPC_RBDEFER_12,
                   SPCFILE.SPC_RBPCT_12,
                   SPCFILE.SPC_RBREDUC_12,
                   SPCFILE.SPC_RBMIN_12,
                   SPCFILE.SPC_RBSPOPT1_12,
                   SPCFILE.SPC_RBSPOPT2_12,
                   SPCFILE.SPC_RBMANAGER_12,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_12,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_12,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_13,''),
                   ISNULL(SPCFILE.SPC_RBDTE_13_1,''),
                   SPCFILE.SPC_RBDAYS_13_1,
                   SPCFILE.SPC_RBYRTYPE_13_1,
                   ISNULL(SPCFILE.SPC_RBDTE_13_2,''),
                   SPCFILE.SPC_RBDAYS_13_2,
                   SPCFILE.SPC_RBYRTYPE_13_2,
                   SPCFILE.SPC_RBMINRET_13,
                   SPCFILE.SPC_RBNOMON_13,
                   SPCFILE.SPC_RBDEDCHG_13,
                   SPCFILE.SPC_RBRECAST_13,
                   SPCFILE.SPC_RBEARLY_13,
                   SPCFILE.SPC_RBDEFER_13,
                   SPCFILE.SPC_RBPCT_13,
                   SPCFILE.SPC_RBREDUC_13,
                   SPCFILE.SPC_RBMIN_13,
                   SPCFILE.SPC_RBSPOPT1_13,
                   SPCFILE.SPC_RBSPOPT2_13,
                   SPCFILE.SPC_RBMANAGER_13,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_13,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_13,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_14,''),
                   ISNULL(SPCFILE.SPC_RBDTE_14_1,''),
                   SPCFILE.SPC_RBDAYS_14_1,
                   SPCFILE.SPC_RBYRTYPE_14_1,
                   ISNULL(SPCFILE.SPC_RBDTE_14_2,''),
                   SPCFILE.SPC_RBDAYS_14_2,
                   SPCFILE.SPC_RBYRTYPE_14_2,
                   SPCFILE.SPC_RBMINRET_14,
                   SPCFILE.SPC_RBNOMON_14,
                   SPCFILE.SPC_RBDEDCHG_14,
                   SPCFILE.SPC_RBRECAST_14,
                   SPCFILE.SPC_RBEARLY_14,
                   SPCFILE.SPC_RBDEFER_14,
                   SPCFILE.SPC_RBPCT_14,
                   SPCFILE.SPC_RBREDUC_14,
                   SPCFILE.SPC_RBMIN_14,
                   SPCFILE.SPC_RBSPOPT1_14,
                   SPCFILE.SPC_RBSPOPT2_14,
                   SPCFILE.SPC_RBMANAGER_14,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_14,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_14,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_15,''),
                   ISNULL(SPCFILE.SPC_RBDTE_15_1,''),
                   SPCFILE.SPC_RBDAYS_15_1,
                   SPCFILE.SPC_RBYRTYPE_15_1,
                   ISNULL(SPCFILE.SPC_RBDTE_15_2,''),
                   SPCFILE.SPC_RBDAYS_15_2,
                   SPCFILE.SPC_RBYRTYPE_15_2,
                   SPCFILE.SPC_RBMINRET_15,
                   SPCFILE.SPC_RBNOMON_15,
                   SPCFILE.SPC_RBDEDCHG_15,
                   SPCFILE.SPC_RBRECAST_15,
                   SPCFILE.SPC_RBEARLY_15,
                   SPCFILE.SPC_RBDEFER_15,
                   SPCFILE.SPC_RBPCT_15,
                   SPCFILE.SPC_RBREDUC_15,
                   SPCFILE.SPC_RBMIN_15,
                   SPCFILE.SPC_RBSPOPT1_15,
                   SPCFILE.SPC_RBSPOPT2_15,
                   SPCFILE.SPC_RBMANAGER_15,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_15,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_15,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_16,''),
                   ISNULL(SPCFILE.SPC_RBDTE_16_1,''),
                   SPCFILE.SPC_RBDAYS_16_1,
                   SPCFILE.SPC_RBYRTYPE_16_1,
                   ISNULL(SPCFILE.SPC_RBDTE_16_2,''),
                   SPCFILE.SPC_RBDAYS_16_2,
                   SPCFILE.SPC_RBYRTYPE_16_2,
                   SPCFILE.SPC_RBMINRET_16,
                   SPCFILE.SPC_RBNOMON_16,
                   SPCFILE.SPC_RBDEDCHG_16,
                   SPCFILE.SPC_RBRECAST_16,
                   SPCFILE.SPC_RBEARLY_16,
                   SPCFILE.SPC_RBDEFER_16,
                   SPCFILE.SPC_RBPCT_16,
                   SPCFILE.SPC_RBREDUC_16,
                   SPCFILE.SPC_RBMIN_16,
                   SPCFILE.SPC_RBSPOPT1_16,
                   SPCFILE.SPC_RBSPOPT2_16,
                   SPCFILE.SPC_RBMANAGER_16,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_16,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_16,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_17,''),
                   ISNULL(SPCFILE.SPC_RBDTE_17_1,''),
                   SPCFILE.SPC_RBDAYS_17_1,
                   SPCFILE.SPC_RBYRTYPE_17_1,
                   ISNULL(SPCFILE.SPC_RBDTE_17_2,''),
                   SPCFILE.SPC_RBDAYS_17_2,
                   SPCFILE.SPC_RBYRTYPE_17_2,
                   SPCFILE.SPC_RBMINRET_17,
                   SPCFILE.SPC_RBNOMON_17,
                   SPCFILE.SPC_RBDEDCHG_17,
                   SPCFILE.SPC_RBRECAST_17,
                   SPCFILE.SPC_RBEARLY_17,
                   SPCFILE.SPC_RBDEFER_17,
                   SPCFILE.SPC_RBPCT_17,
                   SPCFILE.SPC_RBREDUC_17,
                   SPCFILE.SPC_RBMIN_17,
                   SPCFILE.SPC_RBSPOPT1_17,
                   SPCFILE.SPC_RBSPOPT2_17,
                   SPCFILE.SPC_RBMANAGER_17,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_17,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_17,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_18,''),
                   ISNULL(SPCFILE.SPC_RBDTE_18_1,''),
                   SPCFILE.SPC_RBDAYS_18_1,
                   SPCFILE.SPC_RBYRTYPE_18_1,
                   ISNULL(SPCFILE.SPC_RBDTE_18_2,''),
                   SPCFILE.SPC_RBDAYS_18_2,
                   SPCFILE.SPC_RBYRTYPE_18_2,
                   SPCFILE.SPC_RBMINRET_18,
                   SPCFILE.SPC_RBNOMON_18,
                   SPCFILE.SPC_RBDEDCHG_18,
                   SPCFILE.SPC_RBRECAST_18,
                   SPCFILE.SPC_RBEARLY_18,
                   SPCFILE.SPC_RBDEFER_18,
                   SPCFILE.SPC_RBPCT_18,
                   SPCFILE.SPC_RBREDUC_18,
                   SPCFILE.SPC_RBMIN_18,
                   SPCFILE.SPC_RBSPOPT1_18,
                   SPCFILE.SPC_RBSPOPT2_18,
                   SPCFILE.SPC_RBMANAGER_18,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_18,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_18,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_19,''),
                   ISNULL(SPCFILE.SPC_RBDTE_19_1,''),
                   SPCFILE.SPC_RBDAYS_19_1,
                   SPCFILE.SPC_RBYRTYPE_19_1,
                   ISNULL(SPCFILE.SPC_RBDTE_19_2,''),
                   SPCFILE.SPC_RBDAYS_19_2,
                   SPCFILE.SPC_RBYRTYPE_19_2,
                   SPCFILE.SPC_RBMINRET_19,
                   SPCFILE.SPC_RBNOMON_19,
                   SPCFILE.SPC_RBDEDCHG_19,
                   SPCFILE.SPC_RBRECAST_19,
                   SPCFILE.SPC_RBEARLY_19,
                   SPCFILE.SPC_RBDEFER_19,
                   SPCFILE.SPC_RBPCT_19,
                   SPCFILE.SPC_RBREDUC_19,
                   SPCFILE.SPC_RBMIN_19,
                   SPCFILE.SPC_RBSPOPT1_19,
                   SPCFILE.SPC_RBSPOPT2_19,
                   SPCFILE.SPC_RBMANAGER_19,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_19,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_19,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_20,''),
                   ISNULL(SPCFILE.SPC_RBDTE_20_1,''),
                   SPCFILE.SPC_RBDAYS_20_1,
                   SPCFILE.SPC_RBYRTYPE_20_1,
                   ISNULL(SPCFILE.SPC_RBDTE_20_2,''),
                   SPCFILE.SPC_RBDAYS_20_2,
                   SPCFILE.SPC_RBYRTYPE_20_2,
                   SPCFILE.SPC_RBMINRET_20,
                   SPCFILE.SPC_RBNOMON_20,
                   SPCFILE.SPC_RBDEDCHG_20,
                   SPCFILE.SPC_RBRECAST_20,
                   SPCFILE.SPC_RBEARLY_20,
                   SPCFILE.SPC_RBDEFER_20,
                   SPCFILE.SPC_RBPCT_20,
                   SPCFILE.SPC_RBREDUC_20,
                   SPCFILE.SPC_RBMIN_20,
                   SPCFILE.SPC_RBSPOPT1_20,
                   SPCFILE.SPC_RBSPOPT2_20,
                   SPCFILE.SPC_RBMANAGER_20,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_20,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_20,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_21,''),
                   ISNULL(SPCFILE.SPC_RBDTE_21_1,''),
                   SPCFILE.SPC_RBDAYS_21_1,
                   SPCFILE.SPC_RBYRTYPE_21_1,
                   ISNULL(SPCFILE.SPC_RBDTE_21_2,''),
                   SPCFILE.SPC_RBDAYS_21_2,
                   SPCFILE.SPC_RBYRTYPE_21_2,
                   SPCFILE.SPC_RBMINRET_21,
                   SPCFILE.SPC_RBNOMON_21,
                   SPCFILE.SPC_RBDEDCHG_21,
                   SPCFILE.SPC_RBRECAST_21,
                   SPCFILE.SPC_RBEARLY_21,
                   SPCFILE.SPC_RBDEFER_21,
                   SPCFILE.SPC_RBPCT_21,
                   SPCFILE.SPC_RBREDUC_21,
                   SPCFILE.SPC_RBMIN_21,
                   SPCFILE.SPC_RBSPOPT1_21,
                   SPCFILE.SPC_RBSPOPT2_21,
                   SPCFILE.SPC_RBMANAGER_21,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_21,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_21,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA_22,''),
                   ISNULL(SPCFILE.SPC_RBDTE_22_1,''),
                   SPCFILE.SPC_RBDAYS_22_1,
                   SPCFILE.SPC_RBYRTYPE_22_1,
                   ISNULL(SPCFILE.SPC_RBDTE_22_2,''),
                   SPCFILE.SPC_RBDAYS_22_2,
                   SPCFILE.SPC_RBYRTYPE_22_2,
                   SPCFILE.SPC_RBMINRET_22,
                   SPCFILE.SPC_RBNOMON_22,
                   SPCFILE.SPC_RBDEDCHG_22,
                   SPCFILE.SPC_RBRECAST_22,
                   SPCFILE.SPC_RBEARLY_22,
                   SPCFILE.SPC_RBDEFER_22,
                   SPCFILE.SPC_RBPCT_22,
                   SPCFILE.SPC_RBREDUC_22,
                   SPCFILE.SPC_RBMIN_22,
                   SPCFILE.SPC_RBSPOPT1_22,
                   SPCFILE.SPC_RBSPOPT2_22,
                   SPCFILE.SPC_RBMANAGER_22,
                   ISNULL(SPCFILE.SPC_RBUNITPER_CD_22,''),
                   ISNULL(SPCFILE.SPC_RBFRMLA2_22,''),
                   ISNULL(SPCFILE.SPC_RBCOMCD,''),
                   ISNULL(SPCFILE.SPC_ADDON_DISFRMLA,''),
                   ISNULL(SPCFILE.SPC_ADDON_WHOLE_FG,''),
                   ISNULL(SPCFILE.SPC_ADDON_ORG_MATURITY,''),
                   ISNULL(SPCFILE.SPC_CONSOLIDATE_RT_FG,''),
                   SPCFILE.SPC_1STPY_ADDON_DAYS,
                   SPCFILE.SPC_1STPY_ADDON_YRTYPE,
                   ISNULL(SPCFILE.SPC_ADDON_RATE_FG,''),
                   SPCFILE.SPC_ADDON_RATE,
                   ISNULL(SPCFILE.SPC_FEEFRMLA_1,''),
                   ISNULL(SPCFILE.SPC_FEECD_1,''),
                   ISNULL(SPCFILE.SPC_FEEID_1,''),
                   ISNULL(SPCFILE.SPC_FEEFRMLA_2,''),
                   ISNULL(SPCFILE.SPC_FEECD_2,''),
                   ISNULL(SPCFILE.SPC_FEEID_2,''),
                   ISNULL(SPCFILE.SPC_ROUND_PAY_FG,''),
                   ISNULL(SPCFILE.SPC_IRREGULAR_PAY_FG,''),
                   ISNULL(SPCFILE.SPC_DLRVCHGS_RB_CD_1,''),
                   ISNULL(SPCFILE.SPC_DLRVCHGS_RB_CD_2,''),
                   ISNULL(SPCFILE.SPC_DLRVCHGS_RB_CD_3,''),
                   ISNULL(SPCFILE.SPC_PARVHELD_RB_CD,''),
                   ISNULL(SPCFILE.SPC_PARVPAID_RB_CD,''),
                   SPCFILE.SPC_CONTR_CREDIT,
                   ISNULL(SPCFILE.SPC_CONTR_CREDIT_CD,''),
                   SPCFILE.SPC_CONTR_CREDIT_MIN_DEL_PER,
                   ISNULL(SPCFILE.SPC_OPT_CAL_CHGABLE,''),
                   SPCFILE.SPC_PBDEL_DAYS,
                   SPCFILE.SPC_PBINCR_PERCENT,
                   ISNULL(SPCFILE.SPC_CPOT30_CD,''),
                   ISNULL(SPCFILE.SPC_CPOTCHGOFF_CD,''),
                   ISNULL(SPCFILE.SPC_RDPOT30_CD,''),
                   ISNULL(SPCFILE.SPC_RDPOTCHGOFF_CD,''),
                   SPCFILE.SPC_MAX_ALLOW_DELINQ,
                   ISNULL(SPCFILE.SPC_RESCIND_BUS_DAYS,''),
                   ISNULL(SPCFILE.SPC_RESCIND_SATURDAY,''),
                   SPCFILE.SPC_MIN_CREDIT_SCORE,
                   ISNULL(SPCFILE.SPC_DUAL_IN_BRANCH,''),
                   ISNULL(SPCFILE.SPC_DUAL_IN_STATE,''),
                   ISNULL(SPCFILE.SPC_PACESETTER_FG,''),
                   SPCFILE.SPC_WAGE_ASSIGN_DAYS,
                   ISNULL(SPCFILE.SPC_CAL_PAYMENT_ROUND_FG,''),
                   ISNULL(SPCFILE.SPC_CAN_LOANS_FG,''),
                   ISNULL(SPCFILE.SPC_ALLOW_DELINQ_POLCD,''),
                   SPCFILE.SPC_YTD_MAX_ALLOW_DELINQ,
                   ISNULL(SPCFILE.SPC_LNCOST_FRMLA,''),
                   SPCFILE.SPC_LNCOST_AMT,
                   SPCFILE.SPC_DLDISC_RVPRIN1_PCNT,
                   SPCFILE.SPC_RENEWABLE_PAYS,
                   SPCFILE.SPC_RENEWABLE_DAYS,
                   ISNULL(SPCFILE.SPC_ALLOW_LN_BACK_DATE,''),
                   SPCFILE.SPC_DLDISC_RVPRIN1_AF_PCNT,
                   ISNULL(SPCFILE.SPC_CAL_MAX_AT_ESTIMATE,''),
                   ISNULL(SPCFILE.SPC_INSAH_RETRO,''),
                   ISNULL(SPCFILE.SPC_INSAH_DAYS_WAIT,''),
                   ISNULL(SPCFILE.SPC_ADDON_EXCEPT_FG,''),
                   ISNULL(SPCFILE.SPC_REPO_TRCD_1,''),
                   SPCFILE.SPC_REPO_FMNO_1_1,
                   SPCFILE.SPC_REPO_FMNO_1_2,
                   SPCFILE.SPC_REPO_FMNO_1_3,
                   SPCFILE.SPC_REPO_FMNO_1_4,
                   ISNULL(SPCFILE.SPC_REPO_TRCD_2,''),
                   SPCFILE.SPC_REPO_FMNO_2_1,
                   SPCFILE.SPC_REPO_FMNO_2_2,
                   SPCFILE.SPC_REPO_FMNO_2_3,
                   SPCFILE.SPC_REPO_FMNO_2_4,
                   ISNULL(SPCFILE.SPC_REPO_TRCD_3,''),
                   SPCFILE.SPC_REPO_FMNO_3_1,
                   SPCFILE.SPC_REPO_FMNO_3_2,
                   SPCFILE.SPC_REPO_FMNO_3_3,
                   SPCFILE.SPC_REPO_FMNO_3_4,
                   ISNULL(SPCFILE.SPC_CANCEL_ADDON_FG,''),
                   SPCFILE.SPC_DEFAULT_O2_INS_COMP,
                   ISNULL(SPCFILE.SPC_LC_ON_JUDGEMENTS,''),
                   SPCFILE.SPC_DELQ_IB_AGE,
                   SPCFILE.SPC_DELQ_IB_MAX_DAYS,
                   ISNULL(SPCFILE.SPC_INSURANCE_WRITTEN,''),
                   ISNULL(SPCFILE.SPC_INTERIM_COUPON,''),
                   ISNULL(SPCFILE.SPC_AUTO_ASSESS_LCHG,''),
                   SPCFILE.SPC_MAX_CASH_PROCEEDS,
                   ISNULL(SPCFILE.SPC_ALLOW_ZERO_PROC,''),
                   SPCFILE.SPC_BANKRULE_RATE,
                   ISNULL(SPCFILE.SPC_AUTO_SEND_TRCD_1,''),
                   SPCFILE.SPC_AUTO_SEND_FMNO_1_1,
                   SPCFILE.SPC_AUTO_SEND_FMNO_1_2,
                   SPCFILE.SPC_AUTO_SEND_FMNO_1_3,
                   SPCFILE.SPC_AUTO_SEND_FMNO_1_4,
                   ISNULL(SPCFILE.SPC_AUTO_SEND_TRCD_2,''),
                   SPCFILE.SPC_AUTO_SEND_FMNO_2_1,
                   SPCFILE.SPC_AUTO_SEND_FMNO_2_2,
                   SPCFILE.SPC_AUTO_SEND_FMNO_2_3,
                   SPCFILE.SPC_AUTO_SEND_FMNO_2_4,
                   SPCFILE.SPC_DLDISC_CONV_BF_PCNT,
                   ISNULL(SPCFILE.SPC_UNITPER_CD,''),
                   ISNULL(SPCFILE.SPC_RENEWAL_EDIT,''),
                   ISNULL(SPCFILE.SPC_ROUND_MFEE,''),
                   ISNULL(SPCFILE.SPC_ADV_TO_1ST_NO_CORR,''),
                   ISNULL(SPCFILE.SPC_LC_INT_ON_REPO_NON_PL,''),
                   SPCFILE.SPC_CONTRACTUAL_SET_NONACCRUAL,
                   SPCFILE.SPC_CONTRACTUAL_RESET_ACCRUAL,
                   SPCFILE.SPC_MONTHS_PAY_NAPP_COUNTER,
                   SPCFILE.SPC_SHORT_PAY_THRESHOLD,
                   SPCFILE.SPC_CASH_AVAIL_PERCENT,
                   ISNULL(SPCFILE.SPC_O1_JOINT_FG,''),
                   SPCFILE.SPC_NET_BAL_REQ,
                   SPCFILE.SPC_AMT_PROCEEDS_REQ,
                   SPCFILE.SPC_ALT_PREPAY_MONTHS,
                   SPCFILE.SPC_PERCENT_REGPAY_AVAIL,
                   SPCFILE.SPC_ALT_DEFFRMLA,
                   SPCFILE.SPC_ALT_DEFMIN,
                   SPCFILE.SPC_ALT_DEFMAX,
                   ISNULL(SPCFILE.SPC_NON_LOAN_FLAG,''),
                   ISNULL(SPCFILE.SPC_SKIP_TRW,'')
            INTO :QSPC-REC
            FROM DBO.SPCFILE
            WHERE SPCFILE.SPC_ORGST = :QSPC-ORGST
              AND SPCFILE.SPC_SPRCLASS = :QSPC-SPRCLASS
              AND SPCFILE.SPC_SUBCLASS = :QSPC-SUBCLASS
              AND SPCFILE.SPC_LAWCODE = :QSPC-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-SPC1-FILE.

           IF ( IO-FG = 0 )
              PERFORM GET-SPC-FIELDS.

      *-----------------------------------------------------------------
       WRITE-SPC1-FILE.

           PERFORM WRITE-IT.
           MOVE SPC-PATH-SQL TO E-FILE.
           MOVE SPC1-KEY TO E-KEYX.
           PERFORM SET-SPC-FIELDS.

           EXEC SQL
            INSERT INTO DBO.SPCFILE
             (SPCFILE.SPC_ORGST,
              SPCFILE.SPC_SPRCLASS,
              SPCFILE.SPC_SUBCLASS,
              SPCFILE.SPC_LAWCODE,
              SPCFILE.SPC_INSEARN_ORDER_1,
              SPCFILE.SPC_INSEARN_ORDER_2,
              SPCFILE.SPC_INSEARN_ORDER_3,
              SPCFILE.SPC_INSEARN_ORDER_4,
              SPCFILE.SPC_INSEARN_ORDER_5,
              SPCFILE.SPC_INSEARN_ORDER_6,
              SPCFILE.SPC_INSEARN_ORDER_7,
              SPCFILE.SPC_INSEARN_ORDER_8,
              SPCFILE.SPC_INSEARN_ORDER_9,
              SPCFILE.SPC_INSEARN_ORDER_10,
              SPCFILE.SPC_INSEARN_ORDER_11,
              SPCFILE.SPC_INSEARN_ORDER_12,
              SPCFILE.SPC_INSAH_JOINT_FG,
              SPCFILE.SPC_INS_O1_EDIT,
              SPCFILE.SPC_INS_O2_EDIT,
              SPCFILE.SPC_RBFRMLA_1,
              SPCFILE.SPC_RBDTE_1_1,
              SPCFILE.SPC_RBDAYS_1_1,
              SPCFILE.SPC_RBYRTYPE_1_1,
              SPCFILE.SPC_RBDTE_1_2,
              SPCFILE.SPC_RBDAYS_1_2,
              SPCFILE.SPC_RBYRTYPE_1_2,
              SPCFILE.SPC_RBMINRET_1,
              SPCFILE.SPC_RBNOMON_1,
              SPCFILE.SPC_RBDEDCHG_1,
              SPCFILE.SPC_RBRECAST_1,
              SPCFILE.SPC_RBEARLY_1,
              SPCFILE.SPC_RBDEFER_1,
              SPCFILE.SPC_RBPCT_1,
              SPCFILE.SPC_RBREDUC_1,
              SPCFILE.SPC_RBMIN_1,
              SPCFILE.SPC_RBSPOPT1_1,
              SPCFILE.SPC_RBSPOPT2_1,
              SPCFILE.SPC_RBMANAGER_1,
              SPCFILE.SPC_RBUNITPER_CD_1,
              SPCFILE.SPC_RBFRMLA2_1,
              SPCFILE.SPC_RBFRMLA_2,
              SPCFILE.SPC_RBDTE_2_1,
              SPCFILE.SPC_RBDAYS_2_1,
              SPCFILE.SPC_RBYRTYPE_2_1,
              SPCFILE.SPC_RBDTE_2_2,
              SPCFILE.SPC_RBDAYS_2_2,
              SPCFILE.SPC_RBYRTYPE_2_2,
              SPCFILE.SPC_RBMINRET_2,
              SPCFILE.SPC_RBNOMON_2,
              SPCFILE.SPC_RBDEDCHG_2,
              SPCFILE.SPC_RBRECAST_2,
              SPCFILE.SPC_RBEARLY_2,
              SPCFILE.SPC_RBDEFER_2,
              SPCFILE.SPC_RBPCT_2,
              SPCFILE.SPC_RBREDUC_2,
              SPCFILE.SPC_RBMIN_2,
              SPCFILE.SPC_RBSPOPT1_2,
              SPCFILE.SPC_RBSPOPT2_2,
              SPCFILE.SPC_RBMANAGER_2,
              SPCFILE.SPC_RBUNITPER_CD_2,
              SPCFILE.SPC_RBFRMLA2_2,
              SPCFILE.SPC_RBFRMLA_3,
              SPCFILE.SPC_RBDTE_3_1,
              SPCFILE.SPC_RBDAYS_3_1,
              SPCFILE.SPC_RBYRTYPE_3_1,
              SPCFILE.SPC_RBDTE_3_2,
              SPCFILE.SPC_RBDAYS_3_2,
              SPCFILE.SPC_RBYRTYPE_3_2,
              SPCFILE.SPC_RBMINRET_3,
              SPCFILE.SPC_RBNOMON_3,
              SPCFILE.SPC_RBDEDCHG_3,
              SPCFILE.SPC_RBRECAST_3,
              SPCFILE.SPC_RBEARLY_3,
              SPCFILE.SPC_RBDEFER_3,
              SPCFILE.SPC_RBPCT_3,
              SPCFILE.SPC_RBREDUC_3,
              SPCFILE.SPC_RBMIN_3,
              SPCFILE.SPC_RBSPOPT1_3,
              SPCFILE.SPC_RBSPOPT2_3,
              SPCFILE.SPC_RBMANAGER_3,
              SPCFILE.SPC_RBUNITPER_CD_3,
              SPCFILE.SPC_RBFRMLA2_3,
              SPCFILE.SPC_RBFRMLA_4,
              SPCFILE.SPC_RBDTE_4_1,
              SPCFILE.SPC_RBDAYS_4_1,
              SPCFILE.SPC_RBYRTYPE_4_1,
              SPCFILE.SPC_RBDTE_4_2,
              SPCFILE.SPC_RBDAYS_4_2,
              SPCFILE.SPC_RBYRTYPE_4_2,
              SPCFILE.SPC_RBMINRET_4,
              SPCFILE.SPC_RBNOMON_4,
              SPCFILE.SPC_RBDEDCHG_4,
              SPCFILE.SPC_RBRECAST_4,
              SPCFILE.SPC_RBEARLY_4,
              SPCFILE.SPC_RBDEFER_4,
              SPCFILE.SPC_RBPCT_4,
              SPCFILE.SPC_RBREDUC_4,
              SPCFILE.SPC_RBMIN_4,
              SPCFILE.SPC_RBSPOPT1_4,
              SPCFILE.SPC_RBSPOPT2_4,
              SPCFILE.SPC_RBMANAGER_4,
              SPCFILE.SPC_RBUNITPER_CD_4,
              SPCFILE.SPC_RBFRMLA2_4,
              SPCFILE.SPC_RBFRMLA_5,
              SPCFILE.SPC_RBDTE_5_1,
              SPCFILE.SPC_RBDAYS_5_1,
              SPCFILE.SPC_RBYRTYPE_5_1,
              SPCFILE.SPC_RBDTE_5_2,
              SPCFILE.SPC_RBDAYS_5_2,
              SPCFILE.SPC_RBYRTYPE_5_2,
              SPCFILE.SPC_RBMINRET_5,
              SPCFILE.SPC_RBNOMON_5,
              SPCFILE.SPC_RBDEDCHG_5,
              SPCFILE.SPC_RBRECAST_5,
              SPCFILE.SPC_RBEARLY_5,
              SPCFILE.SPC_RBDEFER_5,
              SPCFILE.SPC_RBPCT_5,
              SPCFILE.SPC_RBREDUC_5,
              SPCFILE.SPC_RBMIN_5,
              SPCFILE.SPC_RBSPOPT1_5,
              SPCFILE.SPC_RBSPOPT2_5,
              SPCFILE.SPC_RBMANAGER_5,
              SPCFILE.SPC_RBUNITPER_CD_5,
              SPCFILE.SPC_RBFRMLA2_5,
              SPCFILE.SPC_RBFRMLA_6,
              SPCFILE.SPC_RBDTE_6_1,
              SPCFILE.SPC_RBDAYS_6_1,
              SPCFILE.SPC_RBYRTYPE_6_1,
              SPCFILE.SPC_RBDTE_6_2,
              SPCFILE.SPC_RBDAYS_6_2,
              SPCFILE.SPC_RBYRTYPE_6_2,
              SPCFILE.SPC_RBMINRET_6,
              SPCFILE.SPC_RBNOMON_6,
              SPCFILE.SPC_RBDEDCHG_6,
              SPCFILE.SPC_RBRECAST_6,
              SPCFILE.SPC_RBEARLY_6,
              SPCFILE.SPC_RBDEFER_6,
              SPCFILE.SPC_RBPCT_6,
              SPCFILE.SPC_RBREDUC_6,
              SPCFILE.SPC_RBMIN_6,
              SPCFILE.SPC_RBSPOPT1_6,
              SPCFILE.SPC_RBSPOPT2_6,
              SPCFILE.SPC_RBMANAGER_6,
              SPCFILE.SPC_RBUNITPER_CD_6,
              SPCFILE.SPC_RBFRMLA2_6,
              SPCFILE.SPC_RBFRMLA_7,
              SPCFILE.SPC_RBDTE_7_1,
              SPCFILE.SPC_RBDAYS_7_1,
              SPCFILE.SPC_RBYRTYPE_7_1,
              SPCFILE.SPC_RBDTE_7_2,
              SPCFILE.SPC_RBDAYS_7_2,
              SPCFILE.SPC_RBYRTYPE_7_2,
              SPCFILE.SPC_RBMINRET_7,
              SPCFILE.SPC_RBNOMON_7,
              SPCFILE.SPC_RBDEDCHG_7,
              SPCFILE.SPC_RBRECAST_7,
              SPCFILE.SPC_RBEARLY_7,
              SPCFILE.SPC_RBDEFER_7,
              SPCFILE.SPC_RBPCT_7,
              SPCFILE.SPC_RBREDUC_7,
              SPCFILE.SPC_RBMIN_7,
              SPCFILE.SPC_RBSPOPT1_7,
              SPCFILE.SPC_RBSPOPT2_7,
              SPCFILE.SPC_RBMANAGER_7,
              SPCFILE.SPC_RBUNITPER_CD_7,
              SPCFILE.SPC_RBFRMLA2_7,
              SPCFILE.SPC_RBFRMLA_8,
              SPCFILE.SPC_RBDTE_8_1,
              SPCFILE.SPC_RBDAYS_8_1,
              SPCFILE.SPC_RBYRTYPE_8_1,
              SPCFILE.SPC_RBDTE_8_2,
              SPCFILE.SPC_RBDAYS_8_2,
              SPCFILE.SPC_RBYRTYPE_8_2,
              SPCFILE.SPC_RBMINRET_8,
              SPCFILE.SPC_RBNOMON_8,
              SPCFILE.SPC_RBDEDCHG_8,
              SPCFILE.SPC_RBRECAST_8,
              SPCFILE.SPC_RBEARLY_8,
              SPCFILE.SPC_RBDEFER_8,
              SPCFILE.SPC_RBPCT_8,
              SPCFILE.SPC_RBREDUC_8,
              SPCFILE.SPC_RBMIN_8,
              SPCFILE.SPC_RBSPOPT1_8,
              SPCFILE.SPC_RBSPOPT2_8,
              SPCFILE.SPC_RBMANAGER_8,
              SPCFILE.SPC_RBUNITPER_CD_8,
              SPCFILE.SPC_RBFRMLA2_8,
              SPCFILE.SPC_RBFRMLA_9,
              SPCFILE.SPC_RBDTE_9_1,
              SPCFILE.SPC_RBDAYS_9_1,
              SPCFILE.SPC_RBYRTYPE_9_1,
              SPCFILE.SPC_RBDTE_9_2,
              SPCFILE.SPC_RBDAYS_9_2,
              SPCFILE.SPC_RBYRTYPE_9_2,
              SPCFILE.SPC_RBMINRET_9,
              SPCFILE.SPC_RBNOMON_9,
              SPCFILE.SPC_RBDEDCHG_9,
              SPCFILE.SPC_RBRECAST_9,
              SPCFILE.SPC_RBEARLY_9,
              SPCFILE.SPC_RBDEFER_9,
              SPCFILE.SPC_RBPCT_9,
              SPCFILE.SPC_RBREDUC_9,
              SPCFILE.SPC_RBMIN_9,
              SPCFILE.SPC_RBSPOPT1_9,
              SPCFILE.SPC_RBSPOPT2_9,
              SPCFILE.SPC_RBMANAGER_9,
              SPCFILE.SPC_RBUNITPER_CD_9,
              SPCFILE.SPC_RBFRMLA2_9,
              SPCFILE.SPC_RBFRMLA_10,
              SPCFILE.SPC_RBDTE_10_1,
              SPCFILE.SPC_RBDAYS_10_1,
              SPCFILE.SPC_RBYRTYPE_10_1,
              SPCFILE.SPC_RBDTE_10_2,
              SPCFILE.SPC_RBDAYS_10_2,
              SPCFILE.SPC_RBYRTYPE_10_2,
              SPCFILE.SPC_RBMINRET_10,
              SPCFILE.SPC_RBNOMON_10,
              SPCFILE.SPC_RBDEDCHG_10,
              SPCFILE.SPC_RBRECAST_10,
              SPCFILE.SPC_RBEARLY_10,
              SPCFILE.SPC_RBDEFER_10,
              SPCFILE.SPC_RBPCT_10,
              SPCFILE.SPC_RBREDUC_10,
              SPCFILE.SPC_RBMIN_10,
              SPCFILE.SPC_RBSPOPT1_10,
              SPCFILE.SPC_RBSPOPT2_10,
              SPCFILE.SPC_RBMANAGER_10,
              SPCFILE.SPC_RBUNITPER_CD_10,
              SPCFILE.SPC_RBFRMLA2_10,
              SPCFILE.SPC_RBFRMLA_11,
              SPCFILE.SPC_RBDTE_11_1,
              SPCFILE.SPC_RBDAYS_11_1,
              SPCFILE.SPC_RBYRTYPE_11_1,
              SPCFILE.SPC_RBDTE_11_2,
              SPCFILE.SPC_RBDAYS_11_2,
              SPCFILE.SPC_RBYRTYPE_11_2,
              SPCFILE.SPC_RBMINRET_11,
              SPCFILE.SPC_RBNOMON_11,
              SPCFILE.SPC_RBDEDCHG_11,
              SPCFILE.SPC_RBRECAST_11,
              SPCFILE.SPC_RBEARLY_11,
              SPCFILE.SPC_RBDEFER_11,
              SPCFILE.SPC_RBPCT_11,
              SPCFILE.SPC_RBREDUC_11,
              SPCFILE.SPC_RBMIN_11,
              SPCFILE.SPC_RBSPOPT1_11,
              SPCFILE.SPC_RBSPOPT2_11,
              SPCFILE.SPC_RBMANAGER_11,
              SPCFILE.SPC_RBUNITPER_CD_11,
              SPCFILE.SPC_RBFRMLA2_11,
              SPCFILE.SPC_RBFRMLA_12,
              SPCFILE.SPC_RBDTE_12_1,
              SPCFILE.SPC_RBDAYS_12_1,
              SPCFILE.SPC_RBYRTYPE_12_1,
              SPCFILE.SPC_RBDTE_12_2,
              SPCFILE.SPC_RBDAYS_12_2,
              SPCFILE.SPC_RBYRTYPE_12_2,
              SPCFILE.SPC_RBMINRET_12,
              SPCFILE.SPC_RBNOMON_12,
              SPCFILE.SPC_RBDEDCHG_12,
              SPCFILE.SPC_RBRECAST_12,
              SPCFILE.SPC_RBEARLY_12,
              SPCFILE.SPC_RBDEFER_12,
              SPCFILE.SPC_RBPCT_12,
              SPCFILE.SPC_RBREDUC_12,
              SPCFILE.SPC_RBMIN_12,
              SPCFILE.SPC_RBSPOPT1_12,
              SPCFILE.SPC_RBSPOPT2_12,
              SPCFILE.SPC_RBMANAGER_12,
              SPCFILE.SPC_RBUNITPER_CD_12,
              SPCFILE.SPC_RBFRMLA2_12,
              SPCFILE.SPC_RBFRMLA_13,
              SPCFILE.SPC_RBDTE_13_1,
              SPCFILE.SPC_RBDAYS_13_1,
              SPCFILE.SPC_RBYRTYPE_13_1,
              SPCFILE.SPC_RBDTE_13_2,
              SPCFILE.SPC_RBDAYS_13_2,
              SPCFILE.SPC_RBYRTYPE_13_2,
              SPCFILE.SPC_RBMINRET_13,
              SPCFILE.SPC_RBNOMON_13,
              SPCFILE.SPC_RBDEDCHG_13,
              SPCFILE.SPC_RBRECAST_13,
              SPCFILE.SPC_RBEARLY_13,
              SPCFILE.SPC_RBDEFER_13,
              SPCFILE.SPC_RBPCT_13,
              SPCFILE.SPC_RBREDUC_13,
              SPCFILE.SPC_RBMIN_13,
              SPCFILE.SPC_RBSPOPT1_13,
              SPCFILE.SPC_RBSPOPT2_13,
              SPCFILE.SPC_RBMANAGER_13,
              SPCFILE.SPC_RBUNITPER_CD_13,
              SPCFILE.SPC_RBFRMLA2_13,
              SPCFILE.SPC_RBFRMLA_14,
              SPCFILE.SPC_RBDTE_14_1,
              SPCFILE.SPC_RBDAYS_14_1,
              SPCFILE.SPC_RBYRTYPE_14_1,
              SPCFILE.SPC_RBDTE_14_2,
              SPCFILE.SPC_RBDAYS_14_2,
              SPCFILE.SPC_RBYRTYPE_14_2,
              SPCFILE.SPC_RBMINRET_14,
              SPCFILE.SPC_RBNOMON_14,
              SPCFILE.SPC_RBDEDCHG_14,
              SPCFILE.SPC_RBRECAST_14,
              SPCFILE.SPC_RBEARLY_14,
              SPCFILE.SPC_RBDEFER_14,
              SPCFILE.SPC_RBPCT_14,
              SPCFILE.SPC_RBREDUC_14,
              SPCFILE.SPC_RBMIN_14,
              SPCFILE.SPC_RBSPOPT1_14,
              SPCFILE.SPC_RBSPOPT2_14,
              SPCFILE.SPC_RBMANAGER_14,
              SPCFILE.SPC_RBUNITPER_CD_14,
              SPCFILE.SPC_RBFRMLA2_14,
              SPCFILE.SPC_RBFRMLA_15,
              SPCFILE.SPC_RBDTE_15_1,
              SPCFILE.SPC_RBDAYS_15_1,
              SPCFILE.SPC_RBYRTYPE_15_1,
              SPCFILE.SPC_RBDTE_15_2,
              SPCFILE.SPC_RBDAYS_15_2,
              SPCFILE.SPC_RBYRTYPE_15_2,
              SPCFILE.SPC_RBMINRET_15,
              SPCFILE.SPC_RBNOMON_15,
              SPCFILE.SPC_RBDEDCHG_15,
              SPCFILE.SPC_RBRECAST_15,
              SPCFILE.SPC_RBEARLY_15,
              SPCFILE.SPC_RBDEFER_15,
              SPCFILE.SPC_RBPCT_15,
              SPCFILE.SPC_RBREDUC_15,
              SPCFILE.SPC_RBMIN_15,
              SPCFILE.SPC_RBSPOPT1_15,
              SPCFILE.SPC_RBSPOPT2_15,
              SPCFILE.SPC_RBMANAGER_15,
              SPCFILE.SPC_RBUNITPER_CD_15,
              SPCFILE.SPC_RBFRMLA2_15,
              SPCFILE.SPC_RBFRMLA_16,
              SPCFILE.SPC_RBDTE_16_1,
              SPCFILE.SPC_RBDAYS_16_1,
              SPCFILE.SPC_RBYRTYPE_16_1,
              SPCFILE.SPC_RBDTE_16_2,
              SPCFILE.SPC_RBDAYS_16_2,
              SPCFILE.SPC_RBYRTYPE_16_2,
              SPCFILE.SPC_RBMINRET_16,
              SPCFILE.SPC_RBNOMON_16,
              SPCFILE.SPC_RBDEDCHG_16,
              SPCFILE.SPC_RBRECAST_16,
              SPCFILE.SPC_RBEARLY_16,
              SPCFILE.SPC_RBDEFER_16,
              SPCFILE.SPC_RBPCT_16,
              SPCFILE.SPC_RBREDUC_16,
              SPCFILE.SPC_RBMIN_16,
              SPCFILE.SPC_RBSPOPT1_16,
              SPCFILE.SPC_RBSPOPT2_16,
              SPCFILE.SPC_RBMANAGER_16,
              SPCFILE.SPC_RBUNITPER_CD_16,
              SPCFILE.SPC_RBFRMLA2_16,
              SPCFILE.SPC_RBFRMLA_17,
              SPCFILE.SPC_RBDTE_17_1,
              SPCFILE.SPC_RBDAYS_17_1,
              SPCFILE.SPC_RBYRTYPE_17_1,
              SPCFILE.SPC_RBDTE_17_2,
              SPCFILE.SPC_RBDAYS_17_2,
              SPCFILE.SPC_RBYRTYPE_17_2,
              SPCFILE.SPC_RBMINRET_17,
              SPCFILE.SPC_RBNOMON_17,
              SPCFILE.SPC_RBDEDCHG_17,
              SPCFILE.SPC_RBRECAST_17,
              SPCFILE.SPC_RBEARLY_17,
              SPCFILE.SPC_RBDEFER_17,
              SPCFILE.SPC_RBPCT_17,
              SPCFILE.SPC_RBREDUC_17,
              SPCFILE.SPC_RBMIN_17,
              SPCFILE.SPC_RBSPOPT1_17,
              SPCFILE.SPC_RBSPOPT2_17,
              SPCFILE.SPC_RBMANAGER_17,
              SPCFILE.SPC_RBUNITPER_CD_17,
              SPCFILE.SPC_RBFRMLA2_17,
              SPCFILE.SPC_RBFRMLA_18,
              SPCFILE.SPC_RBDTE_18_1,
              SPCFILE.SPC_RBDAYS_18_1,
              SPCFILE.SPC_RBYRTYPE_18_1,
              SPCFILE.SPC_RBDTE_18_2,
              SPCFILE.SPC_RBDAYS_18_2,
              SPCFILE.SPC_RBYRTYPE_18_2,
              SPCFILE.SPC_RBMINRET_18,
              SPCFILE.SPC_RBNOMON_18,
              SPCFILE.SPC_RBDEDCHG_18,
              SPCFILE.SPC_RBRECAST_18,
              SPCFILE.SPC_RBEARLY_18,
              SPCFILE.SPC_RBDEFER_18,
              SPCFILE.SPC_RBPCT_18,
              SPCFILE.SPC_RBREDUC_18,
              SPCFILE.SPC_RBMIN_18,
              SPCFILE.SPC_RBSPOPT1_18,
              SPCFILE.SPC_RBSPOPT2_18,
              SPCFILE.SPC_RBMANAGER_18,
              SPCFILE.SPC_RBUNITPER_CD_18,
              SPCFILE.SPC_RBFRMLA2_18,
              SPCFILE.SPC_RBFRMLA_19,
              SPCFILE.SPC_RBDTE_19_1,
              SPCFILE.SPC_RBDAYS_19_1,
              SPCFILE.SPC_RBYRTYPE_19_1,
              SPCFILE.SPC_RBDTE_19_2,
              SPCFILE.SPC_RBDAYS_19_2,
              SPCFILE.SPC_RBYRTYPE_19_2,
              SPCFILE.SPC_RBMINRET_19,
              SPCFILE.SPC_RBNOMON_19,
              SPCFILE.SPC_RBDEDCHG_19,
              SPCFILE.SPC_RBRECAST_19,
              SPCFILE.SPC_RBEARLY_19,
              SPCFILE.SPC_RBDEFER_19,
              SPCFILE.SPC_RBPCT_19,
              SPCFILE.SPC_RBREDUC_19,
              SPCFILE.SPC_RBMIN_19,
              SPCFILE.SPC_RBSPOPT1_19,
              SPCFILE.SPC_RBSPOPT2_19,
              SPCFILE.SPC_RBMANAGER_19,
              SPCFILE.SPC_RBUNITPER_CD_19,
              SPCFILE.SPC_RBFRMLA2_19,
              SPCFILE.SPC_RBFRMLA_20,
              SPCFILE.SPC_RBDTE_20_1,
              SPCFILE.SPC_RBDAYS_20_1,
              SPCFILE.SPC_RBYRTYPE_20_1,
              SPCFILE.SPC_RBDTE_20_2,
              SPCFILE.SPC_RBDAYS_20_2,
              SPCFILE.SPC_RBYRTYPE_20_2,
              SPCFILE.SPC_RBMINRET_20,
              SPCFILE.SPC_RBNOMON_20,
              SPCFILE.SPC_RBDEDCHG_20,
              SPCFILE.SPC_RBRECAST_20,
              SPCFILE.SPC_RBEARLY_20,
              SPCFILE.SPC_RBDEFER_20,
              SPCFILE.SPC_RBPCT_20,
              SPCFILE.SPC_RBREDUC_20,
              SPCFILE.SPC_RBMIN_20,
              SPCFILE.SPC_RBSPOPT1_20,
              SPCFILE.SPC_RBSPOPT2_20,
              SPCFILE.SPC_RBMANAGER_20,
              SPCFILE.SPC_RBUNITPER_CD_20,
              SPCFILE.SPC_RBFRMLA2_20,
              SPCFILE.SPC_RBFRMLA_21,
              SPCFILE.SPC_RBDTE_21_1,
              SPCFILE.SPC_RBDAYS_21_1,
              SPCFILE.SPC_RBYRTYPE_21_1,
              SPCFILE.SPC_RBDTE_21_2,
              SPCFILE.SPC_RBDAYS_21_2,
              SPCFILE.SPC_RBYRTYPE_21_2,
              SPCFILE.SPC_RBMINRET_21,
              SPCFILE.SPC_RBNOMON_21,
              SPCFILE.SPC_RBDEDCHG_21,
              SPCFILE.SPC_RBRECAST_21,
              SPCFILE.SPC_RBEARLY_21,
              SPCFILE.SPC_RBDEFER_21,
              SPCFILE.SPC_RBPCT_21,
              SPCFILE.SPC_RBREDUC_21,
              SPCFILE.SPC_RBMIN_21,
              SPCFILE.SPC_RBSPOPT1_21,
              SPCFILE.SPC_RBSPOPT2_21,
              SPCFILE.SPC_RBMANAGER_21,
              SPCFILE.SPC_RBUNITPER_CD_21,
              SPCFILE.SPC_RBFRMLA2_21,
              SPCFILE.SPC_RBFRMLA_22,
              SPCFILE.SPC_RBDTE_22_1,
              SPCFILE.SPC_RBDAYS_22_1,
              SPCFILE.SPC_RBYRTYPE_22_1,
              SPCFILE.SPC_RBDTE_22_2,
              SPCFILE.SPC_RBDAYS_22_2,
              SPCFILE.SPC_RBYRTYPE_22_2,
              SPCFILE.SPC_RBMINRET_22,
              SPCFILE.SPC_RBNOMON_22,
              SPCFILE.SPC_RBDEDCHG_22,
              SPCFILE.SPC_RBRECAST_22,
              SPCFILE.SPC_RBEARLY_22,
              SPCFILE.SPC_RBDEFER_22,
              SPCFILE.SPC_RBPCT_22,
              SPCFILE.SPC_RBREDUC_22,
              SPCFILE.SPC_RBMIN_22,
              SPCFILE.SPC_RBSPOPT1_22,
              SPCFILE.SPC_RBSPOPT2_22,
              SPCFILE.SPC_RBMANAGER_22,
              SPCFILE.SPC_RBUNITPER_CD_22,
              SPCFILE.SPC_RBFRMLA2_22,
              SPCFILE.SPC_RBCOMCD,
              SPCFILE.SPC_ADDON_DISFRMLA,
              SPCFILE.SPC_ADDON_WHOLE_FG,
              SPCFILE.SPC_ADDON_ORG_MATURITY,
              SPCFILE.SPC_CONSOLIDATE_RT_FG,
              SPCFILE.SPC_1STPY_ADDON_DAYS,
              SPCFILE.SPC_1STPY_ADDON_YRTYPE,
              SPCFILE.SPC_ADDON_RATE_FG,
              SPCFILE.SPC_ADDON_RATE,
              SPCFILE.SPC_FEEFRMLA_1,
              SPCFILE.SPC_FEECD_1,
              SPCFILE.SPC_FEEID_1,
              SPCFILE.SPC_FEEFRMLA_2,
              SPCFILE.SPC_FEECD_2,
              SPCFILE.SPC_FEEID_2,
              SPCFILE.SPC_ROUND_PAY_FG,
              SPCFILE.SPC_IRREGULAR_PAY_FG,
              SPCFILE.SPC_DLRVCHGS_RB_CD_1,
              SPCFILE.SPC_DLRVCHGS_RB_CD_2,
              SPCFILE.SPC_DLRVCHGS_RB_CD_3,
              SPCFILE.SPC_PARVHELD_RB_CD,
              SPCFILE.SPC_PARVPAID_RB_CD,
              SPCFILE.SPC_CONTR_CREDIT,
              SPCFILE.SPC_CONTR_CREDIT_CD,
              SPCFILE.SPC_CONTR_CREDIT_MIN_DEL_PER,
              SPCFILE.SPC_OPT_CAL_CHGABLE,
              SPCFILE.SPC_PBDEL_DAYS,
              SPCFILE.SPC_PBINCR_PERCENT,
              SPCFILE.SPC_CPOT30_CD,
              SPCFILE.SPC_CPOTCHGOFF_CD,
              SPCFILE.SPC_RDPOT30_CD,
              SPCFILE.SPC_RDPOTCHGOFF_CD,
              SPCFILE.SPC_MAX_ALLOW_DELINQ,
              SPCFILE.SPC_RESCIND_BUS_DAYS,
              SPCFILE.SPC_RESCIND_SATURDAY,
              SPCFILE.SPC_MIN_CREDIT_SCORE,
              SPCFILE.SPC_DUAL_IN_BRANCH,
              SPCFILE.SPC_DUAL_IN_STATE,
              SPCFILE.SPC_PACESETTER_FG,
              SPCFILE.SPC_WAGE_ASSIGN_DAYS,
              SPCFILE.SPC_CAL_PAYMENT_ROUND_FG,
              SPCFILE.SPC_CAN_LOANS_FG,
              SPCFILE.SPC_ALLOW_DELINQ_POLCD,
              SPCFILE.SPC_YTD_MAX_ALLOW_DELINQ,
              SPCFILE.SPC_LNCOST_FRMLA,
              SPCFILE.SPC_LNCOST_AMT,
              SPCFILE.SPC_DLDISC_RVPRIN1_PCNT,
              SPCFILE.SPC_RENEWABLE_PAYS,
              SPCFILE.SPC_RENEWABLE_DAYS,
              SPCFILE.SPC_ALLOW_LN_BACK_DATE,
              SPCFILE.SPC_DLDISC_RVPRIN1_AF_PCNT,
              SPCFILE.SPC_CAL_MAX_AT_ESTIMATE,
              SPCFILE.SPC_INSAH_RETRO,
              SPCFILE.SPC_INSAH_DAYS_WAIT,
              SPCFILE.SPC_ADDON_EXCEPT_FG,
              SPCFILE.SPC_REPO_TRCD_1,
              SPCFILE.SPC_REPO_FMNO_1_1,
              SPCFILE.SPC_REPO_FMNO_1_2,
              SPCFILE.SPC_REPO_FMNO_1_3,
              SPCFILE.SPC_REPO_FMNO_1_4,
              SPCFILE.SPC_REPO_TRCD_2,
              SPCFILE.SPC_REPO_FMNO_2_1,
              SPCFILE.SPC_REPO_FMNO_2_2,
              SPCFILE.SPC_REPO_FMNO_2_3,
              SPCFILE.SPC_REPO_FMNO_2_4,
              SPCFILE.SPC_REPO_TRCD_3,
              SPCFILE.SPC_REPO_FMNO_3_1,
              SPCFILE.SPC_REPO_FMNO_3_2,
              SPCFILE.SPC_REPO_FMNO_3_3,
              SPCFILE.SPC_REPO_FMNO_3_4,
              SPCFILE.SPC_CANCEL_ADDON_FG,
              SPCFILE.SPC_DEFAULT_O2_INS_COMP,
              SPCFILE.SPC_LC_ON_JUDGEMENTS,
              SPCFILE.SPC_DELQ_IB_AGE,
              SPCFILE.SPC_DELQ_IB_MAX_DAYS,
              SPCFILE.SPC_INSURANCE_WRITTEN,
              SPCFILE.SPC_INTERIM_COUPON,
              SPCFILE.SPC_AUTO_ASSESS_LCHG,
              SPCFILE.SPC_MAX_CASH_PROCEEDS,
              SPCFILE.SPC_ALLOW_ZERO_PROC,
              SPCFILE.SPC_BANKRULE_RATE,
              SPCFILE.SPC_AUTO_SEND_TRCD_1,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_1,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_2,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_3,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_4,
              SPCFILE.SPC_AUTO_SEND_TRCD_2,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_1,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_2,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_3,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_4,
              SPCFILE.SPC_DLDISC_CONV_BF_PCNT,
              SPCFILE.SPC_UNITPER_CD,
              SPCFILE.SPC_RENEWAL_EDIT,
              SPCFILE.SPC_ROUND_MFEE,
              SPCFILE.SPC_ADV_TO_1ST_NO_CORR,
              SPCFILE.SPC_LC_INT_ON_REPO_NON_PL,
              SPCFILE.SPC_CONTRACTUAL_SET_NONACCRUAL,
              SPCFILE.SPC_CONTRACTUAL_RESET_ACCRUAL,
              SPCFILE.SPC_MONTHS_PAY_NAPP_COUNTER,
              SPCFILE.SPC_SHORT_PAY_THRESHOLD,
              SPCFILE.SPC_CASH_AVAIL_PERCENT,
              SPCFILE.SPC_O1_JOINT_FG,
              SPCFILE.SPC_NET_BAL_REQ,
              SPCFILE.SPC_AMT_PROCEEDS_REQ,
              SPCFILE.SPC_ALT_PREPAY_MONTHS,
              SPCFILE.SPC_PERCENT_REGPAY_AVAIL,
              SPCFILE.SPC_ALT_DEFFRMLA,
              SPCFILE.SPC_ALT_DEFMIN,
              SPCFILE.SPC_ALT_DEFMAX,
              SPCFILE.SPC_NON_LOAN_FLAG,
              SPCFILE.SPC_SKIP_TRW)
            VALUES
             (:QSPC-ORGST,
              :QSPC-SPRCLASS,
              :QSPC-SUBCLASS,
              :QSPC-LAWCODE,
              :QSPC-INSEARN-ORDER-1,
              :QSPC-INSEARN-ORDER-2,
              :QSPC-INSEARN-ORDER-3,
              :QSPC-INSEARN-ORDER-4,
              :QSPC-INSEARN-ORDER-5,
              :QSPC-INSEARN-ORDER-6,
              :QSPC-INSEARN-ORDER-7,
              :QSPC-INSEARN-ORDER-8,
              :QSPC-INSEARN-ORDER-9,
              :QSPC-INSEARN-ORDER-10,
              :QSPC-INSEARN-ORDER-11,
              :QSPC-INSEARN-ORDER-12,
              :QSPC-INSAH-JOINT-FG,
              :QSPC-INS-O1-EDIT,
              :QSPC-INS-O2-EDIT,
              :QSPC-RBFRMLA-1,
              :QSPC-RBDTE-1-1,
              :QSPC-RBDAYS-1-1,
              :QSPC-RBYRTYPE-1-1,
              :QSPC-RBDTE-1-2,
              :QSPC-RBDAYS-1-2,
              :QSPC-RBYRTYPE-1-2,
              :QSPC-RBMINRET-1,
              :QSPC-RBNOMON-1,
              :QSPC-RBDEDCHG-1,
              :QSPC-RBRECAST-1,
              :QSPC-RBEARLY-1,
              :QSPC-RBDEFER-1,
              :QSPC-RBPCT-1,
              :QSPC-RBREDUC-1,
              :QSPC-RBMIN-1,
              :QSPC-RBSPOPT1-1,
              :QSPC-RBSPOPT2-1,
              :QSPC-RBMANAGER-1,
              :QSPC-RBUNITPER-CD-1,
              :QSPC-RBFRMLA2-1,
              :QSPC-RBFRMLA-2,
              :QSPC-RBDTE-2-1,
              :QSPC-RBDAYS-2-1,
              :QSPC-RBYRTYPE-2-1,
              :QSPC-RBDTE-2-2,
              :QSPC-RBDAYS-2-2,
              :QSPC-RBYRTYPE-2-2,
              :QSPC-RBMINRET-2,
              :QSPC-RBNOMON-2,
              :QSPC-RBDEDCHG-2,
              :QSPC-RBRECAST-2,
              :QSPC-RBEARLY-2,
              :QSPC-RBDEFER-2,
              :QSPC-RBPCT-2,
              :QSPC-RBREDUC-2,
              :QSPC-RBMIN-2,
              :QSPC-RBSPOPT1-2,
              :QSPC-RBSPOPT2-2,
              :QSPC-RBMANAGER-2,
              :QSPC-RBUNITPER-CD-2,
              :QSPC-RBFRMLA2-2,
              :QSPC-RBFRMLA-3,
              :QSPC-RBDTE-3-1,
              :QSPC-RBDAYS-3-1,
              :QSPC-RBYRTYPE-3-1,
              :QSPC-RBDTE-3-2,
              :QSPC-RBDAYS-3-2,
              :QSPC-RBYRTYPE-3-2,
              :QSPC-RBMINRET-3,
              :QSPC-RBNOMON-3,
              :QSPC-RBDEDCHG-3,
              :QSPC-RBRECAST-3,
              :QSPC-RBEARLY-3,
              :QSPC-RBDEFER-3,
              :QSPC-RBPCT-3,
              :QSPC-RBREDUC-3,
              :QSPC-RBMIN-3,
              :QSPC-RBSPOPT1-3,
              :QSPC-RBSPOPT2-3,
              :QSPC-RBMANAGER-3,
              :QSPC-RBUNITPER-CD-3,
              :QSPC-RBFRMLA2-3,
              :QSPC-RBFRMLA-4,
              :QSPC-RBDTE-4-1,
              :QSPC-RBDAYS-4-1,
              :QSPC-RBYRTYPE-4-1,
              :QSPC-RBDTE-4-2,
              :QSPC-RBDAYS-4-2,
              :QSPC-RBYRTYPE-4-2,
              :QSPC-RBMINRET-4,
              :QSPC-RBNOMON-4,
              :QSPC-RBDEDCHG-4,
              :QSPC-RBRECAST-4,
              :QSPC-RBEARLY-4,
              :QSPC-RBDEFER-4,
              :QSPC-RBPCT-4,
              :QSPC-RBREDUC-4,
              :QSPC-RBMIN-4,
              :QSPC-RBSPOPT1-4,
              :QSPC-RBSPOPT2-4,
              :QSPC-RBMANAGER-4,
              :QSPC-RBUNITPER-CD-4,
              :QSPC-RBFRMLA2-4,
              :QSPC-RBFRMLA-5,
              :QSPC-RBDTE-5-1,
              :QSPC-RBDAYS-5-1,
              :QSPC-RBYRTYPE-5-1,
              :QSPC-RBDTE-5-2,
              :QSPC-RBDAYS-5-2,
              :QSPC-RBYRTYPE-5-2,
              :QSPC-RBMINRET-5,
              :QSPC-RBNOMON-5,
              :QSPC-RBDEDCHG-5,
              :QSPC-RBRECAST-5,
              :QSPC-RBEARLY-5,
              :QSPC-RBDEFER-5,
              :QSPC-RBPCT-5,
              :QSPC-RBREDUC-5,
              :QSPC-RBMIN-5,
              :QSPC-RBSPOPT1-5,
              :QSPC-RBSPOPT2-5,
              :QSPC-RBMANAGER-5,
              :QSPC-RBUNITPER-CD-5,
              :QSPC-RBFRMLA2-5,
              :QSPC-RBFRMLA-6,
              :QSPC-RBDTE-6-1,
              :QSPC-RBDAYS-6-1,
              :QSPC-RBYRTYPE-6-1,
              :QSPC-RBDTE-6-2,
              :QSPC-RBDAYS-6-2,
              :QSPC-RBYRTYPE-6-2,
              :QSPC-RBMINRET-6,
              :QSPC-RBNOMON-6,
              :QSPC-RBDEDCHG-6,
              :QSPC-RBRECAST-6,
              :QSPC-RBEARLY-6,
              :QSPC-RBDEFER-6,
              :QSPC-RBPCT-6,
              :QSPC-RBREDUC-6,
              :QSPC-RBMIN-6,
              :QSPC-RBSPOPT1-6,
              :QSPC-RBSPOPT2-6,
              :QSPC-RBMANAGER-6,
              :QSPC-RBUNITPER-CD-6,
              :QSPC-RBFRMLA2-6,
              :QSPC-RBFRMLA-7,
              :QSPC-RBDTE-7-1,
              :QSPC-RBDAYS-7-1,
              :QSPC-RBYRTYPE-7-1,
              :QSPC-RBDTE-7-2,
              :QSPC-RBDAYS-7-2,
              :QSPC-RBYRTYPE-7-2,
              :QSPC-RBMINRET-7,
              :QSPC-RBNOMON-7,
              :QSPC-RBDEDCHG-7,
              :QSPC-RBRECAST-7,
              :QSPC-RBEARLY-7,
              :QSPC-RBDEFER-7,
              :QSPC-RBPCT-7,
              :QSPC-RBREDUC-7,
              :QSPC-RBMIN-7,
              :QSPC-RBSPOPT1-7,
              :QSPC-RBSPOPT2-7,
              :QSPC-RBMANAGER-7,
              :QSPC-RBUNITPER-CD-7,
              :QSPC-RBFRMLA2-7,
              :QSPC-RBFRMLA-8,
              :QSPC-RBDTE-8-1,
              :QSPC-RBDAYS-8-1,
              :QSPC-RBYRTYPE-8-1,
              :QSPC-RBDTE-8-2,
              :QSPC-RBDAYS-8-2,
              :QSPC-RBYRTYPE-8-2,
              :QSPC-RBMINRET-8,
              :QSPC-RBNOMON-8,
              :QSPC-RBDEDCHG-8,
              :QSPC-RBRECAST-8,
              :QSPC-RBEARLY-8,
              :QSPC-RBDEFER-8,
              :QSPC-RBPCT-8,
              :QSPC-RBREDUC-8,
              :QSPC-RBMIN-8,
              :QSPC-RBSPOPT1-8,
              :QSPC-RBSPOPT2-8,
              :QSPC-RBMANAGER-8,
              :QSPC-RBUNITPER-CD-8,
              :QSPC-RBFRMLA2-8,
              :QSPC-RBFRMLA-9,
              :QSPC-RBDTE-9-1,
              :QSPC-RBDAYS-9-1,
              :QSPC-RBYRTYPE-9-1,
              :QSPC-RBDTE-9-2,
              :QSPC-RBDAYS-9-2,
              :QSPC-RBYRTYPE-9-2,
              :QSPC-RBMINRET-9,
              :QSPC-RBNOMON-9,
              :QSPC-RBDEDCHG-9,
              :QSPC-RBRECAST-9,
              :QSPC-RBEARLY-9,
              :QSPC-RBDEFER-9,
              :QSPC-RBPCT-9,
              :QSPC-RBREDUC-9,
              :QSPC-RBMIN-9,
              :QSPC-RBSPOPT1-9,
              :QSPC-RBSPOPT2-9,
              :QSPC-RBMANAGER-9,
              :QSPC-RBUNITPER-CD-9,
              :QSPC-RBFRMLA2-9,
              :QSPC-RBFRMLA-10,
              :QSPC-RBDTE-10-1,
              :QSPC-RBDAYS-10-1,
              :QSPC-RBYRTYPE-10-1,
              :QSPC-RBDTE-10-2,
              :QSPC-RBDAYS-10-2,
              :QSPC-RBYRTYPE-10-2,
              :QSPC-RBMINRET-10,
              :QSPC-RBNOMON-10,
              :QSPC-RBDEDCHG-10,
              :QSPC-RBRECAST-10,
              :QSPC-RBEARLY-10,
              :QSPC-RBDEFER-10,
              :QSPC-RBPCT-10,
              :QSPC-RBREDUC-10,
              :QSPC-RBMIN-10,
              :QSPC-RBSPOPT1-10,
              :QSPC-RBSPOPT2-10,
              :QSPC-RBMANAGER-10,
              :QSPC-RBUNITPER-CD-10,
              :QSPC-RBFRMLA2-10,
              :QSPC-RBFRMLA-11,
              :QSPC-RBDTE-11-1,
              :QSPC-RBDAYS-11-1,
              :QSPC-RBYRTYPE-11-1,
              :QSPC-RBDTE-11-2,
              :QSPC-RBDAYS-11-2,
              :QSPC-RBYRTYPE-11-2,
              :QSPC-RBMINRET-11,
              :QSPC-RBNOMON-11,
              :QSPC-RBDEDCHG-11,
              :QSPC-RBRECAST-11,
              :QSPC-RBEARLY-11,
              :QSPC-RBDEFER-11,
              :QSPC-RBPCT-11,
              :QSPC-RBREDUC-11,
              :QSPC-RBMIN-11,
              :QSPC-RBSPOPT1-11,
              :QSPC-RBSPOPT2-11,
              :QSPC-RBMANAGER-11,
              :QSPC-RBUNITPER-CD-11,
              :QSPC-RBFRMLA2-11,
              :QSPC-RBFRMLA-12,
              :QSPC-RBDTE-12-1,
              :QSPC-RBDAYS-12-1,
              :QSPC-RBYRTYPE-12-1,
              :QSPC-RBDTE-12-2,
              :QSPC-RBDAYS-12-2,
              :QSPC-RBYRTYPE-12-2,
              :QSPC-RBMINRET-12,
              :QSPC-RBNOMON-12,
              :QSPC-RBDEDCHG-12,
              :QSPC-RBRECAST-12,
              :QSPC-RBEARLY-12,
              :QSPC-RBDEFER-12,
              :QSPC-RBPCT-12,
              :QSPC-RBREDUC-12,
              :QSPC-RBMIN-12,
              :QSPC-RBSPOPT1-12,
              :QSPC-RBSPOPT2-12,
              :QSPC-RBMANAGER-12,
              :QSPC-RBUNITPER-CD-12,
              :QSPC-RBFRMLA2-12,
              :QSPC-RBFRMLA-13,
              :QSPC-RBDTE-13-1,
              :QSPC-RBDAYS-13-1,
              :QSPC-RBYRTYPE-13-1,
              :QSPC-RBDTE-13-2,
              :QSPC-RBDAYS-13-2,
              :QSPC-RBYRTYPE-13-2,
              :QSPC-RBMINRET-13,
              :QSPC-RBNOMON-13,
              :QSPC-RBDEDCHG-13,
              :QSPC-RBRECAST-13,
              :QSPC-RBEARLY-13,
              :QSPC-RBDEFER-13,
              :QSPC-RBPCT-13,
              :QSPC-RBREDUC-13,
              :QSPC-RBMIN-13,
              :QSPC-RBSPOPT1-13,
              :QSPC-RBSPOPT2-13,
              :QSPC-RBMANAGER-13,
              :QSPC-RBUNITPER-CD-13,
              :QSPC-RBFRMLA2-13,
              :QSPC-RBFRMLA-14,
              :QSPC-RBDTE-14-1,
              :QSPC-RBDAYS-14-1,
              :QSPC-RBYRTYPE-14-1,
              :QSPC-RBDTE-14-2,
              :QSPC-RBDAYS-14-2,
              :QSPC-RBYRTYPE-14-2,
              :QSPC-RBMINRET-14,
              :QSPC-RBNOMON-14,
              :QSPC-RBDEDCHG-14,
              :QSPC-RBRECAST-14,
              :QSPC-RBEARLY-14,
              :QSPC-RBDEFER-14,
              :QSPC-RBPCT-14,
              :QSPC-RBREDUC-14,
              :QSPC-RBMIN-14,
              :QSPC-RBSPOPT1-14,
              :QSPC-RBSPOPT2-14,
              :QSPC-RBMANAGER-14,
              :QSPC-RBUNITPER-CD-14,
              :QSPC-RBFRMLA2-14,
              :QSPC-RBFRMLA-15,
              :QSPC-RBDTE-15-1,
              :QSPC-RBDAYS-15-1,
              :QSPC-RBYRTYPE-15-1,
              :QSPC-RBDTE-15-2,
              :QSPC-RBDAYS-15-2,
              :QSPC-RBYRTYPE-15-2,
              :QSPC-RBMINRET-15,
              :QSPC-RBNOMON-15,
              :QSPC-RBDEDCHG-15,
              :QSPC-RBRECAST-15,
              :QSPC-RBEARLY-15,
              :QSPC-RBDEFER-15,
              :QSPC-RBPCT-15,
              :QSPC-RBREDUC-15,
              :QSPC-RBMIN-15,
              :QSPC-RBSPOPT1-15,
              :QSPC-RBSPOPT2-15,
              :QSPC-RBMANAGER-15,
              :QSPC-RBUNITPER-CD-15,
              :QSPC-RBFRMLA2-15,
              :QSPC-RBFRMLA-16,
              :QSPC-RBDTE-16-1,
              :QSPC-RBDAYS-16-1,
              :QSPC-RBYRTYPE-16-1,
              :QSPC-RBDTE-16-2,
              :QSPC-RBDAYS-16-2,
              :QSPC-RBYRTYPE-16-2,
              :QSPC-RBMINRET-16,
              :QSPC-RBNOMON-16,
              :QSPC-RBDEDCHG-16,
              :QSPC-RBRECAST-16,
              :QSPC-RBEARLY-16,
              :QSPC-RBDEFER-16,
              :QSPC-RBPCT-16,
              :QSPC-RBREDUC-16,
              :QSPC-RBMIN-16,
              :QSPC-RBSPOPT1-16,
              :QSPC-RBSPOPT2-16,
              :QSPC-RBMANAGER-16,
              :QSPC-RBUNITPER-CD-16,
              :QSPC-RBFRMLA2-16,
              :QSPC-RBFRMLA-17,
              :QSPC-RBDTE-17-1,
              :QSPC-RBDAYS-17-1,
              :QSPC-RBYRTYPE-17-1,
              :QSPC-RBDTE-17-2,
              :QSPC-RBDAYS-17-2,
              :QSPC-RBYRTYPE-17-2,
              :QSPC-RBMINRET-17,
              :QSPC-RBNOMON-17,
              :QSPC-RBDEDCHG-17,
              :QSPC-RBRECAST-17,
              :QSPC-RBEARLY-17,
              :QSPC-RBDEFER-17,
              :QSPC-RBPCT-17,
              :QSPC-RBREDUC-17,
              :QSPC-RBMIN-17,
              :QSPC-RBSPOPT1-17,
              :QSPC-RBSPOPT2-17,
              :QSPC-RBMANAGER-17,
              :QSPC-RBUNITPER-CD-17,
              :QSPC-RBFRMLA2-17,
              :QSPC-RBFRMLA-18,
              :QSPC-RBDTE-18-1,
              :QSPC-RBDAYS-18-1,
              :QSPC-RBYRTYPE-18-1,
              :QSPC-RBDTE-18-2,
              :QSPC-RBDAYS-18-2,
              :QSPC-RBYRTYPE-18-2,
              :QSPC-RBMINRET-18,
              :QSPC-RBNOMON-18,
              :QSPC-RBDEDCHG-18,
              :QSPC-RBRECAST-18,
              :QSPC-RBEARLY-18,
              :QSPC-RBDEFER-18,
              :QSPC-RBPCT-18,
              :QSPC-RBREDUC-18,
              :QSPC-RBMIN-18,
              :QSPC-RBSPOPT1-18,
              :QSPC-RBSPOPT2-18,
              :QSPC-RBMANAGER-18,
              :QSPC-RBUNITPER-CD-18,
              :QSPC-RBFRMLA2-18,
              :QSPC-RBFRMLA-19,
              :QSPC-RBDTE-19-1,
              :QSPC-RBDAYS-19-1,
              :QSPC-RBYRTYPE-19-1,
              :QSPC-RBDTE-19-2,
              :QSPC-RBDAYS-19-2,
              :QSPC-RBYRTYPE-19-2,
              :QSPC-RBMINRET-19,
              :QSPC-RBNOMON-19,
              :QSPC-RBDEDCHG-19,
              :QSPC-RBRECAST-19,
              :QSPC-RBEARLY-19,
              :QSPC-RBDEFER-19,
              :QSPC-RBPCT-19,
              :QSPC-RBREDUC-19,
              :QSPC-RBMIN-19,
              :QSPC-RBSPOPT1-19,
              :QSPC-RBSPOPT2-19,
              :QSPC-RBMANAGER-19,
              :QSPC-RBUNITPER-CD-19,
              :QSPC-RBFRMLA2-19,
              :QSPC-RBFRMLA-20,
              :QSPC-RBDTE-20-1,
              :QSPC-RBDAYS-20-1,
              :QSPC-RBYRTYPE-20-1,
              :QSPC-RBDTE-20-2,
              :QSPC-RBDAYS-20-2,
              :QSPC-RBYRTYPE-20-2,
              :QSPC-RBMINRET-20,
              :QSPC-RBNOMON-20,
              :QSPC-RBDEDCHG-20,
              :QSPC-RBRECAST-20,
              :QSPC-RBEARLY-20,
              :QSPC-RBDEFER-20,
              :QSPC-RBPCT-20,
              :QSPC-RBREDUC-20,
              :QSPC-RBMIN-20,
              :QSPC-RBSPOPT1-20,
              :QSPC-RBSPOPT2-20,
              :QSPC-RBMANAGER-20,
              :QSPC-RBUNITPER-CD-20,
              :QSPC-RBFRMLA2-20,
              :QSPC-RBFRMLA-21,
              :QSPC-RBDTE-21-1,
              :QSPC-RBDAYS-21-1,
              :QSPC-RBYRTYPE-21-1,
              :QSPC-RBDTE-21-2,
              :QSPC-RBDAYS-21-2,
              :QSPC-RBYRTYPE-21-2,
              :QSPC-RBMINRET-21,
              :QSPC-RBNOMON-21,
              :QSPC-RBDEDCHG-21,
              :QSPC-RBRECAST-21,
              :QSPC-RBEARLY-21,
              :QSPC-RBDEFER-21,
              :QSPC-RBPCT-21,
              :QSPC-RBREDUC-21,
              :QSPC-RBMIN-21,
              :QSPC-RBSPOPT1-21,
              :QSPC-RBSPOPT2-21,
              :QSPC-RBMANAGER-21,
              :QSPC-RBUNITPER-CD-21,
              :QSPC-RBFRMLA2-21,
              :QSPC-RBFRMLA-22,
              :QSPC-RBDTE-22-1,
              :QSPC-RBDAYS-22-1,
              :QSPC-RBYRTYPE-22-1,
              :QSPC-RBDTE-22-2,
              :QSPC-RBDAYS-22-2,
              :QSPC-RBYRTYPE-22-2,
              :QSPC-RBMINRET-22,
              :QSPC-RBNOMON-22,
              :QSPC-RBDEDCHG-22,
              :QSPC-RBRECAST-22,
              :QSPC-RBEARLY-22,
              :QSPC-RBDEFER-22,
              :QSPC-RBPCT-22,
              :QSPC-RBREDUC-22,
              :QSPC-RBMIN-22,
              :QSPC-RBSPOPT1-22,
              :QSPC-RBSPOPT2-22,
              :QSPC-RBMANAGER-22,
              :QSPC-RBUNITPER-CD-22,
              :QSPC-RBFRMLA2-22,
              :QSPC-RBCOMCD,
              :QSPC-ADDON-DISFRMLA,
              :QSPC-ADDON-WHOLE-FG,
              :QSPC-ADDON-ORG-MATURITY,
              :QSPC-CONSOLIDATE-RT-FG,
              :QSPC-1STPY-ADDON-DAYS,
              :QSPC-1STPY-ADDON-YRTYPE,
              :QSPC-ADDON-RATE-FG,
              :QSPC-ADDON-RATE,
              :QSPC-FEEFRMLA-1,
              :QSPC-FEECD-1,
              :QSPC-FEEID-1,
              :QSPC-FEEFRMLA-2,
              :QSPC-FEECD-2,
              :QSPC-FEEID-2,
              :QSPC-ROUND-PAY-FG,
              :QSPC-IRREGULAR-PAY-FG,
              :QSPC-DLRVCHGS-RB-CD-1,
              :QSPC-DLRVCHGS-RB-CD-2,
              :QSPC-DLRVCHGS-RB-CD-3,
              :QSPC-PARVHELD-RB-CD,
              :QSPC-PARVPAID-RB-CD,
              :QSPC-CONTR-CREDIT,
              :QSPC-CONTR-CREDIT-CD,
              :QSPC-CONTR-CREDIT-MIN-DEL-PER,
              :QSPC-OPT-CAL-CHGABLE,
              :QSPC-PBDEL-DAYS,
              :QSPC-PBINCR-PERCENT,
              :QSPC-CPOT30-CD,
              :QSPC-CPOTCHGOFF-CD,
              :QSPC-RDPOT30-CD,
              :QSPC-RDPOTCHGOFF-CD,
              :QSPC-MAX-ALLOW-DELINQ,
              :QSPC-RESCIND-BUS-DAYS,
              :QSPC-RESCIND-SATURDAY,
              :QSPC-MIN-CREDIT-SCORE,
              :QSPC-DUAL-IN-BRANCH,
              :QSPC-DUAL-IN-STATE,
              :QSPC-PACESETTER-FG,
              :QSPC-WAGE-ASSIGN-DAYS,
              :QSPC-CAL-PAYMENT-ROUND-FG,
              :QSPC-CAN-LOANS-FG,
              :QSPC-ALLOW-DELINQ-POLCD,
              :QSPC-YTD-MAX-ALLOW-DELINQ,
              :QSPC-LNCOST-FRMLA,
              :QSPC-LNCOST-AMT,
              :QSPC-DLDISC-RVPRIN1-PCNT,
              :QSPC-RENEWABLE-PAYS,
              :QSPC-RENEWABLE-DAYS,
              :QSPC-ALLOW-LN-BACK-DATE,
              :QSPC-DLDISC-RVPRIN1-AF-PCNT,
              :QSPC-CAL-MAX-AT-ESTIMATE,
              :QSPC-INSAH-RETRO,
              :QSPC-INSAH-DAYS-WAIT,
              :QSPC-ADDON-EXCEPT-FG,
              :QSPC-REPO-TRCD-1,
              :QSPC-REPO-FMNO-1-1,
              :QSPC-REPO-FMNO-1-2,
              :QSPC-REPO-FMNO-1-3,
              :QSPC-REPO-FMNO-1-4,
              :QSPC-REPO-TRCD-2,
              :QSPC-REPO-FMNO-2-1,
              :QSPC-REPO-FMNO-2-2,
              :QSPC-REPO-FMNO-2-3,
              :QSPC-REPO-FMNO-2-4,
              :QSPC-REPO-TRCD-3,
              :QSPC-REPO-FMNO-3-1,
              :QSPC-REPO-FMNO-3-2,
              :QSPC-REPO-FMNO-3-3,
              :QSPC-REPO-FMNO-3-4,
              :QSPC-CANCEL-ADDON-FG,
              :QSPC-DEFAULT-O2-INS-COMP,
              :QSPC-LC-ON-JUDGEMENTS,
              :QSPC-DELQ-IB-AGE,
              :QSPC-DELQ-IB-MAX-DAYS,
              :QSPC-INSURANCE-WRITTEN,
              :QSPC-INTERIM-COUPON,
              :QSPC-AUTO-ASSESS-LCHG,
              :QSPC-MAX-CASH-PROCEEDS,
              :QSPC-ALLOW-ZERO-PROC,
              :QSPC-BANKRULE-RATE,
              :QSPC-AUTO-SEND-TRCD-1,
              :QSPC-AUTO-SEND-FMNO-1-1,
              :QSPC-AUTO-SEND-FMNO-1-2,
              :QSPC-AUTO-SEND-FMNO-1-3,
              :QSPC-AUTO-SEND-FMNO-1-4,
              :QSPC-AUTO-SEND-TRCD-2,
              :QSPC-AUTO-SEND-FMNO-2-1,
              :QSPC-AUTO-SEND-FMNO-2-2,
              :QSPC-AUTO-SEND-FMNO-2-3,
              :QSPC-AUTO-SEND-FMNO-2-4,
              :QSPC-DLDISC-CONV-BF-PCNT,
              :QSPC-UNITPER-CD,
              :QSPC-RENEWAL-EDIT,
              :QSPC-ROUND-MFEE,
              :QSPC-ADV-TO-1ST-NO-CORR,
              :QSPC-LC-INT-ON-REPO-NON-PL,
              :QSPC-CONTRACTUAL-SET-NONACCRUAL,
              :QSPC-CONTRACTUAL-RESET-ACCRUAL,
              :QSPC-MONTHS-PAY-NAPP-COUNTER,
              :QSPC-SHORT-PAY-THRESHOLD,
              :QSPC-CASH-AVAIL-PERCENT,
              :QSPC-O1-JOINT-FG,
              :QSPC-NET-BAL-REQ,
              :QSPC-AMT-PROCEEDS-REQ,
              :QSPC-ALT-PREPAY-MONTHS,
              :QSPC-PERCENT-REGPAY-AVAIL,
              :QSPC-ALT-DEFFRMLA,
              :QSPC-ALT-DEFMIN,
              :QSPC-ALT-DEFMAX,
              :QSPC-NON-LOAN-FLAG,
              :QSPC-SKIP-TRW)
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO WRITE-SPC1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-----------------------------------------------------------------
       REWRITE-SPC1-FILE.

           PERFORM REWRITE-IT.
           MOVE SPC-PATH-SQL TO E-FILE.
           MOVE SPC1-KEY TO E-KEYX.
           PERFORM SET-SPC-FIELDS.

           EXEC SQL
            UPDATE DBO.SPCFILE
             SET
              SPCFILE.SPC_ORGST = :QSPC-ORGST,
              SPCFILE.SPC_SPRCLASS = :QSPC-SPRCLASS,
              SPCFILE.SPC_SUBCLASS = :QSPC-SUBCLASS,
              SPCFILE.SPC_LAWCODE = :QSPC-LAWCODE,
              SPCFILE.SPC_INSEARN_ORDER_1 = :QSPC-INSEARN-ORDER-1,
              SPCFILE.SPC_INSEARN_ORDER_2 = :QSPC-INSEARN-ORDER-2,
              SPCFILE.SPC_INSEARN_ORDER_3 = :QSPC-INSEARN-ORDER-3,
              SPCFILE.SPC_INSEARN_ORDER_4 = :QSPC-INSEARN-ORDER-4,
              SPCFILE.SPC_INSEARN_ORDER_5 = :QSPC-INSEARN-ORDER-5,
              SPCFILE.SPC_INSEARN_ORDER_6 = :QSPC-INSEARN-ORDER-6,
              SPCFILE.SPC_INSEARN_ORDER_7 = :QSPC-INSEARN-ORDER-7,
              SPCFILE.SPC_INSEARN_ORDER_8 = :QSPC-INSEARN-ORDER-8,
              SPCFILE.SPC_INSEARN_ORDER_9 = :QSPC-INSEARN-ORDER-9,
              SPCFILE.SPC_INSEARN_ORDER_10 =
                   :QSPC-INSEARN-ORDER-10,
              SPCFILE.SPC_INSEARN_ORDER_11 =
                   :QSPC-INSEARN-ORDER-11,
              SPCFILE.SPC_INSEARN_ORDER_12 =
                   :QSPC-INSEARN-ORDER-12,
              SPCFILE.SPC_INSAH_JOINT_FG = :QSPC-INSAH-JOINT-FG,
              SPCFILE.SPC_INS_O1_EDIT = :QSPC-INS-O1-EDIT,
              SPCFILE.SPC_INS_O2_EDIT = :QSPC-INS-O2-EDIT,
              SPCFILE.SPC_RBFRMLA_1 = :QSPC-RBFRMLA-1,
              SPCFILE.SPC_RBDTE_1_1 = :QSPC-RBDTE-1-1,
              SPCFILE.SPC_RBDAYS_1_1 = :QSPC-RBDAYS-1-1,
              SPCFILE.SPC_RBYRTYPE_1_1 = :QSPC-RBYRTYPE-1-1,
              SPCFILE.SPC_RBDTE_1_2 = :QSPC-RBDTE-1-2,
              SPCFILE.SPC_RBDAYS_1_2 = :QSPC-RBDAYS-1-2,
              SPCFILE.SPC_RBYRTYPE_1_2 = :QSPC-RBYRTYPE-1-2,
              SPCFILE.SPC_RBMINRET_1 = :QSPC-RBMINRET-1,
              SPCFILE.SPC_RBNOMON_1 = :QSPC-RBNOMON-1,
              SPCFILE.SPC_RBDEDCHG_1 = :QSPC-RBDEDCHG-1,
              SPCFILE.SPC_RBRECAST_1 = :QSPC-RBRECAST-1,
              SPCFILE.SPC_RBEARLY_1 = :QSPC-RBEARLY-1,
              SPCFILE.SPC_RBDEFER_1 = :QSPC-RBDEFER-1,
              SPCFILE.SPC_RBPCT_1 = :QSPC-RBPCT-1,
              SPCFILE.SPC_RBREDUC_1 = :QSPC-RBREDUC-1,
              SPCFILE.SPC_RBMIN_1 = :QSPC-RBMIN-1,
              SPCFILE.SPC_RBSPOPT1_1 = :QSPC-RBSPOPT1-1,
              SPCFILE.SPC_RBSPOPT2_1 = :QSPC-RBSPOPT2-1,
              SPCFILE.SPC_RBMANAGER_1 = :QSPC-RBMANAGER-1,
              SPCFILE.SPC_RBUNITPER_CD_1 = :QSPC-RBUNITPER-CD-1,
              SPCFILE.SPC_RBFRMLA2_1 = :QSPC-RBFRMLA2-1,
              SPCFILE.SPC_RBFRMLA_2 = :QSPC-RBFRMLA-2,
              SPCFILE.SPC_RBDTE_2_1 = :QSPC-RBDTE-2-1,
              SPCFILE.SPC_RBDAYS_2_1 = :QSPC-RBDAYS-2-1,
              SPCFILE.SPC_RBYRTYPE_2_1 = :QSPC-RBYRTYPE-2-1,
              SPCFILE.SPC_RBDTE_2_2 = :QSPC-RBDTE-2-2,
              SPCFILE.SPC_RBDAYS_2_2 = :QSPC-RBDAYS-2-2,
              SPCFILE.SPC_RBYRTYPE_2_2 = :QSPC-RBYRTYPE-2-2,
              SPCFILE.SPC_RBMINRET_2 = :QSPC-RBMINRET-2,
              SPCFILE.SPC_RBNOMON_2 = :QSPC-RBNOMON-2,
              SPCFILE.SPC_RBDEDCHG_2 = :QSPC-RBDEDCHG-2,
              SPCFILE.SPC_RBRECAST_2 = :QSPC-RBRECAST-2,
              SPCFILE.SPC_RBEARLY_2 = :QSPC-RBEARLY-2,
              SPCFILE.SPC_RBDEFER_2 = :QSPC-RBDEFER-2,
              SPCFILE.SPC_RBPCT_2 = :QSPC-RBPCT-2,
              SPCFILE.SPC_RBREDUC_2 = :QSPC-RBREDUC-2,
              SPCFILE.SPC_RBMIN_2 = :QSPC-RBMIN-2,
              SPCFILE.SPC_RBSPOPT1_2 = :QSPC-RBSPOPT1-2,
              SPCFILE.SPC_RBSPOPT2_2 = :QSPC-RBSPOPT2-2,
              SPCFILE.SPC_RBMANAGER_2 = :QSPC-RBMANAGER-2,
              SPCFILE.SPC_RBUNITPER_CD_2 = :QSPC-RBUNITPER-CD-2,
              SPCFILE.SPC_RBFRMLA2_2 = :QSPC-RBFRMLA2-2,
              SPCFILE.SPC_RBFRMLA_3 = :QSPC-RBFRMLA-3,
              SPCFILE.SPC_RBDTE_3_1 = :QSPC-RBDTE-3-1,
              SPCFILE.SPC_RBDAYS_3_1 = :QSPC-RBDAYS-3-1,
              SPCFILE.SPC_RBYRTYPE_3_1 = :QSPC-RBYRTYPE-3-1,
              SPCFILE.SPC_RBDTE_3_2 = :QSPC-RBDTE-3-2,
              SPCFILE.SPC_RBDAYS_3_2 = :QSPC-RBDAYS-3-2,
              SPCFILE.SPC_RBYRTYPE_3_2 = :QSPC-RBYRTYPE-3-2,
              SPCFILE.SPC_RBMINRET_3 = :QSPC-RBMINRET-3,
              SPCFILE.SPC_RBNOMON_3 = :QSPC-RBNOMON-3,
              SPCFILE.SPC_RBDEDCHG_3 = :QSPC-RBDEDCHG-3,
              SPCFILE.SPC_RBRECAST_3 = :QSPC-RBRECAST-3,
              SPCFILE.SPC_RBEARLY_3 = :QSPC-RBEARLY-3,
              SPCFILE.SPC_RBDEFER_3 = :QSPC-RBDEFER-3,
              SPCFILE.SPC_RBPCT_3 = :QSPC-RBPCT-3,
              SPCFILE.SPC_RBREDUC_3 = :QSPC-RBREDUC-3,
              SPCFILE.SPC_RBMIN_3 = :QSPC-RBMIN-3,
              SPCFILE.SPC_RBSPOPT1_3 = :QSPC-RBSPOPT1-3,
              SPCFILE.SPC_RBSPOPT2_3 = :QSPC-RBSPOPT2-3,
              SPCFILE.SPC_RBMANAGER_3 = :QSPC-RBMANAGER-3,
              SPCFILE.SPC_RBUNITPER_CD_3 = :QSPC-RBUNITPER-CD-3,
              SPCFILE.SPC_RBFRMLA2_3 = :QSPC-RBFRMLA2-3,
              SPCFILE.SPC_RBFRMLA_4 = :QSPC-RBFRMLA-4,
              SPCFILE.SPC_RBDTE_4_1 = :QSPC-RBDTE-4-1,
              SPCFILE.SPC_RBDAYS_4_1 = :QSPC-RBDAYS-4-1,
              SPCFILE.SPC_RBYRTYPE_4_1 = :QSPC-RBYRTYPE-4-1,
              SPCFILE.SPC_RBDTE_4_2 = :QSPC-RBDTE-4-2,
              SPCFILE.SPC_RBDAYS_4_2 = :QSPC-RBDAYS-4-2,
              SPCFILE.SPC_RBYRTYPE_4_2 = :QSPC-RBYRTYPE-4-2,
              SPCFILE.SPC_RBMINRET_4 = :QSPC-RBMINRET-4,
              SPCFILE.SPC_RBNOMON_4 = :QSPC-RBNOMON-4,
              SPCFILE.SPC_RBDEDCHG_4 = :QSPC-RBDEDCHG-4,
              SPCFILE.SPC_RBRECAST_4 = :QSPC-RBRECAST-4,
              SPCFILE.SPC_RBEARLY_4 = :QSPC-RBEARLY-4,
              SPCFILE.SPC_RBDEFER_4 = :QSPC-RBDEFER-4,
              SPCFILE.SPC_RBPCT_4 = :QSPC-RBPCT-4,
              SPCFILE.SPC_RBREDUC_4 = :QSPC-RBREDUC-4,
              SPCFILE.SPC_RBMIN_4 = :QSPC-RBMIN-4,
              SPCFILE.SPC_RBSPOPT1_4 = :QSPC-RBSPOPT1-4,
              SPCFILE.SPC_RBSPOPT2_4 = :QSPC-RBSPOPT2-4,
              SPCFILE.SPC_RBMANAGER_4 = :QSPC-RBMANAGER-4,
              SPCFILE.SPC_RBUNITPER_CD_4 = :QSPC-RBUNITPER-CD-4,
              SPCFILE.SPC_RBFRMLA2_4 = :QSPC-RBFRMLA2-4,
              SPCFILE.SPC_RBFRMLA_5 = :QSPC-RBFRMLA-5,
              SPCFILE.SPC_RBDTE_5_1 = :QSPC-RBDTE-5-1,
              SPCFILE.SPC_RBDAYS_5_1 = :QSPC-RBDAYS-5-1,
              SPCFILE.SPC_RBYRTYPE_5_1 = :QSPC-RBYRTYPE-5-1,
              SPCFILE.SPC_RBDTE_5_2 = :QSPC-RBDTE-5-2,
              SPCFILE.SPC_RBDAYS_5_2 = :QSPC-RBDAYS-5-2,
              SPCFILE.SPC_RBYRTYPE_5_2 = :QSPC-RBYRTYPE-5-2,
              SPCFILE.SPC_RBMINRET_5 = :QSPC-RBMINRET-5,
              SPCFILE.SPC_RBNOMON_5 = :QSPC-RBNOMON-5,
              SPCFILE.SPC_RBDEDCHG_5 = :QSPC-RBDEDCHG-5,
              SPCFILE.SPC_RBRECAST_5 = :QSPC-RBRECAST-5,
              SPCFILE.SPC_RBEARLY_5 = :QSPC-RBEARLY-5,
              SPCFILE.SPC_RBDEFER_5 = :QSPC-RBDEFER-5,
              SPCFILE.SPC_RBPCT_5 = :QSPC-RBPCT-5,
              SPCFILE.SPC_RBREDUC_5 = :QSPC-RBREDUC-5,
              SPCFILE.SPC_RBMIN_5 = :QSPC-RBMIN-5,
              SPCFILE.SPC_RBSPOPT1_5 = :QSPC-RBSPOPT1-5,
              SPCFILE.SPC_RBSPOPT2_5 = :QSPC-RBSPOPT2-5,
              SPCFILE.SPC_RBMANAGER_5 = :QSPC-RBMANAGER-5,
              SPCFILE.SPC_RBUNITPER_CD_5 = :QSPC-RBUNITPER-CD-5,
              SPCFILE.SPC_RBFRMLA2_5 = :QSPC-RBFRMLA2-5,
              SPCFILE.SPC_RBFRMLA_6 = :QSPC-RBFRMLA-6,
              SPCFILE.SPC_RBDTE_6_1 = :QSPC-RBDTE-6-1,
              SPCFILE.SPC_RBDAYS_6_1 = :QSPC-RBDAYS-6-1,
              SPCFILE.SPC_RBYRTYPE_6_1 = :QSPC-RBYRTYPE-6-1,
              SPCFILE.SPC_RBDTE_6_2 = :QSPC-RBDTE-6-2,
              SPCFILE.SPC_RBDAYS_6_2 = :QSPC-RBDAYS-6-2,
              SPCFILE.SPC_RBYRTYPE_6_2 = :QSPC-RBYRTYPE-6-2,
              SPCFILE.SPC_RBMINRET_6 = :QSPC-RBMINRET-6,
              SPCFILE.SPC_RBNOMON_6 = :QSPC-RBNOMON-6,
              SPCFILE.SPC_RBDEDCHG_6 = :QSPC-RBDEDCHG-6,
              SPCFILE.SPC_RBRECAST_6 = :QSPC-RBRECAST-6,
              SPCFILE.SPC_RBEARLY_6 = :QSPC-RBEARLY-6,
              SPCFILE.SPC_RBDEFER_6 = :QSPC-RBDEFER-6,
              SPCFILE.SPC_RBPCT_6 = :QSPC-RBPCT-6,
              SPCFILE.SPC_RBREDUC_6 = :QSPC-RBREDUC-6,
              SPCFILE.SPC_RBMIN_6 = :QSPC-RBMIN-6,
              SPCFILE.SPC_RBSPOPT1_6 = :QSPC-RBSPOPT1-6,
              SPCFILE.SPC_RBSPOPT2_6 = :QSPC-RBSPOPT2-6,
              SPCFILE.SPC_RBMANAGER_6 = :QSPC-RBMANAGER-6,
              SPCFILE.SPC_RBUNITPER_CD_6 = :QSPC-RBUNITPER-CD-6,
              SPCFILE.SPC_RBFRMLA2_6 = :QSPC-RBFRMLA2-6,
              SPCFILE.SPC_RBFRMLA_7 = :QSPC-RBFRMLA-7,
              SPCFILE.SPC_RBDTE_7_1 = :QSPC-RBDTE-7-1,
              SPCFILE.SPC_RBDAYS_7_1 = :QSPC-RBDAYS-7-1,
              SPCFILE.SPC_RBYRTYPE_7_1 = :QSPC-RBYRTYPE-7-1,
              SPCFILE.SPC_RBDTE_7_2 = :QSPC-RBDTE-7-2,
              SPCFILE.SPC_RBDAYS_7_2 = :QSPC-RBDAYS-7-2,
              SPCFILE.SPC_RBYRTYPE_7_2 = :QSPC-RBYRTYPE-7-2,
              SPCFILE.SPC_RBMINRET_7 = :QSPC-RBMINRET-7,
              SPCFILE.SPC_RBNOMON_7 = :QSPC-RBNOMON-7,
              SPCFILE.SPC_RBDEDCHG_7 = :QSPC-RBDEDCHG-7,
              SPCFILE.SPC_RBRECAST_7 = :QSPC-RBRECAST-7,
              SPCFILE.SPC_RBEARLY_7 = :QSPC-RBEARLY-7,
              SPCFILE.SPC_RBDEFER_7 = :QSPC-RBDEFER-7,
              SPCFILE.SPC_RBPCT_7 = :QSPC-RBPCT-7,
              SPCFILE.SPC_RBREDUC_7 = :QSPC-RBREDUC-7,
              SPCFILE.SPC_RBMIN_7 = :QSPC-RBMIN-7,
              SPCFILE.SPC_RBSPOPT1_7 = :QSPC-RBSPOPT1-7,
              SPCFILE.SPC_RBSPOPT2_7 = :QSPC-RBSPOPT2-7,
              SPCFILE.SPC_RBMANAGER_7 = :QSPC-RBMANAGER-7,
              SPCFILE.SPC_RBUNITPER_CD_7 = :QSPC-RBUNITPER-CD-7,
              SPCFILE.SPC_RBFRMLA2_7 = :QSPC-RBFRMLA2-7,
              SPCFILE.SPC_RBFRMLA_8 = :QSPC-RBFRMLA-8,
              SPCFILE.SPC_RBDTE_8_1 = :QSPC-RBDTE-8-1,
              SPCFILE.SPC_RBDAYS_8_1 = :QSPC-RBDAYS-8-1,
              SPCFILE.SPC_RBYRTYPE_8_1 = :QSPC-RBYRTYPE-8-1,
              SPCFILE.SPC_RBDTE_8_2 = :QSPC-RBDTE-8-2,
              SPCFILE.SPC_RBDAYS_8_2 = :QSPC-RBDAYS-8-2,
              SPCFILE.SPC_RBYRTYPE_8_2 = :QSPC-RBYRTYPE-8-2,
              SPCFILE.SPC_RBMINRET_8 = :QSPC-RBMINRET-8,
              SPCFILE.SPC_RBNOMON_8 = :QSPC-RBNOMON-8,
              SPCFILE.SPC_RBDEDCHG_8 = :QSPC-RBDEDCHG-8,
              SPCFILE.SPC_RBRECAST_8 = :QSPC-RBRECAST-8,
              SPCFILE.SPC_RBEARLY_8 = :QSPC-RBEARLY-8,
              SPCFILE.SPC_RBDEFER_8 = :QSPC-RBDEFER-8,
              SPCFILE.SPC_RBPCT_8 = :QSPC-RBPCT-8,
              SPCFILE.SPC_RBREDUC_8 = :QSPC-RBREDUC-8,
              SPCFILE.SPC_RBMIN_8 = :QSPC-RBMIN-8,
              SPCFILE.SPC_RBSPOPT1_8 = :QSPC-RBSPOPT1-8,
              SPCFILE.SPC_RBSPOPT2_8 = :QSPC-RBSPOPT2-8,
              SPCFILE.SPC_RBMANAGER_8 = :QSPC-RBMANAGER-8,
              SPCFILE.SPC_RBUNITPER_CD_8 = :QSPC-RBUNITPER-CD-8,
              SPCFILE.SPC_RBFRMLA2_8 = :QSPC-RBFRMLA2-8,
              SPCFILE.SPC_RBFRMLA_9 = :QSPC-RBFRMLA-9,
              SPCFILE.SPC_RBDTE_9_1 = :QSPC-RBDTE-9-1,
              SPCFILE.SPC_RBDAYS_9_1 = :QSPC-RBDAYS-9-1,
              SPCFILE.SPC_RBYRTYPE_9_1 = :QSPC-RBYRTYPE-9-1,
              SPCFILE.SPC_RBDTE_9_2 = :QSPC-RBDTE-9-2,
              SPCFILE.SPC_RBDAYS_9_2 = :QSPC-RBDAYS-9-2,
              SPCFILE.SPC_RBYRTYPE_9_2 = :QSPC-RBYRTYPE-9-2,
              SPCFILE.SPC_RBMINRET_9 = :QSPC-RBMINRET-9,
              SPCFILE.SPC_RBNOMON_9 = :QSPC-RBNOMON-9,
              SPCFILE.SPC_RBDEDCHG_9 = :QSPC-RBDEDCHG-9,
              SPCFILE.SPC_RBRECAST_9 = :QSPC-RBRECAST-9,
              SPCFILE.SPC_RBEARLY_9 = :QSPC-RBEARLY-9,
              SPCFILE.SPC_RBDEFER_9 = :QSPC-RBDEFER-9,
              SPCFILE.SPC_RBPCT_9 = :QSPC-RBPCT-9,
              SPCFILE.SPC_RBREDUC_9 = :QSPC-RBREDUC-9,
              SPCFILE.SPC_RBMIN_9 = :QSPC-RBMIN-9,
              SPCFILE.SPC_RBSPOPT1_9 = :QSPC-RBSPOPT1-9,
              SPCFILE.SPC_RBSPOPT2_9 = :QSPC-RBSPOPT2-9,
              SPCFILE.SPC_RBMANAGER_9 = :QSPC-RBMANAGER-9,
              SPCFILE.SPC_RBUNITPER_CD_9 = :QSPC-RBUNITPER-CD-9,
              SPCFILE.SPC_RBFRMLA2_9 = :QSPC-RBFRMLA2-9,
              SPCFILE.SPC_RBFRMLA_10 = :QSPC-RBFRMLA-10,
              SPCFILE.SPC_RBDTE_10_1 = :QSPC-RBDTE-10-1,
              SPCFILE.SPC_RBDAYS_10_1 = :QSPC-RBDAYS-10-1,
              SPCFILE.SPC_RBYRTYPE_10_1 = :QSPC-RBYRTYPE-10-1,
              SPCFILE.SPC_RBDTE_10_2 = :QSPC-RBDTE-10-2,
              SPCFILE.SPC_RBDAYS_10_2 = :QSPC-RBDAYS-10-2,
              SPCFILE.SPC_RBYRTYPE_10_2 = :QSPC-RBYRTYPE-10-2,
              SPCFILE.SPC_RBMINRET_10 = :QSPC-RBMINRET-10,
              SPCFILE.SPC_RBNOMON_10 = :QSPC-RBNOMON-10,
              SPCFILE.SPC_RBDEDCHG_10 = :QSPC-RBDEDCHG-10,
              SPCFILE.SPC_RBRECAST_10 = :QSPC-RBRECAST-10,
              SPCFILE.SPC_RBEARLY_10 = :QSPC-RBEARLY-10,
              SPCFILE.SPC_RBDEFER_10 = :QSPC-RBDEFER-10,
              SPCFILE.SPC_RBPCT_10 = :QSPC-RBPCT-10,
              SPCFILE.SPC_RBREDUC_10 = :QSPC-RBREDUC-10,
              SPCFILE.SPC_RBMIN_10 = :QSPC-RBMIN-10,
              SPCFILE.SPC_RBSPOPT1_10 = :QSPC-RBSPOPT1-10,
              SPCFILE.SPC_RBSPOPT2_10 = :QSPC-RBSPOPT2-10,
              SPCFILE.SPC_RBMANAGER_10 = :QSPC-RBMANAGER-10,
              SPCFILE.SPC_RBUNITPER_CD_10 = :QSPC-RBUNITPER-CD-10,
              SPCFILE.SPC_RBFRMLA2_10 = :QSPC-RBFRMLA2-10,
              SPCFILE.SPC_RBFRMLA_11 = :QSPC-RBFRMLA-11,
              SPCFILE.SPC_RBDTE_11_1 = :QSPC-RBDTE-11-1,
              SPCFILE.SPC_RBDAYS_11_1 = :QSPC-RBDAYS-11-1,
              SPCFILE.SPC_RBYRTYPE_11_1 = :QSPC-RBYRTYPE-11-1,
              SPCFILE.SPC_RBDTE_11_2 = :QSPC-RBDTE-11-2,
              SPCFILE.SPC_RBDAYS_11_2 = :QSPC-RBDAYS-11-2,
              SPCFILE.SPC_RBYRTYPE_11_2 = :QSPC-RBYRTYPE-11-2,
              SPCFILE.SPC_RBMINRET_11 = :QSPC-RBMINRET-11,
              SPCFILE.SPC_RBNOMON_11 = :QSPC-RBNOMON-11,
              SPCFILE.SPC_RBDEDCHG_11 = :QSPC-RBDEDCHG-11,
              SPCFILE.SPC_RBRECAST_11 = :QSPC-RBRECAST-11,
              SPCFILE.SPC_RBEARLY_11 = :QSPC-RBEARLY-11,
              SPCFILE.SPC_RBDEFER_11 = :QSPC-RBDEFER-11,
              SPCFILE.SPC_RBPCT_11 = :QSPC-RBPCT-11,
              SPCFILE.SPC_RBREDUC_11 = :QSPC-RBREDUC-11,
              SPCFILE.SPC_RBMIN_11 = :QSPC-RBMIN-11,
              SPCFILE.SPC_RBSPOPT1_11 = :QSPC-RBSPOPT1-11,
              SPCFILE.SPC_RBSPOPT2_11 = :QSPC-RBSPOPT2-11,
              SPCFILE.SPC_RBMANAGER_11 = :QSPC-RBMANAGER-11,
              SPCFILE.SPC_RBUNITPER_CD_11 = :QSPC-RBUNITPER-CD-11,
              SPCFILE.SPC_RBFRMLA2_11 = :QSPC-RBFRMLA2-11,
              SPCFILE.SPC_RBFRMLA_12 = :QSPC-RBFRMLA-12,
              SPCFILE.SPC_RBDTE_12_1 = :QSPC-RBDTE-12-1,
              SPCFILE.SPC_RBDAYS_12_1 = :QSPC-RBDAYS-12-1,
              SPCFILE.SPC_RBYRTYPE_12_1 = :QSPC-RBYRTYPE-12-1,
              SPCFILE.SPC_RBDTE_12_2 = :QSPC-RBDTE-12-2,
              SPCFILE.SPC_RBDAYS_12_2 = :QSPC-RBDAYS-12-2,
              SPCFILE.SPC_RBYRTYPE_12_2 = :QSPC-RBYRTYPE-12-2,
              SPCFILE.SPC_RBMINRET_12 = :QSPC-RBMINRET-12,
              SPCFILE.SPC_RBNOMON_12 = :QSPC-RBNOMON-12,
              SPCFILE.SPC_RBDEDCHG_12 = :QSPC-RBDEDCHG-12,
              SPCFILE.SPC_RBRECAST_12 = :QSPC-RBRECAST-12,
              SPCFILE.SPC_RBEARLY_12 = :QSPC-RBEARLY-12,
              SPCFILE.SPC_RBDEFER_12 = :QSPC-RBDEFER-12,
              SPCFILE.SPC_RBPCT_12 = :QSPC-RBPCT-12,
              SPCFILE.SPC_RBREDUC_12 = :QSPC-RBREDUC-12,
              SPCFILE.SPC_RBMIN_12 = :QSPC-RBMIN-12,
              SPCFILE.SPC_RBSPOPT1_12 = :QSPC-RBSPOPT1-12,
              SPCFILE.SPC_RBSPOPT2_12 = :QSPC-RBSPOPT2-12,
              SPCFILE.SPC_RBMANAGER_12 = :QSPC-RBMANAGER-12,
              SPCFILE.SPC_RBUNITPER_CD_12 = :QSPC-RBUNITPER-CD-12,
              SPCFILE.SPC_RBFRMLA2_12 = :QSPC-RBFRMLA2-12,
              SPCFILE.SPC_RBFRMLA_13 = :QSPC-RBFRMLA-13,
              SPCFILE.SPC_RBDTE_13_1 = :QSPC-RBDTE-13-1,
              SPCFILE.SPC_RBDAYS_13_1 = :QSPC-RBDAYS-13-1,
              SPCFILE.SPC_RBYRTYPE_13_1 = :QSPC-RBYRTYPE-13-1,
              SPCFILE.SPC_RBDTE_13_2 = :QSPC-RBDTE-13-2,
              SPCFILE.SPC_RBDAYS_13_2 = :QSPC-RBDAYS-13-2,
              SPCFILE.SPC_RBYRTYPE_13_2 = :QSPC-RBYRTYPE-13-2,
              SPCFILE.SPC_RBMINRET_13 = :QSPC-RBMINRET-13,
              SPCFILE.SPC_RBNOMON_13 = :QSPC-RBNOMON-13,
              SPCFILE.SPC_RBDEDCHG_13 = :QSPC-RBDEDCHG-13,
              SPCFILE.SPC_RBRECAST_13 = :QSPC-RBRECAST-13,
              SPCFILE.SPC_RBEARLY_13 = :QSPC-RBEARLY-13,
              SPCFILE.SPC_RBDEFER_13 = :QSPC-RBDEFER-13,
              SPCFILE.SPC_RBPCT_13 = :QSPC-RBPCT-13,
              SPCFILE.SPC_RBREDUC_13 = :QSPC-RBREDUC-13,
              SPCFILE.SPC_RBMIN_13 = :QSPC-RBMIN-13,
              SPCFILE.SPC_RBSPOPT1_13 = :QSPC-RBSPOPT1-13,
              SPCFILE.SPC_RBSPOPT2_13 = :QSPC-RBSPOPT2-13,
              SPCFILE.SPC_RBMANAGER_13 = :QSPC-RBMANAGER-13,
              SPCFILE.SPC_RBUNITPER_CD_13 = :QSPC-RBUNITPER-CD-13,
              SPCFILE.SPC_RBFRMLA2_13 = :QSPC-RBFRMLA2-13,
              SPCFILE.SPC_RBFRMLA_14 = :QSPC-RBFRMLA-14,
              SPCFILE.SPC_RBDTE_14_1 = :QSPC-RBDTE-14-1,
              SPCFILE.SPC_RBDAYS_14_1 = :QSPC-RBDAYS-14-1,
              SPCFILE.SPC_RBYRTYPE_14_1 = :QSPC-RBYRTYPE-14-1,
              SPCFILE.SPC_RBDTE_14_2 = :QSPC-RBDTE-14-2,
              SPCFILE.SPC_RBDAYS_14_2 = :QSPC-RBDAYS-14-2,
              SPCFILE.SPC_RBYRTYPE_14_2 = :QSPC-RBYRTYPE-14-2,
              SPCFILE.SPC_RBMINRET_14 = :QSPC-RBMINRET-14,
              SPCFILE.SPC_RBNOMON_14 = :QSPC-RBNOMON-14,
              SPCFILE.SPC_RBDEDCHG_14 = :QSPC-RBDEDCHG-14,
              SPCFILE.SPC_RBRECAST_14 = :QSPC-RBRECAST-14,
              SPCFILE.SPC_RBEARLY_14 = :QSPC-RBEARLY-14,
              SPCFILE.SPC_RBDEFER_14 = :QSPC-RBDEFER-14,
              SPCFILE.SPC_RBPCT_14 = :QSPC-RBPCT-14,
              SPCFILE.SPC_RBREDUC_14 = :QSPC-RBREDUC-14,
              SPCFILE.SPC_RBMIN_14 = :QSPC-RBMIN-14,
              SPCFILE.SPC_RBSPOPT1_14 = :QSPC-RBSPOPT1-14,
              SPCFILE.SPC_RBSPOPT2_14 = :QSPC-RBSPOPT2-14,
              SPCFILE.SPC_RBMANAGER_14 = :QSPC-RBMANAGER-14,
              SPCFILE.SPC_RBUNITPER_CD_14 = :QSPC-RBUNITPER-CD-14,
              SPCFILE.SPC_RBFRMLA2_14 = :QSPC-RBFRMLA2-14,
              SPCFILE.SPC_RBFRMLA_15 = :QSPC-RBFRMLA-15,
              SPCFILE.SPC_RBDTE_15_1 = :QSPC-RBDTE-15-1,
              SPCFILE.SPC_RBDAYS_15_1 = :QSPC-RBDAYS-15-1,
              SPCFILE.SPC_RBYRTYPE_15_1 = :QSPC-RBYRTYPE-15-1,
              SPCFILE.SPC_RBDTE_15_2 = :QSPC-RBDTE-15-2,
              SPCFILE.SPC_RBDAYS_15_2 = :QSPC-RBDAYS-15-2,
              SPCFILE.SPC_RBYRTYPE_15_2 = :QSPC-RBYRTYPE-15-2,
              SPCFILE.SPC_RBMINRET_15 = :QSPC-RBMINRET-15,
              SPCFILE.SPC_RBNOMON_15 = :QSPC-RBNOMON-15,
              SPCFILE.SPC_RBDEDCHG_15 = :QSPC-RBDEDCHG-15,
              SPCFILE.SPC_RBRECAST_15 = :QSPC-RBRECAST-15,
              SPCFILE.SPC_RBEARLY_15 = :QSPC-RBEARLY-15,
              SPCFILE.SPC_RBDEFER_15 = :QSPC-RBDEFER-15,
              SPCFILE.SPC_RBPCT_15 = :QSPC-RBPCT-15,
              SPCFILE.SPC_RBREDUC_15 = :QSPC-RBREDUC-15,
              SPCFILE.SPC_RBMIN_15 = :QSPC-RBMIN-15,
              SPCFILE.SPC_RBSPOPT1_15 = :QSPC-RBSPOPT1-15,
              SPCFILE.SPC_RBSPOPT2_15 = :QSPC-RBSPOPT2-15,
              SPCFILE.SPC_RBMANAGER_15 = :QSPC-RBMANAGER-15,
              SPCFILE.SPC_RBUNITPER_CD_15 = :QSPC-RBUNITPER-CD-15,
              SPCFILE.SPC_RBFRMLA2_15 = :QSPC-RBFRMLA2-15,
              SPCFILE.SPC_RBFRMLA_16 = :QSPC-RBFRMLA-16,
              SPCFILE.SPC_RBDTE_16_1 = :QSPC-RBDTE-16-1,
              SPCFILE.SPC_RBDAYS_16_1 = :QSPC-RBDAYS-16-1,
              SPCFILE.SPC_RBYRTYPE_16_1 = :QSPC-RBYRTYPE-16-1,
              SPCFILE.SPC_RBDTE_16_2 = :QSPC-RBDTE-16-2,
              SPCFILE.SPC_RBDAYS_16_2 = :QSPC-RBDAYS-16-2,
              SPCFILE.SPC_RBYRTYPE_16_2 = :QSPC-RBYRTYPE-16-2,
              SPCFILE.SPC_RBMINRET_16 = :QSPC-RBMINRET-16,
              SPCFILE.SPC_RBNOMON_16 = :QSPC-RBNOMON-16,
              SPCFILE.SPC_RBDEDCHG_16 = :QSPC-RBDEDCHG-16,
              SPCFILE.SPC_RBRECAST_16 = :QSPC-RBRECAST-16,
              SPCFILE.SPC_RBEARLY_16 = :QSPC-RBEARLY-16,
              SPCFILE.SPC_RBDEFER_16 = :QSPC-RBDEFER-16,
              SPCFILE.SPC_RBPCT_16 = :QSPC-RBPCT-16,
              SPCFILE.SPC_RBREDUC_16 = :QSPC-RBREDUC-16,
              SPCFILE.SPC_RBMIN_16 = :QSPC-RBMIN-16,
              SPCFILE.SPC_RBSPOPT1_16 = :QSPC-RBSPOPT1-16,
              SPCFILE.SPC_RBSPOPT2_16 = :QSPC-RBSPOPT2-16,
              SPCFILE.SPC_RBMANAGER_16 = :QSPC-RBMANAGER-16,
              SPCFILE.SPC_RBUNITPER_CD_16 = :QSPC-RBUNITPER-CD-16,
              SPCFILE.SPC_RBFRMLA2_16 = :QSPC-RBFRMLA2-16,
              SPCFILE.SPC_RBFRMLA_17 = :QSPC-RBFRMLA-17,
              SPCFILE.SPC_RBDTE_17_1 = :QSPC-RBDTE-17-1,
              SPCFILE.SPC_RBDAYS_17_1 = :QSPC-RBDAYS-17-1,
              SPCFILE.SPC_RBYRTYPE_17_1 = :QSPC-RBYRTYPE-17-1,
              SPCFILE.SPC_RBDTE_17_2 = :QSPC-RBDTE-17-2,
              SPCFILE.SPC_RBDAYS_17_2 = :QSPC-RBDAYS-17-2,
              SPCFILE.SPC_RBYRTYPE_17_2 = :QSPC-RBYRTYPE-17-2,
              SPCFILE.SPC_RBMINRET_17 = :QSPC-RBMINRET-17,
              SPCFILE.SPC_RBNOMON_17 = :QSPC-RBNOMON-17,
              SPCFILE.SPC_RBDEDCHG_17 = :QSPC-RBDEDCHG-17,
              SPCFILE.SPC_RBRECAST_17 = :QSPC-RBRECAST-17,
              SPCFILE.SPC_RBEARLY_17 = :QSPC-RBEARLY-17,
              SPCFILE.SPC_RBDEFER_17 = :QSPC-RBDEFER-17,
              SPCFILE.SPC_RBPCT_17 = :QSPC-RBPCT-17,
              SPCFILE.SPC_RBREDUC_17 = :QSPC-RBREDUC-17,
              SPCFILE.SPC_RBMIN_17 = :QSPC-RBMIN-17,
              SPCFILE.SPC_RBSPOPT1_17 = :QSPC-RBSPOPT1-17,
              SPCFILE.SPC_RBSPOPT2_17 = :QSPC-RBSPOPT2-17,
              SPCFILE.SPC_RBMANAGER_17 = :QSPC-RBMANAGER-17,
              SPCFILE.SPC_RBUNITPER_CD_17 = :QSPC-RBUNITPER-CD-17,
              SPCFILE.SPC_RBFRMLA2_17 = :QSPC-RBFRMLA2-17,
              SPCFILE.SPC_RBFRMLA_18 = :QSPC-RBFRMLA-18,
              SPCFILE.SPC_RBDTE_18_1 = :QSPC-RBDTE-18-1,
              SPCFILE.SPC_RBDAYS_18_1 = :QSPC-RBDAYS-18-1,
              SPCFILE.SPC_RBYRTYPE_18_1 = :QSPC-RBYRTYPE-18-1,
              SPCFILE.SPC_RBDTE_18_2 = :QSPC-RBDTE-18-2,
              SPCFILE.SPC_RBDAYS_18_2 = :QSPC-RBDAYS-18-2,
              SPCFILE.SPC_RBYRTYPE_18_2 = :QSPC-RBYRTYPE-18-2,
              SPCFILE.SPC_RBMINRET_18 = :QSPC-RBMINRET-18,
              SPCFILE.SPC_RBNOMON_18 = :QSPC-RBNOMON-18,
              SPCFILE.SPC_RBDEDCHG_18 = :QSPC-RBDEDCHG-18,
              SPCFILE.SPC_RBRECAST_18 = :QSPC-RBRECAST-18,
              SPCFILE.SPC_RBEARLY_18 = :QSPC-RBEARLY-18,
              SPCFILE.SPC_RBDEFER_18 = :QSPC-RBDEFER-18,
              SPCFILE.SPC_RBPCT_18 = :QSPC-RBPCT-18,
              SPCFILE.SPC_RBREDUC_18 = :QSPC-RBREDUC-18,
              SPCFILE.SPC_RBMIN_18 = :QSPC-RBMIN-18,
              SPCFILE.SPC_RBSPOPT1_18 = :QSPC-RBSPOPT1-18,
              SPCFILE.SPC_RBSPOPT2_18 = :QSPC-RBSPOPT2-18,
              SPCFILE.SPC_RBMANAGER_18 = :QSPC-RBMANAGER-18,
              SPCFILE.SPC_RBUNITPER_CD_18 = :QSPC-RBUNITPER-CD-18,
              SPCFILE.SPC_RBFRMLA2_18 = :QSPC-RBFRMLA2-18,
              SPCFILE.SPC_RBFRMLA_19 = :QSPC-RBFRMLA-19,
              SPCFILE.SPC_RBDTE_19_1 = :QSPC-RBDTE-19-1,
              SPCFILE.SPC_RBDAYS_19_1 = :QSPC-RBDAYS-19-1,
              SPCFILE.SPC_RBYRTYPE_19_1 = :QSPC-RBYRTYPE-19-1,
              SPCFILE.SPC_RBDTE_19_2 = :QSPC-RBDTE-19-2,
              SPCFILE.SPC_RBDAYS_19_2 = :QSPC-RBDAYS-19-2,
              SPCFILE.SPC_RBYRTYPE_19_2 = :QSPC-RBYRTYPE-19-2,
              SPCFILE.SPC_RBMINRET_19 = :QSPC-RBMINRET-19,
              SPCFILE.SPC_RBNOMON_19 = :QSPC-RBNOMON-19,
              SPCFILE.SPC_RBDEDCHG_19 = :QSPC-RBDEDCHG-19,
              SPCFILE.SPC_RBRECAST_19 = :QSPC-RBRECAST-19,
              SPCFILE.SPC_RBEARLY_19 = :QSPC-RBEARLY-19,
              SPCFILE.SPC_RBDEFER_19 = :QSPC-RBDEFER-19,
              SPCFILE.SPC_RBPCT_19 = :QSPC-RBPCT-19,
              SPCFILE.SPC_RBREDUC_19 = :QSPC-RBREDUC-19,
              SPCFILE.SPC_RBMIN_19 = :QSPC-RBMIN-19,
              SPCFILE.SPC_RBSPOPT1_19 = :QSPC-RBSPOPT1-19,
              SPCFILE.SPC_RBSPOPT2_19 = :QSPC-RBSPOPT2-19,
              SPCFILE.SPC_RBMANAGER_19 = :QSPC-RBMANAGER-19,
              SPCFILE.SPC_RBUNITPER_CD_19 = :QSPC-RBUNITPER-CD-19,
              SPCFILE.SPC_RBFRMLA2_19 = :QSPC-RBFRMLA2-19,
              SPCFILE.SPC_RBFRMLA_20 = :QSPC-RBFRMLA-20,
              SPCFILE.SPC_RBDTE_20_1 = :QSPC-RBDTE-20-1,
              SPCFILE.SPC_RBDAYS_20_1 = :QSPC-RBDAYS-20-1,
              SPCFILE.SPC_RBYRTYPE_20_1 = :QSPC-RBYRTYPE-20-1,
              SPCFILE.SPC_RBDTE_20_2 = :QSPC-RBDTE-20-2,
              SPCFILE.SPC_RBDAYS_20_2 = :QSPC-RBDAYS-20-2,
              SPCFILE.SPC_RBYRTYPE_20_2 = :QSPC-RBYRTYPE-20-2,
              SPCFILE.SPC_RBMINRET_20 = :QSPC-RBMINRET-20,
              SPCFILE.SPC_RBNOMON_20 = :QSPC-RBNOMON-20,
              SPCFILE.SPC_RBDEDCHG_20 = :QSPC-RBDEDCHG-20,
              SPCFILE.SPC_RBRECAST_20 = :QSPC-RBRECAST-20,
              SPCFILE.SPC_RBEARLY_20 = :QSPC-RBEARLY-20,
              SPCFILE.SPC_RBDEFER_20 = :QSPC-RBDEFER-20,
              SPCFILE.SPC_RBPCT_20 = :QSPC-RBPCT-20,
              SPCFILE.SPC_RBREDUC_20 = :QSPC-RBREDUC-20,
              SPCFILE.SPC_RBMIN_20 = :QSPC-RBMIN-20,
              SPCFILE.SPC_RBSPOPT1_20 = :QSPC-RBSPOPT1-20,
              SPCFILE.SPC_RBSPOPT2_20 = :QSPC-RBSPOPT2-20,
              SPCFILE.SPC_RBMANAGER_20 = :QSPC-RBMANAGER-20,
              SPCFILE.SPC_RBUNITPER_CD_20 = :QSPC-RBUNITPER-CD-20,
              SPCFILE.SPC_RBFRMLA2_20 = :QSPC-RBFRMLA2-20,
              SPCFILE.SPC_RBFRMLA_21 = :QSPC-RBFRMLA-21,
              SPCFILE.SPC_RBDTE_21_1 = :QSPC-RBDTE-21-1,
              SPCFILE.SPC_RBDAYS_21_1 = :QSPC-RBDAYS-21-1,
              SPCFILE.SPC_RBYRTYPE_21_1 = :QSPC-RBYRTYPE-21-1,
              SPCFILE.SPC_RBDTE_21_2 = :QSPC-RBDTE-21-2,
              SPCFILE.SPC_RBDAYS_21_2 = :QSPC-RBDAYS-21-2,
              SPCFILE.SPC_RBYRTYPE_21_2 = :QSPC-RBYRTYPE-21-2,
              SPCFILE.SPC_RBMINRET_21 = :QSPC-RBMINRET-21,
              SPCFILE.SPC_RBNOMON_21 = :QSPC-RBNOMON-21,
              SPCFILE.SPC_RBDEDCHG_21 = :QSPC-RBDEDCHG-21,
              SPCFILE.SPC_RBRECAST_21 = :QSPC-RBRECAST-21,
              SPCFILE.SPC_RBEARLY_21 = :QSPC-RBEARLY-21,
              SPCFILE.SPC_RBDEFER_21 = :QSPC-RBDEFER-21,
              SPCFILE.SPC_RBPCT_21 = :QSPC-RBPCT-21,
              SPCFILE.SPC_RBREDUC_21 = :QSPC-RBREDUC-21,
              SPCFILE.SPC_RBMIN_21 = :QSPC-RBMIN-21,
              SPCFILE.SPC_RBSPOPT1_21 = :QSPC-RBSPOPT1-21,
              SPCFILE.SPC_RBSPOPT2_21 = :QSPC-RBSPOPT2-21,
              SPCFILE.SPC_RBMANAGER_21 = :QSPC-RBMANAGER-21,
              SPCFILE.SPC_RBUNITPER_CD_21 = :QSPC-RBUNITPER-CD-21,
              SPCFILE.SPC_RBFRMLA2_21 = :QSPC-RBFRMLA2-21,
              SPCFILE.SPC_RBFRMLA_22 = :QSPC-RBFRMLA-22,
              SPCFILE.SPC_RBDTE_22_1 = :QSPC-RBDTE-22-1,
              SPCFILE.SPC_RBDAYS_22_1 = :QSPC-RBDAYS-22-1,
              SPCFILE.SPC_RBYRTYPE_22_1 = :QSPC-RBYRTYPE-22-1,
              SPCFILE.SPC_RBDTE_22_2 = :QSPC-RBDTE-22-2,
              SPCFILE.SPC_RBDAYS_22_2 = :QSPC-RBDAYS-22-2,
              SPCFILE.SPC_RBYRTYPE_22_2 = :QSPC-RBYRTYPE-22-2,
              SPCFILE.SPC_RBMINRET_22 = :QSPC-RBMINRET-22,
              SPCFILE.SPC_RBNOMON_22 = :QSPC-RBNOMON-22,
              SPCFILE.SPC_RBDEDCHG_22 = :QSPC-RBDEDCHG-22,
              SPCFILE.SPC_RBRECAST_22 = :QSPC-RBRECAST-22,
              SPCFILE.SPC_RBEARLY_22 = :QSPC-RBEARLY-22,
              SPCFILE.SPC_RBDEFER_22 = :QSPC-RBDEFER-22,
              SPCFILE.SPC_RBPCT_22 = :QSPC-RBPCT-22,
              SPCFILE.SPC_RBREDUC_22 = :QSPC-RBREDUC-22,
              SPCFILE.SPC_RBMIN_22 = :QSPC-RBMIN-22,
              SPCFILE.SPC_RBSPOPT1_22 = :QSPC-RBSPOPT1-22,
              SPCFILE.SPC_RBSPOPT2_22 = :QSPC-RBSPOPT2-22,
              SPCFILE.SPC_RBMANAGER_22 = :QSPC-RBMANAGER-22,
              SPCFILE.SPC_RBUNITPER_CD_22 = :QSPC-RBUNITPER-CD-22,
              SPCFILE.SPC_RBFRMLA2_22 = :QSPC-RBFRMLA2-22,
              SPCFILE.SPC_RBCOMCD = :QSPC-RBCOMCD,
              SPCFILE.SPC_ADDON_DISFRMLA = :QSPC-ADDON-DISFRMLA,
              SPCFILE.SPC_ADDON_WHOLE_FG = :QSPC-ADDON-WHOLE-FG,
              SPCFILE.SPC_ADDON_ORG_MATURITY =
                   :QSPC-ADDON-ORG-MATURITY,
              SPCFILE.SPC_CONSOLIDATE_RT_FG =
                   :QSPC-CONSOLIDATE-RT-FG,
              SPCFILE.SPC_1STPY_ADDON_DAYS =
                   :QSPC-1STPY-ADDON-DAYS,
              SPCFILE.SPC_1STPY_ADDON_YRTYPE =
                   :QSPC-1STPY-ADDON-YRTYPE,
              SPCFILE.SPC_ADDON_RATE_FG = :QSPC-ADDON-RATE-FG,
              SPCFILE.SPC_ADDON_RATE = :QSPC-ADDON-RATE,
              SPCFILE.SPC_FEEFRMLA_1 = :QSPC-FEEFRMLA-1,
              SPCFILE.SPC_FEECD_1 = :QSPC-FEECD-1,
              SPCFILE.SPC_FEEID_1 = :QSPC-FEEID-1,
              SPCFILE.SPC_FEEFRMLA_2 = :QSPC-FEEFRMLA-2,
              SPCFILE.SPC_FEECD_2 = :QSPC-FEECD-2,
              SPCFILE.SPC_FEEID_2 = :QSPC-FEEID-2,
              SPCFILE.SPC_ROUND_PAY_FG = :QSPC-ROUND-PAY-FG,
              SPCFILE.SPC_IRREGULAR_PAY_FG =
                   :QSPC-IRREGULAR-PAY-FG,
              SPCFILE.SPC_DLRVCHGS_RB_CD_1 =
                   :QSPC-DLRVCHGS-RB-CD-1,
              SPCFILE.SPC_DLRVCHGS_RB_CD_2 =
                   :QSPC-DLRVCHGS-RB-CD-2,
              SPCFILE.SPC_DLRVCHGS_RB_CD_3 =
                   :QSPC-DLRVCHGS-RB-CD-3,
              SPCFILE.SPC_PARVHELD_RB_CD = :QSPC-PARVHELD-RB-CD,
              SPCFILE.SPC_PARVPAID_RB_CD = :QSPC-PARVPAID-RB-CD,
              SPCFILE.SPC_CONTR_CREDIT = :QSPC-CONTR-CREDIT,
              SPCFILE.SPC_CONTR_CREDIT_CD = :QSPC-CONTR-CREDIT-CD,
              SPCFILE.SPC_CONTR_CREDIT_MIN_DEL_PER =
                   :QSPC-CONTR-CREDIT-MIN-DEL-PER,
              SPCFILE.SPC_OPT_CAL_CHGABLE = :QSPC-OPT-CAL-CHGABLE,
              SPCFILE.SPC_PBDEL_DAYS = :QSPC-PBDEL-DAYS,
              SPCFILE.SPC_PBINCR_PERCENT = :QSPC-PBINCR-PERCENT,
              SPCFILE.SPC_CPOT30_CD = :QSPC-CPOT30-CD,
              SPCFILE.SPC_CPOTCHGOFF_CD = :QSPC-CPOTCHGOFF-CD,
              SPCFILE.SPC_RDPOT30_CD = :QSPC-RDPOT30-CD,
              SPCFILE.SPC_RDPOTCHGOFF_CD = :QSPC-RDPOTCHGOFF-CD,
              SPCFILE.SPC_MAX_ALLOW_DELINQ =
                   :QSPC-MAX-ALLOW-DELINQ,
              SPCFILE.SPC_RESCIND_BUS_DAYS =
                   :QSPC-RESCIND-BUS-DAYS,
              SPCFILE.SPC_RESCIND_SATURDAY =
                   :QSPC-RESCIND-SATURDAY,
              SPCFILE.SPC_MIN_CREDIT_SCORE =
                   :QSPC-MIN-CREDIT-SCORE,
              SPCFILE.SPC_DUAL_IN_BRANCH = :QSPC-DUAL-IN-BRANCH,
              SPCFILE.SPC_DUAL_IN_STATE = :QSPC-DUAL-IN-STATE,
              SPCFILE.SPC_PACESETTER_FG = :QSPC-PACESETTER-FG,
              SPCFILE.SPC_WAGE_ASSIGN_DAYS =
                   :QSPC-WAGE-ASSIGN-DAYS,
              SPCFILE.SPC_CAL_PAYMENT_ROUND_FG =
                   :QSPC-CAL-PAYMENT-ROUND-FG,
              SPCFILE.SPC_CAN_LOANS_FG = :QSPC-CAN-LOANS-FG,
              SPCFILE.SPC_ALLOW_DELINQ_POLCD =
                   :QSPC-ALLOW-DELINQ-POLCD,
              SPCFILE.SPC_YTD_MAX_ALLOW_DELINQ =
                   :QSPC-YTD-MAX-ALLOW-DELINQ,
              SPCFILE.SPC_LNCOST_FRMLA = :QSPC-LNCOST-FRMLA,
              SPCFILE.SPC_LNCOST_AMT = :QSPC-LNCOST-AMT,
              SPCFILE.SPC_DLDISC_RVPRIN1_PCNT =
                   :QSPC-DLDISC-RVPRIN1-PCNT,
              SPCFILE.SPC_RENEWABLE_PAYS = :QSPC-RENEWABLE-PAYS,
              SPCFILE.SPC_RENEWABLE_DAYS = :QSPC-RENEWABLE-DAYS,
              SPCFILE.SPC_ALLOW_LN_BACK_DATE =
                   :QSPC-ALLOW-LN-BACK-DATE,
              SPCFILE.SPC_DLDISC_RVPRIN1_AF_PCNT =
                   :QSPC-DLDISC-RVPRIN1-AF-PCNT,
              SPCFILE.SPC_CAL_MAX_AT_ESTIMATE =
                   :QSPC-CAL-MAX-AT-ESTIMATE,
              SPCFILE.SPC_INSAH_RETRO = :QSPC-INSAH-RETRO,
              SPCFILE.SPC_INSAH_DAYS_WAIT = :QSPC-INSAH-DAYS-WAIT,
              SPCFILE.SPC_ADDON_EXCEPT_FG = :QSPC-ADDON-EXCEPT-FG,
              SPCFILE.SPC_REPO_TRCD_1 = :QSPC-REPO-TRCD-1,
              SPCFILE.SPC_REPO_FMNO_1_1 = :QSPC-REPO-FMNO-1-1,
              SPCFILE.SPC_REPO_FMNO_1_2 = :QSPC-REPO-FMNO-1-2,
              SPCFILE.SPC_REPO_FMNO_1_3 = :QSPC-REPO-FMNO-1-3,
              SPCFILE.SPC_REPO_FMNO_1_4 = :QSPC-REPO-FMNO-1-4,
              SPCFILE.SPC_REPO_TRCD_2 = :QSPC-REPO-TRCD-2,
              SPCFILE.SPC_REPO_FMNO_2_1 = :QSPC-REPO-FMNO-2-1,
              SPCFILE.SPC_REPO_FMNO_2_2 = :QSPC-REPO-FMNO-2-2,
              SPCFILE.SPC_REPO_FMNO_2_3 = :QSPC-REPO-FMNO-2-3,
              SPCFILE.SPC_REPO_FMNO_2_4 = :QSPC-REPO-FMNO-2-4,
              SPCFILE.SPC_REPO_TRCD_3 = :QSPC-REPO-TRCD-3,
              SPCFILE.SPC_REPO_FMNO_3_1 = :QSPC-REPO-FMNO-3-1,
              SPCFILE.SPC_REPO_FMNO_3_2 = :QSPC-REPO-FMNO-3-2,
              SPCFILE.SPC_REPO_FMNO_3_3 = :QSPC-REPO-FMNO-3-3,
              SPCFILE.SPC_REPO_FMNO_3_4 = :QSPC-REPO-FMNO-3-4,
              SPCFILE.SPC_CANCEL_ADDON_FG = :QSPC-CANCEL-ADDON-FG,
              SPCFILE.SPC_DEFAULT_O2_INS_COMP =
                   :QSPC-DEFAULT-O2-INS-COMP,
              SPCFILE.SPC_LC_ON_JUDGEMENTS =
                   :QSPC-LC-ON-JUDGEMENTS,
              SPCFILE.SPC_DELQ_IB_AGE = :QSPC-DELQ-IB-AGE,
              SPCFILE.SPC_DELQ_IB_MAX_DAYS =
                   :QSPC-DELQ-IB-MAX-DAYS,
              SPCFILE.SPC_INSURANCE_WRITTEN =
                   :QSPC-INSURANCE-WRITTEN,
              SPCFILE.SPC_INTERIM_COUPON = :QSPC-INTERIM-COUPON,
              SPCFILE.SPC_AUTO_ASSESS_LCHG =
                   :QSPC-AUTO-ASSESS-LCHG,
              SPCFILE.SPC_MAX_CASH_PROCEEDS =
                   :QSPC-MAX-CASH-PROCEEDS,
              SPCFILE.SPC_ALLOW_ZERO_PROC = :QSPC-ALLOW-ZERO-PROC,
              SPCFILE.SPC_BANKRULE_RATE = :QSPC-BANKRULE-RATE,
              SPCFILE.SPC_AUTO_SEND_TRCD_1 =
                   :QSPC-AUTO-SEND-TRCD-1,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_1 =
                   :QSPC-AUTO-SEND-FMNO-1-1,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_2 =
                   :QSPC-AUTO-SEND-FMNO-1-2,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_3 =
                   :QSPC-AUTO-SEND-FMNO-1-3,
              SPCFILE.SPC_AUTO_SEND_FMNO_1_4 =
                   :QSPC-AUTO-SEND-FMNO-1-4,
              SPCFILE.SPC_AUTO_SEND_TRCD_2 =
                   :QSPC-AUTO-SEND-TRCD-2,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_1 =
                   :QSPC-AUTO-SEND-FMNO-2-1,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_2 =
                   :QSPC-AUTO-SEND-FMNO-2-2,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_3 =
                   :QSPC-AUTO-SEND-FMNO-2-3,
              SPCFILE.SPC_AUTO_SEND_FMNO_2_4 =
                   :QSPC-AUTO-SEND-FMNO-2-4,
              SPCFILE.SPC_DLDISC_CONV_BF_PCNT =
                   :QSPC-DLDISC-CONV-BF-PCNT,
              SPCFILE.SPC_UNITPER_CD = :QSPC-UNITPER-CD,
              SPCFILE.SPC_RENEWAL_EDIT = :QSPC-RENEWAL-EDIT,
              SPCFILE.SPC_ROUND_MFEE = :QSPC-ROUND-MFEE,
              SPCFILE.SPC_ADV_TO_1ST_NO_CORR =
                   :QSPC-ADV-TO-1ST-NO-CORR,
              SPCFILE.SPC_LC_INT_ON_REPO_NON_PL =
                   :QSPC-LC-INT-ON-REPO-NON-PL,
              SPCFILE.SPC_CONTRACTUAL_SET_NONACCRUAL =
                   :QSPC-CONTRACTUAL-SET-NONACCRUAL,
              SPCFILE.SPC_CONTRACTUAL_RESET_ACCRUAL =
                   :QSPC-CONTRACTUAL-RESET-ACCRUAL,
              SPCFILE.SPC_MONTHS_PAY_NAPP_COUNTER =
                   :QSPC-MONTHS-PAY-NAPP-COUNTER,
              SPCFILE.SPC_SHORT_PAY_THRESHOLD =
                   :QSPC-SHORT-PAY-THRESHOLD,
              SPCFILE.SPC_CASH_AVAIL_PERCENT =
                   :QSPC-CASH-AVAIL-PERCENT,
              SPCFILE.SPC_O1_JOINT_FG = :QSPC-O1-JOINT-FG,
              SPCFILE.SPC_NET_BAL_REQ = :QSPC-NET-BAL-REQ,
              SPCFILE.SPC_AMT_PROCEEDS_REQ =
                   :QSPC-AMT-PROCEEDS-REQ,
              SPCFILE.SPC_ALT_PREPAY_MONTHS =
                   :QSPC-ALT-PREPAY-MONTHS,
              SPCFILE.SPC_PERCENT_REGPAY_AVAIL =
                   :QSPC-PERCENT-REGPAY-AVAIL,
              SPCFILE.SPC_ALT_DEFFRMLA = :QSPC-ALT-DEFFRMLA,
              SPCFILE.SPC_ALT_DEFMIN = :QSPC-ALT-DEFMIN,
              SPCFILE.SPC_ALT_DEFMAX = :QSPC-ALT-DEFMAX,
              SPCFILE.SPC_NON_LOAN_FLAG = :QSPC-NON-LOAN-FLAG,
              SPCFILE.SPC_SKIP_TRW = :QSPC-SKIP-TRW
            WHERE SPCFILE.SPC_ORGST = :QSPC-ORGST
              AND SPCFILE.SPC_SPRCLASS = :QSPC-SPRCLASS
              AND SPCFILE.SPC_SUBCLASS = :QSPC-SUBCLASS
              AND SPCFILE.SPC_LAWCODE = :QSPC-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO REWRITE-SPC1-FILE.

      *    IF ( IO-FG = 0 )
      *       EXEC SQL COMMIT END-EXEC
      *       PERFORM SQL-IO-VALIDATION.

      *-----------------------------------------------------------------
       DELETE-SPC1-FILE.

           PERFORM DELETE-IT.
           MOVE SPC-PATH-SQL TO E-FILE.
           MOVE SPC1-KEY TO E-KEYX.
           PERFORM SET-SPC-FIELDS.

           EXEC SQL
            DELETE FROM DBO.SPCFILE
            WHERE SPCFILE.SPC_ORGST = :QSPC-ORGST
              AND SPCFILE.SPC_SPRCLASS = :QSPC-SPRCLASS
              AND SPCFILE.SPC_SUBCLASS = :QSPC-SUBCLASS
              AND SPCFILE.SPC_LAWCODE = :QSPC-LAWCODE 
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *> LOCKED
              GO TO DELETE-SPC1-FILE.

      *-----------------------------------------------------------------
       CLOSE-SPC1-FILE.

