      * COPYMEMBER: LIBLP/LPSPGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - SPFILE (SPAFILE, SPBFILE, SPCFILE)
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD SPA-REC FROM QSPA-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-SPA-FIELDS.
           MOVE QSPA-ORGST TO SPA-ORGST.
           MOVE QSPA-SPRCLASS TO SPA-SPRCLASS.
           MOVE QSPA-SUBCLASS TO SPA-SUBCLASS.
           MOVE QSPA-LAWCODE TO SPA-LAWCODE.

           IF ( QSPA-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO SPA-LTOUCH-DATE
           ELSE
              MOVE QSPA-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO SPA-LTOUCH-DATE.

           MOVE QSPA-DESC TO SPA-DESC.
           MOVE QSPA-NOTES TO SPA-NOTES.

           IF ( QSPA-EFFDATE = "1900-01-01" )
              MOVE ZEROES TO SPA-EFFDATE
           ELSE
              MOVE QSPA-EFFDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO SPA-EFFDATE.


           IF ( QSPA-EXPDATE = "1900-01-01" )
              MOVE ZEROES TO SPA-EXPDATE
           ELSE
              MOVE QSPA-EXPDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO SPA-EXPDATE.

           MOVE QSPA-EXPD-MONTHS TO SPA-EXPD-MONTHS.
           MOVE QSPA-EXPD-DAYS TO SPA-EXPD-DAYS.
           MOVE QSPA-EXPD-FRMLA TO SPA-EXPD-FRMLA.
           MOVE QSPA-EXPD-EXCEPT TO SPA-EXPD-EXCEPT.
           MOVE QSPA-EXPR-FRMLA TO SPA-EXPR-FRMLA.
           MOVE QSPA-EXPR-REDU-FRMLA TO SPA-EXPR-REDU-FRMLA.
           MOVE QSPA-EXPR-RATE-1 TO SPA-EXPR-RATE(1).
           MOVE QSPA-EXPR-BREAK-1 TO SPA-EXPR-BREAK(1).
           MOVE QSPA-EXPR-YRTYPE-1 TO SPA-EXPR-YRTYPE(1).
           MOVE QSPA-EXPR-INTMETH-1 TO SPA-EXPR-INTMETH(1).
           MOVE QSPA-EXPR-RATE-2 TO SPA-EXPR-RATE(2).
           MOVE QSPA-EXPR-BREAK-2 TO SPA-EXPR-BREAK(2).
           MOVE QSPA-EXPR-YRTYPE-2 TO SPA-EXPR-YRTYPE(2).
           MOVE QSPA-EXPR-INTMETH-2 TO SPA-EXPR-INTMETH(2).
           MOVE QSPA-EXPR-RATE-3 TO SPA-EXPR-RATE(3).
           MOVE QSPA-EXPR-BREAK-3 TO SPA-EXPR-BREAK(3).
           MOVE QSPA-EXPR-YRTYPE-3 TO SPA-EXPR-YRTYPE(3).
           MOVE QSPA-EXPR-INTMETH-3 TO SPA-EXPR-INTMETH(3).
           MOVE QSPA-EXPR-RATE-4 TO SPA-EXPR-RATE(4).
           MOVE QSPA-EXPR-BREAK-4 TO SPA-EXPR-BREAK(4).
           MOVE QSPA-EXPR-YRTYPE-4 TO SPA-EXPR-YRTYPE(4).
           MOVE QSPA-EXPR-INTMETH-4 TO SPA-EXPR-INTMETH(4).
           MOVE QSPA-EXPR-RATE-5 TO SPA-EXPR-RATE(5).
           MOVE QSPA-EXPR-BREAK-5 TO SPA-EXPR-BREAK(5).
           MOVE QSPA-EXPR-YRTYPE-5 TO SPA-EXPR-YRTYPE(5).
           MOVE QSPA-EXPR-INTMETH-5 TO SPA-EXPR-INTMETH(5).
           MOVE QSPA-EXPR-LCHG TO SPA-EXPR-LCHG.
           MOVE QSPA-JUDGFRMLA TO SPA-JUDGFRMLA.
           MOVE QSPA-JUDGRATE TO SPA-JUDGRATE.
           MOVE QSPA-JUDGYRTYPE TO SPA-JUDGYRTYPE.
           MOVE QSPA-JUDGINTMETH TO SPA-JUDGINTMETH.
           MOVE QSPA-ACC-FRMLA TO SPA-ACC-FRMLA.
           MOVE QSPA-ACC-YRTYPE TO SPA-ACC-YRTYPE.
           MOVE QSPA-ACC-INTMETH TO SPA-ACC-INTMETH.
           MOVE QSPA-ACC-RATE-1 TO SPA-ACC-RATE(1).
           MOVE QSPA-ACC-BREAK-1 TO SPA-ACC-BREAK(1).
           MOVE QSPA-ACC-RATE-2 TO SPA-ACC-RATE(2).
           MOVE QSPA-ACC-BREAK-2 TO SPA-ACC-BREAK(2).
           MOVE QSPA-ACC-RATE-3 TO SPA-ACC-RATE(3).
           MOVE QSPA-ACC-BREAK-3 TO SPA-ACC-BREAK(3).
           MOVE QSPA-ACC-RATE-4 TO SPA-ACC-RATE(4).
           MOVE QSPA-ACC-BREAK-4 TO SPA-ACC-BREAK(4).
           MOVE QSPA-ACC-RATE-5 TO SPA-ACC-RATE(5).
           MOVE QSPA-ACC-BREAK-5 TO SPA-ACC-BREAK(5).
           MOVE QSPA-1098FRMLA TO SPA-1098FRMLA.
           MOVE QSPA-DISFRMLA TO SPA-DISFRMLA.
           MOVE QSPA-CONTRFRMLA TO SPA-CONTRFRMLA.
           MOVE QSPA-BANKRULE TO SPA-BANKRULE.
           MOVE QSPA-CONTPDTH TO SPA-CONTPDTH.
           MOVE QSPA-FINCHG TO SPA-FINCHG.
           MOVE QSPA-BANKUNITPER-CD TO SPA-BANKUNITPER-CD.
           MOVE QSPA-TRWBANKRULE TO SPA-TRWBANKRULE.
           MOVE QSPA-TRWCONTPDTH TO SPA-TRWCONTPDTH.
           MOVE QSPA-TRWBANKUNITPER-CD TO SPA-TRWBANKUNITPER-CD.
           MOVE QSPA-RECFRMLA TO SPA-RECFRMLA.
           MOVE QSPA-RECPAYCD TO SPA-RECPAYCD.
           MOVE QSPA-RECPDTH TO SPA-RECPDTH.
           MOVE QSPA-DISFRMLA-SPAY-FG TO SPA-DISFRMLA-SPAY-FG.
           MOVE QSPA-ERNFRMLA-1 TO SPA-ERNFRMLA(1).
           MOVE QSPA-ERNAMT-1 TO SPA-ERNAMT(1).
           MOVE QSPA-ERNPERCT-1 TO SPA-ERNPERCT(1).
           MOVE QSPA-ERNPERCD-1 TO SPA-ERNPERCD(1).
           MOVE QSPA-ERNACCRL-FG-1 TO SPA-ERNACCRL-FG(1).
           MOVE QSPA-ERNACCRL-START-CD-1 TO SPA-ERNACCRL-START-CD(1).
           MOVE QSPA-ERNACCRL-DFCD-1 TO SPA-ERNACCRL-DFCD(1).
           MOVE QSPA-ERN-DAYS-1 TO SPA-ERN-DAYS(1).
           MOVE QSPA-ERN-TERM-1 TO SPA-ERN-TERM(1).
           MOVE QSPA-ERN-TYPE-1 TO SPA-ERN-TYPE(1).
           MOVE QSPA-ERNFRMLA-2 TO SPA-ERNFRMLA(2).
           MOVE QSPA-ERNAMT-2 TO SPA-ERNAMT(2).
           MOVE QSPA-ERNPERCT-2 TO SPA-ERNPERCT(2).
           MOVE QSPA-ERNPERCD-2 TO SPA-ERNPERCD(2).
           MOVE QSPA-ERNACCRL-FG-2 TO SPA-ERNACCRL-FG(2).
           MOVE QSPA-ERNACCRL-START-CD-2 TO SPA-ERNACCRL-START-CD(2).
           MOVE QSPA-ERNACCRL-DFCD-2 TO SPA-ERNACCRL-DFCD(2).
           MOVE QSPA-ERN-DAYS-2 TO SPA-ERN-DAYS(2).
           MOVE QSPA-ERN-TERM-2 TO SPA-ERN-TERM(2).
           MOVE QSPA-ERN-TYPE-2 TO SPA-ERN-TYPE(2).
           MOVE QSPA-ERNFRMLA-3 TO SPA-ERNFRMLA(3).
           MOVE QSPA-ERNAMT-3 TO SPA-ERNAMT(3).
           MOVE QSPA-ERNPERCT-3 TO SPA-ERNPERCT(3).
           MOVE QSPA-ERNPERCD-3 TO SPA-ERNPERCD(3).
           MOVE QSPA-ERNACCRL-FG-3 TO SPA-ERNACCRL-FG(3).
           MOVE QSPA-ERNACCRL-START-CD-3 TO SPA-ERNACCRL-START-CD(3).
           MOVE QSPA-ERNACCRL-DFCD-3 TO SPA-ERNACCRL-DFCD(3).
           MOVE QSPA-ERN-DAYS-3 TO SPA-ERN-DAYS(3).
           MOVE QSPA-ERN-TERM-3 TO SPA-ERN-TERM(3).
           MOVE QSPA-ERN-TYPE-3 TO SPA-ERN-TYPE(3).
           MOVE QSPA-ERNFRMLA-4 TO SPA-ERNFRMLA(4).
           MOVE QSPA-ERNAMT-4 TO SPA-ERNAMT(4).
           MOVE QSPA-ERNPERCT-4 TO SPA-ERNPERCT(4).
           MOVE QSPA-ERNPERCD-4 TO SPA-ERNPERCD(4).
           MOVE QSPA-ERNACCRL-FG-4 TO SPA-ERNACCRL-FG(4).
           MOVE QSPA-ERNACCRL-START-CD-4 TO SPA-ERNACCRL-START-CD(4).
           MOVE QSPA-ERNACCRL-DFCD-4 TO SPA-ERNACCRL-DFCD(4).
           MOVE QSPA-ERN-DAYS-4 TO SPA-ERN-DAYS(4).
           MOVE QSPA-ERN-TERM-4 TO SPA-ERN-TERM(4).
           MOVE QSPA-ERN-TYPE-4 TO SPA-ERN-TYPE(4).
           MOVE QSPA-ERNFRMLA-5 TO SPA-ERNFRMLA(5).
           MOVE QSPA-ERNAMT-5 TO SPA-ERNAMT(5).
           MOVE QSPA-ERNPERCT-5 TO SPA-ERNPERCT(5).
           MOVE QSPA-ERNPERCD-5 TO SPA-ERNPERCD(5).
           MOVE QSPA-ERNACCRL-FG-5 TO SPA-ERNACCRL-FG(5).
           MOVE QSPA-ERNACCRL-START-CD-5 TO SPA-ERNACCRL-START-CD(5).
           MOVE QSPA-ERNACCRL-DFCD-5 TO SPA-ERNACCRL-DFCD(5).
           MOVE QSPA-ERN-DAYS-5 TO SPA-ERN-DAYS(5).
           MOVE QSPA-ERN-TERM-5 TO SPA-ERN-TERM(5).
           MOVE QSPA-ERN-TYPE-5 TO SPA-ERN-TYPE(5).
           MOVE QSPA-ERNFRMLA-6 TO SPA-ERNFRMLA(6).
           MOVE QSPA-ERNAMT-6 TO SPA-ERNAMT(6).
           MOVE QSPA-ERNPERCT-6 TO SPA-ERNPERCT(6).
           MOVE QSPA-ERNPERCD-6 TO SPA-ERNPERCD(6).
           MOVE QSPA-ERNACCRL-FG-6 TO SPA-ERNACCRL-FG(6).
           MOVE QSPA-ERNACCRL-START-CD-6 TO SPA-ERNACCRL-START-CD(6).
           MOVE QSPA-ERNACCRL-DFCD-6 TO SPA-ERNACCRL-DFCD(6).
           MOVE QSPA-ERN-DAYS-6 TO SPA-ERN-DAYS(6).
           MOVE QSPA-ERN-TERM-6 TO SPA-ERN-TERM(6).
           MOVE QSPA-ERN-TYPE-6 TO SPA-ERN-TYPE(6).
           MOVE QSPA-ERNFRMLA-7 TO SPA-ERNFRMLA(7).
           MOVE QSPA-ERNAMT-7 TO SPA-ERNAMT(7).
           MOVE QSPA-ERNPERCT-7 TO SPA-ERNPERCT(7).
           MOVE QSPA-ERNPERCD-7 TO SPA-ERNPERCD(7).
           MOVE QSPA-ERNACCRL-FG-7 TO SPA-ERNACCRL-FG(7).
           MOVE QSPA-ERNACCRL-START-CD-7 TO SPA-ERNACCRL-START-CD(7).
           MOVE QSPA-ERNACCRL-DFCD-7 TO SPA-ERNACCRL-DFCD(7).
           MOVE QSPA-ERN-DAYS-7 TO SPA-ERN-DAYS(7).
           MOVE QSPA-ERN-TERM-7 TO SPA-ERN-TERM(7).
           MOVE QSPA-ERN-TYPE-7 TO SPA-ERN-TYPE(7).
           MOVE QSPA-ERNFRMLA-8 TO SPA-ERNFRMLA(8).
           MOVE QSPA-ERNAMT-8 TO SPA-ERNAMT(8).
           MOVE QSPA-ERNPERCT-8 TO SPA-ERNPERCT(8).
           MOVE QSPA-ERNPERCD-8 TO SPA-ERNPERCD(8).
           MOVE QSPA-ERNACCRL-FG-8 TO SPA-ERNACCRL-FG(8).
           MOVE QSPA-ERNACCRL-START-CD-8 TO SPA-ERNACCRL-START-CD(8).
           MOVE QSPA-ERNACCRL-DFCD-8 TO SPA-ERNACCRL-DFCD(8).
           MOVE QSPA-ERN-DAYS-8 TO SPA-ERN-DAYS(8).
           MOVE QSPA-ERN-TERM-8 TO SPA-ERN-TERM(8).
           MOVE QSPA-ERN-TYPE-8 TO SPA-ERN-TYPE(8).
           MOVE QSPA-ERNFRMLA-9 TO SPA-ERNFRMLA(9).
           MOVE QSPA-ERNAMT-9 TO SPA-ERNAMT(9).
           MOVE QSPA-ERNPERCT-9 TO SPA-ERNPERCT(9).
           MOVE QSPA-ERNPERCD-9 TO SPA-ERNPERCD(9).
           MOVE QSPA-ERNACCRL-FG-9 TO SPA-ERNACCRL-FG(9).
           MOVE QSPA-ERNACCRL-START-CD-9 TO SPA-ERNACCRL-START-CD(9).
           MOVE QSPA-ERNACCRL-DFCD-9 TO SPA-ERNACCRL-DFCD(9).
           MOVE QSPA-ERN-DAYS-9 TO SPA-ERN-DAYS(9).
           MOVE QSPA-ERN-TERM-9 TO SPA-ERN-TERM(9).
           MOVE QSPA-ERN-TYPE-9 TO SPA-ERN-TYPE(9).
           MOVE QSPA-ERNFRMLA-10 TO SPA-ERNFRMLA(10).
           MOVE QSPA-ERNAMT-10 TO SPA-ERNAMT(10).
           MOVE QSPA-ERNPERCT-10 TO SPA-ERNPERCT(10).
           MOVE QSPA-ERNPERCD-10 TO SPA-ERNPERCD(10).
           MOVE QSPA-ERNACCRL-FG-10 TO SPA-ERNACCRL-FG(10).
           MOVE QSPA-ERNACCRL-START-CD-10 TO SPA-ERNACCRL-START-CD(10).
           MOVE QSPA-ERNACCRL-DFCD-10 TO SPA-ERNACCRL-DFCD(10).
           MOVE QSPA-ERN-DAYS-10 TO SPA-ERN-DAYS(10).
           MOVE QSPA-ERN-TERM-10 TO SPA-ERN-TERM(10).
           MOVE QSPA-ERN-TYPE-10 TO SPA-ERN-TYPE(10).
           MOVE QSPA-ERNACCEL-CD TO SPA-ERNACCEL-CD.
           MOVE QSPA-ERNJD-CD TO SPA-ERNJD-CD.
           MOVE QSPA-MIDSTRERNCD TO SPA-MIDSTRERNCD.
           MOVE QSPA-EARN-ORDER-1 TO SPA-EARN-ORDER(1).
           MOVE QSPA-EARN-ORDER-2 TO SPA-EARN-ORDER(2).
           MOVE QSPA-EARN-ORDER-3 TO SPA-EARN-ORDER(3).
           MOVE QSPA-EARN-ORDER-4 TO SPA-EARN-ORDER(4).
           MOVE QSPA-EARN-ORDER-5 TO SPA-EARN-ORDER(5).
           MOVE QSPA-EARN-ORDER-6 TO SPA-EARN-ORDER(6).
           MOVE QSPA-EARN-ORDER-7 TO SPA-EARN-ORDER(7).
           MOVE QSPA-EARN-ORDER-8 TO SPA-EARN-ORDER(8).
           MOVE QSPA-EARN-ORDER-9 TO SPA-EARN-ORDER(9).
           MOVE QSPA-EARN-ORDER-10 TO SPA-EARN-ORDER(10).
           MOVE QSPA-ERNDELQFRMLA TO SPA-ERNDELQFRMLA.
           MOVE QSPA-ERNDELQ-START TO SPA-ERNDELQ-START.
           MOVE QSPA-ERNDELQ-STOP TO SPA-ERNDELQ-STOP.
           MOVE QSPA-1098-INC-LC TO SPA-1098-INC-LC.
           MOVE QSPA-MAX-IB-ACR-DAYS TO SPA-MAX-IB-ACR-DAYS.
           MOVE QSPA-LCGRACE TO SPA-LCGRACE.
           MOVE QSPA-LCGRACECD TO SPA-LCGRACECD.
           MOVE QSPA-LCTYPE TO SPA-LCTYPE.
           MOVE QSPA-LCRATE TO SPA-LCRATE.
           MOVE QSPA-LCFRMLA TO SPA-LCFRMLA.
           MOVE QSPA-LCMINCHG TO SPA-LCMINCHG.
           MOVE QSPA-LCMAXAMT TO SPA-LCMAXAMT.
           MOVE QSPA-LCDELFAC TO SPA-LCDELFAC.
           MOVE QSPA-LCYRTYPE TO SPA-LCYRTYPE.
           MOVE QSPA-LC-CODE TO SPA-LC-CODE.
           MOVE QSPA-LCUNITPER-CD TO SPA-LCUNITPER-CD.
           MOVE QSPA-DEFFRMLA TO SPA-DEFFRMLA.
           MOVE QSPA-DEFEXCEPT TO SPA-DEFEXCEPT.
           MOVE QSPA-DEFWORKER TO SPA-DEFWORKER.
           MOVE QSPA-DEFPERCD TO SPA-DEFPERCD.
           MOVE QSPA-DEFBASE TO SPA-DEFBASE.
           MOVE QSPA-DEFPOLCD TO SPA-DEFPOLCD.
           MOVE QSPA-DEFPOLMX-1 TO SPA-DEFPOLMX(1).
           MOVE QSPA-DEFPOLMX-2 TO SPA-DEFPOLMX(2).
           MOVE QSPA-DEFPOLMX-3 TO SPA-DEFPOLMX(3).
           MOVE QSPA-DEFMIN TO SPA-DEFMIN.
           MOVE QSPA-DEFMAX TO SPA-DEFMAX.
           MOVE QSPA-DEFUNITPER-CD TO SPA-DEFUNITPER-CD.
           MOVE QSPA-PRFORM-1 TO SPA-PRFORM(1).
           MOVE QSPA-PRFLAG-1 TO SPA-PRFLAG(1).
           MOVE QSPA-PRFORM-2 TO SPA-PRFORM(2).
           MOVE QSPA-PRFLAG-2 TO SPA-PRFLAG(2).
           MOVE QSPA-PRFORM-3 TO SPA-PRFORM(3).
           MOVE QSPA-PRFLAG-3 TO SPA-PRFLAG(3).
           MOVE QSPA-PRFORM-4 TO SPA-PRFORM(4).
           MOVE QSPA-PRFLAG-4 TO SPA-PRFLAG(4).
           MOVE QSPA-PRFORM-5 TO SPA-PRFORM(5).
           MOVE QSPA-PRFLAG-5 TO SPA-PRFLAG(5).
           MOVE QSPA-PRFORM-6 TO SPA-PRFORM(6).
           MOVE QSPA-PRFLAG-6 TO SPA-PRFLAG(6).
           MOVE QSPA-PRFORM-7 TO SPA-PRFORM(7).
           MOVE QSPA-PRFLAG-7 TO SPA-PRFLAG(7).
           MOVE QSPA-PRFORM-8 TO SPA-PRFORM(8).
           MOVE QSPA-PRFLAG-8 TO SPA-PRFLAG(8).
           MOVE QSPA-PRFORM-9 TO SPA-PRFORM(9).
           MOVE QSPA-PRFLAG-9 TO SPA-PRFLAG(9).
           MOVE QSPA-PRFORM-10 TO SPA-PRFORM(10).
           MOVE QSPA-PRFLAG-10 TO SPA-PRFLAG(10).
           MOVE QSPA-PRFORM-11 TO SPA-PRFORM(11).
           MOVE QSPA-PRFLAG-11 TO SPA-PRFLAG(11).
           MOVE QSPA-PRFORM-12 TO SPA-PRFORM(12).
           MOVE QSPA-PRFLAG-12 TO SPA-PRFLAG(12).
           MOVE QSPA-PRFORM-13 TO SPA-PRFORM(13).
           MOVE QSPA-PRFLAG-13 TO SPA-PRFLAG(13).
           MOVE QSPA-PRFORM-14 TO SPA-PRFORM(14).
           MOVE QSPA-PRFLAG-14 TO SPA-PRFLAG(14).
           MOVE QSPA-PRFORM-15 TO SPA-PRFORM(15).
           MOVE QSPA-PRFLAG-15 TO SPA-PRFLAG(15).
           MOVE QSPA-PRFORM-16 TO SPA-PRFORM(16).
           MOVE QSPA-PRFLAG-16 TO SPA-PRFLAG(16).
           MOVE QSPA-PRFORM-17 TO SPA-PRFORM(17).
           MOVE QSPA-PRFLAG-17 TO SPA-PRFLAG(17).
           MOVE QSPA-PRFORM-18 TO SPA-PRFORM(18).
           MOVE QSPA-PRFLAG-18 TO SPA-PRFLAG(18).
           MOVE QSPA-PRFORM-19 TO SPA-PRFORM(19).
           MOVE QSPA-PRFLAG-19 TO SPA-PRFLAG(19).
           MOVE QSPA-PRFORM-20 TO SPA-PRFORM(20).
           MOVE QSPA-PRFLAG-20 TO SPA-PRFLAG(20).
           MOVE QSPA-IMED-REC TO SPA-IMED-REC.
           MOVE QSPA-SCFRMLA TO SPA-SCFRMLA.
           MOVE QSPA-SCRATE TO SPA-SCRATE.
           MOVE QSPA-SCMIN TO SPA-SCMIN.
           MOVE QSPA-SCMAX TO SPA-SCMAX.
           MOVE QSPA-MFFRMLA TO SPA-MFFRMLA.
           MOVE QSPA-MFRATE TO SPA-MFRATE.
           MOVE QSPA-MFMIN TO SPA-MFMIN.
           MOVE QSPA-MFMAX TO SPA-MFMAX.
           MOVE QSPA-INTMETHOD TO SPA-INTMETHOD.
           MOVE QSPA-YEARTYPE TO SPA-YEARTYPE.
           MOVE QSPA-PYEXFRMLA TO SPA-PYEXFRMLA.
           MOVE QSPA-PYEXSPCODE TO SPA-PYEXSPCODE.
           MOVE QSPA-PYEXYEARTP TO SPA-PYEXYEARTP.
           MOVE QSPA-PYEXFMDATE TO SPA-PYEXFMDATE.
           MOVE QSPA-PYEXBASECD TO SPA-PYEXBASECD.
           MOVE QSPA-PYEXBASE TO SPA-PYEXBASE.
           MOVE QSPA-PYEXDAYS TO SPA-PYEXDAYS.
           MOVE QSPA-CAL-SPFRMLA TO SPA-CAL-SPFRMLA.
           MOVE QSPA-CAL-RATETYPE-1 TO SPA-CAL-RATETYPE(1).
           MOVE QSPA-CAL-BREAKTYPE-1 TO SPA-CAL-BREAKTYPE(1).
           MOVE QSPA-CAL-CHGABLE-1 TO SPA-CAL-CHGABLE(1).
           MOVE QSPA-CAL-NORATES-1 TO SPA-CAL-NORATES(1).
           MOVE QSPA-CAL-TBFRMLA-1 TO SPA-CAL-TBFRMLA(1).
           MOVE QSPA-CAL-RATE-1-1 TO SPA-CAL-RATE(1 1).
           MOVE QSPA-CAL-BREAK-1-1 TO SPA-CAL-BREAK(1 1).
           MOVE QSPA-CAL-RATE-1-2 TO SPA-CAL-RATE(1 2).
           MOVE QSPA-CAL-BREAK-1-2 TO SPA-CAL-BREAK(1 2).
           MOVE QSPA-CAL-RATE-1-3 TO SPA-CAL-RATE(1 3).
           MOVE QSPA-CAL-BREAK-1-3 TO SPA-CAL-BREAK(1 3).
           MOVE QSPA-CAL-RATE-1-4 TO SPA-CAL-RATE(1 4).
           MOVE QSPA-CAL-BREAK-1-4 TO SPA-CAL-BREAK(1 4).
           MOVE QSPA-CAL-RATE-1-5 TO SPA-CAL-RATE(1 5).
           MOVE QSPA-CAL-BREAK-1-5 TO SPA-CAL-BREAK(1 5).
           MOVE QSPA-CAL-RATETYPE-2 TO SPA-CAL-RATETYPE(2).
           MOVE QSPA-CAL-BREAKTYPE-2 TO SPA-CAL-BREAKTYPE(2).
           MOVE QSPA-CAL-CHGABLE-2 TO SPA-CAL-CHGABLE(2).
           MOVE QSPA-CAL-NORATES-2 TO SPA-CAL-NORATES(2).
           MOVE QSPA-CAL-TBFRMLA-2 TO SPA-CAL-TBFRMLA(2).
           MOVE QSPA-CAL-RATE-2-1 TO SPA-CAL-RATE(2 1).
           MOVE QSPA-CAL-BREAK-2-1 TO SPA-CAL-BREAK(2 1).
           MOVE QSPA-CAL-RATE-2-2 TO SPA-CAL-RATE(2 2).
           MOVE QSPA-CAL-BREAK-2-2 TO SPA-CAL-BREAK(2 2).
           MOVE QSPA-CAL-RATE-2-3 TO SPA-CAL-RATE(2 3).
           MOVE QSPA-CAL-BREAK-2-3 TO SPA-CAL-BREAK(2 3).
           MOVE QSPA-CAL-RATE-2-4 TO SPA-CAL-RATE(2 4).
           MOVE QSPA-CAL-BREAK-2-4 TO SPA-CAL-BREAK(2 4).
           MOVE QSPA-CAL-RATE-2-5 TO SPA-CAL-RATE(2 5).
           MOVE QSPA-CAL-BREAK-2-5 TO SPA-CAL-BREAK(2 5).
           MOVE QSPA-MINSF-FRMLA TO SPA-MINSF-FRMLA.
           MOVE QSPA-MINSF-CHG TO SPA-MINSF-CHG.
           MOVE QSPA-MAXAPR-FRMLA TO SPA-MAXAPR-FRMLA.
           MOVE QSPA-EDT-NOEDITS-1 TO SPA-EDT-NOEDITS(1).
           MOVE QSPA-EDT-TYPE-1-1 TO SPA-EDT-TYPE(1 1).
           MOVE QSPA-EDT-HL-1-1 TO SPA-EDT-HL(1 1).
           MOVE QSPA-EDT-COLL-1-1 TO SPA-EDT-COLL(1 1).
           MOVE QSPA-EDT-CD-1-1 TO SPA-EDT-CD(1 1).
           MOVE QSPA-EDT-RATE-1-1 TO SPA-EDT-RATE(1 1).
           MOVE QSPA-EDT-RATETYPE-1-1 TO SPA-EDT-RATETYPE(1 1).
           MOVE QSPA-EDT-AMT-1-1 TO SPA-EDT-AMT(1 1).
           MOVE QSPA-EDT-AMTYPE-1-1 TO SPA-EDT-AMTYPE(1 1).
           MOVE QSPA-EDT-TERM-1-1 TO SPA-EDT-TERM(1 1).
           MOVE QSPA-EDT-TYPE-1-2 TO SPA-EDT-TYPE(1 2).
           MOVE QSPA-EDT-HL-1-2 TO SPA-EDT-HL(1 2).
           MOVE QSPA-EDT-COLL-1-2 TO SPA-EDT-COLL(1 2).
           MOVE QSPA-EDT-CD-1-2 TO SPA-EDT-CD(1 2).
           MOVE QSPA-EDT-RATE-1-2 TO SPA-EDT-RATE(1 2).
           MOVE QSPA-EDT-RATETYPE-1-2 TO SPA-EDT-RATETYPE(1 2).
           MOVE QSPA-EDT-AMT-1-2 TO SPA-EDT-AMT(1 2).
           MOVE QSPA-EDT-AMTYPE-1-2 TO SPA-EDT-AMTYPE(1 2).
           MOVE QSPA-EDT-TERM-1-2 TO SPA-EDT-TERM(1 2).
           MOVE QSPA-EDT-TYPE-1-3 TO SPA-EDT-TYPE(1 3).
           MOVE QSPA-EDT-HL-1-3 TO SPA-EDT-HL(1 3).
           MOVE QSPA-EDT-COLL-1-3 TO SPA-EDT-COLL(1 3).
           MOVE QSPA-EDT-CD-1-3 TO SPA-EDT-CD(1 3).
           MOVE QSPA-EDT-RATE-1-3 TO SPA-EDT-RATE(1 3).
           MOVE QSPA-EDT-RATETYPE-1-3 TO SPA-EDT-RATETYPE(1 3).
           MOVE QSPA-EDT-AMT-1-3 TO SPA-EDT-AMT(1 3).
           MOVE QSPA-EDT-AMTYPE-1-3 TO SPA-EDT-AMTYPE(1 3).
           MOVE QSPA-EDT-TERM-1-3 TO SPA-EDT-TERM(1 3).
           MOVE QSPA-EDT-TYPE-1-4 TO SPA-EDT-TYPE(1 4).
           MOVE QSPA-EDT-HL-1-4 TO SPA-EDT-HL(1 4).
           MOVE QSPA-EDT-COLL-1-4 TO SPA-EDT-COLL(1 4).
           MOVE QSPA-EDT-CD-1-4 TO SPA-EDT-CD(1 4).
           MOVE QSPA-EDT-RATE-1-4 TO SPA-EDT-RATE(1 4).
           MOVE QSPA-EDT-RATETYPE-1-4 TO SPA-EDT-RATETYPE(1 4).
           MOVE QSPA-EDT-AMT-1-4 TO SPA-EDT-AMT(1 4).
           MOVE QSPA-EDT-AMTYPE-1-4 TO SPA-EDT-AMTYPE(1 4).
           MOVE QSPA-EDT-TERM-1-4 TO SPA-EDT-TERM(1 4).
           MOVE QSPA-EDT-TYPE-1-5 TO SPA-EDT-TYPE(1 5).
           MOVE QSPA-EDT-HL-1-5 TO SPA-EDT-HL(1 5).
           MOVE QSPA-EDT-COLL-1-5 TO SPA-EDT-COLL(1 5).
           MOVE QSPA-EDT-CD-1-5 TO SPA-EDT-CD(1 5).
           MOVE QSPA-EDT-RATE-1-5 TO SPA-EDT-RATE(1 5).
           MOVE QSPA-EDT-RATETYPE-1-5 TO SPA-EDT-RATETYPE(1 5).
           MOVE QSPA-EDT-AMT-1-5 TO SPA-EDT-AMT(1 5).
           MOVE QSPA-EDT-AMTYPE-1-5 TO SPA-EDT-AMTYPE(1 5).
           MOVE QSPA-EDT-TERM-1-5 TO SPA-EDT-TERM(1 5).
           MOVE QSPA-EDT-TYPE-1-6 TO SPA-EDT-TYPE(1 6).
           MOVE QSPA-EDT-HL-1-6 TO SPA-EDT-HL(1 6).
           MOVE QSPA-EDT-COLL-1-6 TO SPA-EDT-COLL(1 6).
           MOVE QSPA-EDT-CD-1-6 TO SPA-EDT-CD(1 6).
           MOVE QSPA-EDT-RATE-1-6 TO SPA-EDT-RATE(1 6).
           MOVE QSPA-EDT-RATETYPE-1-6 TO SPA-EDT-RATETYPE(1 6).
           MOVE QSPA-EDT-AMT-1-6 TO SPA-EDT-AMT(1 6).
           MOVE QSPA-EDT-AMTYPE-1-6 TO SPA-EDT-AMTYPE(1 6).
           MOVE QSPA-EDT-TERM-1-6 TO SPA-EDT-TERM(1 6).
           MOVE QSPA-EDT-NOEDITS-2 TO SPA-EDT-NOEDITS(2).
           MOVE QSPA-EDT-TYPE-2-1 TO SPA-EDT-TYPE(2 1).
           MOVE QSPA-EDT-HL-2-1 TO SPA-EDT-HL(2 1).
           MOVE QSPA-EDT-COLL-2-1 TO SPA-EDT-COLL(2 1).
           MOVE QSPA-EDT-CD-2-1 TO SPA-EDT-CD(2 1).
           MOVE QSPA-EDT-RATE-2-1 TO SPA-EDT-RATE(2 1).
           MOVE QSPA-EDT-RATETYPE-2-1 TO SPA-EDT-RATETYPE(2 1).
           MOVE QSPA-EDT-AMT-2-1 TO SPA-EDT-AMT(2 1).
           MOVE QSPA-EDT-AMTYPE-2-1 TO SPA-EDT-AMTYPE(2 1).
           MOVE QSPA-EDT-TERM-2-1 TO SPA-EDT-TERM(2 1).
           MOVE QSPA-EDT-TYPE-2-2 TO SPA-EDT-TYPE(2 2).
           MOVE QSPA-EDT-HL-2-2 TO SPA-EDT-HL(2 2).
           MOVE QSPA-EDT-COLL-2-2 TO SPA-EDT-COLL(2 2).
           MOVE QSPA-EDT-CD-2-2 TO SPA-EDT-CD(2 2).
           MOVE QSPA-EDT-RATE-2-2 TO SPA-EDT-RATE(2 2).
           MOVE QSPA-EDT-RATETYPE-2-2 TO SPA-EDT-RATETYPE(2 2).
           MOVE QSPA-EDT-AMT-2-2 TO SPA-EDT-AMT(2 2).
           MOVE QSPA-EDT-AMTYPE-2-2 TO SPA-EDT-AMTYPE(2 2).
           MOVE QSPA-EDT-TERM-2-2 TO SPA-EDT-TERM(2 2).
           MOVE QSPA-EDT-TYPE-2-3 TO SPA-EDT-TYPE(2 3).
           MOVE QSPA-EDT-HL-2-3 TO SPA-EDT-HL(2 3).
           MOVE QSPA-EDT-COLL-2-3 TO SPA-EDT-COLL(2 3).
           MOVE QSPA-EDT-CD-2-3 TO SPA-EDT-CD(2 3).
           MOVE QSPA-EDT-RATE-2-3 TO SPA-EDT-RATE(2 3).
           MOVE QSPA-EDT-RATETYPE-2-3 TO SPA-EDT-RATETYPE(2 3).
           MOVE QSPA-EDT-AMT-2-3 TO SPA-EDT-AMT(2 3).
           MOVE QSPA-EDT-AMTYPE-2-3 TO SPA-EDT-AMTYPE(2 3).
           MOVE QSPA-EDT-TERM-2-3 TO SPA-EDT-TERM(2 3).
           MOVE QSPA-EDT-TYPE-2-4 TO SPA-EDT-TYPE(2 4).
           MOVE QSPA-EDT-HL-2-4 TO SPA-EDT-HL(2 4).
           MOVE QSPA-EDT-COLL-2-4 TO SPA-EDT-COLL(2 4).
           MOVE QSPA-EDT-CD-2-4 TO SPA-EDT-CD(2 4).
           MOVE QSPA-EDT-RATE-2-4 TO SPA-EDT-RATE(2 4).
           MOVE QSPA-EDT-RATETYPE-2-4 TO SPA-EDT-RATETYPE(2 4).
           MOVE QSPA-EDT-AMT-2-4 TO SPA-EDT-AMT(2 4).
           MOVE QSPA-EDT-AMTYPE-2-4 TO SPA-EDT-AMTYPE(2 4).
           MOVE QSPA-EDT-TERM-2-4 TO SPA-EDT-TERM(2 4).
           MOVE QSPA-EDT-TYPE-2-5 TO SPA-EDT-TYPE(2 5).
           MOVE QSPA-EDT-HL-2-5 TO SPA-EDT-HL(2 5).
           MOVE QSPA-EDT-COLL-2-5 TO SPA-EDT-COLL(2 5).
           MOVE QSPA-EDT-CD-2-5 TO SPA-EDT-CD(2 5).
           MOVE QSPA-EDT-RATE-2-5 TO SPA-EDT-RATE(2 5).
           MOVE QSPA-EDT-RATETYPE-2-5 TO SPA-EDT-RATETYPE(2 5).
           MOVE QSPA-EDT-AMT-2-5 TO SPA-EDT-AMT(2 5).
           MOVE QSPA-EDT-AMTYPE-2-5 TO SPA-EDT-AMTYPE(2 5).
           MOVE QSPA-EDT-TERM-2-5 TO SPA-EDT-TERM(2 5).
           MOVE QSPA-EDT-TYPE-2-6 TO SPA-EDT-TYPE(2 6).
           MOVE QSPA-EDT-HL-2-6 TO SPA-EDT-HL(2 6).
           MOVE QSPA-EDT-COLL-2-6 TO SPA-EDT-COLL(2 6).
           MOVE QSPA-EDT-CD-2-6 TO SPA-EDT-CD(2 6).
           MOVE QSPA-EDT-RATE-2-6 TO SPA-EDT-RATE(2 6).
           MOVE QSPA-EDT-RATETYPE-2-6 TO SPA-EDT-RATETYPE(2 6).
           MOVE QSPA-EDT-AMT-2-6 TO SPA-EDT-AMT(2 6).
           MOVE QSPA-EDT-AMTYPE-2-6 TO SPA-EDT-AMTYPE(2 6).
           MOVE QSPA-EDT-TERM-2-6 TO SPA-EDT-TERM(2 6).
 
      *-----------------------------------------------------------------
      *    LOAD QSPA-REC FROM SPA-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-SPA-FIELDS.
           MOVE SPA-ORGST TO QSPA-ORGST.
           MOVE SPA-SPRCLASS TO QSPA-SPRCLASS.
           MOVE SPA-SUBCLASS TO QSPA-SUBCLASS.
           MOVE SPA-LAWCODE TO QSPA-LAWCODE.

           IF ( SPA-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QSPA-LTOUCH-DATE
           ELSE
              MOVE SPA-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QSPA-LTOUCH-DATE.

           MOVE SPA-DESC TO QSPA-DESC.
           MOVE SPA-NOTES TO QSPA-NOTES.

           IF ( SPA-EFFDATE = ZEROES )
              MOVE "1900-01-01" TO QSPA-EFFDATE
           ELSE
              MOVE SPA-EFFDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QSPA-EFFDATE.


           IF ( SPA-EXPDATE = ZEROES )
              MOVE "1900-01-01" TO QSPA-EXPDATE
           ELSE
              MOVE SPA-EXPDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QSPA-EXPDATE.

           MOVE SPA-EXPD-MONTHS TO QSPA-EXPD-MONTHS.
           MOVE SPA-EXPD-DAYS TO QSPA-EXPD-DAYS.
           MOVE SPA-EXPD-FRMLA TO QSPA-EXPD-FRMLA.
           MOVE SPA-EXPD-EXCEPT TO QSPA-EXPD-EXCEPT.
           MOVE SPA-EXPR-FRMLA TO QSPA-EXPR-FRMLA.
           MOVE SPA-EXPR-REDU-FRMLA TO QSPA-EXPR-REDU-FRMLA.
           MOVE SPA-EXPR-RATE(1) TO QSPA-EXPR-RATE-1.
           MOVE SPA-EXPR-BREAK(1) TO QSPA-EXPR-BREAK-1.
           MOVE SPA-EXPR-YRTYPE(1) TO QSPA-EXPR-YRTYPE-1.
           MOVE SPA-EXPR-INTMETH(1) TO QSPA-EXPR-INTMETH-1.
           MOVE SPA-EXPR-RATE(2) TO QSPA-EXPR-RATE-2.
           MOVE SPA-EXPR-BREAK(2) TO QSPA-EXPR-BREAK-2.
           MOVE SPA-EXPR-YRTYPE(2) TO QSPA-EXPR-YRTYPE-2.
           MOVE SPA-EXPR-INTMETH(2) TO QSPA-EXPR-INTMETH-2.
           MOVE SPA-EXPR-RATE(3) TO QSPA-EXPR-RATE-3.
           MOVE SPA-EXPR-BREAK(3) TO QSPA-EXPR-BREAK-3.
           MOVE SPA-EXPR-YRTYPE(3) TO QSPA-EXPR-YRTYPE-3.
           MOVE SPA-EXPR-INTMETH(3) TO QSPA-EXPR-INTMETH-3.
           MOVE SPA-EXPR-RATE(4) TO QSPA-EXPR-RATE-4.
           MOVE SPA-EXPR-BREAK(4) TO QSPA-EXPR-BREAK-4.
           MOVE SPA-EXPR-YRTYPE(4) TO QSPA-EXPR-YRTYPE-4.
           MOVE SPA-EXPR-INTMETH(4) TO QSPA-EXPR-INTMETH-4.
           MOVE SPA-EXPR-RATE(5) TO QSPA-EXPR-RATE-5.
           MOVE SPA-EXPR-BREAK(5) TO QSPA-EXPR-BREAK-5.
           MOVE SPA-EXPR-YRTYPE(5) TO QSPA-EXPR-YRTYPE-5.
           MOVE SPA-EXPR-INTMETH(5) TO QSPA-EXPR-INTMETH-5.
           MOVE SPA-EXPR-LCHG TO QSPA-EXPR-LCHG.
           MOVE SPA-JUDGFRMLA TO QSPA-JUDGFRMLA.
           MOVE SPA-JUDGRATE TO QSPA-JUDGRATE.
           MOVE SPA-JUDGYRTYPE TO QSPA-JUDGYRTYPE.
           MOVE SPA-JUDGINTMETH TO QSPA-JUDGINTMETH.
           MOVE SPA-ACC-FRMLA TO QSPA-ACC-FRMLA.
           MOVE SPA-ACC-YRTYPE TO QSPA-ACC-YRTYPE.
           MOVE SPA-ACC-INTMETH TO QSPA-ACC-INTMETH.
           MOVE SPA-ACC-RATE(1) TO QSPA-ACC-RATE-1.
           MOVE SPA-ACC-BREAK(1) TO QSPA-ACC-BREAK-1.
           MOVE SPA-ACC-RATE(2) TO QSPA-ACC-RATE-2.
           MOVE SPA-ACC-BREAK(2) TO QSPA-ACC-BREAK-2.
           MOVE SPA-ACC-RATE(3) TO QSPA-ACC-RATE-3.
           MOVE SPA-ACC-BREAK(3) TO QSPA-ACC-BREAK-3.
           MOVE SPA-ACC-RATE(4) TO QSPA-ACC-RATE-4.
           MOVE SPA-ACC-BREAK(4) TO QSPA-ACC-BREAK-4.
           MOVE SPA-ACC-RATE(5) TO QSPA-ACC-RATE-5.
           MOVE SPA-ACC-BREAK(5) TO QSPA-ACC-BREAK-5.
           MOVE SPA-1098FRMLA TO QSPA-1098FRMLA.
           MOVE SPA-DISFRMLA TO QSPA-DISFRMLA.
           MOVE SPA-CONTRFRMLA TO QSPA-CONTRFRMLA.
           MOVE SPA-BANKRULE TO QSPA-BANKRULE.
           MOVE SPA-CONTPDTH TO QSPA-CONTPDTH.
           MOVE SPA-FINCHG TO QSPA-FINCHG.
           MOVE SPA-BANKUNITPER-CD TO QSPA-BANKUNITPER-CD.
           MOVE SPA-TRWBANKRULE TO QSPA-TRWBANKRULE.
           MOVE SPA-TRWCONTPDTH TO QSPA-TRWCONTPDTH.
           MOVE SPA-TRWBANKUNITPER-CD TO QSPA-TRWBANKUNITPER-CD.
           MOVE SPA-RECFRMLA TO QSPA-RECFRMLA.
           MOVE SPA-RECPAYCD TO QSPA-RECPAYCD.
           MOVE SPA-RECPDTH TO QSPA-RECPDTH.
           MOVE SPA-DISFRMLA-SPAY-FG TO QSPA-DISFRMLA-SPAY-FG.
           MOVE SPA-ERNFRMLA(1) TO QSPA-ERNFRMLA-1.
           MOVE SPA-ERNAMT(1) TO QSPA-ERNAMT-1.
           MOVE SPA-ERNPERCT(1) TO QSPA-ERNPERCT-1.
           MOVE SPA-ERNPERCD(1) TO QSPA-ERNPERCD-1.
           MOVE SPA-ERNACCRL-FG(1) TO QSPA-ERNACCRL-FG-1.
           MOVE SPA-ERNACCRL-START-CD(1) TO QSPA-ERNACCRL-START-CD-1.
           MOVE SPA-ERNACCRL-DFCD(1) TO QSPA-ERNACCRL-DFCD-1.
           MOVE SPA-ERN-DAYS(1) TO QSPA-ERN-DAYS-1.
           MOVE SPA-ERN-TERM(1) TO QSPA-ERN-TERM-1.
           MOVE SPA-ERN-TYPE(1) TO QSPA-ERN-TYPE-1.
           MOVE SPA-ERNFRMLA(2) TO QSPA-ERNFRMLA-2.
           MOVE SPA-ERNAMT(2) TO QSPA-ERNAMT-2.
           MOVE SPA-ERNPERCT(2) TO QSPA-ERNPERCT-2.
           MOVE SPA-ERNPERCD(2) TO QSPA-ERNPERCD-2.
           MOVE SPA-ERNACCRL-FG(2) TO QSPA-ERNACCRL-FG-2.
           MOVE SPA-ERNACCRL-START-CD(2) TO QSPA-ERNACCRL-START-CD-2.
           MOVE SPA-ERNACCRL-DFCD(2) TO QSPA-ERNACCRL-DFCD-2.
           MOVE SPA-ERN-DAYS(2) TO QSPA-ERN-DAYS-2.
           MOVE SPA-ERN-TERM(2) TO QSPA-ERN-TERM-2.
           MOVE SPA-ERN-TYPE(2) TO QSPA-ERN-TYPE-2.
           MOVE SPA-ERNFRMLA(3) TO QSPA-ERNFRMLA-3.
           MOVE SPA-ERNAMT(3) TO QSPA-ERNAMT-3.
           MOVE SPA-ERNPERCT(3) TO QSPA-ERNPERCT-3.
           MOVE SPA-ERNPERCD(3) TO QSPA-ERNPERCD-3.
           MOVE SPA-ERNACCRL-FG(3) TO QSPA-ERNACCRL-FG-3.
           MOVE SPA-ERNACCRL-START-CD(3) TO QSPA-ERNACCRL-START-CD-3.
           MOVE SPA-ERNACCRL-DFCD(3) TO QSPA-ERNACCRL-DFCD-3.
           MOVE SPA-ERN-DAYS(3) TO QSPA-ERN-DAYS-3.
           MOVE SPA-ERN-TERM(3) TO QSPA-ERN-TERM-3.
           MOVE SPA-ERN-TYPE(3) TO QSPA-ERN-TYPE-3.
           MOVE SPA-ERNFRMLA(4) TO QSPA-ERNFRMLA-4.
           MOVE SPA-ERNAMT(4) TO QSPA-ERNAMT-4.
           MOVE SPA-ERNPERCT(4) TO QSPA-ERNPERCT-4.
           MOVE SPA-ERNPERCD(4) TO QSPA-ERNPERCD-4.
           MOVE SPA-ERNACCRL-FG(4) TO QSPA-ERNACCRL-FG-4.
           MOVE SPA-ERNACCRL-START-CD(4) TO QSPA-ERNACCRL-START-CD-4.
           MOVE SPA-ERNACCRL-DFCD(4) TO QSPA-ERNACCRL-DFCD-4.
           MOVE SPA-ERN-DAYS(4) TO QSPA-ERN-DAYS-4.
           MOVE SPA-ERN-TERM(4) TO QSPA-ERN-TERM-4.
           MOVE SPA-ERN-TYPE(4) TO QSPA-ERN-TYPE-4.
           MOVE SPA-ERNFRMLA(5) TO QSPA-ERNFRMLA-5.
           MOVE SPA-ERNAMT(5) TO QSPA-ERNAMT-5.
           MOVE SPA-ERNPERCT(5) TO QSPA-ERNPERCT-5.
           MOVE SPA-ERNPERCD(5) TO QSPA-ERNPERCD-5.
           MOVE SPA-ERNACCRL-FG(5) TO QSPA-ERNACCRL-FG-5.
           MOVE SPA-ERNACCRL-START-CD(5) TO QSPA-ERNACCRL-START-CD-5.
           MOVE SPA-ERNACCRL-DFCD(5) TO QSPA-ERNACCRL-DFCD-5.
           MOVE SPA-ERN-DAYS(5) TO QSPA-ERN-DAYS-5.
           MOVE SPA-ERN-TERM(5) TO QSPA-ERN-TERM-5.
           MOVE SPA-ERN-TYPE(5) TO QSPA-ERN-TYPE-5.
           MOVE SPA-ERNFRMLA(6) TO QSPA-ERNFRMLA-6.
           MOVE SPA-ERNAMT(6) TO QSPA-ERNAMT-6.
           MOVE SPA-ERNPERCT(6) TO QSPA-ERNPERCT-6.
           MOVE SPA-ERNPERCD(6) TO QSPA-ERNPERCD-6.
           MOVE SPA-ERNACCRL-FG(6) TO QSPA-ERNACCRL-FG-6.
           MOVE SPA-ERNACCRL-START-CD(6) TO QSPA-ERNACCRL-START-CD-6.
           MOVE SPA-ERNACCRL-DFCD(6) TO QSPA-ERNACCRL-DFCD-6.
           MOVE SPA-ERN-DAYS(6) TO QSPA-ERN-DAYS-6.
           MOVE SPA-ERN-TERM(6) TO QSPA-ERN-TERM-6.
           MOVE SPA-ERN-TYPE(6) TO QSPA-ERN-TYPE-6.
           MOVE SPA-ERNFRMLA(7) TO QSPA-ERNFRMLA-7.
           MOVE SPA-ERNAMT(7) TO QSPA-ERNAMT-7.
           MOVE SPA-ERNPERCT(7) TO QSPA-ERNPERCT-7.
           MOVE SPA-ERNPERCD(7) TO QSPA-ERNPERCD-7.
           MOVE SPA-ERNACCRL-FG(7) TO QSPA-ERNACCRL-FG-7.
           MOVE SPA-ERNACCRL-START-CD(7) TO QSPA-ERNACCRL-START-CD-7.
           MOVE SPA-ERNACCRL-DFCD(7) TO QSPA-ERNACCRL-DFCD-7.
           MOVE SPA-ERN-DAYS(7) TO QSPA-ERN-DAYS-7.
           MOVE SPA-ERN-TERM(7) TO QSPA-ERN-TERM-7.
           MOVE SPA-ERN-TYPE(7) TO QSPA-ERN-TYPE-7.
           MOVE SPA-ERNFRMLA(8) TO QSPA-ERNFRMLA-8.
           MOVE SPA-ERNAMT(8) TO QSPA-ERNAMT-8.
           MOVE SPA-ERNPERCT(8) TO QSPA-ERNPERCT-8.
           MOVE SPA-ERNPERCD(8) TO QSPA-ERNPERCD-8.
           MOVE SPA-ERNACCRL-FG(8) TO QSPA-ERNACCRL-FG-8.
           MOVE SPA-ERNACCRL-START-CD(8) TO QSPA-ERNACCRL-START-CD-8.
           MOVE SPA-ERNACCRL-DFCD(8) TO QSPA-ERNACCRL-DFCD-8.
           MOVE SPA-ERN-DAYS(8) TO QSPA-ERN-DAYS-8.
           MOVE SPA-ERN-TERM(8) TO QSPA-ERN-TERM-8.
           MOVE SPA-ERN-TYPE(8) TO QSPA-ERN-TYPE-8.
           MOVE SPA-ERNFRMLA(9) TO QSPA-ERNFRMLA-9.
           MOVE SPA-ERNAMT(9) TO QSPA-ERNAMT-9.
           MOVE SPA-ERNPERCT(9) TO QSPA-ERNPERCT-9.
           MOVE SPA-ERNPERCD(9) TO QSPA-ERNPERCD-9.
           MOVE SPA-ERNACCRL-FG(9) TO QSPA-ERNACCRL-FG-9.
           MOVE SPA-ERNACCRL-START-CD(9) TO QSPA-ERNACCRL-START-CD-9.
           MOVE SPA-ERNACCRL-DFCD(9) TO QSPA-ERNACCRL-DFCD-9.
           MOVE SPA-ERN-DAYS(9) TO QSPA-ERN-DAYS-9.
           MOVE SPA-ERN-TERM(9) TO QSPA-ERN-TERM-9.
           MOVE SPA-ERN-TYPE(9) TO QSPA-ERN-TYPE-9.
           MOVE SPA-ERNFRMLA(10) TO QSPA-ERNFRMLA-10.
           MOVE SPA-ERNAMT(10) TO QSPA-ERNAMT-10.
           MOVE SPA-ERNPERCT(10) TO QSPA-ERNPERCT-10.
           MOVE SPA-ERNPERCD(10) TO QSPA-ERNPERCD-10.
           MOVE SPA-ERNACCRL-FG(10) TO QSPA-ERNACCRL-FG-10.
           MOVE SPA-ERNACCRL-START-CD(10) TO QSPA-ERNACCRL-START-CD-10.
           MOVE SPA-ERNACCRL-DFCD(10) TO QSPA-ERNACCRL-DFCD-10.
           MOVE SPA-ERN-DAYS(10) TO QSPA-ERN-DAYS-10.
           MOVE SPA-ERN-TERM(10) TO QSPA-ERN-TERM-10.
           MOVE SPA-ERN-TYPE(10) TO QSPA-ERN-TYPE-10.
           MOVE SPA-ERNACCEL-CD TO QSPA-ERNACCEL-CD.
           MOVE SPA-ERNJD-CD TO QSPA-ERNJD-CD.
           MOVE SPA-MIDSTRERNCD TO QSPA-MIDSTRERNCD.
           MOVE SPA-EARN-ORDER(1) TO QSPA-EARN-ORDER-1.
           MOVE SPA-EARN-ORDER(2) TO QSPA-EARN-ORDER-2.
           MOVE SPA-EARN-ORDER(3) TO QSPA-EARN-ORDER-3.
           MOVE SPA-EARN-ORDER(4) TO QSPA-EARN-ORDER-4.
           MOVE SPA-EARN-ORDER(5) TO QSPA-EARN-ORDER-5.
           MOVE SPA-EARN-ORDER(6) TO QSPA-EARN-ORDER-6.
           MOVE SPA-EARN-ORDER(7) TO QSPA-EARN-ORDER-7.
           MOVE SPA-EARN-ORDER(8) TO QSPA-EARN-ORDER-8.
           MOVE SPA-EARN-ORDER(9) TO QSPA-EARN-ORDER-9.
           MOVE SPA-EARN-ORDER(10) TO QSPA-EARN-ORDER-10.
           MOVE SPA-ERNDELQFRMLA TO QSPA-ERNDELQFRMLA.
           MOVE SPA-ERNDELQ-START TO QSPA-ERNDELQ-START.
           MOVE SPA-ERNDELQ-STOP TO QSPA-ERNDELQ-STOP.
           MOVE SPA-1098-INC-LC TO QSPA-1098-INC-LC.
           MOVE SPA-MAX-IB-ACR-DAYS TO QSPA-MAX-IB-ACR-DAYS.
           MOVE SPA-LCGRACE TO QSPA-LCGRACE.
           MOVE SPA-LCGRACECD TO QSPA-LCGRACECD.
           MOVE SPA-LCTYPE TO QSPA-LCTYPE.
           MOVE SPA-LCRATE TO QSPA-LCRATE.
           MOVE SPA-LCFRMLA TO QSPA-LCFRMLA.
           MOVE SPA-LCMINCHG TO QSPA-LCMINCHG.
           MOVE SPA-LCMAXAMT TO QSPA-LCMAXAMT.
           MOVE SPA-LCDELFAC TO QSPA-LCDELFAC.
           MOVE SPA-LCYRTYPE TO QSPA-LCYRTYPE.
           MOVE SPA-LC-CODE TO QSPA-LC-CODE.
           MOVE SPA-LCUNITPER-CD TO QSPA-LCUNITPER-CD.
           MOVE SPA-DEFFRMLA TO QSPA-DEFFRMLA.
           MOVE SPA-DEFEXCEPT TO QSPA-DEFEXCEPT.
           MOVE SPA-DEFWORKER TO QSPA-DEFWORKER.
           MOVE SPA-DEFPERCD TO QSPA-DEFPERCD.
           MOVE SPA-DEFBASE TO QSPA-DEFBASE.
           MOVE SPA-DEFPOLCD TO QSPA-DEFPOLCD.
           MOVE SPA-DEFPOLMX(1) TO QSPA-DEFPOLMX-1.
           MOVE SPA-DEFPOLMX(2) TO QSPA-DEFPOLMX-2.
           MOVE SPA-DEFPOLMX(3) TO QSPA-DEFPOLMX-3.
           MOVE SPA-DEFMIN TO QSPA-DEFMIN.
           MOVE SPA-DEFMAX TO QSPA-DEFMAX.
           MOVE SPA-DEFUNITPER-CD TO QSPA-DEFUNITPER-CD.
           MOVE SPA-PRFORM(1) TO QSPA-PRFORM-1.
           MOVE SPA-PRFLAG(1) TO QSPA-PRFLAG-1.
           MOVE SPA-PRFORM(2) TO QSPA-PRFORM-2.
           MOVE SPA-PRFLAG(2) TO QSPA-PRFLAG-2.
           MOVE SPA-PRFORM(3) TO QSPA-PRFORM-3.
           MOVE SPA-PRFLAG(3) TO QSPA-PRFLAG-3.
           MOVE SPA-PRFORM(4) TO QSPA-PRFORM-4.
           MOVE SPA-PRFLAG(4) TO QSPA-PRFLAG-4.
           MOVE SPA-PRFORM(5) TO QSPA-PRFORM-5.
           MOVE SPA-PRFLAG(5) TO QSPA-PRFLAG-5.
           MOVE SPA-PRFORM(6) TO QSPA-PRFORM-6.
           MOVE SPA-PRFLAG(6) TO QSPA-PRFLAG-6.
           MOVE SPA-PRFORM(7) TO QSPA-PRFORM-7.
           MOVE SPA-PRFLAG(7) TO QSPA-PRFLAG-7.
           MOVE SPA-PRFORM(8) TO QSPA-PRFORM-8.
           MOVE SPA-PRFLAG(8) TO QSPA-PRFLAG-8.
           MOVE SPA-PRFORM(9) TO QSPA-PRFORM-9.
           MOVE SPA-PRFLAG(9) TO QSPA-PRFLAG-9.
           MOVE SPA-PRFORM(10) TO QSPA-PRFORM-10.
           MOVE SPA-PRFLAG(10) TO QSPA-PRFLAG-10.
           MOVE SPA-PRFORM(11) TO QSPA-PRFORM-11.
           MOVE SPA-PRFLAG(11) TO QSPA-PRFLAG-11.
           MOVE SPA-PRFORM(12) TO QSPA-PRFORM-12.
           MOVE SPA-PRFLAG(12) TO QSPA-PRFLAG-12.
           MOVE SPA-PRFORM(13) TO QSPA-PRFORM-13.
           MOVE SPA-PRFLAG(13) TO QSPA-PRFLAG-13.
           MOVE SPA-PRFORM(14) TO QSPA-PRFORM-14.
           MOVE SPA-PRFLAG(14) TO QSPA-PRFLAG-14.
           MOVE SPA-PRFORM(15) TO QSPA-PRFORM-15.
           MOVE SPA-PRFLAG(15) TO QSPA-PRFLAG-15.
           MOVE SPA-PRFORM(16) TO QSPA-PRFORM-16.
           MOVE SPA-PRFLAG(16) TO QSPA-PRFLAG-16.
           MOVE SPA-PRFORM(17) TO QSPA-PRFORM-17.
           MOVE SPA-PRFLAG(17) TO QSPA-PRFLAG-17.
           MOVE SPA-PRFORM(18) TO QSPA-PRFORM-18.
           MOVE SPA-PRFLAG(18) TO QSPA-PRFLAG-18.
           MOVE SPA-PRFORM(19) TO QSPA-PRFORM-19.
           MOVE SPA-PRFLAG(19) TO QSPA-PRFLAG-19.
           MOVE SPA-PRFORM(20) TO QSPA-PRFORM-20.
           MOVE SPA-PRFLAG(20) TO QSPA-PRFLAG-20.
           MOVE SPA-IMED-REC TO QSPA-IMED-REC.
           MOVE SPA-SCFRMLA TO QSPA-SCFRMLA.
           MOVE SPA-SCRATE TO QSPA-SCRATE.
           MOVE SPA-SCMIN TO QSPA-SCMIN.
           MOVE SPA-SCMAX TO QSPA-SCMAX.
           MOVE SPA-MFFRMLA TO QSPA-MFFRMLA.
           MOVE SPA-MFRATE TO QSPA-MFRATE.
           MOVE SPA-MFMIN TO QSPA-MFMIN.
           MOVE SPA-MFMAX TO QSPA-MFMAX.
           MOVE SPA-INTMETHOD TO QSPA-INTMETHOD.
           MOVE SPA-YEARTYPE TO QSPA-YEARTYPE.
           MOVE SPA-PYEXFRMLA TO QSPA-PYEXFRMLA.
           MOVE SPA-PYEXSPCODE TO QSPA-PYEXSPCODE.
           MOVE SPA-PYEXYEARTP TO QSPA-PYEXYEARTP.
           MOVE SPA-PYEXFMDATE TO QSPA-PYEXFMDATE.
           MOVE SPA-PYEXBASECD TO QSPA-PYEXBASECD.
           MOVE SPA-PYEXBASE TO QSPA-PYEXBASE.
           MOVE SPA-PYEXDAYS TO QSPA-PYEXDAYS.
           MOVE SPA-CAL-SPFRMLA TO QSPA-CAL-SPFRMLA.
           MOVE SPA-CAL-RATETYPE(1) TO QSPA-CAL-RATETYPE-1.
           MOVE SPA-CAL-BREAKTYPE(1) TO QSPA-CAL-BREAKTYPE-1.
           MOVE SPA-CAL-CHGABLE(1) TO QSPA-CAL-CHGABLE-1.
           MOVE SPA-CAL-NORATES(1) TO QSPA-CAL-NORATES-1.
           MOVE SPA-CAL-TBFRMLA(1) TO QSPA-CAL-TBFRMLA-1.
           MOVE SPA-CAL-RATE(1 1) TO QSPA-CAL-RATE-1-1.
           MOVE SPA-CAL-BREAK(1 1) TO QSPA-CAL-BREAK-1-1.
           MOVE SPA-CAL-RATE(1 2) TO QSPA-CAL-RATE-1-2.
           MOVE SPA-CAL-BREAK(1 2) TO QSPA-CAL-BREAK-1-2.
           MOVE SPA-CAL-RATE(1 3) TO QSPA-CAL-RATE-1-3.
           MOVE SPA-CAL-BREAK(1 3) TO QSPA-CAL-BREAK-1-3.
           MOVE SPA-CAL-RATE(1 4) TO QSPA-CAL-RATE-1-4.
           MOVE SPA-CAL-BREAK(1 4) TO QSPA-CAL-BREAK-1-4.
           MOVE SPA-CAL-RATE(1 5) TO QSPA-CAL-RATE-1-5.
           MOVE SPA-CAL-BREAK(1 5) TO QSPA-CAL-BREAK-1-5.
           MOVE SPA-CAL-RATETYPE(2) TO QSPA-CAL-RATETYPE-2.
           MOVE SPA-CAL-BREAKTYPE(2) TO QSPA-CAL-BREAKTYPE-2.
           MOVE SPA-CAL-CHGABLE(2) TO QSPA-CAL-CHGABLE-2.
           MOVE SPA-CAL-NORATES(2) TO QSPA-CAL-NORATES-2.
           MOVE SPA-CAL-TBFRMLA(2) TO QSPA-CAL-TBFRMLA-2.
           MOVE SPA-CAL-RATE(2 1) TO QSPA-CAL-RATE-2-1.
           MOVE SPA-CAL-BREAK(2 1) TO QSPA-CAL-BREAK-2-1.
           MOVE SPA-CAL-RATE(2 2) TO QSPA-CAL-RATE-2-2.
           MOVE SPA-CAL-BREAK(2 2) TO QSPA-CAL-BREAK-2-2.
           MOVE SPA-CAL-RATE(2 3) TO QSPA-CAL-RATE-2-3.
           MOVE SPA-CAL-BREAK(2 3) TO QSPA-CAL-BREAK-2-3.
           MOVE SPA-CAL-RATE(2 4) TO QSPA-CAL-RATE-2-4.
           MOVE SPA-CAL-BREAK(2 4) TO QSPA-CAL-BREAK-2-4.
           MOVE SPA-CAL-RATE(2 5) TO QSPA-CAL-RATE-2-5.
           MOVE SPA-CAL-BREAK(2 5) TO QSPA-CAL-BREAK-2-5.
           MOVE SPA-MINSF-FRMLA TO QSPA-MINSF-FRMLA.
           MOVE SPA-MINSF-CHG TO QSPA-MINSF-CHG.
           MOVE SPA-MAXAPR-FRMLA TO QSPA-MAXAPR-FRMLA.
           MOVE SPA-EDT-NOEDITS(1) TO QSPA-EDT-NOEDITS-1.
           MOVE SPA-EDT-TYPE(1 1) TO QSPA-EDT-TYPE-1-1.
           MOVE SPA-EDT-HL(1 1) TO QSPA-EDT-HL-1-1.
           MOVE SPA-EDT-COLL(1 1) TO QSPA-EDT-COLL-1-1.
           MOVE SPA-EDT-CD(1 1) TO QSPA-EDT-CD-1-1.
           MOVE SPA-EDT-RATE(1 1) TO QSPA-EDT-RATE-1-1.
           MOVE SPA-EDT-RATETYPE(1 1) TO QSPA-EDT-RATETYPE-1-1.
           MOVE SPA-EDT-AMT(1 1) TO QSPA-EDT-AMT-1-1.
           MOVE SPA-EDT-AMTYPE(1 1) TO QSPA-EDT-AMTYPE-1-1.
           MOVE SPA-EDT-TERM(1 1) TO QSPA-EDT-TERM-1-1.
           MOVE SPA-EDT-TYPE(1 2) TO QSPA-EDT-TYPE-1-2.
           MOVE SPA-EDT-HL(1 2) TO QSPA-EDT-HL-1-2.
           MOVE SPA-EDT-COLL(1 2) TO QSPA-EDT-COLL-1-2.
           MOVE SPA-EDT-CD(1 2) TO QSPA-EDT-CD-1-2.
           MOVE SPA-EDT-RATE(1 2) TO QSPA-EDT-RATE-1-2.
           MOVE SPA-EDT-RATETYPE(1 2) TO QSPA-EDT-RATETYPE-1-2.
           MOVE SPA-EDT-AMT(1 2) TO QSPA-EDT-AMT-1-2.
           MOVE SPA-EDT-AMTYPE(1 2) TO QSPA-EDT-AMTYPE-1-2.
           MOVE SPA-EDT-TERM(1 2) TO QSPA-EDT-TERM-1-2.
           MOVE SPA-EDT-TYPE(1 3) TO QSPA-EDT-TYPE-1-3.
           MOVE SPA-EDT-HL(1 3) TO QSPA-EDT-HL-1-3.
           MOVE SPA-EDT-COLL(1 3) TO QSPA-EDT-COLL-1-3.
           MOVE SPA-EDT-CD(1 3) TO QSPA-EDT-CD-1-3.
           MOVE SPA-EDT-RATE(1 3) TO QSPA-EDT-RATE-1-3.
           MOVE SPA-EDT-RATETYPE(1 3) TO QSPA-EDT-RATETYPE-1-3.
           MOVE SPA-EDT-AMT(1 3) TO QSPA-EDT-AMT-1-3.
           MOVE SPA-EDT-AMTYPE(1 3) TO QSPA-EDT-AMTYPE-1-3.
           MOVE SPA-EDT-TERM(1 3) TO QSPA-EDT-TERM-1-3.
           MOVE SPA-EDT-TYPE(1 4) TO QSPA-EDT-TYPE-1-4.
           MOVE SPA-EDT-HL(1 4) TO QSPA-EDT-HL-1-4.
           MOVE SPA-EDT-COLL(1 4) TO QSPA-EDT-COLL-1-4.
           MOVE SPA-EDT-CD(1 4) TO QSPA-EDT-CD-1-4.
           MOVE SPA-EDT-RATE(1 4) TO QSPA-EDT-RATE-1-4.
           MOVE SPA-EDT-RATETYPE(1 4) TO QSPA-EDT-RATETYPE-1-4.
           MOVE SPA-EDT-AMT(1 4) TO QSPA-EDT-AMT-1-4.
           MOVE SPA-EDT-AMTYPE(1 4) TO QSPA-EDT-AMTYPE-1-4.
           MOVE SPA-EDT-TERM(1 4) TO QSPA-EDT-TERM-1-4.
           MOVE SPA-EDT-TYPE(1 5) TO QSPA-EDT-TYPE-1-5.
           MOVE SPA-EDT-HL(1 5) TO QSPA-EDT-HL-1-5.
           MOVE SPA-EDT-COLL(1 5) TO QSPA-EDT-COLL-1-5.
           MOVE SPA-EDT-CD(1 5) TO QSPA-EDT-CD-1-5.
           MOVE SPA-EDT-RATE(1 5) TO QSPA-EDT-RATE-1-5.
           MOVE SPA-EDT-RATETYPE(1 5) TO QSPA-EDT-RATETYPE-1-5.
           MOVE SPA-EDT-AMT(1 5) TO QSPA-EDT-AMT-1-5.
           MOVE SPA-EDT-AMTYPE(1 5) TO QSPA-EDT-AMTYPE-1-5.
           MOVE SPA-EDT-TERM(1 5) TO QSPA-EDT-TERM-1-5.
           MOVE SPA-EDT-TYPE(1 6) TO QSPA-EDT-TYPE-1-6.
           MOVE SPA-EDT-HL(1 6) TO QSPA-EDT-HL-1-6.
           MOVE SPA-EDT-COLL(1 6) TO QSPA-EDT-COLL-1-6.
           MOVE SPA-EDT-CD(1 6) TO QSPA-EDT-CD-1-6.
           MOVE SPA-EDT-RATE(1 6) TO QSPA-EDT-RATE-1-6.
           MOVE SPA-EDT-RATETYPE(1 6) TO QSPA-EDT-RATETYPE-1-6.
           MOVE SPA-EDT-AMT(1 6) TO QSPA-EDT-AMT-1-6.
           MOVE SPA-EDT-AMTYPE(1 6) TO QSPA-EDT-AMTYPE-1-6.
           MOVE SPA-EDT-TERM(1 6) TO QSPA-EDT-TERM-1-6.
           MOVE SPA-EDT-NOEDITS(2) TO QSPA-EDT-NOEDITS-2.
           MOVE SPA-EDT-TYPE(2 1) TO QSPA-EDT-TYPE-2-1.
           MOVE SPA-EDT-HL(2 1) TO QSPA-EDT-HL-2-1.
           MOVE SPA-EDT-COLL(2 1) TO QSPA-EDT-COLL-2-1.
           MOVE SPA-EDT-CD(2 1) TO QSPA-EDT-CD-2-1.
           MOVE SPA-EDT-RATE(2 1) TO QSPA-EDT-RATE-2-1.
           MOVE SPA-EDT-RATETYPE(2 1) TO QSPA-EDT-RATETYPE-2-1.
           MOVE SPA-EDT-AMT(2 1) TO QSPA-EDT-AMT-2-1.
           MOVE SPA-EDT-AMTYPE(2 1) TO QSPA-EDT-AMTYPE-2-1.
           MOVE SPA-EDT-TERM(2 1) TO QSPA-EDT-TERM-2-1.
           MOVE SPA-EDT-TYPE(2 2) TO QSPA-EDT-TYPE-2-2.
           MOVE SPA-EDT-HL(2 2) TO QSPA-EDT-HL-2-2.
           MOVE SPA-EDT-COLL(2 2) TO QSPA-EDT-COLL-2-2.
           MOVE SPA-EDT-CD(2 2) TO QSPA-EDT-CD-2-2.
           MOVE SPA-EDT-RATE(2 2) TO QSPA-EDT-RATE-2-2.
           MOVE SPA-EDT-RATETYPE(2 2) TO QSPA-EDT-RATETYPE-2-2.
           MOVE SPA-EDT-AMT(2 2) TO QSPA-EDT-AMT-2-2.
           MOVE SPA-EDT-AMTYPE(2 2) TO QSPA-EDT-AMTYPE-2-2.
           MOVE SPA-EDT-TERM(2 2) TO QSPA-EDT-TERM-2-2.
           MOVE SPA-EDT-TYPE(2 3) TO QSPA-EDT-TYPE-2-3.
           MOVE SPA-EDT-HL(2 3) TO QSPA-EDT-HL-2-3.
           MOVE SPA-EDT-COLL(2 3) TO QSPA-EDT-COLL-2-3.
           MOVE SPA-EDT-CD(2 3) TO QSPA-EDT-CD-2-3.
           MOVE SPA-EDT-RATE(2 3) TO QSPA-EDT-RATE-2-3.
           MOVE SPA-EDT-RATETYPE(2 3) TO QSPA-EDT-RATETYPE-2-3.
           MOVE SPA-EDT-AMT(2 3) TO QSPA-EDT-AMT-2-3.
           MOVE SPA-EDT-AMTYPE(2 3) TO QSPA-EDT-AMTYPE-2-3.
           MOVE SPA-EDT-TERM(2 3) TO QSPA-EDT-TERM-2-3.
           MOVE SPA-EDT-TYPE(2 4) TO QSPA-EDT-TYPE-2-4.
           MOVE SPA-EDT-HL(2 4) TO QSPA-EDT-HL-2-4.
           MOVE SPA-EDT-COLL(2 4) TO QSPA-EDT-COLL-2-4.
           MOVE SPA-EDT-CD(2 4) TO QSPA-EDT-CD-2-4.
           MOVE SPA-EDT-RATE(2 4) TO QSPA-EDT-RATE-2-4.
           MOVE SPA-EDT-RATETYPE(2 4) TO QSPA-EDT-RATETYPE-2-4.
           MOVE SPA-EDT-AMT(2 4) TO QSPA-EDT-AMT-2-4.
           MOVE SPA-EDT-AMTYPE(2 4) TO QSPA-EDT-AMTYPE-2-4.
           MOVE SPA-EDT-TERM(2 4) TO QSPA-EDT-TERM-2-4.
           MOVE SPA-EDT-TYPE(2 5) TO QSPA-EDT-TYPE-2-5.
           MOVE SPA-EDT-HL(2 5) TO QSPA-EDT-HL-2-5.
           MOVE SPA-EDT-COLL(2 5) TO QSPA-EDT-COLL-2-5.
           MOVE SPA-EDT-CD(2 5) TO QSPA-EDT-CD-2-5.
           MOVE SPA-EDT-RATE(2 5) TO QSPA-EDT-RATE-2-5.
           MOVE SPA-EDT-RATETYPE(2 5) TO QSPA-EDT-RATETYPE-2-5.
           MOVE SPA-EDT-AMT(2 5) TO QSPA-EDT-AMT-2-5.
           MOVE SPA-EDT-AMTYPE(2 5) TO QSPA-EDT-AMTYPE-2-5.
           MOVE SPA-EDT-TERM(2 5) TO QSPA-EDT-TERM-2-5.
           MOVE SPA-EDT-TYPE(2 6) TO QSPA-EDT-TYPE-2-6.
           MOVE SPA-EDT-HL(2 6) TO QSPA-EDT-HL-2-6.
           MOVE SPA-EDT-COLL(2 6) TO QSPA-EDT-COLL-2-6.
           MOVE SPA-EDT-CD(2 6) TO QSPA-EDT-CD-2-6.
           MOVE SPA-EDT-RATE(2 6) TO QSPA-EDT-RATE-2-6.
           MOVE SPA-EDT-RATETYPE(2 6) TO QSPA-EDT-RATETYPE-2-6.
           MOVE SPA-EDT-AMT(2 6) TO QSPA-EDT-AMT-2-6.
           MOVE SPA-EDT-AMTYPE(2 6) TO QSPA-EDT-AMTYPE-2-6.
           MOVE SPA-EDT-TERM(2 6) TO QSPA-EDT-TERM-2-6.
 
      *-----------------------------------------------------------------
      *    LOAD SPB-REC FROM QSPB-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-SPB-FIELDS.
           MOVE QSPB-ORGST TO SPB-ORGST.
           MOVE QSPB-SPRCLASS TO SPB-SPRCLASS.
           MOVE QSPB-SUBCLASS TO SPB-SUBCLASS.
           MOVE QSPB-LAWCODE TO SPB-LAWCODE.
           MOVE QSPB-INSCOM-1 TO SPB-INSCOM(1).
           MOVE QSPB-INSRATECD-1 TO SPB-INSRATECD(1).
           MOVE QSPB-INSJFAC-1 TO SPB-INSJFAC(1).
           MOVE QSPB-INSDISCNT-1 TO SPB-INSDISCNT(1).
           MOVE QSPB-INSCHGABL-1 TO SPB-INSCHGABL(1).
           MOVE QSPB-INSTERM-1-1 TO SPB-INSTERM(1 1).
           MOVE QSPB-INSRATE-1-1 TO SPB-INSRATE(1 1).
           MOVE QSPB-INSTERM-1-2 TO SPB-INSTERM(1 2).
           MOVE QSPB-INSRATE-1-2 TO SPB-INSRATE(1 2).
           MOVE QSPB-INSTERM-1-3 TO SPB-INSTERM(1 3).
           MOVE QSPB-INSRATE-1-3 TO SPB-INSRATE(1 3).
           MOVE QSPB-INSTERM-1-4 TO SPB-INSTERM(1 4).
           MOVE QSPB-INSRATE-1-4 TO SPB-INSRATE(1 4).
           MOVE QSPB-INSTERM-1-5 TO SPB-INSTERM(1 5).
           MOVE QSPB-INSRATE-1-5 TO SPB-INSRATE(1 5).
           MOVE QSPB-INSTERM-1-6 TO SPB-INSTERM(1 6).
           MOVE QSPB-INSRATE-1-6 TO SPB-INSRATE(1 6).
           MOVE QSPB-INSTERM-1-7 TO SPB-INSTERM(1 7).
           MOVE QSPB-INSRATE-1-7 TO SPB-INSRATE(1 7).
           MOVE QSPB-INSTERM-1-8 TO SPB-INSTERM(1 8).
           MOVE QSPB-INSRATE-1-8 TO SPB-INSRATE(1 8).
           MOVE QSPB-INSTERM-1-9 TO SPB-INSTERM(1 9).
           MOVE QSPB-INSRATE-1-9 TO SPB-INSRATE(1 9).
           MOVE QSPB-INSTERM-1-10 TO SPB-INSTERM(1 10).
           MOVE QSPB-INSRATE-1-10 TO SPB-INSRATE(1 10).
           MOVE QSPB-INSTERM-1-11 TO SPB-INSTERM(1 11).
           MOVE QSPB-INSRATE-1-11 TO SPB-INSRATE(1 11).
           MOVE QSPB-INSTERM-1-12 TO SPB-INSTERM(1 12).
           MOVE QSPB-INSRATE-1-12 TO SPB-INSRATE(1 12).
           MOVE QSPB-INSTERM-1-13 TO SPB-INSTERM(1 13).
           MOVE QSPB-INSRATE-1-13 TO SPB-INSRATE(1 13).
           MOVE QSPB-INSTERM-1-14 TO SPB-INSTERM(1 14).
           MOVE QSPB-INSRATE-1-14 TO SPB-INSRATE(1 14).
           MOVE QSPB-INSTERM-1-15 TO SPB-INSTERM(1 15).
           MOVE QSPB-INSRATE-1-15 TO SPB-INSRATE(1 15).
           MOVE QSPB-INSTERM-1-16 TO SPB-INSTERM(1 16).
           MOVE QSPB-INSRATE-1-16 TO SPB-INSRATE(1 16).
           MOVE QSPB-INSTERM-1-17 TO SPB-INSTERM(1 17).
           MOVE QSPB-INSRATE-1-17 TO SPB-INSRATE(1 17).
           MOVE QSPB-INSTERM-1-18 TO SPB-INSTERM(1 18).
           MOVE QSPB-INSRATE-1-18 TO SPB-INSRATE(1 18).
           MOVE QSPB-INSTERM-1-19 TO SPB-INSTERM(1 19).
           MOVE QSPB-INSRATE-1-19 TO SPB-INSRATE(1 19).
           MOVE QSPB-INSTERM-1-20 TO SPB-INSTERM(1 20).
           MOVE QSPB-INSRATE-1-20 TO SPB-INSRATE(1 20).
           MOVE QSPB-INSMINPREM-1 TO SPB-INSMINPREM(1).
           MOVE QSPB-INSMINCHGABL-1 TO SPB-INSMINCHGABL(1).
           MOVE QSPB-INSMAXCHGABL-1 TO SPB-INSMAXCHGABL(1).
           MOVE QSPB-INSMAXBENIF-1 TO SPB-INSMAXBENIF(1).
           MOVE QSPB-INSMAXTERM-1 TO SPB-INSMAXTERM(1).
           MOVE QSPB-INSCHGBEN-1 TO SPB-INSCHGBEN(1).
           MOVE QSPB-INSEXCEPT-1 TO SPB-INSEXCEPT(1).
           MOVE QSPB-INSNOVER-1 TO SPB-INSNOVER(1).
           MOVE QSPB-INSMINAGE-1-1 TO SPB-INSMINAGE(1 1).
           MOVE QSPB-INSMAXAGE-1-1 TO SPB-INSMAXAGE(1 1).
           MOVE QSPB-INSMAXCOV-1-1 TO SPB-INSMAXCOV(1 1).
           MOVE QSPB-INSMAXTRM-1-1 TO SPB-INSMAXTRM(1 1).
           MOVE QSPB-INSMINAGE-1-2 TO SPB-INSMINAGE(1 2).
           MOVE QSPB-INSMAXAGE-1-2 TO SPB-INSMAXAGE(1 2).
           MOVE QSPB-INSMAXCOV-1-2 TO SPB-INSMAXCOV(1 2).
           MOVE QSPB-INSMAXTRM-1-2 TO SPB-INSMAXTRM(1 2).
           MOVE QSPB-INSMINAGE-1-3 TO SPB-INSMINAGE(1 3).
           MOVE QSPB-INSMAXAGE-1-3 TO SPB-INSMAXAGE(1 3).
           MOVE QSPB-INSMAXCOV-1-3 TO SPB-INSMAXCOV(1 3).
           MOVE QSPB-INSMAXTRM-1-3 TO SPB-INSMAXTRM(1 3).
           MOVE QSPB-INSMINAGE-1-4 TO SPB-INSMINAGE(1 4).
           MOVE QSPB-INSMAXAGE-1-4 TO SPB-INSMAXAGE(1 4).
           MOVE QSPB-INSMAXCOV-1-4 TO SPB-INSMAXCOV(1 4).
           MOVE QSPB-INSMAXTRM-1-4 TO SPB-INSMAXTRM(1 4).
           MOVE QSPB-INSMINAGE-1-5 TO SPB-INSMINAGE(1 5).
           MOVE QSPB-INSMAXAGE-1-5 TO SPB-INSMAXAGE(1 5).
           MOVE QSPB-INSMAXCOV-1-5 TO SPB-INSMAXCOV(1 5).
           MOVE QSPB-INSMAXTRM-1-5 TO SPB-INSMAXTRM(1 5).
           MOVE QSPB-INSFEECD-1 TO SPB-INSFEECD(1).
           MOVE QSPB-INSFEE-FRMLA-1 TO SPB-INSFEE-FRMLA(1).
           MOVE QSPB-INSCHGABL-FG-1 TO SPB-INSCHGABL-FG(1).
           MOVE QSPB-INSREJECT-FG-1 TO SPB-INSREJECT-FG(1).
           MOVE QSPB-INSFINCHG-1 TO SPB-INSFINCHG(1).
           MOVE QSPB-INSCOM-2 TO SPB-INSCOM(2).
           MOVE QSPB-INSRATECD-2 TO SPB-INSRATECD(2).
           MOVE QSPB-INSJFAC-2 TO SPB-INSJFAC(2).
           MOVE QSPB-INSDISCNT-2 TO SPB-INSDISCNT(2).
           MOVE QSPB-INSCHGABL-2 TO SPB-INSCHGABL(2).
           MOVE QSPB-INSTERM-2-1 TO SPB-INSTERM(2 1).
           MOVE QSPB-INSRATE-2-1 TO SPB-INSRATE(2 1).
           MOVE QSPB-INSTERM-2-2 TO SPB-INSTERM(2 2).
           MOVE QSPB-INSRATE-2-2 TO SPB-INSRATE(2 2).
           MOVE QSPB-INSTERM-2-3 TO SPB-INSTERM(2 3).
           MOVE QSPB-INSRATE-2-3 TO SPB-INSRATE(2 3).
           MOVE QSPB-INSTERM-2-4 TO SPB-INSTERM(2 4).
           MOVE QSPB-INSRATE-2-4 TO SPB-INSRATE(2 4).
           MOVE QSPB-INSTERM-2-5 TO SPB-INSTERM(2 5).
           MOVE QSPB-INSRATE-2-5 TO SPB-INSRATE(2 5).
           MOVE QSPB-INSTERM-2-6 TO SPB-INSTERM(2 6).
           MOVE QSPB-INSRATE-2-6 TO SPB-INSRATE(2 6).
           MOVE QSPB-INSTERM-2-7 TO SPB-INSTERM(2 7).
           MOVE QSPB-INSRATE-2-7 TO SPB-INSRATE(2 7).
           MOVE QSPB-INSTERM-2-8 TO SPB-INSTERM(2 8).
           MOVE QSPB-INSRATE-2-8 TO SPB-INSRATE(2 8).
           MOVE QSPB-INSTERM-2-9 TO SPB-INSTERM(2 9).
           MOVE QSPB-INSRATE-2-9 TO SPB-INSRATE(2 9).
           MOVE QSPB-INSTERM-2-10 TO SPB-INSTERM(2 10).
           MOVE QSPB-INSRATE-2-10 TO SPB-INSRATE(2 10).
           MOVE QSPB-INSTERM-2-11 TO SPB-INSTERM(2 11).
           MOVE QSPB-INSRATE-2-11 TO SPB-INSRATE(2 11).
           MOVE QSPB-INSTERM-2-12 TO SPB-INSTERM(2 12).
           MOVE QSPB-INSRATE-2-12 TO SPB-INSRATE(2 12).
           MOVE QSPB-INSTERM-2-13 TO SPB-INSTERM(2 13).
           MOVE QSPB-INSRATE-2-13 TO SPB-INSRATE(2 13).
           MOVE QSPB-INSTERM-2-14 TO SPB-INSTERM(2 14).
           MOVE QSPB-INSRATE-2-14 TO SPB-INSRATE(2 14).
           MOVE QSPB-INSTERM-2-15 TO SPB-INSTERM(2 15).
           MOVE QSPB-INSRATE-2-15 TO SPB-INSRATE(2 15).
           MOVE QSPB-INSTERM-2-16 TO SPB-INSTERM(2 16).
           MOVE QSPB-INSRATE-2-16 TO SPB-INSRATE(2 16).
           MOVE QSPB-INSTERM-2-17 TO SPB-INSTERM(2 17).
           MOVE QSPB-INSRATE-2-17 TO SPB-INSRATE(2 17).
           MOVE QSPB-INSTERM-2-18 TO SPB-INSTERM(2 18).
           MOVE QSPB-INSRATE-2-18 TO SPB-INSRATE(2 18).
           MOVE QSPB-INSTERM-2-19 TO SPB-INSTERM(2 19).
           MOVE QSPB-INSRATE-2-19 TO SPB-INSRATE(2 19).
           MOVE QSPB-INSTERM-2-20 TO SPB-INSTERM(2 20).
           MOVE QSPB-INSRATE-2-20 TO SPB-INSRATE(2 20).
           MOVE QSPB-INSMINPREM-2 TO SPB-INSMINPREM(2).
           MOVE QSPB-INSMINCHGABL-2 TO SPB-INSMINCHGABL(2).
           MOVE QSPB-INSMAXCHGABL-2 TO SPB-INSMAXCHGABL(2).
           MOVE QSPB-INSMAXBENIF-2 TO SPB-INSMAXBENIF(2).
           MOVE QSPB-INSMAXTERM-2 TO SPB-INSMAXTERM(2).
           MOVE QSPB-INSCHGBEN-2 TO SPB-INSCHGBEN(2).
           MOVE QSPB-INSEXCEPT-2 TO SPB-INSEXCEPT(2).
           MOVE QSPB-INSNOVER-2 TO SPB-INSNOVER(2).
           MOVE QSPB-INSMINAGE-2-1 TO SPB-INSMINAGE(2 1).
           MOVE QSPB-INSMAXAGE-2-1 TO SPB-INSMAXAGE(2 1).
           MOVE QSPB-INSMAXCOV-2-1 TO SPB-INSMAXCOV(2 1).
           MOVE QSPB-INSMAXTRM-2-1 TO SPB-INSMAXTRM(2 1).
           MOVE QSPB-INSMINAGE-2-2 TO SPB-INSMINAGE(2 2).
           MOVE QSPB-INSMAXAGE-2-2 TO SPB-INSMAXAGE(2 2).
           MOVE QSPB-INSMAXCOV-2-2 TO SPB-INSMAXCOV(2 2).
           MOVE QSPB-INSMAXTRM-2-2 TO SPB-INSMAXTRM(2 2).
           MOVE QSPB-INSMINAGE-2-3 TO SPB-INSMINAGE(2 3).
           MOVE QSPB-INSMAXAGE-2-3 TO SPB-INSMAXAGE(2 3).
           MOVE QSPB-INSMAXCOV-2-3 TO SPB-INSMAXCOV(2 3).
           MOVE QSPB-INSMAXTRM-2-3 TO SPB-INSMAXTRM(2 3).
           MOVE QSPB-INSMINAGE-2-4 TO SPB-INSMINAGE(2 4).
           MOVE QSPB-INSMAXAGE-2-4 TO SPB-INSMAXAGE(2 4).
           MOVE QSPB-INSMAXCOV-2-4 TO SPB-INSMAXCOV(2 4).
           MOVE QSPB-INSMAXTRM-2-4 TO SPB-INSMAXTRM(2 4).
           MOVE QSPB-INSMINAGE-2-5 TO SPB-INSMINAGE(2 5).
           MOVE QSPB-INSMAXAGE-2-5 TO SPB-INSMAXAGE(2 5).
           MOVE QSPB-INSMAXCOV-2-5 TO SPB-INSMAXCOV(2 5).
           MOVE QSPB-INSMAXTRM-2-5 TO SPB-INSMAXTRM(2 5).
           MOVE QSPB-INSFEECD-2 TO SPB-INSFEECD(2).
           MOVE QSPB-INSFEE-FRMLA-2 TO SPB-INSFEE-FRMLA(2).
           MOVE QSPB-INSCHGABL-FG-2 TO SPB-INSCHGABL-FG(2).
           MOVE QSPB-INSREJECT-FG-2 TO SPB-INSREJECT-FG(2).
           MOVE QSPB-INSFINCHG-2 TO SPB-INSFINCHG(2).
           MOVE QSPB-INSCOM-3 TO SPB-INSCOM(3).
           MOVE QSPB-INSRATECD-3 TO SPB-INSRATECD(3).
           MOVE QSPB-INSJFAC-3 TO SPB-INSJFAC(3).
           MOVE QSPB-INSDISCNT-3 TO SPB-INSDISCNT(3).
           MOVE QSPB-INSCHGABL-3 TO SPB-INSCHGABL(3).
           MOVE QSPB-INSTERM-3-1 TO SPB-INSTERM(3 1).
           MOVE QSPB-INSRATE-3-1 TO SPB-INSRATE(3 1).
           MOVE QSPB-INSTERM-3-2 TO SPB-INSTERM(3 2).
           MOVE QSPB-INSRATE-3-2 TO SPB-INSRATE(3 2).
           MOVE QSPB-INSTERM-3-3 TO SPB-INSTERM(3 3).
           MOVE QSPB-INSRATE-3-3 TO SPB-INSRATE(3 3).
           MOVE QSPB-INSTERM-3-4 TO SPB-INSTERM(3 4).
           MOVE QSPB-INSRATE-3-4 TO SPB-INSRATE(3 4).
           MOVE QSPB-INSTERM-3-5 TO SPB-INSTERM(3 5).
           MOVE QSPB-INSRATE-3-5 TO SPB-INSRATE(3 5).
           MOVE QSPB-INSTERM-3-6 TO SPB-INSTERM(3 6).
           MOVE QSPB-INSRATE-3-6 TO SPB-INSRATE(3 6).
           MOVE QSPB-INSTERM-3-7 TO SPB-INSTERM(3 7).
           MOVE QSPB-INSRATE-3-7 TO SPB-INSRATE(3 7).
           MOVE QSPB-INSTERM-3-8 TO SPB-INSTERM(3 8).
           MOVE QSPB-INSRATE-3-8 TO SPB-INSRATE(3 8).
           MOVE QSPB-INSTERM-3-9 TO SPB-INSTERM(3 9).
           MOVE QSPB-INSRATE-3-9 TO SPB-INSRATE(3 9).
           MOVE QSPB-INSTERM-3-10 TO SPB-INSTERM(3 10).
           MOVE QSPB-INSRATE-3-10 TO SPB-INSRATE(3 10).
           MOVE QSPB-INSTERM-3-11 TO SPB-INSTERM(3 11).
           MOVE QSPB-INSRATE-3-11 TO SPB-INSRATE(3 11).
           MOVE QSPB-INSTERM-3-12 TO SPB-INSTERM(3 12).
           MOVE QSPB-INSRATE-3-12 TO SPB-INSRATE(3 12).
           MOVE QSPB-INSTERM-3-13 TO SPB-INSTERM(3 13).
           MOVE QSPB-INSRATE-3-13 TO SPB-INSRATE(3 13).
           MOVE QSPB-INSTERM-3-14 TO SPB-INSTERM(3 14).
           MOVE QSPB-INSRATE-3-14 TO SPB-INSRATE(3 14).
           MOVE QSPB-INSTERM-3-15 TO SPB-INSTERM(3 15).
           MOVE QSPB-INSRATE-3-15 TO SPB-INSRATE(3 15).
           MOVE QSPB-INSTERM-3-16 TO SPB-INSTERM(3 16).
           MOVE QSPB-INSRATE-3-16 TO SPB-INSRATE(3 16).
           MOVE QSPB-INSTERM-3-17 TO SPB-INSTERM(3 17).
           MOVE QSPB-INSRATE-3-17 TO SPB-INSRATE(3 17).
           MOVE QSPB-INSTERM-3-18 TO SPB-INSTERM(3 18).
           MOVE QSPB-INSRATE-3-18 TO SPB-INSRATE(3 18).
           MOVE QSPB-INSTERM-3-19 TO SPB-INSTERM(3 19).
           MOVE QSPB-INSRATE-3-19 TO SPB-INSRATE(3 19).
           MOVE QSPB-INSTERM-3-20 TO SPB-INSTERM(3 20).
           MOVE QSPB-INSRATE-3-20 TO SPB-INSRATE(3 20).
           MOVE QSPB-INSMINPREM-3 TO SPB-INSMINPREM(3).
           MOVE QSPB-INSMINCHGABL-3 TO SPB-INSMINCHGABL(3).
           MOVE QSPB-INSMAXCHGABL-3 TO SPB-INSMAXCHGABL(3).
           MOVE QSPB-INSMAXBENIF-3 TO SPB-INSMAXBENIF(3).
           MOVE QSPB-INSMAXTERM-3 TO SPB-INSMAXTERM(3).
           MOVE QSPB-INSCHGBEN-3 TO SPB-INSCHGBEN(3).
           MOVE QSPB-INSEXCEPT-3 TO SPB-INSEXCEPT(3).
           MOVE QSPB-INSNOVER-3 TO SPB-INSNOVER(3).
           MOVE QSPB-INSMINAGE-3-1 TO SPB-INSMINAGE(3 1).
           MOVE QSPB-INSMAXAGE-3-1 TO SPB-INSMAXAGE(3 1).
           MOVE QSPB-INSMAXCOV-3-1 TO SPB-INSMAXCOV(3 1).
           MOVE QSPB-INSMAXTRM-3-1 TO SPB-INSMAXTRM(3 1).
           MOVE QSPB-INSMINAGE-3-2 TO SPB-INSMINAGE(3 2).
           MOVE QSPB-INSMAXAGE-3-2 TO SPB-INSMAXAGE(3 2).
           MOVE QSPB-INSMAXCOV-3-2 TO SPB-INSMAXCOV(3 2).
           MOVE QSPB-INSMAXTRM-3-2 TO SPB-INSMAXTRM(3 2).
           MOVE QSPB-INSMINAGE-3-3 TO SPB-INSMINAGE(3 3).
           MOVE QSPB-INSMAXAGE-3-3 TO SPB-INSMAXAGE(3 3).
           MOVE QSPB-INSMAXCOV-3-3 TO SPB-INSMAXCOV(3 3).
           MOVE QSPB-INSMAXTRM-3-3 TO SPB-INSMAXTRM(3 3).
           MOVE QSPB-INSMINAGE-3-4 TO SPB-INSMINAGE(3 4).
           MOVE QSPB-INSMAXAGE-3-4 TO SPB-INSMAXAGE(3 4).
           MOVE QSPB-INSMAXCOV-3-4 TO SPB-INSMAXCOV(3 4).
           MOVE QSPB-INSMAXTRM-3-4 TO SPB-INSMAXTRM(3 4).
           MOVE QSPB-INSMINAGE-3-5 TO SPB-INSMINAGE(3 5).
           MOVE QSPB-INSMAXAGE-3-5 TO SPB-INSMAXAGE(3 5).
           MOVE QSPB-INSMAXCOV-3-5 TO SPB-INSMAXCOV(3 5).
           MOVE QSPB-INSMAXTRM-3-5 TO SPB-INSMAXTRM(3 5).
           MOVE QSPB-INSFEECD-3 TO SPB-INSFEECD(3).
           MOVE QSPB-INSFEE-FRMLA-3 TO SPB-INSFEE-FRMLA(3).
           MOVE QSPB-INSCHGABL-FG-3 TO SPB-INSCHGABL-FG(3).
           MOVE QSPB-INSREJECT-FG-3 TO SPB-INSREJECT-FG(3).
           MOVE QSPB-INSFINCHG-3 TO SPB-INSFINCHG(3).
           MOVE QSPB-INSCOM-4 TO SPB-INSCOM(4).
           MOVE QSPB-INSRATECD-4 TO SPB-INSRATECD(4).
           MOVE QSPB-INSJFAC-4 TO SPB-INSJFAC(4).
           MOVE QSPB-INSDISCNT-4 TO SPB-INSDISCNT(4).
           MOVE QSPB-INSCHGABL-4 TO SPB-INSCHGABL(4).
           MOVE QSPB-INSTERM-4-1 TO SPB-INSTERM(4 1).
           MOVE QSPB-INSRATE-4-1 TO SPB-INSRATE(4 1).
           MOVE QSPB-INSTERM-4-2 TO SPB-INSTERM(4 2).
           MOVE QSPB-INSRATE-4-2 TO SPB-INSRATE(4 2).
           MOVE QSPB-INSTERM-4-3 TO SPB-INSTERM(4 3).
           MOVE QSPB-INSRATE-4-3 TO SPB-INSRATE(4 3).
           MOVE QSPB-INSTERM-4-4 TO SPB-INSTERM(4 4).
           MOVE QSPB-INSRATE-4-4 TO SPB-INSRATE(4 4).
           MOVE QSPB-INSTERM-4-5 TO SPB-INSTERM(4 5).
           MOVE QSPB-INSRATE-4-5 TO SPB-INSRATE(4 5).
           MOVE QSPB-INSTERM-4-6 TO SPB-INSTERM(4 6).
           MOVE QSPB-INSRATE-4-6 TO SPB-INSRATE(4 6).
           MOVE QSPB-INSTERM-4-7 TO SPB-INSTERM(4 7).
           MOVE QSPB-INSRATE-4-7 TO SPB-INSRATE(4 7).
           MOVE QSPB-INSTERM-4-8 TO SPB-INSTERM(4 8).
           MOVE QSPB-INSRATE-4-8 TO SPB-INSRATE(4 8).
           MOVE QSPB-INSTERM-4-9 TO SPB-INSTERM(4 9).
           MOVE QSPB-INSRATE-4-9 TO SPB-INSRATE(4 9).
           MOVE QSPB-INSTERM-4-10 TO SPB-INSTERM(4 10).
           MOVE QSPB-INSRATE-4-10 TO SPB-INSRATE(4 10).
           MOVE QSPB-INSTERM-4-11 TO SPB-INSTERM(4 11).
           MOVE QSPB-INSRATE-4-11 TO SPB-INSRATE(4 11).
           MOVE QSPB-INSTERM-4-12 TO SPB-INSTERM(4 12).
           MOVE QSPB-INSRATE-4-12 TO SPB-INSRATE(4 12).
           MOVE QSPB-INSTERM-4-13 TO SPB-INSTERM(4 13).
           MOVE QSPB-INSRATE-4-13 TO SPB-INSRATE(4 13).
           MOVE QSPB-INSTERM-4-14 TO SPB-INSTERM(4 14).
           MOVE QSPB-INSRATE-4-14 TO SPB-INSRATE(4 14).
           MOVE QSPB-INSTERM-4-15 TO SPB-INSTERM(4 15).
           MOVE QSPB-INSRATE-4-15 TO SPB-INSRATE(4 15).
           MOVE QSPB-INSTERM-4-16 TO SPB-INSTERM(4 16).
           MOVE QSPB-INSRATE-4-16 TO SPB-INSRATE(4 16).
           MOVE QSPB-INSTERM-4-17 TO SPB-INSTERM(4 17).
           MOVE QSPB-INSRATE-4-17 TO SPB-INSRATE(4 17).
           MOVE QSPB-INSTERM-4-18 TO SPB-INSTERM(4 18).
           MOVE QSPB-INSRATE-4-18 TO SPB-INSRATE(4 18).
           MOVE QSPB-INSTERM-4-19 TO SPB-INSTERM(4 19).
           MOVE QSPB-INSRATE-4-19 TO SPB-INSRATE(4 19).
           MOVE QSPB-INSTERM-4-20 TO SPB-INSTERM(4 20).
           MOVE QSPB-INSRATE-4-20 TO SPB-INSRATE(4 20).
           MOVE QSPB-INSMINPREM-4 TO SPB-INSMINPREM(4).
           MOVE QSPB-INSMINCHGABL-4 TO SPB-INSMINCHGABL(4).
           MOVE QSPB-INSMAXCHGABL-4 TO SPB-INSMAXCHGABL(4).
           MOVE QSPB-INSMAXBENIF-4 TO SPB-INSMAXBENIF(4).
           MOVE QSPB-INSMAXTERM-4 TO SPB-INSMAXTERM(4).
           MOVE QSPB-INSCHGBEN-4 TO SPB-INSCHGBEN(4).
           MOVE QSPB-INSEXCEPT-4 TO SPB-INSEXCEPT(4).
           MOVE QSPB-INSNOVER-4 TO SPB-INSNOVER(4).
           MOVE QSPB-INSMINAGE-4-1 TO SPB-INSMINAGE(4 1).
           MOVE QSPB-INSMAXAGE-4-1 TO SPB-INSMAXAGE(4 1).
           MOVE QSPB-INSMAXCOV-4-1 TO SPB-INSMAXCOV(4 1).
           MOVE QSPB-INSMAXTRM-4-1 TO SPB-INSMAXTRM(4 1).
           MOVE QSPB-INSMINAGE-4-2 TO SPB-INSMINAGE(4 2).
           MOVE QSPB-INSMAXAGE-4-2 TO SPB-INSMAXAGE(4 2).
           MOVE QSPB-INSMAXCOV-4-2 TO SPB-INSMAXCOV(4 2).
           MOVE QSPB-INSMAXTRM-4-2 TO SPB-INSMAXTRM(4 2).
           MOVE QSPB-INSMINAGE-4-3 TO SPB-INSMINAGE(4 3).
           MOVE QSPB-INSMAXAGE-4-3 TO SPB-INSMAXAGE(4 3).
           MOVE QSPB-INSMAXCOV-4-3 TO SPB-INSMAXCOV(4 3).
           MOVE QSPB-INSMAXTRM-4-3 TO SPB-INSMAXTRM(4 3).
           MOVE QSPB-INSMINAGE-4-4 TO SPB-INSMINAGE(4 4).
           MOVE QSPB-INSMAXAGE-4-4 TO SPB-INSMAXAGE(4 4).
           MOVE QSPB-INSMAXCOV-4-4 TO SPB-INSMAXCOV(4 4).
           MOVE QSPB-INSMAXTRM-4-4 TO SPB-INSMAXTRM(4 4).
           MOVE QSPB-INSMINAGE-4-5 TO SPB-INSMINAGE(4 5).
           MOVE QSPB-INSMAXAGE-4-5 TO SPB-INSMAXAGE(4 5).
           MOVE QSPB-INSMAXCOV-4-5 TO SPB-INSMAXCOV(4 5).
           MOVE QSPB-INSMAXTRM-4-5 TO SPB-INSMAXTRM(4 5).
           MOVE QSPB-INSFEECD-4 TO SPB-INSFEECD(4).
           MOVE QSPB-INSFEE-FRMLA-4 TO SPB-INSFEE-FRMLA(4).
           MOVE QSPB-INSCHGABL-FG-4 TO SPB-INSCHGABL-FG(4).
           MOVE QSPB-INSREJECT-FG-4 TO SPB-INSREJECT-FG(4).
           MOVE QSPB-INSFINCHG-4 TO SPB-INSFINCHG(4).
           MOVE QSPB-INSCOM-5 TO SPB-INSCOM(5).
           MOVE QSPB-INSRATECD-5 TO SPB-INSRATECD(5).
           MOVE QSPB-INSJFAC-5 TO SPB-INSJFAC(5).
           MOVE QSPB-INSDISCNT-5 TO SPB-INSDISCNT(5).
           MOVE QSPB-INSCHGABL-5 TO SPB-INSCHGABL(5).
           MOVE QSPB-INSTERM-5-1 TO SPB-INSTERM(5 1).
           MOVE QSPB-INSRATE-5-1 TO SPB-INSRATE(5 1).
           MOVE QSPB-INSTERM-5-2 TO SPB-INSTERM(5 2).
           MOVE QSPB-INSRATE-5-2 TO SPB-INSRATE(5 2).
           MOVE QSPB-INSTERM-5-3 TO SPB-INSTERM(5 3).
           MOVE QSPB-INSRATE-5-3 TO SPB-INSRATE(5 3).
           MOVE QSPB-INSTERM-5-4 TO SPB-INSTERM(5 4).
           MOVE QSPB-INSRATE-5-4 TO SPB-INSRATE(5 4).
           MOVE QSPB-INSTERM-5-5 TO SPB-INSTERM(5 5).
           MOVE QSPB-INSRATE-5-5 TO SPB-INSRATE(5 5).
           MOVE QSPB-INSTERM-5-6 TO SPB-INSTERM(5 6).
           MOVE QSPB-INSRATE-5-6 TO SPB-INSRATE(5 6).
           MOVE QSPB-INSTERM-5-7 TO SPB-INSTERM(5 7).
           MOVE QSPB-INSRATE-5-7 TO SPB-INSRATE(5 7).
           MOVE QSPB-INSTERM-5-8 TO SPB-INSTERM(5 8).
           MOVE QSPB-INSRATE-5-8 TO SPB-INSRATE(5 8).
           MOVE QSPB-INSTERM-5-9 TO SPB-INSTERM(5 9).
           MOVE QSPB-INSRATE-5-9 TO SPB-INSRATE(5 9).
           MOVE QSPB-INSTERM-5-10 TO SPB-INSTERM(5 10).
           MOVE QSPB-INSRATE-5-10 TO SPB-INSRATE(5 10).
           MOVE QSPB-INSTERM-5-11 TO SPB-INSTERM(5 11).
           MOVE QSPB-INSRATE-5-11 TO SPB-INSRATE(5 11).
           MOVE QSPB-INSTERM-5-12 TO SPB-INSTERM(5 12).
           MOVE QSPB-INSRATE-5-12 TO SPB-INSRATE(5 12).
           MOVE QSPB-INSTERM-5-13 TO SPB-INSTERM(5 13).
           MOVE QSPB-INSRATE-5-13 TO SPB-INSRATE(5 13).
           MOVE QSPB-INSTERM-5-14 TO SPB-INSTERM(5 14).
           MOVE QSPB-INSRATE-5-14 TO SPB-INSRATE(5 14).
           MOVE QSPB-INSTERM-5-15 TO SPB-INSTERM(5 15).
           MOVE QSPB-INSRATE-5-15 TO SPB-INSRATE(5 15).
           MOVE QSPB-INSTERM-5-16 TO SPB-INSTERM(5 16).
           MOVE QSPB-INSRATE-5-16 TO SPB-INSRATE(5 16).
           MOVE QSPB-INSTERM-5-17 TO SPB-INSTERM(5 17).
           MOVE QSPB-INSRATE-5-17 TO SPB-INSRATE(5 17).
           MOVE QSPB-INSTERM-5-18 TO SPB-INSTERM(5 18).
           MOVE QSPB-INSRATE-5-18 TO SPB-INSRATE(5 18).
           MOVE QSPB-INSTERM-5-19 TO SPB-INSTERM(5 19).
           MOVE QSPB-INSRATE-5-19 TO SPB-INSRATE(5 19).
           MOVE QSPB-INSTERM-5-20 TO SPB-INSTERM(5 20).
           MOVE QSPB-INSRATE-5-20 TO SPB-INSRATE(5 20).
           MOVE QSPB-INSMINPREM-5 TO SPB-INSMINPREM(5).
           MOVE QSPB-INSMINCHGABL-5 TO SPB-INSMINCHGABL(5).
           MOVE QSPB-INSMAXCHGABL-5 TO SPB-INSMAXCHGABL(5).
           MOVE QSPB-INSMAXBENIF-5 TO SPB-INSMAXBENIF(5).
           MOVE QSPB-INSMAXTERM-5 TO SPB-INSMAXTERM(5).
           MOVE QSPB-INSCHGBEN-5 TO SPB-INSCHGBEN(5).
           MOVE QSPB-INSEXCEPT-5 TO SPB-INSEXCEPT(5).
           MOVE QSPB-INSNOVER-5 TO SPB-INSNOVER(5).
           MOVE QSPB-INSMINAGE-5-1 TO SPB-INSMINAGE(5 1).
           MOVE QSPB-INSMAXAGE-5-1 TO SPB-INSMAXAGE(5 1).
           MOVE QSPB-INSMAXCOV-5-1 TO SPB-INSMAXCOV(5 1).
           MOVE QSPB-INSMAXTRM-5-1 TO SPB-INSMAXTRM(5 1).
           MOVE QSPB-INSMINAGE-5-2 TO SPB-INSMINAGE(5 2).
           MOVE QSPB-INSMAXAGE-5-2 TO SPB-INSMAXAGE(5 2).
           MOVE QSPB-INSMAXCOV-5-2 TO SPB-INSMAXCOV(5 2).
           MOVE QSPB-INSMAXTRM-5-2 TO SPB-INSMAXTRM(5 2).
           MOVE QSPB-INSMINAGE-5-3 TO SPB-INSMINAGE(5 3).
           MOVE QSPB-INSMAXAGE-5-3 TO SPB-INSMAXAGE(5 3).
           MOVE QSPB-INSMAXCOV-5-3 TO SPB-INSMAXCOV(5 3).
           MOVE QSPB-INSMAXTRM-5-3 TO SPB-INSMAXTRM(5 3).
           MOVE QSPB-INSMINAGE-5-4 TO SPB-INSMINAGE(5 4).
           MOVE QSPB-INSMAXAGE-5-4 TO SPB-INSMAXAGE(5 4).
           MOVE QSPB-INSMAXCOV-5-4 TO SPB-INSMAXCOV(5 4).
           MOVE QSPB-INSMAXTRM-5-4 TO SPB-INSMAXTRM(5 4).
           MOVE QSPB-INSMINAGE-5-5 TO SPB-INSMINAGE(5 5).
           MOVE QSPB-INSMAXAGE-5-5 TO SPB-INSMAXAGE(5 5).
           MOVE QSPB-INSMAXCOV-5-5 TO SPB-INSMAXCOV(5 5).
           MOVE QSPB-INSMAXTRM-5-5 TO SPB-INSMAXTRM(5 5).
           MOVE QSPB-INSFEECD-5 TO SPB-INSFEECD(5).
           MOVE QSPB-INSFEE-FRMLA-5 TO SPB-INSFEE-FRMLA(5).
           MOVE QSPB-INSCHGABL-FG-5 TO SPB-INSCHGABL-FG(5).
           MOVE QSPB-INSREJECT-FG-5 TO SPB-INSREJECT-FG(5).
           MOVE QSPB-INSFINCHG-5 TO SPB-INSFINCHG(5).
           MOVE QSPB-INSCOM-6 TO SPB-INSCOM(6).
           MOVE QSPB-INSRATECD-6 TO SPB-INSRATECD(6).
           MOVE QSPB-INSJFAC-6 TO SPB-INSJFAC(6).
           MOVE QSPB-INSDISCNT-6 TO SPB-INSDISCNT(6).
           MOVE QSPB-INSCHGABL-6 TO SPB-INSCHGABL(6).
           MOVE QSPB-INSTERM-6-1 TO SPB-INSTERM(6 1).
           MOVE QSPB-INSRATE-6-1 TO SPB-INSRATE(6 1).
           MOVE QSPB-INSTERM-6-2 TO SPB-INSTERM(6 2).
           MOVE QSPB-INSRATE-6-2 TO SPB-INSRATE(6 2).
           MOVE QSPB-INSTERM-6-3 TO SPB-INSTERM(6 3).
           MOVE QSPB-INSRATE-6-3 TO SPB-INSRATE(6 3).
           MOVE QSPB-INSTERM-6-4 TO SPB-INSTERM(6 4).
           MOVE QSPB-INSRATE-6-4 TO SPB-INSRATE(6 4).
           MOVE QSPB-INSTERM-6-5 TO SPB-INSTERM(6 5).
           MOVE QSPB-INSRATE-6-5 TO SPB-INSRATE(6 5).
           MOVE QSPB-INSTERM-6-6 TO SPB-INSTERM(6 6).
           MOVE QSPB-INSRATE-6-6 TO SPB-INSRATE(6 6).
           MOVE QSPB-INSTERM-6-7 TO SPB-INSTERM(6 7).
           MOVE QSPB-INSRATE-6-7 TO SPB-INSRATE(6 7).
           MOVE QSPB-INSTERM-6-8 TO SPB-INSTERM(6 8).
           MOVE QSPB-INSRATE-6-8 TO SPB-INSRATE(6 8).
           MOVE QSPB-INSTERM-6-9 TO SPB-INSTERM(6 9).
           MOVE QSPB-INSRATE-6-9 TO SPB-INSRATE(6 9).
           MOVE QSPB-INSTERM-6-10 TO SPB-INSTERM(6 10).
           MOVE QSPB-INSRATE-6-10 TO SPB-INSRATE(6 10).
           MOVE QSPB-INSTERM-6-11 TO SPB-INSTERM(6 11).
           MOVE QSPB-INSRATE-6-11 TO SPB-INSRATE(6 11).
           MOVE QSPB-INSTERM-6-12 TO SPB-INSTERM(6 12).
           MOVE QSPB-INSRATE-6-12 TO SPB-INSRATE(6 12).
           MOVE QSPB-INSTERM-6-13 TO SPB-INSTERM(6 13).
           MOVE QSPB-INSRATE-6-13 TO SPB-INSRATE(6 13).
           MOVE QSPB-INSTERM-6-14 TO SPB-INSTERM(6 14).
           MOVE QSPB-INSRATE-6-14 TO SPB-INSRATE(6 14).
           MOVE QSPB-INSTERM-6-15 TO SPB-INSTERM(6 15).
           MOVE QSPB-INSRATE-6-15 TO SPB-INSRATE(6 15).
           MOVE QSPB-INSTERM-6-16 TO SPB-INSTERM(6 16).
           MOVE QSPB-INSRATE-6-16 TO SPB-INSRATE(6 16).
           MOVE QSPB-INSTERM-6-17 TO SPB-INSTERM(6 17).
           MOVE QSPB-INSRATE-6-17 TO SPB-INSRATE(6 17).
           MOVE QSPB-INSTERM-6-18 TO SPB-INSTERM(6 18).
           MOVE QSPB-INSRATE-6-18 TO SPB-INSRATE(6 18).
           MOVE QSPB-INSTERM-6-19 TO SPB-INSTERM(6 19).
           MOVE QSPB-INSRATE-6-19 TO SPB-INSRATE(6 19).
           MOVE QSPB-INSTERM-6-20 TO SPB-INSTERM(6 20).
           MOVE QSPB-INSRATE-6-20 TO SPB-INSRATE(6 20).
           MOVE QSPB-INSMINPREM-6 TO SPB-INSMINPREM(6).
           MOVE QSPB-INSMINCHGABL-6 TO SPB-INSMINCHGABL(6).
           MOVE QSPB-INSMAXCHGABL-6 TO SPB-INSMAXCHGABL(6).
           MOVE QSPB-INSMAXBENIF-6 TO SPB-INSMAXBENIF(6).
           MOVE QSPB-INSMAXTERM-6 TO SPB-INSMAXTERM(6).
           MOVE QSPB-INSCHGBEN-6 TO SPB-INSCHGBEN(6).
           MOVE QSPB-INSEXCEPT-6 TO SPB-INSEXCEPT(6).
           MOVE QSPB-INSNOVER-6 TO SPB-INSNOVER(6).
           MOVE QSPB-INSMINAGE-6-1 TO SPB-INSMINAGE(6 1).
           MOVE QSPB-INSMAXAGE-6-1 TO SPB-INSMAXAGE(6 1).
           MOVE QSPB-INSMAXCOV-6-1 TO SPB-INSMAXCOV(6 1).
           MOVE QSPB-INSMAXTRM-6-1 TO SPB-INSMAXTRM(6 1).
           MOVE QSPB-INSMINAGE-6-2 TO SPB-INSMINAGE(6 2).
           MOVE QSPB-INSMAXAGE-6-2 TO SPB-INSMAXAGE(6 2).
           MOVE QSPB-INSMAXCOV-6-2 TO SPB-INSMAXCOV(6 2).
           MOVE QSPB-INSMAXTRM-6-2 TO SPB-INSMAXTRM(6 2).
           MOVE QSPB-INSMINAGE-6-3 TO SPB-INSMINAGE(6 3).
           MOVE QSPB-INSMAXAGE-6-3 TO SPB-INSMAXAGE(6 3).
           MOVE QSPB-INSMAXCOV-6-3 TO SPB-INSMAXCOV(6 3).
           MOVE QSPB-INSMAXTRM-6-3 TO SPB-INSMAXTRM(6 3).
           MOVE QSPB-INSMINAGE-6-4 TO SPB-INSMINAGE(6 4).
           MOVE QSPB-INSMAXAGE-6-4 TO SPB-INSMAXAGE(6 4).
           MOVE QSPB-INSMAXCOV-6-4 TO SPB-INSMAXCOV(6 4).
           MOVE QSPB-INSMAXTRM-6-4 TO SPB-INSMAXTRM(6 4).
           MOVE QSPB-INSMINAGE-6-5 TO SPB-INSMINAGE(6 5).
           MOVE QSPB-INSMAXAGE-6-5 TO SPB-INSMAXAGE(6 5).
           MOVE QSPB-INSMAXCOV-6-5 TO SPB-INSMAXCOV(6 5).
           MOVE QSPB-INSMAXTRM-6-5 TO SPB-INSMAXTRM(6 5).
           MOVE QSPB-INSFEECD-6 TO SPB-INSFEECD(6).
           MOVE QSPB-INSFEE-FRMLA-6 TO SPB-INSFEE-FRMLA(6).
           MOVE QSPB-INSCHGABL-FG-6 TO SPB-INSCHGABL-FG(6).
           MOVE QSPB-INSREJECT-FG-6 TO SPB-INSREJECT-FG(6).
           MOVE QSPB-INSFINCHG-6 TO SPB-INSFINCHG(6).
           MOVE QSPB-INSCOM-7 TO SPB-INSCOM(7).
           MOVE QSPB-INSRATECD-7 TO SPB-INSRATECD(7).
           MOVE QSPB-INSJFAC-7 TO SPB-INSJFAC(7).
           MOVE QSPB-INSDISCNT-7 TO SPB-INSDISCNT(7).
           MOVE QSPB-INSCHGABL-7 TO SPB-INSCHGABL(7).
           MOVE QSPB-INSTERM-7-1 TO SPB-INSTERM(7 1).
           MOVE QSPB-INSRATE-7-1 TO SPB-INSRATE(7 1).
           MOVE QSPB-INSTERM-7-2 TO SPB-INSTERM(7 2).
           MOVE QSPB-INSRATE-7-2 TO SPB-INSRATE(7 2).
           MOVE QSPB-INSTERM-7-3 TO SPB-INSTERM(7 3).
           MOVE QSPB-INSRATE-7-3 TO SPB-INSRATE(7 3).
           MOVE QSPB-INSTERM-7-4 TO SPB-INSTERM(7 4).
           MOVE QSPB-INSRATE-7-4 TO SPB-INSRATE(7 4).
           MOVE QSPB-INSTERM-7-5 TO SPB-INSTERM(7 5).
           MOVE QSPB-INSRATE-7-5 TO SPB-INSRATE(7 5).
           MOVE QSPB-INSTERM-7-6 TO SPB-INSTERM(7 6).
           MOVE QSPB-INSRATE-7-6 TO SPB-INSRATE(7 6).
           MOVE QSPB-INSTERM-7-7 TO SPB-INSTERM(7 7).
           MOVE QSPB-INSRATE-7-7 TO SPB-INSRATE(7 7).
           MOVE QSPB-INSTERM-7-8 TO SPB-INSTERM(7 8).
           MOVE QSPB-INSRATE-7-8 TO SPB-INSRATE(7 8).
           MOVE QSPB-INSTERM-7-9 TO SPB-INSTERM(7 9).
           MOVE QSPB-INSRATE-7-9 TO SPB-INSRATE(7 9).
           MOVE QSPB-INSTERM-7-10 TO SPB-INSTERM(7 10).
           MOVE QSPB-INSRATE-7-10 TO SPB-INSRATE(7 10).
           MOVE QSPB-INSTERM-7-11 TO SPB-INSTERM(7 11).
           MOVE QSPB-INSRATE-7-11 TO SPB-INSRATE(7 11).
           MOVE QSPB-INSTERM-7-12 TO SPB-INSTERM(7 12).
           MOVE QSPB-INSRATE-7-12 TO SPB-INSRATE(7 12).
           MOVE QSPB-INSTERM-7-13 TO SPB-INSTERM(7 13).
           MOVE QSPB-INSRATE-7-13 TO SPB-INSRATE(7 13).
           MOVE QSPB-INSTERM-7-14 TO SPB-INSTERM(7 14).
           MOVE QSPB-INSRATE-7-14 TO SPB-INSRATE(7 14).
           MOVE QSPB-INSTERM-7-15 TO SPB-INSTERM(7 15).
           MOVE QSPB-INSRATE-7-15 TO SPB-INSRATE(7 15).
           MOVE QSPB-INSTERM-7-16 TO SPB-INSTERM(7 16).
           MOVE QSPB-INSRATE-7-16 TO SPB-INSRATE(7 16).
           MOVE QSPB-INSTERM-7-17 TO SPB-INSTERM(7 17).
           MOVE QSPB-INSRATE-7-17 TO SPB-INSRATE(7 17).
           MOVE QSPB-INSTERM-7-18 TO SPB-INSTERM(7 18).
           MOVE QSPB-INSRATE-7-18 TO SPB-INSRATE(7 18).
           MOVE QSPB-INSTERM-7-19 TO SPB-INSTERM(7 19).
           MOVE QSPB-INSRATE-7-19 TO SPB-INSRATE(7 19).
           MOVE QSPB-INSTERM-7-20 TO SPB-INSTERM(7 20).
           MOVE QSPB-INSRATE-7-20 TO SPB-INSRATE(7 20).
           MOVE QSPB-INSMINPREM-7 TO SPB-INSMINPREM(7).
           MOVE QSPB-INSMINCHGABL-7 TO SPB-INSMINCHGABL(7).
           MOVE QSPB-INSMAXCHGABL-7 TO SPB-INSMAXCHGABL(7).
           MOVE QSPB-INSMAXBENIF-7 TO SPB-INSMAXBENIF(7).
           MOVE QSPB-INSMAXTERM-7 TO SPB-INSMAXTERM(7).
           MOVE QSPB-INSCHGBEN-7 TO SPB-INSCHGBEN(7).
           MOVE QSPB-INSEXCEPT-7 TO SPB-INSEXCEPT(7).
           MOVE QSPB-INSNOVER-7 TO SPB-INSNOVER(7).
           MOVE QSPB-INSMINAGE-7-1 TO SPB-INSMINAGE(7 1).
           MOVE QSPB-INSMAXAGE-7-1 TO SPB-INSMAXAGE(7 1).
           MOVE QSPB-INSMAXCOV-7-1 TO SPB-INSMAXCOV(7 1).
           MOVE QSPB-INSMAXTRM-7-1 TO SPB-INSMAXTRM(7 1).
           MOVE QSPB-INSMINAGE-7-2 TO SPB-INSMINAGE(7 2).
           MOVE QSPB-INSMAXAGE-7-2 TO SPB-INSMAXAGE(7 2).
           MOVE QSPB-INSMAXCOV-7-2 TO SPB-INSMAXCOV(7 2).
           MOVE QSPB-INSMAXTRM-7-2 TO SPB-INSMAXTRM(7 2).
           MOVE QSPB-INSMINAGE-7-3 TO SPB-INSMINAGE(7 3).
           MOVE QSPB-INSMAXAGE-7-3 TO SPB-INSMAXAGE(7 3).
           MOVE QSPB-INSMAXCOV-7-3 TO SPB-INSMAXCOV(7 3).
           MOVE QSPB-INSMAXTRM-7-3 TO SPB-INSMAXTRM(7 3).
           MOVE QSPB-INSMINAGE-7-4 TO SPB-INSMINAGE(7 4).
           MOVE QSPB-INSMAXAGE-7-4 TO SPB-INSMAXAGE(7 4).
           MOVE QSPB-INSMAXCOV-7-4 TO SPB-INSMAXCOV(7 4).
           MOVE QSPB-INSMAXTRM-7-4 TO SPB-INSMAXTRM(7 4).
           MOVE QSPB-INSMINAGE-7-5 TO SPB-INSMINAGE(7 5).
           MOVE QSPB-INSMAXAGE-7-5 TO SPB-INSMAXAGE(7 5).
           MOVE QSPB-INSMAXCOV-7-5 TO SPB-INSMAXCOV(7 5).
           MOVE QSPB-INSMAXTRM-7-5 TO SPB-INSMAXTRM(7 5).
           MOVE QSPB-INSFEECD-7 TO SPB-INSFEECD(7).
           MOVE QSPB-INSFEE-FRMLA-7 TO SPB-INSFEE-FRMLA(7).
           MOVE QSPB-INSCHGABL-FG-7 TO SPB-INSCHGABL-FG(7).
           MOVE QSPB-INSREJECT-FG-7 TO SPB-INSREJECT-FG(7).
           MOVE QSPB-INSFINCHG-7 TO SPB-INSFINCHG(7).
           MOVE QSPB-INSCOM-8 TO SPB-INSCOM(8).
           MOVE QSPB-INSRATECD-8 TO SPB-INSRATECD(8).
           MOVE QSPB-INSJFAC-8 TO SPB-INSJFAC(8).
           MOVE QSPB-INSDISCNT-8 TO SPB-INSDISCNT(8).
           MOVE QSPB-INSCHGABL-8 TO SPB-INSCHGABL(8).
           MOVE QSPB-INSTERM-8-1 TO SPB-INSTERM(8 1).
           MOVE QSPB-INSRATE-8-1 TO SPB-INSRATE(8 1).
           MOVE QSPB-INSTERM-8-2 TO SPB-INSTERM(8 2).
           MOVE QSPB-INSRATE-8-2 TO SPB-INSRATE(8 2).
           MOVE QSPB-INSTERM-8-3 TO SPB-INSTERM(8 3).
           MOVE QSPB-INSRATE-8-3 TO SPB-INSRATE(8 3).
           MOVE QSPB-INSTERM-8-4 TO SPB-INSTERM(8 4).
           MOVE QSPB-INSRATE-8-4 TO SPB-INSRATE(8 4).
           MOVE QSPB-INSTERM-8-5 TO SPB-INSTERM(8 5).
           MOVE QSPB-INSRATE-8-5 TO SPB-INSRATE(8 5).
           MOVE QSPB-INSTERM-8-6 TO SPB-INSTERM(8 6).
           MOVE QSPB-INSRATE-8-6 TO SPB-INSRATE(8 6).
           MOVE QSPB-INSTERM-8-7 TO SPB-INSTERM(8 7).
           MOVE QSPB-INSRATE-8-7 TO SPB-INSRATE(8 7).
           MOVE QSPB-INSTERM-8-8 TO SPB-INSTERM(8 8).
           MOVE QSPB-INSRATE-8-8 TO SPB-INSRATE(8 8).
           MOVE QSPB-INSTERM-8-9 TO SPB-INSTERM(8 9).
           MOVE QSPB-INSRATE-8-9 TO SPB-INSRATE(8 9).
           MOVE QSPB-INSTERM-8-10 TO SPB-INSTERM(8 10).
           MOVE QSPB-INSRATE-8-10 TO SPB-INSRATE(8 10).
           MOVE QSPB-INSTERM-8-11 TO SPB-INSTERM(8 11).
           MOVE QSPB-INSRATE-8-11 TO SPB-INSRATE(8 11).
           MOVE QSPB-INSTERM-8-12 TO SPB-INSTERM(8 12).
           MOVE QSPB-INSRATE-8-12 TO SPB-INSRATE(8 12).
           MOVE QSPB-INSTERM-8-13 TO SPB-INSTERM(8 13).
           MOVE QSPB-INSRATE-8-13 TO SPB-INSRATE(8 13).
           MOVE QSPB-INSTERM-8-14 TO SPB-INSTERM(8 14).
           MOVE QSPB-INSRATE-8-14 TO SPB-INSRATE(8 14).
           MOVE QSPB-INSTERM-8-15 TO SPB-INSTERM(8 15).
           MOVE QSPB-INSRATE-8-15 TO SPB-INSRATE(8 15).
           MOVE QSPB-INSTERM-8-16 TO SPB-INSTERM(8 16).
           MOVE QSPB-INSRATE-8-16 TO SPB-INSRATE(8 16).
           MOVE QSPB-INSTERM-8-17 TO SPB-INSTERM(8 17).
           MOVE QSPB-INSRATE-8-17 TO SPB-INSRATE(8 17).
           MOVE QSPB-INSTERM-8-18 TO SPB-INSTERM(8 18).
           MOVE QSPB-INSRATE-8-18 TO SPB-INSRATE(8 18).
           MOVE QSPB-INSTERM-8-19 TO SPB-INSTERM(8 19).
           MOVE QSPB-INSRATE-8-19 TO SPB-INSRATE(8 19).
           MOVE QSPB-INSTERM-8-20 TO SPB-INSTERM(8 20).
           MOVE QSPB-INSRATE-8-20 TO SPB-INSRATE(8 20).
           MOVE QSPB-INSMINPREM-8 TO SPB-INSMINPREM(8).
           MOVE QSPB-INSMINCHGABL-8 TO SPB-INSMINCHGABL(8).
           MOVE QSPB-INSMAXCHGABL-8 TO SPB-INSMAXCHGABL(8).
           MOVE QSPB-INSMAXBENIF-8 TO SPB-INSMAXBENIF(8).
           MOVE QSPB-INSMAXTERM-8 TO SPB-INSMAXTERM(8).
           MOVE QSPB-INSCHGBEN-8 TO SPB-INSCHGBEN(8).
           MOVE QSPB-INSEXCEPT-8 TO SPB-INSEXCEPT(8).
           MOVE QSPB-INSNOVER-8 TO SPB-INSNOVER(8).
           MOVE QSPB-INSMINAGE-8-1 TO SPB-INSMINAGE(8 1).
           MOVE QSPB-INSMAXAGE-8-1 TO SPB-INSMAXAGE(8 1).
           MOVE QSPB-INSMAXCOV-8-1 TO SPB-INSMAXCOV(8 1).
           MOVE QSPB-INSMAXTRM-8-1 TO SPB-INSMAXTRM(8 1).
           MOVE QSPB-INSMINAGE-8-2 TO SPB-INSMINAGE(8 2).
           MOVE QSPB-INSMAXAGE-8-2 TO SPB-INSMAXAGE(8 2).
           MOVE QSPB-INSMAXCOV-8-2 TO SPB-INSMAXCOV(8 2).
           MOVE QSPB-INSMAXTRM-8-2 TO SPB-INSMAXTRM(8 2).
           MOVE QSPB-INSMINAGE-8-3 TO SPB-INSMINAGE(8 3).
           MOVE QSPB-INSMAXAGE-8-3 TO SPB-INSMAXAGE(8 3).
           MOVE QSPB-INSMAXCOV-8-3 TO SPB-INSMAXCOV(8 3).
           MOVE QSPB-INSMAXTRM-8-3 TO SPB-INSMAXTRM(8 3).
           MOVE QSPB-INSMINAGE-8-4 TO SPB-INSMINAGE(8 4).
           MOVE QSPB-INSMAXAGE-8-4 TO SPB-INSMAXAGE(8 4).
           MOVE QSPB-INSMAXCOV-8-4 TO SPB-INSMAXCOV(8 4).
           MOVE QSPB-INSMAXTRM-8-4 TO SPB-INSMAXTRM(8 4).
           MOVE QSPB-INSMINAGE-8-5 TO SPB-INSMINAGE(8 5).
           MOVE QSPB-INSMAXAGE-8-5 TO SPB-INSMAXAGE(8 5).
           MOVE QSPB-INSMAXCOV-8-5 TO SPB-INSMAXCOV(8 5).
           MOVE QSPB-INSMAXTRM-8-5 TO SPB-INSMAXTRM(8 5).
           MOVE QSPB-INSFEECD-8 TO SPB-INSFEECD(8).
           MOVE QSPB-INSFEE-FRMLA-8 TO SPB-INSFEE-FRMLA(8).
           MOVE QSPB-INSCHGABL-FG-8 TO SPB-INSCHGABL-FG(8).
           MOVE QSPB-INSREJECT-FG-8 TO SPB-INSREJECT-FG(8).
           MOVE QSPB-INSFINCHG-8 TO SPB-INSFINCHG(8).
           MOVE QSPB-INSCOM-9 TO SPB-INSCOM(9).
           MOVE QSPB-INSRATECD-9 TO SPB-INSRATECD(9).
           MOVE QSPB-INSJFAC-9 TO SPB-INSJFAC(9).
           MOVE QSPB-INSDISCNT-9 TO SPB-INSDISCNT(9).
           MOVE QSPB-INSCHGABL-9 TO SPB-INSCHGABL(9).
           MOVE QSPB-INSTERM-9-1 TO SPB-INSTERM(9 1).
           MOVE QSPB-INSRATE-9-1 TO SPB-INSRATE(9 1).
           MOVE QSPB-INSTERM-9-2 TO SPB-INSTERM(9 2).
           MOVE QSPB-INSRATE-9-2 TO SPB-INSRATE(9 2).
           MOVE QSPB-INSTERM-9-3 TO SPB-INSTERM(9 3).
           MOVE QSPB-INSRATE-9-3 TO SPB-INSRATE(9 3).
           MOVE QSPB-INSTERM-9-4 TO SPB-INSTERM(9 4).
           MOVE QSPB-INSRATE-9-4 TO SPB-INSRATE(9 4).
           MOVE QSPB-INSTERM-9-5 TO SPB-INSTERM(9 5).
           MOVE QSPB-INSRATE-9-5 TO SPB-INSRATE(9 5).
           MOVE QSPB-INSTERM-9-6 TO SPB-INSTERM(9 6).
           MOVE QSPB-INSRATE-9-6 TO SPB-INSRATE(9 6).
           MOVE QSPB-INSTERM-9-7 TO SPB-INSTERM(9 7).
           MOVE QSPB-INSRATE-9-7 TO SPB-INSRATE(9 7).
           MOVE QSPB-INSTERM-9-8 TO SPB-INSTERM(9 8).
           MOVE QSPB-INSRATE-9-8 TO SPB-INSRATE(9 8).
           MOVE QSPB-INSTERM-9-9 TO SPB-INSTERM(9 9).
           MOVE QSPB-INSRATE-9-9 TO SPB-INSRATE(9 9).
           MOVE QSPB-INSTERM-9-10 TO SPB-INSTERM(9 10).
           MOVE QSPB-INSRATE-9-10 TO SPB-INSRATE(9 10).
           MOVE QSPB-INSTERM-9-11 TO SPB-INSTERM(9 11).
           MOVE QSPB-INSRATE-9-11 TO SPB-INSRATE(9 11).
           MOVE QSPB-INSTERM-9-12 TO SPB-INSTERM(9 12).
           MOVE QSPB-INSRATE-9-12 TO SPB-INSRATE(9 12).
           MOVE QSPB-INSTERM-9-13 TO SPB-INSTERM(9 13).
           MOVE QSPB-INSRATE-9-13 TO SPB-INSRATE(9 13).
           MOVE QSPB-INSTERM-9-14 TO SPB-INSTERM(9 14).
           MOVE QSPB-INSRATE-9-14 TO SPB-INSRATE(9 14).
           MOVE QSPB-INSTERM-9-15 TO SPB-INSTERM(9 15).
           MOVE QSPB-INSRATE-9-15 TO SPB-INSRATE(9 15).
           MOVE QSPB-INSTERM-9-16 TO SPB-INSTERM(9 16).
           MOVE QSPB-INSRATE-9-16 TO SPB-INSRATE(9 16).
           MOVE QSPB-INSTERM-9-17 TO SPB-INSTERM(9 17).
           MOVE QSPB-INSRATE-9-17 TO SPB-INSRATE(9 17).
           MOVE QSPB-INSTERM-9-18 TO SPB-INSTERM(9 18).
           MOVE QSPB-INSRATE-9-18 TO SPB-INSRATE(9 18).
           MOVE QSPB-INSTERM-9-19 TO SPB-INSTERM(9 19).
           MOVE QSPB-INSRATE-9-19 TO SPB-INSRATE(9 19).
           MOVE QSPB-INSTERM-9-20 TO SPB-INSTERM(9 20).
           MOVE QSPB-INSRATE-9-20 TO SPB-INSRATE(9 20).
           MOVE QSPB-INSMINPREM-9 TO SPB-INSMINPREM(9).
           MOVE QSPB-INSMINCHGABL-9 TO SPB-INSMINCHGABL(9).
           MOVE QSPB-INSMAXCHGABL-9 TO SPB-INSMAXCHGABL(9).
           MOVE QSPB-INSMAXBENIF-9 TO SPB-INSMAXBENIF(9).
           MOVE QSPB-INSMAXTERM-9 TO SPB-INSMAXTERM(9).
           MOVE QSPB-INSCHGBEN-9 TO SPB-INSCHGBEN(9).
           MOVE QSPB-INSEXCEPT-9 TO SPB-INSEXCEPT(9).
           MOVE QSPB-INSNOVER-9 TO SPB-INSNOVER(9).
           MOVE QSPB-INSMINAGE-9-1 TO SPB-INSMINAGE(9 1).
           MOVE QSPB-INSMAXAGE-9-1 TO SPB-INSMAXAGE(9 1).
           MOVE QSPB-INSMAXCOV-9-1 TO SPB-INSMAXCOV(9 1).
           MOVE QSPB-INSMAXTRM-9-1 TO SPB-INSMAXTRM(9 1).
           MOVE QSPB-INSMINAGE-9-2 TO SPB-INSMINAGE(9 2).
           MOVE QSPB-INSMAXAGE-9-2 TO SPB-INSMAXAGE(9 2).
           MOVE QSPB-INSMAXCOV-9-2 TO SPB-INSMAXCOV(9 2).
           MOVE QSPB-INSMAXTRM-9-2 TO SPB-INSMAXTRM(9 2).
           MOVE QSPB-INSMINAGE-9-3 TO SPB-INSMINAGE(9 3).
           MOVE QSPB-INSMAXAGE-9-3 TO SPB-INSMAXAGE(9 3).
           MOVE QSPB-INSMAXCOV-9-3 TO SPB-INSMAXCOV(9 3).
           MOVE QSPB-INSMAXTRM-9-3 TO SPB-INSMAXTRM(9 3).
           MOVE QSPB-INSMINAGE-9-4 TO SPB-INSMINAGE(9 4).
           MOVE QSPB-INSMAXAGE-9-4 TO SPB-INSMAXAGE(9 4).
           MOVE QSPB-INSMAXCOV-9-4 TO SPB-INSMAXCOV(9 4).
           MOVE QSPB-INSMAXTRM-9-4 TO SPB-INSMAXTRM(9 4).
           MOVE QSPB-INSMINAGE-9-5 TO SPB-INSMINAGE(9 5).
           MOVE QSPB-INSMAXAGE-9-5 TO SPB-INSMAXAGE(9 5).
           MOVE QSPB-INSMAXCOV-9-5 TO SPB-INSMAXCOV(9 5).
           MOVE QSPB-INSMAXTRM-9-5 TO SPB-INSMAXTRM(9 5).
           MOVE QSPB-INSFEECD-9 TO SPB-INSFEECD(9).
           MOVE QSPB-INSFEE-FRMLA-9 TO SPB-INSFEE-FRMLA(9).
           MOVE QSPB-INSCHGABL-FG-9 TO SPB-INSCHGABL-FG(9).
           MOVE QSPB-INSREJECT-FG-9 TO SPB-INSREJECT-FG(9).
           MOVE QSPB-INSFINCHG-9 TO SPB-INSFINCHG(9).
           MOVE QSPB-INSCOM-10 TO SPB-INSCOM(10).
           MOVE QSPB-INSRATECD-10 TO SPB-INSRATECD(10).
           MOVE QSPB-INSJFAC-10 TO SPB-INSJFAC(10).
           MOVE QSPB-INSDISCNT-10 TO SPB-INSDISCNT(10).
           MOVE QSPB-INSCHGABL-10 TO SPB-INSCHGABL(10).
           MOVE QSPB-INSTERM-10-1 TO SPB-INSTERM(10 1).
           MOVE QSPB-INSRATE-10-1 TO SPB-INSRATE(10 1).
           MOVE QSPB-INSTERM-10-2 TO SPB-INSTERM(10 2).
           MOVE QSPB-INSRATE-10-2 TO SPB-INSRATE(10 2).
           MOVE QSPB-INSTERM-10-3 TO SPB-INSTERM(10 3).
           MOVE QSPB-INSRATE-10-3 TO SPB-INSRATE(10 3).
           MOVE QSPB-INSTERM-10-4 TO SPB-INSTERM(10 4).
           MOVE QSPB-INSRATE-10-4 TO SPB-INSRATE(10 4).
           MOVE QSPB-INSTERM-10-5 TO SPB-INSTERM(10 5).
           MOVE QSPB-INSRATE-10-5 TO SPB-INSRATE(10 5).
           MOVE QSPB-INSTERM-10-6 TO SPB-INSTERM(10 6).
           MOVE QSPB-INSRATE-10-6 TO SPB-INSRATE(10 6).
           MOVE QSPB-INSTERM-10-7 TO SPB-INSTERM(10 7).
           MOVE QSPB-INSRATE-10-7 TO SPB-INSRATE(10 7).
           MOVE QSPB-INSTERM-10-8 TO SPB-INSTERM(10 8).
           MOVE QSPB-INSRATE-10-8 TO SPB-INSRATE(10 8).
           MOVE QSPB-INSTERM-10-9 TO SPB-INSTERM(10 9).
           MOVE QSPB-INSRATE-10-9 TO SPB-INSRATE(10 9).
           MOVE QSPB-INSTERM-10-10 TO SPB-INSTERM(10 10).
           MOVE QSPB-INSRATE-10-10 TO SPB-INSRATE(10 10).
           MOVE QSPB-INSTERM-10-11 TO SPB-INSTERM(10 11).
           MOVE QSPB-INSRATE-10-11 TO SPB-INSRATE(10 11).
           MOVE QSPB-INSTERM-10-12 TO SPB-INSTERM(10 12).
           MOVE QSPB-INSRATE-10-12 TO SPB-INSRATE(10 12).
           MOVE QSPB-INSTERM-10-13 TO SPB-INSTERM(10 13).
           MOVE QSPB-INSRATE-10-13 TO SPB-INSRATE(10 13).
           MOVE QSPB-INSTERM-10-14 TO SPB-INSTERM(10 14).
           MOVE QSPB-INSRATE-10-14 TO SPB-INSRATE(10 14).
           MOVE QSPB-INSTERM-10-15 TO SPB-INSTERM(10 15).
           MOVE QSPB-INSRATE-10-15 TO SPB-INSRATE(10 15).
           MOVE QSPB-INSTERM-10-16 TO SPB-INSTERM(10 16).
           MOVE QSPB-INSRATE-10-16 TO SPB-INSRATE(10 16).
           MOVE QSPB-INSTERM-10-17 TO SPB-INSTERM(10 17).
           MOVE QSPB-INSRATE-10-17 TO SPB-INSRATE(10 17).
           MOVE QSPB-INSTERM-10-18 TO SPB-INSTERM(10 18).
           MOVE QSPB-INSRATE-10-18 TO SPB-INSRATE(10 18).
           MOVE QSPB-INSTERM-10-19 TO SPB-INSTERM(10 19).
           MOVE QSPB-INSRATE-10-19 TO SPB-INSRATE(10 19).
           MOVE QSPB-INSTERM-10-20 TO SPB-INSTERM(10 20).
           MOVE QSPB-INSRATE-10-20 TO SPB-INSRATE(10 20).
           MOVE QSPB-INSMINPREM-10 TO SPB-INSMINPREM(10).
           MOVE QSPB-INSMINCHGABL-10 TO SPB-INSMINCHGABL(10).
           MOVE QSPB-INSMAXCHGABL-10 TO SPB-INSMAXCHGABL(10).
           MOVE QSPB-INSMAXBENIF-10 TO SPB-INSMAXBENIF(10).
           MOVE QSPB-INSMAXTERM-10 TO SPB-INSMAXTERM(10).
           MOVE QSPB-INSCHGBEN-10 TO SPB-INSCHGBEN(10).
           MOVE QSPB-INSEXCEPT-10 TO SPB-INSEXCEPT(10).
           MOVE QSPB-INSNOVER-10 TO SPB-INSNOVER(10).
           MOVE QSPB-INSMINAGE-10-1 TO SPB-INSMINAGE(10 1).
           MOVE QSPB-INSMAXAGE-10-1 TO SPB-INSMAXAGE(10 1).
           MOVE QSPB-INSMAXCOV-10-1 TO SPB-INSMAXCOV(10 1).
           MOVE QSPB-INSMAXTRM-10-1 TO SPB-INSMAXTRM(10 1).
           MOVE QSPB-INSMINAGE-10-2 TO SPB-INSMINAGE(10 2).
           MOVE QSPB-INSMAXAGE-10-2 TO SPB-INSMAXAGE(10 2).
           MOVE QSPB-INSMAXCOV-10-2 TO SPB-INSMAXCOV(10 2).
           MOVE QSPB-INSMAXTRM-10-2 TO SPB-INSMAXTRM(10 2).
           MOVE QSPB-INSMINAGE-10-3 TO SPB-INSMINAGE(10 3).
           MOVE QSPB-INSMAXAGE-10-3 TO SPB-INSMAXAGE(10 3).
           MOVE QSPB-INSMAXCOV-10-3 TO SPB-INSMAXCOV(10 3).
           MOVE QSPB-INSMAXTRM-10-3 TO SPB-INSMAXTRM(10 3).
           MOVE QSPB-INSMINAGE-10-4 TO SPB-INSMINAGE(10 4).
           MOVE QSPB-INSMAXAGE-10-4 TO SPB-INSMAXAGE(10 4).
           MOVE QSPB-INSMAXCOV-10-4 TO SPB-INSMAXCOV(10 4).
           MOVE QSPB-INSMAXTRM-10-4 TO SPB-INSMAXTRM(10 4).
           MOVE QSPB-INSMINAGE-10-5 TO SPB-INSMINAGE(10 5).
           MOVE QSPB-INSMAXAGE-10-5 TO SPB-INSMAXAGE(10 5).
           MOVE QSPB-INSMAXCOV-10-5 TO SPB-INSMAXCOV(10 5).
           MOVE QSPB-INSMAXTRM-10-5 TO SPB-INSMAXTRM(10 5).
           MOVE QSPB-INSFEECD-10 TO SPB-INSFEECD(10).
           MOVE QSPB-INSFEE-FRMLA-10 TO SPB-INSFEE-FRMLA(10).
           MOVE QSPB-INSCHGABL-FG-10 TO SPB-INSCHGABL-FG(10).
           MOVE QSPB-INSREJECT-FG-10 TO SPB-INSREJECT-FG(10).
           MOVE QSPB-INSFINCHG-10 TO SPB-INSFINCHG(10).
           MOVE QSPB-INSCOM-11 TO SPB-INSCOM(11).
           MOVE QSPB-INSRATECD-11 TO SPB-INSRATECD(11).
           MOVE QSPB-INSJFAC-11 TO SPB-INSJFAC(11).
           MOVE QSPB-INSDISCNT-11 TO SPB-INSDISCNT(11).
           MOVE QSPB-INSCHGABL-11 TO SPB-INSCHGABL(11).
           MOVE QSPB-INSTERM-11-1 TO SPB-INSTERM(11 1).
           MOVE QSPB-INSRATE-11-1 TO SPB-INSRATE(11 1).
           MOVE QSPB-INSTERM-11-2 TO SPB-INSTERM(11 2).
           MOVE QSPB-INSRATE-11-2 TO SPB-INSRATE(11 2).
           MOVE QSPB-INSTERM-11-3 TO SPB-INSTERM(11 3).
           MOVE QSPB-INSRATE-11-3 TO SPB-INSRATE(11 3).
           MOVE QSPB-INSTERM-11-4 TO SPB-INSTERM(11 4).
           MOVE QSPB-INSRATE-11-4 TO SPB-INSRATE(11 4).
           MOVE QSPB-INSTERM-11-5 TO SPB-INSTERM(11 5).
           MOVE QSPB-INSRATE-11-5 TO SPB-INSRATE(11 5).
           MOVE QSPB-INSTERM-11-6 TO SPB-INSTERM(11 6).
           MOVE QSPB-INSRATE-11-6 TO SPB-INSRATE(11 6).
           MOVE QSPB-INSTERM-11-7 TO SPB-INSTERM(11 7).
           MOVE QSPB-INSRATE-11-7 TO SPB-INSRATE(11 7).
           MOVE QSPB-INSTERM-11-8 TO SPB-INSTERM(11 8).
           MOVE QSPB-INSRATE-11-8 TO SPB-INSRATE(11 8).
           MOVE QSPB-INSTERM-11-9 TO SPB-INSTERM(11 9).
           MOVE QSPB-INSRATE-11-9 TO SPB-INSRATE(11 9).
           MOVE QSPB-INSTERM-11-10 TO SPB-INSTERM(11 10).
           MOVE QSPB-INSRATE-11-10 TO SPB-INSRATE(11 10).
           MOVE QSPB-INSTERM-11-11 TO SPB-INSTERM(11 11).
           MOVE QSPB-INSRATE-11-11 TO SPB-INSRATE(11 11).
           MOVE QSPB-INSTERM-11-12 TO SPB-INSTERM(11 12).
           MOVE QSPB-INSRATE-11-12 TO SPB-INSRATE(11 12).
           MOVE QSPB-INSTERM-11-13 TO SPB-INSTERM(11 13).
           MOVE QSPB-INSRATE-11-13 TO SPB-INSRATE(11 13).
           MOVE QSPB-INSTERM-11-14 TO SPB-INSTERM(11 14).
           MOVE QSPB-INSRATE-11-14 TO SPB-INSRATE(11 14).
           MOVE QSPB-INSTERM-11-15 TO SPB-INSTERM(11 15).
           MOVE QSPB-INSRATE-11-15 TO SPB-INSRATE(11 15).
           MOVE QSPB-INSTERM-11-16 TO SPB-INSTERM(11 16).
           MOVE QSPB-INSRATE-11-16 TO SPB-INSRATE(11 16).
           MOVE QSPB-INSTERM-11-17 TO SPB-INSTERM(11 17).
           MOVE QSPB-INSRATE-11-17 TO SPB-INSRATE(11 17).
           MOVE QSPB-INSTERM-11-18 TO SPB-INSTERM(11 18).
           MOVE QSPB-INSRATE-11-18 TO SPB-INSRATE(11 18).
           MOVE QSPB-INSTERM-11-19 TO SPB-INSTERM(11 19).
           MOVE QSPB-INSRATE-11-19 TO SPB-INSRATE(11 19).
           MOVE QSPB-INSTERM-11-20 TO SPB-INSTERM(11 20).
           MOVE QSPB-INSRATE-11-20 TO SPB-INSRATE(11 20).
           MOVE QSPB-INSMINPREM-11 TO SPB-INSMINPREM(11).
           MOVE QSPB-INSMINCHGABL-11 TO SPB-INSMINCHGABL(11).
           MOVE QSPB-INSMAXCHGABL-11 TO SPB-INSMAXCHGABL(11).
           MOVE QSPB-INSMAXBENIF-11 TO SPB-INSMAXBENIF(11).
           MOVE QSPB-INSMAXTERM-11 TO SPB-INSMAXTERM(11).
           MOVE QSPB-INSCHGBEN-11 TO SPB-INSCHGBEN(11).
           MOVE QSPB-INSEXCEPT-11 TO SPB-INSEXCEPT(11).
           MOVE QSPB-INSNOVER-11 TO SPB-INSNOVER(11).
           MOVE QSPB-INSMINAGE-11-1 TO SPB-INSMINAGE(11 1).
           MOVE QSPB-INSMAXAGE-11-1 TO SPB-INSMAXAGE(11 1).
           MOVE QSPB-INSMAXCOV-11-1 TO SPB-INSMAXCOV(11 1).
           MOVE QSPB-INSMAXTRM-11-1 TO SPB-INSMAXTRM(11 1).
           MOVE QSPB-INSMINAGE-11-2 TO SPB-INSMINAGE(11 2).
           MOVE QSPB-INSMAXAGE-11-2 TO SPB-INSMAXAGE(11 2).
           MOVE QSPB-INSMAXCOV-11-2 TO SPB-INSMAXCOV(11 2).
           MOVE QSPB-INSMAXTRM-11-2 TO SPB-INSMAXTRM(11 2).
           MOVE QSPB-INSMINAGE-11-3 TO SPB-INSMINAGE(11 3).
           MOVE QSPB-INSMAXAGE-11-3 TO SPB-INSMAXAGE(11 3).
           MOVE QSPB-INSMAXCOV-11-3 TO SPB-INSMAXCOV(11 3).
           MOVE QSPB-INSMAXTRM-11-3 TO SPB-INSMAXTRM(11 3).
           MOVE QSPB-INSMINAGE-11-4 TO SPB-INSMINAGE(11 4).
           MOVE QSPB-INSMAXAGE-11-4 TO SPB-INSMAXAGE(11 4).
           MOVE QSPB-INSMAXCOV-11-4 TO SPB-INSMAXCOV(11 4).
           MOVE QSPB-INSMAXTRM-11-4 TO SPB-INSMAXTRM(11 4).
           MOVE QSPB-INSMINAGE-11-5 TO SPB-INSMINAGE(11 5).
           MOVE QSPB-INSMAXAGE-11-5 TO SPB-INSMAXAGE(11 5).
           MOVE QSPB-INSMAXCOV-11-5 TO SPB-INSMAXCOV(11 5).
           MOVE QSPB-INSMAXTRM-11-5 TO SPB-INSMAXTRM(11 5).
           MOVE QSPB-INSFEECD-11 TO SPB-INSFEECD(11).
           MOVE QSPB-INSFEE-FRMLA-11 TO SPB-INSFEE-FRMLA(11).
           MOVE QSPB-INSCHGABL-FG-11 TO SPB-INSCHGABL-FG(11).
           MOVE QSPB-INSREJECT-FG-11 TO SPB-INSREJECT-FG(11).
           MOVE QSPB-INSFINCHG-11 TO SPB-INSFINCHG(11).
           MOVE QSPB-INSCOM-12 TO SPB-INSCOM(12).
           MOVE QSPB-INSRATECD-12 TO SPB-INSRATECD(12).
           MOVE QSPB-INSJFAC-12 TO SPB-INSJFAC(12).
           MOVE QSPB-INSDISCNT-12 TO SPB-INSDISCNT(12).
           MOVE QSPB-INSCHGABL-12 TO SPB-INSCHGABL(12).
           MOVE QSPB-INSTERM-12-1 TO SPB-INSTERM(12 1).
           MOVE QSPB-INSRATE-12-1 TO SPB-INSRATE(12 1).
           MOVE QSPB-INSTERM-12-2 TO SPB-INSTERM(12 2).
           MOVE QSPB-INSRATE-12-2 TO SPB-INSRATE(12 2).
           MOVE QSPB-INSTERM-12-3 TO SPB-INSTERM(12 3).
           MOVE QSPB-INSRATE-12-3 TO SPB-INSRATE(12 3).
           MOVE QSPB-INSTERM-12-4 TO SPB-INSTERM(12 4).
           MOVE QSPB-INSRATE-12-4 TO SPB-INSRATE(12 4).
           MOVE QSPB-INSTERM-12-5 TO SPB-INSTERM(12 5).
           MOVE QSPB-INSRATE-12-5 TO SPB-INSRATE(12 5).
           MOVE QSPB-INSTERM-12-6 TO SPB-INSTERM(12 6).
           MOVE QSPB-INSRATE-12-6 TO SPB-INSRATE(12 6).
           MOVE QSPB-INSTERM-12-7 TO SPB-INSTERM(12 7).
           MOVE QSPB-INSRATE-12-7 TO SPB-INSRATE(12 7).
           MOVE QSPB-INSTERM-12-8 TO SPB-INSTERM(12 8).
           MOVE QSPB-INSRATE-12-8 TO SPB-INSRATE(12 8).
           MOVE QSPB-INSTERM-12-9 TO SPB-INSTERM(12 9).
           MOVE QSPB-INSRATE-12-9 TO SPB-INSRATE(12 9).
           MOVE QSPB-INSTERM-12-10 TO SPB-INSTERM(12 10).
           MOVE QSPB-INSRATE-12-10 TO SPB-INSRATE(12 10).
           MOVE QSPB-INSTERM-12-11 TO SPB-INSTERM(12 11).
           MOVE QSPB-INSRATE-12-11 TO SPB-INSRATE(12 11).
           MOVE QSPB-INSTERM-12-12 TO SPB-INSTERM(12 12).
           MOVE QSPB-INSRATE-12-12 TO SPB-INSRATE(12 12).
           MOVE QSPB-INSTERM-12-13 TO SPB-INSTERM(12 13).
           MOVE QSPB-INSRATE-12-13 TO SPB-INSRATE(12 13).
           MOVE QSPB-INSTERM-12-14 TO SPB-INSTERM(12 14).
           MOVE QSPB-INSRATE-12-14 TO SPB-INSRATE(12 14).
           MOVE QSPB-INSTERM-12-15 TO SPB-INSTERM(12 15).
           MOVE QSPB-INSRATE-12-15 TO SPB-INSRATE(12 15).
           MOVE QSPB-INSTERM-12-16 TO SPB-INSTERM(12 16).
           MOVE QSPB-INSRATE-12-16 TO SPB-INSRATE(12 16).
           MOVE QSPB-INSTERM-12-17 TO SPB-INSTERM(12 17).
           MOVE QSPB-INSRATE-12-17 TO SPB-INSRATE(12 17).
           MOVE QSPB-INSTERM-12-18 TO SPB-INSTERM(12 18).
           MOVE QSPB-INSRATE-12-18 TO SPB-INSRATE(12 18).
           MOVE QSPB-INSTERM-12-19 TO SPB-INSTERM(12 19).
           MOVE QSPB-INSRATE-12-19 TO SPB-INSRATE(12 19).
           MOVE QSPB-INSTERM-12-20 TO SPB-INSTERM(12 20).
           MOVE QSPB-INSRATE-12-20 TO SPB-INSRATE(12 20).
           MOVE QSPB-INSMINPREM-12 TO SPB-INSMINPREM(12).
           MOVE QSPB-INSMINCHGABL-12 TO SPB-INSMINCHGABL(12).
           MOVE QSPB-INSMAXCHGABL-12 TO SPB-INSMAXCHGABL(12).
           MOVE QSPB-INSMAXBENIF-12 TO SPB-INSMAXBENIF(12).
           MOVE QSPB-INSMAXTERM-12 TO SPB-INSMAXTERM(12).
           MOVE QSPB-INSCHGBEN-12 TO SPB-INSCHGBEN(12).
           MOVE QSPB-INSEXCEPT-12 TO SPB-INSEXCEPT(12).
           MOVE QSPB-INSNOVER-12 TO SPB-INSNOVER(12).
           MOVE QSPB-INSMINAGE-12-1 TO SPB-INSMINAGE(12 1).
           MOVE QSPB-INSMAXAGE-12-1 TO SPB-INSMAXAGE(12 1).
           MOVE QSPB-INSMAXCOV-12-1 TO SPB-INSMAXCOV(12 1).
           MOVE QSPB-INSMAXTRM-12-1 TO SPB-INSMAXTRM(12 1).
           MOVE QSPB-INSMINAGE-12-2 TO SPB-INSMINAGE(12 2).
           MOVE QSPB-INSMAXAGE-12-2 TO SPB-INSMAXAGE(12 2).
           MOVE QSPB-INSMAXCOV-12-2 TO SPB-INSMAXCOV(12 2).
           MOVE QSPB-INSMAXTRM-12-2 TO SPB-INSMAXTRM(12 2).
           MOVE QSPB-INSMINAGE-12-3 TO SPB-INSMINAGE(12 3).
           MOVE QSPB-INSMAXAGE-12-3 TO SPB-INSMAXAGE(12 3).
           MOVE QSPB-INSMAXCOV-12-3 TO SPB-INSMAXCOV(12 3).
           MOVE QSPB-INSMAXTRM-12-3 TO SPB-INSMAXTRM(12 3).
           MOVE QSPB-INSMINAGE-12-4 TO SPB-INSMINAGE(12 4).
           MOVE QSPB-INSMAXAGE-12-4 TO SPB-INSMAXAGE(12 4).
           MOVE QSPB-INSMAXCOV-12-4 TO SPB-INSMAXCOV(12 4).
           MOVE QSPB-INSMAXTRM-12-4 TO SPB-INSMAXTRM(12 4).
           MOVE QSPB-INSMINAGE-12-5 TO SPB-INSMINAGE(12 5).
           MOVE QSPB-INSMAXAGE-12-5 TO SPB-INSMAXAGE(12 5).
           MOVE QSPB-INSMAXCOV-12-5 TO SPB-INSMAXCOV(12 5).
           MOVE QSPB-INSMAXTRM-12-5 TO SPB-INSMAXTRM(12 5).
           MOVE QSPB-INSFEECD-12 TO SPB-INSFEECD(12).
           MOVE QSPB-INSFEE-FRMLA-12 TO SPB-INSFEE-FRMLA(12).
           MOVE QSPB-INSCHGABL-FG-12 TO SPB-INSCHGABL-FG(12).
           MOVE QSPB-INSREJECT-FG-12 TO SPB-INSREJECT-FG(12).
           MOVE QSPB-INSFINCHG-12 TO SPB-INSFINCHG(12).
 
      *-----------------------------------------------------------------
      *    LOAD QSPB-REC FROM SPB-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-SPB-FIELDS.
           MOVE SPB-ORGST TO QSPB-ORGST.
           MOVE SPB-SPRCLASS TO QSPB-SPRCLASS.
           MOVE SPB-SUBCLASS TO QSPB-SUBCLASS.
           MOVE SPB-LAWCODE TO QSPB-LAWCODE.
           MOVE SPB-INSCOM(1) TO QSPB-INSCOM-1.
           MOVE SPB-INSRATECD(1) TO QSPB-INSRATECD-1.
           MOVE SPB-INSJFAC(1) TO QSPB-INSJFAC-1.
           MOVE SPB-INSDISCNT(1) TO QSPB-INSDISCNT-1.
           MOVE SPB-INSCHGABL(1) TO QSPB-INSCHGABL-1.
           MOVE SPB-INSTERM(1 1) TO QSPB-INSTERM-1-1.
           MOVE SPB-INSRATE(1 1) TO QSPB-INSRATE-1-1.
           MOVE SPB-INSTERM(1 2) TO QSPB-INSTERM-1-2.
           MOVE SPB-INSRATE(1 2) TO QSPB-INSRATE-1-2.
           MOVE SPB-INSTERM(1 3) TO QSPB-INSTERM-1-3.
           MOVE SPB-INSRATE(1 3) TO QSPB-INSRATE-1-3.
           MOVE SPB-INSTERM(1 4) TO QSPB-INSTERM-1-4.
           MOVE SPB-INSRATE(1 4) TO QSPB-INSRATE-1-4.
           MOVE SPB-INSTERM(1 5) TO QSPB-INSTERM-1-5.
           MOVE SPB-INSRATE(1 5) TO QSPB-INSRATE-1-5.
           MOVE SPB-INSTERM(1 6) TO QSPB-INSTERM-1-6.
           MOVE SPB-INSRATE(1 6) TO QSPB-INSRATE-1-6.
           MOVE SPB-INSTERM(1 7) TO QSPB-INSTERM-1-7.
           MOVE SPB-INSRATE(1 7) TO QSPB-INSRATE-1-7.
           MOVE SPB-INSTERM(1 8) TO QSPB-INSTERM-1-8.
           MOVE SPB-INSRATE(1 8) TO QSPB-INSRATE-1-8.
           MOVE SPB-INSTERM(1 9) TO QSPB-INSTERM-1-9.
           MOVE SPB-INSRATE(1 9) TO QSPB-INSRATE-1-9.
           MOVE SPB-INSTERM(1 10) TO QSPB-INSTERM-1-10.
           MOVE SPB-INSRATE(1 10) TO QSPB-INSRATE-1-10.
           MOVE SPB-INSTERM(1 11) TO QSPB-INSTERM-1-11.
           MOVE SPB-INSRATE(1 11) TO QSPB-INSRATE-1-11.
           MOVE SPB-INSTERM(1 12) TO QSPB-INSTERM-1-12.
           MOVE SPB-INSRATE(1 12) TO QSPB-INSRATE-1-12.
           MOVE SPB-INSTERM(1 13) TO QSPB-INSTERM-1-13.
           MOVE SPB-INSRATE(1 13) TO QSPB-INSRATE-1-13.
           MOVE SPB-INSTERM(1 14) TO QSPB-INSTERM-1-14.
           MOVE SPB-INSRATE(1 14) TO QSPB-INSRATE-1-14.
           MOVE SPB-INSTERM(1 15) TO QSPB-INSTERM-1-15.
           MOVE SPB-INSRATE(1 15) TO QSPB-INSRATE-1-15.
           MOVE SPB-INSTERM(1 16) TO QSPB-INSTERM-1-16.
           MOVE SPB-INSRATE(1 16) TO QSPB-INSRATE-1-16.
           MOVE SPB-INSTERM(1 17) TO QSPB-INSTERM-1-17.
           MOVE SPB-INSRATE(1 17) TO QSPB-INSRATE-1-17.
           MOVE SPB-INSTERM(1 18) TO QSPB-INSTERM-1-18.
           MOVE SPB-INSRATE(1 18) TO QSPB-INSRATE-1-18.
           MOVE SPB-INSTERM(1 19) TO QSPB-INSTERM-1-19.
           MOVE SPB-INSRATE(1 19) TO QSPB-INSRATE-1-19.
           MOVE SPB-INSTERM(1 20) TO QSPB-INSTERM-1-20.
           MOVE SPB-INSRATE(1 20) TO QSPB-INSRATE-1-20.
           MOVE SPB-INSMINPREM(1) TO QSPB-INSMINPREM-1.
           MOVE SPB-INSMINCHGABL(1) TO QSPB-INSMINCHGABL-1.
           MOVE SPB-INSMAXCHGABL(1) TO QSPB-INSMAXCHGABL-1.
           MOVE SPB-INSMAXBENIF(1) TO QSPB-INSMAXBENIF-1.
           MOVE SPB-INSMAXTERM(1) TO QSPB-INSMAXTERM-1.
           MOVE SPB-INSCHGBEN(1) TO QSPB-INSCHGBEN-1.
           MOVE SPB-INSEXCEPT(1) TO QSPB-INSEXCEPT-1.
           MOVE SPB-INSNOVER(1) TO QSPB-INSNOVER-1.
           MOVE SPB-INSMINAGE(1 1) TO QSPB-INSMINAGE-1-1.
           MOVE SPB-INSMAXAGE(1 1) TO QSPB-INSMAXAGE-1-1.
           MOVE SPB-INSMAXCOV(1 1) TO QSPB-INSMAXCOV-1-1.
           MOVE SPB-INSMAXTRM(1 1) TO QSPB-INSMAXTRM-1-1.
           MOVE SPB-INSMINAGE(1 2) TO QSPB-INSMINAGE-1-2.
           MOVE SPB-INSMAXAGE(1 2) TO QSPB-INSMAXAGE-1-2.
           MOVE SPB-INSMAXCOV(1 2) TO QSPB-INSMAXCOV-1-2.
           MOVE SPB-INSMAXTRM(1 2) TO QSPB-INSMAXTRM-1-2.
           MOVE SPB-INSMINAGE(1 3) TO QSPB-INSMINAGE-1-3.
           MOVE SPB-INSMAXAGE(1 3) TO QSPB-INSMAXAGE-1-3.
           MOVE SPB-INSMAXCOV(1 3) TO QSPB-INSMAXCOV-1-3.
           MOVE SPB-INSMAXTRM(1 3) TO QSPB-INSMAXTRM-1-3.
           MOVE SPB-INSMINAGE(1 4) TO QSPB-INSMINAGE-1-4.
           MOVE SPB-INSMAXAGE(1 4) TO QSPB-INSMAXAGE-1-4.
           MOVE SPB-INSMAXCOV(1 4) TO QSPB-INSMAXCOV-1-4.
           MOVE SPB-INSMAXTRM(1 4) TO QSPB-INSMAXTRM-1-4.
           MOVE SPB-INSMINAGE(1 5) TO QSPB-INSMINAGE-1-5.
           MOVE SPB-INSMAXAGE(1 5) TO QSPB-INSMAXAGE-1-5.
           MOVE SPB-INSMAXCOV(1 5) TO QSPB-INSMAXCOV-1-5.
           MOVE SPB-INSMAXTRM(1 5) TO QSPB-INSMAXTRM-1-5.
           MOVE SPB-INSFEECD(1) TO QSPB-INSFEECD-1.
           MOVE SPB-INSFEE-FRMLA(1) TO QSPB-INSFEE-FRMLA-1.
           MOVE SPB-INSCHGABL-FG(1) TO QSPB-INSCHGABL-FG-1.
           MOVE SPB-INSREJECT-FG(1) TO QSPB-INSREJECT-FG-1.
           MOVE SPB-INSFINCHG(1) TO QSPB-INSFINCHG-1.
           MOVE SPB-INSCOM(2) TO QSPB-INSCOM-2.
           MOVE SPB-INSRATECD(2) TO QSPB-INSRATECD-2.
           MOVE SPB-INSJFAC(2) TO QSPB-INSJFAC-2.
           MOVE SPB-INSDISCNT(2) TO QSPB-INSDISCNT-2.
           MOVE SPB-INSCHGABL(2) TO QSPB-INSCHGABL-2.
           MOVE SPB-INSTERM(2 1) TO QSPB-INSTERM-2-1.
           MOVE SPB-INSRATE(2 1) TO QSPB-INSRATE-2-1.
           MOVE SPB-INSTERM(2 2) TO QSPB-INSTERM-2-2.
           MOVE SPB-INSRATE(2 2) TO QSPB-INSRATE-2-2.
           MOVE SPB-INSTERM(2 3) TO QSPB-INSTERM-2-3.
           MOVE SPB-INSRATE(2 3) TO QSPB-INSRATE-2-3.
           MOVE SPB-INSTERM(2 4) TO QSPB-INSTERM-2-4.
           MOVE SPB-INSRATE(2 4) TO QSPB-INSRATE-2-4.
           MOVE SPB-INSTERM(2 5) TO QSPB-INSTERM-2-5.
           MOVE SPB-INSRATE(2 5) TO QSPB-INSRATE-2-5.
           MOVE SPB-INSTERM(2 6) TO QSPB-INSTERM-2-6.
           MOVE SPB-INSRATE(2 6) TO QSPB-INSRATE-2-6.
           MOVE SPB-INSTERM(2 7) TO QSPB-INSTERM-2-7.
           MOVE SPB-INSRATE(2 7) TO QSPB-INSRATE-2-7.
           MOVE SPB-INSTERM(2 8) TO QSPB-INSTERM-2-8.
           MOVE SPB-INSRATE(2 8) TO QSPB-INSRATE-2-8.
           MOVE SPB-INSTERM(2 9) TO QSPB-INSTERM-2-9.
           MOVE SPB-INSRATE(2 9) TO QSPB-INSRATE-2-9.
           MOVE SPB-INSTERM(2 10) TO QSPB-INSTERM-2-10.
           MOVE SPB-INSRATE(2 10) TO QSPB-INSRATE-2-10.
           MOVE SPB-INSTERM(2 11) TO QSPB-INSTERM-2-11.
           MOVE SPB-INSRATE(2 11) TO QSPB-INSRATE-2-11.
           MOVE SPB-INSTERM(2 12) TO QSPB-INSTERM-2-12.
           MOVE SPB-INSRATE(2 12) TO QSPB-INSRATE-2-12.
           MOVE SPB-INSTERM(2 13) TO QSPB-INSTERM-2-13.
           MOVE SPB-INSRATE(2 13) TO QSPB-INSRATE-2-13.
           MOVE SPB-INSTERM(2 14) TO QSPB-INSTERM-2-14.
           MOVE SPB-INSRATE(2 14) TO QSPB-INSRATE-2-14.
           MOVE SPB-INSTERM(2 15) TO QSPB-INSTERM-2-15.
           MOVE SPB-INSRATE(2 15) TO QSPB-INSRATE-2-15.
           MOVE SPB-INSTERM(2 16) TO QSPB-INSTERM-2-16.
           MOVE SPB-INSRATE(2 16) TO QSPB-INSRATE-2-16.
           MOVE SPB-INSTERM(2 17) TO QSPB-INSTERM-2-17.
           MOVE SPB-INSRATE(2 17) TO QSPB-INSRATE-2-17.
           MOVE SPB-INSTERM(2 18) TO QSPB-INSTERM-2-18.
           MOVE SPB-INSRATE(2 18) TO QSPB-INSRATE-2-18.
           MOVE SPB-INSTERM(2 19) TO QSPB-INSTERM-2-19.
           MOVE SPB-INSRATE(2 19) TO QSPB-INSRATE-2-19.
           MOVE SPB-INSTERM(2 20) TO QSPB-INSTERM-2-20.
           MOVE SPB-INSRATE(2 20) TO QSPB-INSRATE-2-20.
           MOVE SPB-INSMINPREM(2) TO QSPB-INSMINPREM-2.
           MOVE SPB-INSMINCHGABL(2) TO QSPB-INSMINCHGABL-2.
           MOVE SPB-INSMAXCHGABL(2) TO QSPB-INSMAXCHGABL-2.
           MOVE SPB-INSMAXBENIF(2) TO QSPB-INSMAXBENIF-2.
           MOVE SPB-INSMAXTERM(2) TO QSPB-INSMAXTERM-2.
           MOVE SPB-INSCHGBEN(2) TO QSPB-INSCHGBEN-2.
           MOVE SPB-INSEXCEPT(2) TO QSPB-INSEXCEPT-2.
           MOVE SPB-INSNOVER(2) TO QSPB-INSNOVER-2.
           MOVE SPB-INSMINAGE(2 1) TO QSPB-INSMINAGE-2-1.
           MOVE SPB-INSMAXAGE(2 1) TO QSPB-INSMAXAGE-2-1.
           MOVE SPB-INSMAXCOV(2 1) TO QSPB-INSMAXCOV-2-1.
           MOVE SPB-INSMAXTRM(2 1) TO QSPB-INSMAXTRM-2-1.
           MOVE SPB-INSMINAGE(2 2) TO QSPB-INSMINAGE-2-2.
           MOVE SPB-INSMAXAGE(2 2) TO QSPB-INSMAXAGE-2-2.
           MOVE SPB-INSMAXCOV(2 2) TO QSPB-INSMAXCOV-2-2.
           MOVE SPB-INSMAXTRM(2 2) TO QSPB-INSMAXTRM-2-2.
           MOVE SPB-INSMINAGE(2 3) TO QSPB-INSMINAGE-2-3.
           MOVE SPB-INSMAXAGE(2 3) TO QSPB-INSMAXAGE-2-3.
           MOVE SPB-INSMAXCOV(2 3) TO QSPB-INSMAXCOV-2-3.
           MOVE SPB-INSMAXTRM(2 3) TO QSPB-INSMAXTRM-2-3.
           MOVE SPB-INSMINAGE(2 4) TO QSPB-INSMINAGE-2-4.
           MOVE SPB-INSMAXAGE(2 4) TO QSPB-INSMAXAGE-2-4.
           MOVE SPB-INSMAXCOV(2 4) TO QSPB-INSMAXCOV-2-4.
           MOVE SPB-INSMAXTRM(2 4) TO QSPB-INSMAXTRM-2-4.
           MOVE SPB-INSMINAGE(2 5) TO QSPB-INSMINAGE-2-5.
           MOVE SPB-INSMAXAGE(2 5) TO QSPB-INSMAXAGE-2-5.
           MOVE SPB-INSMAXCOV(2 5) TO QSPB-INSMAXCOV-2-5.
           MOVE SPB-INSMAXTRM(2 5) TO QSPB-INSMAXTRM-2-5.
           MOVE SPB-INSFEECD(2) TO QSPB-INSFEECD-2.
           MOVE SPB-INSFEE-FRMLA(2) TO QSPB-INSFEE-FRMLA-2.
           MOVE SPB-INSCHGABL-FG(2) TO QSPB-INSCHGABL-FG-2.
           MOVE SPB-INSREJECT-FG(2) TO QSPB-INSREJECT-FG-2.
           MOVE SPB-INSFINCHG(2) TO QSPB-INSFINCHG-2.
           MOVE SPB-INSCOM(3) TO QSPB-INSCOM-3.
           MOVE SPB-INSRATECD(3) TO QSPB-INSRATECD-3.
           MOVE SPB-INSJFAC(3) TO QSPB-INSJFAC-3.
           MOVE SPB-INSDISCNT(3) TO QSPB-INSDISCNT-3.
           MOVE SPB-INSCHGABL(3) TO QSPB-INSCHGABL-3.
           MOVE SPB-INSTERM(3 1) TO QSPB-INSTERM-3-1.
           MOVE SPB-INSRATE(3 1) TO QSPB-INSRATE-3-1.
           MOVE SPB-INSTERM(3 2) TO QSPB-INSTERM-3-2.
           MOVE SPB-INSRATE(3 2) TO QSPB-INSRATE-3-2.
           MOVE SPB-INSTERM(3 3) TO QSPB-INSTERM-3-3.
           MOVE SPB-INSRATE(3 3) TO QSPB-INSRATE-3-3.
           MOVE SPB-INSTERM(3 4) TO QSPB-INSTERM-3-4.
           MOVE SPB-INSRATE(3 4) TO QSPB-INSRATE-3-4.
           MOVE SPB-INSTERM(3 5) TO QSPB-INSTERM-3-5.
           MOVE SPB-INSRATE(3 5) TO QSPB-INSRATE-3-5.
           MOVE SPB-INSTERM(3 6) TO QSPB-INSTERM-3-6.
           MOVE SPB-INSRATE(3 6) TO QSPB-INSRATE-3-6.
           MOVE SPB-INSTERM(3 7) TO QSPB-INSTERM-3-7.
           MOVE SPB-INSRATE(3 7) TO QSPB-INSRATE-3-7.
           MOVE SPB-INSTERM(3 8) TO QSPB-INSTERM-3-8.
           MOVE SPB-INSRATE(3 8) TO QSPB-INSRATE-3-8.
           MOVE SPB-INSTERM(3 9) TO QSPB-INSTERM-3-9.
           MOVE SPB-INSRATE(3 9) TO QSPB-INSRATE-3-9.
           MOVE SPB-INSTERM(3 10) TO QSPB-INSTERM-3-10.
           MOVE SPB-INSRATE(3 10) TO QSPB-INSRATE-3-10.
           MOVE SPB-INSTERM(3 11) TO QSPB-INSTERM-3-11.
           MOVE SPB-INSRATE(3 11) TO QSPB-INSRATE-3-11.
           MOVE SPB-INSTERM(3 12) TO QSPB-INSTERM-3-12.
           MOVE SPB-INSRATE(3 12) TO QSPB-INSRATE-3-12.
           MOVE SPB-INSTERM(3 13) TO QSPB-INSTERM-3-13.
           MOVE SPB-INSRATE(3 13) TO QSPB-INSRATE-3-13.
           MOVE SPB-INSTERM(3 14) TO QSPB-INSTERM-3-14.
           MOVE SPB-INSRATE(3 14) TO QSPB-INSRATE-3-14.
           MOVE SPB-INSTERM(3 15) TO QSPB-INSTERM-3-15.
           MOVE SPB-INSRATE(3 15) TO QSPB-INSRATE-3-15.
           MOVE SPB-INSTERM(3 16) TO QSPB-INSTERM-3-16.
           MOVE SPB-INSRATE(3 16) TO QSPB-INSRATE-3-16.
           MOVE SPB-INSTERM(3 17) TO QSPB-INSTERM-3-17.
           MOVE SPB-INSRATE(3 17) TO QSPB-INSRATE-3-17.
           MOVE SPB-INSTERM(3 18) TO QSPB-INSTERM-3-18.
           MOVE SPB-INSRATE(3 18) TO QSPB-INSRATE-3-18.
           MOVE SPB-INSTERM(3 19) TO QSPB-INSTERM-3-19.
           MOVE SPB-INSRATE(3 19) TO QSPB-INSRATE-3-19.
           MOVE SPB-INSTERM(3 20) TO QSPB-INSTERM-3-20.
           MOVE SPB-INSRATE(3 20) TO QSPB-INSRATE-3-20.
           MOVE SPB-INSMINPREM(3) TO QSPB-INSMINPREM-3.
           MOVE SPB-INSMINCHGABL(3) TO QSPB-INSMINCHGABL-3.
           MOVE SPB-INSMAXCHGABL(3) TO QSPB-INSMAXCHGABL-3.
           MOVE SPB-INSMAXBENIF(3) TO QSPB-INSMAXBENIF-3.
           MOVE SPB-INSMAXTERM(3) TO QSPB-INSMAXTERM-3.
           MOVE SPB-INSCHGBEN(3) TO QSPB-INSCHGBEN-3.
           MOVE SPB-INSEXCEPT(3) TO QSPB-INSEXCEPT-3.
           MOVE SPB-INSNOVER(3) TO QSPB-INSNOVER-3.
           MOVE SPB-INSMINAGE(3 1) TO QSPB-INSMINAGE-3-1.
           MOVE SPB-INSMAXAGE(3 1) TO QSPB-INSMAXAGE-3-1.
           MOVE SPB-INSMAXCOV(3 1) TO QSPB-INSMAXCOV-3-1.
           MOVE SPB-INSMAXTRM(3 1) TO QSPB-INSMAXTRM-3-1.
           MOVE SPB-INSMINAGE(3 2) TO QSPB-INSMINAGE-3-2.
           MOVE SPB-INSMAXAGE(3 2) TO QSPB-INSMAXAGE-3-2.
           MOVE SPB-INSMAXCOV(3 2) TO QSPB-INSMAXCOV-3-2.
           MOVE SPB-INSMAXTRM(3 2) TO QSPB-INSMAXTRM-3-2.
           MOVE SPB-INSMINAGE(3 3) TO QSPB-INSMINAGE-3-3.
           MOVE SPB-INSMAXAGE(3 3) TO QSPB-INSMAXAGE-3-3.
           MOVE SPB-INSMAXCOV(3 3) TO QSPB-INSMAXCOV-3-3.
           MOVE SPB-INSMAXTRM(3 3) TO QSPB-INSMAXTRM-3-3.
           MOVE SPB-INSMINAGE(3 4) TO QSPB-INSMINAGE-3-4.
           MOVE SPB-INSMAXAGE(3 4) TO QSPB-INSMAXAGE-3-4.
           MOVE SPB-INSMAXCOV(3 4) TO QSPB-INSMAXCOV-3-4.
           MOVE SPB-INSMAXTRM(3 4) TO QSPB-INSMAXTRM-3-4.
           MOVE SPB-INSMINAGE(3 5) TO QSPB-INSMINAGE-3-5.
           MOVE SPB-INSMAXAGE(3 5) TO QSPB-INSMAXAGE-3-5.
           MOVE SPB-INSMAXCOV(3 5) TO QSPB-INSMAXCOV-3-5.
           MOVE SPB-INSMAXTRM(3 5) TO QSPB-INSMAXTRM-3-5.
           MOVE SPB-INSFEECD(3) TO QSPB-INSFEECD-3.
           MOVE SPB-INSFEE-FRMLA(3) TO QSPB-INSFEE-FRMLA-3.
           MOVE SPB-INSCHGABL-FG(3) TO QSPB-INSCHGABL-FG-3.
           MOVE SPB-INSREJECT-FG(3) TO QSPB-INSREJECT-FG-3.
           MOVE SPB-INSFINCHG(3) TO QSPB-INSFINCHG-3.
           MOVE SPB-INSCOM(4) TO QSPB-INSCOM-4.
           MOVE SPB-INSRATECD(4) TO QSPB-INSRATECD-4.
           MOVE SPB-INSJFAC(4) TO QSPB-INSJFAC-4.
           MOVE SPB-INSDISCNT(4) TO QSPB-INSDISCNT-4.
           MOVE SPB-INSCHGABL(4) TO QSPB-INSCHGABL-4.
           MOVE SPB-INSTERM(4 1) TO QSPB-INSTERM-4-1.
           MOVE SPB-INSRATE(4 1) TO QSPB-INSRATE-4-1.
           MOVE SPB-INSTERM(4 2) TO QSPB-INSTERM-4-2.
           MOVE SPB-INSRATE(4 2) TO QSPB-INSRATE-4-2.
           MOVE SPB-INSTERM(4 3) TO QSPB-INSTERM-4-3.
           MOVE SPB-INSRATE(4 3) TO QSPB-INSRATE-4-3.
           MOVE SPB-INSTERM(4 4) TO QSPB-INSTERM-4-4.
           MOVE SPB-INSRATE(4 4) TO QSPB-INSRATE-4-4.
           MOVE SPB-INSTERM(4 5) TO QSPB-INSTERM-4-5.
           MOVE SPB-INSRATE(4 5) TO QSPB-INSRATE-4-5.
           MOVE SPB-INSTERM(4 6) TO QSPB-INSTERM-4-6.
           MOVE SPB-INSRATE(4 6) TO QSPB-INSRATE-4-6.
           MOVE SPB-INSTERM(4 7) TO QSPB-INSTERM-4-7.
           MOVE SPB-INSRATE(4 7) TO QSPB-INSRATE-4-7.
           MOVE SPB-INSTERM(4 8) TO QSPB-INSTERM-4-8.
           MOVE SPB-INSRATE(4 8) TO QSPB-INSRATE-4-8.
           MOVE SPB-INSTERM(4 9) TO QSPB-INSTERM-4-9.
           MOVE SPB-INSRATE(4 9) TO QSPB-INSRATE-4-9.
           MOVE SPB-INSTERM(4 10) TO QSPB-INSTERM-4-10.
           MOVE SPB-INSRATE(4 10) TO QSPB-INSRATE-4-10.
           MOVE SPB-INSTERM(4 11) TO QSPB-INSTERM-4-11.
           MOVE SPB-INSRATE(4 11) TO QSPB-INSRATE-4-11.
           MOVE SPB-INSTERM(4 12) TO QSPB-INSTERM-4-12.
           MOVE SPB-INSRATE(4 12) TO QSPB-INSRATE-4-12.
           MOVE SPB-INSTERM(4 13) TO QSPB-INSTERM-4-13.
           MOVE SPB-INSRATE(4 13) TO QSPB-INSRATE-4-13.
           MOVE SPB-INSTERM(4 14) TO QSPB-INSTERM-4-14.
           MOVE SPB-INSRATE(4 14) TO QSPB-INSRATE-4-14.
           MOVE SPB-INSTERM(4 15) TO QSPB-INSTERM-4-15.
           MOVE SPB-INSRATE(4 15) TO QSPB-INSRATE-4-15.
           MOVE SPB-INSTERM(4 16) TO QSPB-INSTERM-4-16.
           MOVE SPB-INSRATE(4 16) TO QSPB-INSRATE-4-16.
           MOVE SPB-INSTERM(4 17) TO QSPB-INSTERM-4-17.
           MOVE SPB-INSRATE(4 17) TO QSPB-INSRATE-4-17.
           MOVE SPB-INSTERM(4 18) TO QSPB-INSTERM-4-18.
           MOVE SPB-INSRATE(4 18) TO QSPB-INSRATE-4-18.
           MOVE SPB-INSTERM(4 19) TO QSPB-INSTERM-4-19.
           MOVE SPB-INSRATE(4 19) TO QSPB-INSRATE-4-19.
           MOVE SPB-INSTERM(4 20) TO QSPB-INSTERM-4-20.
           MOVE SPB-INSRATE(4 20) TO QSPB-INSRATE-4-20.
           MOVE SPB-INSMINPREM(4) TO QSPB-INSMINPREM-4.
           MOVE SPB-INSMINCHGABL(4) TO QSPB-INSMINCHGABL-4.
           MOVE SPB-INSMAXCHGABL(4) TO QSPB-INSMAXCHGABL-4.
           MOVE SPB-INSMAXBENIF(4) TO QSPB-INSMAXBENIF-4.
           MOVE SPB-INSMAXTERM(4) TO QSPB-INSMAXTERM-4.
           MOVE SPB-INSCHGBEN(4) TO QSPB-INSCHGBEN-4.
           MOVE SPB-INSEXCEPT(4) TO QSPB-INSEXCEPT-4.
           MOVE SPB-INSNOVER(4) TO QSPB-INSNOVER-4.
           MOVE SPB-INSMINAGE(4 1) TO QSPB-INSMINAGE-4-1.
           MOVE SPB-INSMAXAGE(4 1) TO QSPB-INSMAXAGE-4-1.
           MOVE SPB-INSMAXCOV(4 1) TO QSPB-INSMAXCOV-4-1.
           MOVE SPB-INSMAXTRM(4 1) TO QSPB-INSMAXTRM-4-1.
           MOVE SPB-INSMINAGE(4 2) TO QSPB-INSMINAGE-4-2.
           MOVE SPB-INSMAXAGE(4 2) TO QSPB-INSMAXAGE-4-2.
           MOVE SPB-INSMAXCOV(4 2) TO QSPB-INSMAXCOV-4-2.
           MOVE SPB-INSMAXTRM(4 2) TO QSPB-INSMAXTRM-4-2.
           MOVE SPB-INSMINAGE(4 3) TO QSPB-INSMINAGE-4-3.
           MOVE SPB-INSMAXAGE(4 3) TO QSPB-INSMAXAGE-4-3.
           MOVE SPB-INSMAXCOV(4 3) TO QSPB-INSMAXCOV-4-3.
           MOVE SPB-INSMAXTRM(4 3) TO QSPB-INSMAXTRM-4-3.
           MOVE SPB-INSMINAGE(4 4) TO QSPB-INSMINAGE-4-4.
           MOVE SPB-INSMAXAGE(4 4) TO QSPB-INSMAXAGE-4-4.
           MOVE SPB-INSMAXCOV(4 4) TO QSPB-INSMAXCOV-4-4.
           MOVE SPB-INSMAXTRM(4 4) TO QSPB-INSMAXTRM-4-4.
           MOVE SPB-INSMINAGE(4 5) TO QSPB-INSMINAGE-4-5.
           MOVE SPB-INSMAXAGE(4 5) TO QSPB-INSMAXAGE-4-5.
           MOVE SPB-INSMAXCOV(4 5) TO QSPB-INSMAXCOV-4-5.
           MOVE SPB-INSMAXTRM(4 5) TO QSPB-INSMAXTRM-4-5.
           MOVE SPB-INSFEECD(4) TO QSPB-INSFEECD-4.
           MOVE SPB-INSFEE-FRMLA(4) TO QSPB-INSFEE-FRMLA-4.
           MOVE SPB-INSCHGABL-FG(4) TO QSPB-INSCHGABL-FG-4.
           MOVE SPB-INSREJECT-FG(4) TO QSPB-INSREJECT-FG-4.
           MOVE SPB-INSFINCHG(4) TO QSPB-INSFINCHG-4.
           MOVE SPB-INSCOM(5) TO QSPB-INSCOM-5.
           MOVE SPB-INSRATECD(5) TO QSPB-INSRATECD-5.
           MOVE SPB-INSJFAC(5) TO QSPB-INSJFAC-5.
           MOVE SPB-INSDISCNT(5) TO QSPB-INSDISCNT-5.
           MOVE SPB-INSCHGABL(5) TO QSPB-INSCHGABL-5.
           MOVE SPB-INSTERM(5 1) TO QSPB-INSTERM-5-1.
           MOVE SPB-INSRATE(5 1) TO QSPB-INSRATE-5-1.
           MOVE SPB-INSTERM(5 2) TO QSPB-INSTERM-5-2.
           MOVE SPB-INSRATE(5 2) TO QSPB-INSRATE-5-2.
           MOVE SPB-INSTERM(5 3) TO QSPB-INSTERM-5-3.
           MOVE SPB-INSRATE(5 3) TO QSPB-INSRATE-5-3.
           MOVE SPB-INSTERM(5 4) TO QSPB-INSTERM-5-4.
           MOVE SPB-INSRATE(5 4) TO QSPB-INSRATE-5-4.
           MOVE SPB-INSTERM(5 5) TO QSPB-INSTERM-5-5.
           MOVE SPB-INSRATE(5 5) TO QSPB-INSRATE-5-5.
           MOVE SPB-INSTERM(5 6) TO QSPB-INSTERM-5-6.
           MOVE SPB-INSRATE(5 6) TO QSPB-INSRATE-5-6.
           MOVE SPB-INSTERM(5 7) TO QSPB-INSTERM-5-7.
           MOVE SPB-INSRATE(5 7) TO QSPB-INSRATE-5-7.
           MOVE SPB-INSTERM(5 8) TO QSPB-INSTERM-5-8.
           MOVE SPB-INSRATE(5 8) TO QSPB-INSRATE-5-8.
           MOVE SPB-INSTERM(5 9) TO QSPB-INSTERM-5-9.
           MOVE SPB-INSRATE(5 9) TO QSPB-INSRATE-5-9.
           MOVE SPB-INSTERM(5 10) TO QSPB-INSTERM-5-10.
           MOVE SPB-INSRATE(5 10) TO QSPB-INSRATE-5-10.
           MOVE SPB-INSTERM(5 11) TO QSPB-INSTERM-5-11.
           MOVE SPB-INSRATE(5 11) TO QSPB-INSRATE-5-11.
           MOVE SPB-INSTERM(5 12) TO QSPB-INSTERM-5-12.
           MOVE SPB-INSRATE(5 12) TO QSPB-INSRATE-5-12.
           MOVE SPB-INSTERM(5 13) TO QSPB-INSTERM-5-13.
           MOVE SPB-INSRATE(5 13) TO QSPB-INSRATE-5-13.
           MOVE SPB-INSTERM(5 14) TO QSPB-INSTERM-5-14.
           MOVE SPB-INSRATE(5 14) TO QSPB-INSRATE-5-14.
           MOVE SPB-INSTERM(5 15) TO QSPB-INSTERM-5-15.
           MOVE SPB-INSRATE(5 15) TO QSPB-INSRATE-5-15.
           MOVE SPB-INSTERM(5 16) TO QSPB-INSTERM-5-16.
           MOVE SPB-INSRATE(5 16) TO QSPB-INSRATE-5-16.
           MOVE SPB-INSTERM(5 17) TO QSPB-INSTERM-5-17.
           MOVE SPB-INSRATE(5 17) TO QSPB-INSRATE-5-17.
           MOVE SPB-INSTERM(5 18) TO QSPB-INSTERM-5-18.
           MOVE SPB-INSRATE(5 18) TO QSPB-INSRATE-5-18.
           MOVE SPB-INSTERM(5 19) TO QSPB-INSTERM-5-19.
           MOVE SPB-INSRATE(5 19) TO QSPB-INSRATE-5-19.
           MOVE SPB-INSTERM(5 20) TO QSPB-INSTERM-5-20.
           MOVE SPB-INSRATE(5 20) TO QSPB-INSRATE-5-20.
           MOVE SPB-INSMINPREM(5) TO QSPB-INSMINPREM-5.
           MOVE SPB-INSMINCHGABL(5) TO QSPB-INSMINCHGABL-5.
           MOVE SPB-INSMAXCHGABL(5) TO QSPB-INSMAXCHGABL-5.
           MOVE SPB-INSMAXBENIF(5) TO QSPB-INSMAXBENIF-5.
           MOVE SPB-INSMAXTERM(5) TO QSPB-INSMAXTERM-5.
           MOVE SPB-INSCHGBEN(5) TO QSPB-INSCHGBEN-5.
           MOVE SPB-INSEXCEPT(5) TO QSPB-INSEXCEPT-5.
           MOVE SPB-INSNOVER(5) TO QSPB-INSNOVER-5.
           MOVE SPB-INSMINAGE(5 1) TO QSPB-INSMINAGE-5-1.
           MOVE SPB-INSMAXAGE(5 1) TO QSPB-INSMAXAGE-5-1.
           MOVE SPB-INSMAXCOV(5 1) TO QSPB-INSMAXCOV-5-1.
           MOVE SPB-INSMAXTRM(5 1) TO QSPB-INSMAXTRM-5-1.
           MOVE SPB-INSMINAGE(5 2) TO QSPB-INSMINAGE-5-2.
           MOVE SPB-INSMAXAGE(5 2) TO QSPB-INSMAXAGE-5-2.
           MOVE SPB-INSMAXCOV(5 2) TO QSPB-INSMAXCOV-5-2.
           MOVE SPB-INSMAXTRM(5 2) TO QSPB-INSMAXTRM-5-2.
           MOVE SPB-INSMINAGE(5 3) TO QSPB-INSMINAGE-5-3.
           MOVE SPB-INSMAXAGE(5 3) TO QSPB-INSMAXAGE-5-3.
           MOVE SPB-INSMAXCOV(5 3) TO QSPB-INSMAXCOV-5-3.
           MOVE SPB-INSMAXTRM(5 3) TO QSPB-INSMAXTRM-5-3.
           MOVE SPB-INSMINAGE(5 4) TO QSPB-INSMINAGE-5-4.
           MOVE SPB-INSMAXAGE(5 4) TO QSPB-INSMAXAGE-5-4.
           MOVE SPB-INSMAXCOV(5 4) TO QSPB-INSMAXCOV-5-4.
           MOVE SPB-INSMAXTRM(5 4) TO QSPB-INSMAXTRM-5-4.
           MOVE SPB-INSMINAGE(5 5) TO QSPB-INSMINAGE-5-5.
           MOVE SPB-INSMAXAGE(5 5) TO QSPB-INSMAXAGE-5-5.
           MOVE SPB-INSMAXCOV(5 5) TO QSPB-INSMAXCOV-5-5.
           MOVE SPB-INSMAXTRM(5 5) TO QSPB-INSMAXTRM-5-5.
           MOVE SPB-INSFEECD(5) TO QSPB-INSFEECD-5.
           MOVE SPB-INSFEE-FRMLA(5) TO QSPB-INSFEE-FRMLA-5.
           MOVE SPB-INSCHGABL-FG(5) TO QSPB-INSCHGABL-FG-5.
           MOVE SPB-INSREJECT-FG(5) TO QSPB-INSREJECT-FG-5.
           MOVE SPB-INSFINCHG(5) TO QSPB-INSFINCHG-5.
           MOVE SPB-INSCOM(6) TO QSPB-INSCOM-6.
           MOVE SPB-INSRATECD(6) TO QSPB-INSRATECD-6.
           MOVE SPB-INSJFAC(6) TO QSPB-INSJFAC-6.
           MOVE SPB-INSDISCNT(6) TO QSPB-INSDISCNT-6.
           MOVE SPB-INSCHGABL(6) TO QSPB-INSCHGABL-6.
           MOVE SPB-INSTERM(6 1) TO QSPB-INSTERM-6-1.
           MOVE SPB-INSRATE(6 1) TO QSPB-INSRATE-6-1.
           MOVE SPB-INSTERM(6 2) TO QSPB-INSTERM-6-2.
           MOVE SPB-INSRATE(6 2) TO QSPB-INSRATE-6-2.
           MOVE SPB-INSTERM(6 3) TO QSPB-INSTERM-6-3.
           MOVE SPB-INSRATE(6 3) TO QSPB-INSRATE-6-3.
           MOVE SPB-INSTERM(6 4) TO QSPB-INSTERM-6-4.
           MOVE SPB-INSRATE(6 4) TO QSPB-INSRATE-6-4.
           MOVE SPB-INSTERM(6 5) TO QSPB-INSTERM-6-5.
           MOVE SPB-INSRATE(6 5) TO QSPB-INSRATE-6-5.
           MOVE SPB-INSTERM(6 6) TO QSPB-INSTERM-6-6.
           MOVE SPB-INSRATE(6 6) TO QSPB-INSRATE-6-6.
           MOVE SPB-INSTERM(6 7) TO QSPB-INSTERM-6-7.
           MOVE SPB-INSRATE(6 7) TO QSPB-INSRATE-6-7.
           MOVE SPB-INSTERM(6 8) TO QSPB-INSTERM-6-8.
           MOVE SPB-INSRATE(6 8) TO QSPB-INSRATE-6-8.
           MOVE SPB-INSTERM(6 9) TO QSPB-INSTERM-6-9.
           MOVE SPB-INSRATE(6 9) TO QSPB-INSRATE-6-9.
           MOVE SPB-INSTERM(6 10) TO QSPB-INSTERM-6-10.
           MOVE SPB-INSRATE(6 10) TO QSPB-INSRATE-6-10.
           MOVE SPB-INSTERM(6 11) TO QSPB-INSTERM-6-11.
           MOVE SPB-INSRATE(6 11) TO QSPB-INSRATE-6-11.
           MOVE SPB-INSTERM(6 12) TO QSPB-INSTERM-6-12.
           MOVE SPB-INSRATE(6 12) TO QSPB-INSRATE-6-12.
           MOVE SPB-INSTERM(6 13) TO QSPB-INSTERM-6-13.
           MOVE SPB-INSRATE(6 13) TO QSPB-INSRATE-6-13.
           MOVE SPB-INSTERM(6 14) TO QSPB-INSTERM-6-14.
           MOVE SPB-INSRATE(6 14) TO QSPB-INSRATE-6-14.
           MOVE SPB-INSTERM(6 15) TO QSPB-INSTERM-6-15.
           MOVE SPB-INSRATE(6 15) TO QSPB-INSRATE-6-15.
           MOVE SPB-INSTERM(6 16) TO QSPB-INSTERM-6-16.
           MOVE SPB-INSRATE(6 16) TO QSPB-INSRATE-6-16.
           MOVE SPB-INSTERM(6 17) TO QSPB-INSTERM-6-17.
           MOVE SPB-INSRATE(6 17) TO QSPB-INSRATE-6-17.
           MOVE SPB-INSTERM(6 18) TO QSPB-INSTERM-6-18.
           MOVE SPB-INSRATE(6 18) TO QSPB-INSRATE-6-18.
           MOVE SPB-INSTERM(6 19) TO QSPB-INSTERM-6-19.
           MOVE SPB-INSRATE(6 19) TO QSPB-INSRATE-6-19.
           MOVE SPB-INSTERM(6 20) TO QSPB-INSTERM-6-20.
           MOVE SPB-INSRATE(6 20) TO QSPB-INSRATE-6-20.
           MOVE SPB-INSMINPREM(6) TO QSPB-INSMINPREM-6.
           MOVE SPB-INSMINCHGABL(6) TO QSPB-INSMINCHGABL-6.
           MOVE SPB-INSMAXCHGABL(6) TO QSPB-INSMAXCHGABL-6.
           MOVE SPB-INSMAXBENIF(6) TO QSPB-INSMAXBENIF-6.
           MOVE SPB-INSMAXTERM(6) TO QSPB-INSMAXTERM-6.
           MOVE SPB-INSCHGBEN(6) TO QSPB-INSCHGBEN-6.
           MOVE SPB-INSEXCEPT(6) TO QSPB-INSEXCEPT-6.
           MOVE SPB-INSNOVER(6) TO QSPB-INSNOVER-6.
           MOVE SPB-INSMINAGE(6 1) TO QSPB-INSMINAGE-6-1.
           MOVE SPB-INSMAXAGE(6 1) TO QSPB-INSMAXAGE-6-1.
           MOVE SPB-INSMAXCOV(6 1) TO QSPB-INSMAXCOV-6-1.
           MOVE SPB-INSMAXTRM(6 1) TO QSPB-INSMAXTRM-6-1.
           MOVE SPB-INSMINAGE(6 2) TO QSPB-INSMINAGE-6-2.
           MOVE SPB-INSMAXAGE(6 2) TO QSPB-INSMAXAGE-6-2.
           MOVE SPB-INSMAXCOV(6 2) TO QSPB-INSMAXCOV-6-2.
           MOVE SPB-INSMAXTRM(6 2) TO QSPB-INSMAXTRM-6-2.
           MOVE SPB-INSMINAGE(6 3) TO QSPB-INSMINAGE-6-3.
           MOVE SPB-INSMAXAGE(6 3) TO QSPB-INSMAXAGE-6-3.
           MOVE SPB-INSMAXCOV(6 3) TO QSPB-INSMAXCOV-6-3.
           MOVE SPB-INSMAXTRM(6 3) TO QSPB-INSMAXTRM-6-3.
           MOVE SPB-INSMINAGE(6 4) TO QSPB-INSMINAGE-6-4.
           MOVE SPB-INSMAXAGE(6 4) TO QSPB-INSMAXAGE-6-4.
           MOVE SPB-INSMAXCOV(6 4) TO QSPB-INSMAXCOV-6-4.
           MOVE SPB-INSMAXTRM(6 4) TO QSPB-INSMAXTRM-6-4.
           MOVE SPB-INSMINAGE(6 5) TO QSPB-INSMINAGE-6-5.
           MOVE SPB-INSMAXAGE(6 5) TO QSPB-INSMAXAGE-6-5.
           MOVE SPB-INSMAXCOV(6 5) TO QSPB-INSMAXCOV-6-5.
           MOVE SPB-INSMAXTRM(6 5) TO QSPB-INSMAXTRM-6-5.
           MOVE SPB-INSFEECD(6) TO QSPB-INSFEECD-6.
           MOVE SPB-INSFEE-FRMLA(6) TO QSPB-INSFEE-FRMLA-6.
           MOVE SPB-INSCHGABL-FG(6) TO QSPB-INSCHGABL-FG-6.
           MOVE SPB-INSREJECT-FG(6) TO QSPB-INSREJECT-FG-6.
           MOVE SPB-INSFINCHG(6) TO QSPB-INSFINCHG-6.
           MOVE SPB-INSCOM(7) TO QSPB-INSCOM-7.
           MOVE SPB-INSRATECD(7) TO QSPB-INSRATECD-7.
           MOVE SPB-INSJFAC(7) TO QSPB-INSJFAC-7.
           MOVE SPB-INSDISCNT(7) TO QSPB-INSDISCNT-7.
           MOVE SPB-INSCHGABL(7) TO QSPB-INSCHGABL-7.
           MOVE SPB-INSTERM(7 1) TO QSPB-INSTERM-7-1.
           MOVE SPB-INSRATE(7 1) TO QSPB-INSRATE-7-1.
           MOVE SPB-INSTERM(7 2) TO QSPB-INSTERM-7-2.
           MOVE SPB-INSRATE(7 2) TO QSPB-INSRATE-7-2.
           MOVE SPB-INSTERM(7 3) TO QSPB-INSTERM-7-3.
           MOVE SPB-INSRATE(7 3) TO QSPB-INSRATE-7-3.
           MOVE SPB-INSTERM(7 4) TO QSPB-INSTERM-7-4.
           MOVE SPB-INSRATE(7 4) TO QSPB-INSRATE-7-4.
           MOVE SPB-INSTERM(7 5) TO QSPB-INSTERM-7-5.
           MOVE SPB-INSRATE(7 5) TO QSPB-INSRATE-7-5.
           MOVE SPB-INSTERM(7 6) TO QSPB-INSTERM-7-6.
           MOVE SPB-INSRATE(7 6) TO QSPB-INSRATE-7-6.
           MOVE SPB-INSTERM(7 7) TO QSPB-INSTERM-7-7.
           MOVE SPB-INSRATE(7 7) TO QSPB-INSRATE-7-7.
           MOVE SPB-INSTERM(7 8) TO QSPB-INSTERM-7-8.
           MOVE SPB-INSRATE(7 8) TO QSPB-INSRATE-7-8.
           MOVE SPB-INSTERM(7 9) TO QSPB-INSTERM-7-9.
           MOVE SPB-INSRATE(7 9) TO QSPB-INSRATE-7-9.
           MOVE SPB-INSTERM(7 10) TO QSPB-INSTERM-7-10.
           MOVE SPB-INSRATE(7 10) TO QSPB-INSRATE-7-10.
           MOVE SPB-INSTERM(7 11) TO QSPB-INSTERM-7-11.
           MOVE SPB-INSRATE(7 11) TO QSPB-INSRATE-7-11.
           MOVE SPB-INSTERM(7 12) TO QSPB-INSTERM-7-12.
           MOVE SPB-INSRATE(7 12) TO QSPB-INSRATE-7-12.
           MOVE SPB-INSTERM(7 13) TO QSPB-INSTERM-7-13.
           MOVE SPB-INSRATE(7 13) TO QSPB-INSRATE-7-13.
           MOVE SPB-INSTERM(7 14) TO QSPB-INSTERM-7-14.
           MOVE SPB-INSRATE(7 14) TO QSPB-INSRATE-7-14.
           MOVE SPB-INSTERM(7 15) TO QSPB-INSTERM-7-15.
           MOVE SPB-INSRATE(7 15) TO QSPB-INSRATE-7-15.
           MOVE SPB-INSTERM(7 16) TO QSPB-INSTERM-7-16.
           MOVE SPB-INSRATE(7 16) TO QSPB-INSRATE-7-16.
           MOVE SPB-INSTERM(7 17) TO QSPB-INSTERM-7-17.
           MOVE SPB-INSRATE(7 17) TO QSPB-INSRATE-7-17.
           MOVE SPB-INSTERM(7 18) TO QSPB-INSTERM-7-18.
           MOVE SPB-INSRATE(7 18) TO QSPB-INSRATE-7-18.
           MOVE SPB-INSTERM(7 19) TO QSPB-INSTERM-7-19.
           MOVE SPB-INSRATE(7 19) TO QSPB-INSRATE-7-19.
           MOVE SPB-INSTERM(7 20) TO QSPB-INSTERM-7-20.
           MOVE SPB-INSRATE(7 20) TO QSPB-INSRATE-7-20.
           MOVE SPB-INSMINPREM(7) TO QSPB-INSMINPREM-7.
           MOVE SPB-INSMINCHGABL(7) TO QSPB-INSMINCHGABL-7.
           MOVE SPB-INSMAXCHGABL(7) TO QSPB-INSMAXCHGABL-7.
           MOVE SPB-INSMAXBENIF(7) TO QSPB-INSMAXBENIF-7.
           MOVE SPB-INSMAXTERM(7) TO QSPB-INSMAXTERM-7.
           MOVE SPB-INSCHGBEN(7) TO QSPB-INSCHGBEN-7.
           MOVE SPB-INSEXCEPT(7) TO QSPB-INSEXCEPT-7.
           MOVE SPB-INSNOVER(7) TO QSPB-INSNOVER-7.
           MOVE SPB-INSMINAGE(7 1) TO QSPB-INSMINAGE-7-1.
           MOVE SPB-INSMAXAGE(7 1) TO QSPB-INSMAXAGE-7-1.
           MOVE SPB-INSMAXCOV(7 1) TO QSPB-INSMAXCOV-7-1.
           MOVE SPB-INSMAXTRM(7 1) TO QSPB-INSMAXTRM-7-1.
           MOVE SPB-INSMINAGE(7 2) TO QSPB-INSMINAGE-7-2.
           MOVE SPB-INSMAXAGE(7 2) TO QSPB-INSMAXAGE-7-2.
           MOVE SPB-INSMAXCOV(7 2) TO QSPB-INSMAXCOV-7-2.
           MOVE SPB-INSMAXTRM(7 2) TO QSPB-INSMAXTRM-7-2.
           MOVE SPB-INSMINAGE(7 3) TO QSPB-INSMINAGE-7-3.
           MOVE SPB-INSMAXAGE(7 3) TO QSPB-INSMAXAGE-7-3.
           MOVE SPB-INSMAXCOV(7 3) TO QSPB-INSMAXCOV-7-3.
           MOVE SPB-INSMAXTRM(7 3) TO QSPB-INSMAXTRM-7-3.
           MOVE SPB-INSMINAGE(7 4) TO QSPB-INSMINAGE-7-4.
           MOVE SPB-INSMAXAGE(7 4) TO QSPB-INSMAXAGE-7-4.
           MOVE SPB-INSMAXCOV(7 4) TO QSPB-INSMAXCOV-7-4.
           MOVE SPB-INSMAXTRM(7 4) TO QSPB-INSMAXTRM-7-4.
           MOVE SPB-INSMINAGE(7 5) TO QSPB-INSMINAGE-7-5.
           MOVE SPB-INSMAXAGE(7 5) TO QSPB-INSMAXAGE-7-5.
           MOVE SPB-INSMAXCOV(7 5) TO QSPB-INSMAXCOV-7-5.
           MOVE SPB-INSMAXTRM(7 5) TO QSPB-INSMAXTRM-7-5.
           MOVE SPB-INSFEECD(7) TO QSPB-INSFEECD-7.
           MOVE SPB-INSFEE-FRMLA(7) TO QSPB-INSFEE-FRMLA-7.
           MOVE SPB-INSCHGABL-FG(7) TO QSPB-INSCHGABL-FG-7.
           MOVE SPB-INSREJECT-FG(7) TO QSPB-INSREJECT-FG-7.
           MOVE SPB-INSFINCHG(7) TO QSPB-INSFINCHG-7.
           MOVE SPB-INSCOM(8) TO QSPB-INSCOM-8.
           MOVE SPB-INSRATECD(8) TO QSPB-INSRATECD-8.
           MOVE SPB-INSJFAC(8) TO QSPB-INSJFAC-8.
           MOVE SPB-INSDISCNT(8) TO QSPB-INSDISCNT-8.
           MOVE SPB-INSCHGABL(8) TO QSPB-INSCHGABL-8.
           MOVE SPB-INSTERM(8 1) TO QSPB-INSTERM-8-1.
           MOVE SPB-INSRATE(8 1) TO QSPB-INSRATE-8-1.
           MOVE SPB-INSTERM(8 2) TO QSPB-INSTERM-8-2.
           MOVE SPB-INSRATE(8 2) TO QSPB-INSRATE-8-2.
           MOVE SPB-INSTERM(8 3) TO QSPB-INSTERM-8-3.
           MOVE SPB-INSRATE(8 3) TO QSPB-INSRATE-8-3.
           MOVE SPB-INSTERM(8 4) TO QSPB-INSTERM-8-4.
           MOVE SPB-INSRATE(8 4) TO QSPB-INSRATE-8-4.
           MOVE SPB-INSTERM(8 5) TO QSPB-INSTERM-8-5.
           MOVE SPB-INSRATE(8 5) TO QSPB-INSRATE-8-5.
           MOVE SPB-INSTERM(8 6) TO QSPB-INSTERM-8-6.
           MOVE SPB-INSRATE(8 6) TO QSPB-INSRATE-8-6.
           MOVE SPB-INSTERM(8 7) TO QSPB-INSTERM-8-7.
           MOVE SPB-INSRATE(8 7) TO QSPB-INSRATE-8-7.
           MOVE SPB-INSTERM(8 8) TO QSPB-INSTERM-8-8.
           MOVE SPB-INSRATE(8 8) TO QSPB-INSRATE-8-8.
           MOVE SPB-INSTERM(8 9) TO QSPB-INSTERM-8-9.
           MOVE SPB-INSRATE(8 9) TO QSPB-INSRATE-8-9.
           MOVE SPB-INSTERM(8 10) TO QSPB-INSTERM-8-10.
           MOVE SPB-INSRATE(8 10) TO QSPB-INSRATE-8-10.
           MOVE SPB-INSTERM(8 11) TO QSPB-INSTERM-8-11.
           MOVE SPB-INSRATE(8 11) TO QSPB-INSRATE-8-11.
           MOVE SPB-INSTERM(8 12) TO QSPB-INSTERM-8-12.
           MOVE SPB-INSRATE(8 12) TO QSPB-INSRATE-8-12.
           MOVE SPB-INSTERM(8 13) TO QSPB-INSTERM-8-13.
           MOVE SPB-INSRATE(8 13) TO QSPB-INSRATE-8-13.
           MOVE SPB-INSTERM(8 14) TO QSPB-INSTERM-8-14.
           MOVE SPB-INSRATE(8 14) TO QSPB-INSRATE-8-14.
           MOVE SPB-INSTERM(8 15) TO QSPB-INSTERM-8-15.
           MOVE SPB-INSRATE(8 15) TO QSPB-INSRATE-8-15.
           MOVE SPB-INSTERM(8 16) TO QSPB-INSTERM-8-16.
           MOVE SPB-INSRATE(8 16) TO QSPB-INSRATE-8-16.
           MOVE SPB-INSTERM(8 17) TO QSPB-INSTERM-8-17.
           MOVE SPB-INSRATE(8 17) TO QSPB-INSRATE-8-17.
           MOVE SPB-INSTERM(8 18) TO QSPB-INSTERM-8-18.
           MOVE SPB-INSRATE(8 18) TO QSPB-INSRATE-8-18.
           MOVE SPB-INSTERM(8 19) TO QSPB-INSTERM-8-19.
           MOVE SPB-INSRATE(8 19) TO QSPB-INSRATE-8-19.
           MOVE SPB-INSTERM(8 20) TO QSPB-INSTERM-8-20.
           MOVE SPB-INSRATE(8 20) TO QSPB-INSRATE-8-20.
           MOVE SPB-INSMINPREM(8) TO QSPB-INSMINPREM-8.
           MOVE SPB-INSMINCHGABL(8) TO QSPB-INSMINCHGABL-8.
           MOVE SPB-INSMAXCHGABL(8) TO QSPB-INSMAXCHGABL-8.
           MOVE SPB-INSMAXBENIF(8) TO QSPB-INSMAXBENIF-8.
           MOVE SPB-INSMAXTERM(8) TO QSPB-INSMAXTERM-8.
           MOVE SPB-INSCHGBEN(8) TO QSPB-INSCHGBEN-8.
           MOVE SPB-INSEXCEPT(8) TO QSPB-INSEXCEPT-8.
           MOVE SPB-INSNOVER(8) TO QSPB-INSNOVER-8.
           MOVE SPB-INSMINAGE(8 1) TO QSPB-INSMINAGE-8-1.
           MOVE SPB-INSMAXAGE(8 1) TO QSPB-INSMAXAGE-8-1.
           MOVE SPB-INSMAXCOV(8 1) TO QSPB-INSMAXCOV-8-1.
           MOVE SPB-INSMAXTRM(8 1) TO QSPB-INSMAXTRM-8-1.
           MOVE SPB-INSMINAGE(8 2) TO QSPB-INSMINAGE-8-2.
           MOVE SPB-INSMAXAGE(8 2) TO QSPB-INSMAXAGE-8-2.
           MOVE SPB-INSMAXCOV(8 2) TO QSPB-INSMAXCOV-8-2.
           MOVE SPB-INSMAXTRM(8 2) TO QSPB-INSMAXTRM-8-2.
           MOVE SPB-INSMINAGE(8 3) TO QSPB-INSMINAGE-8-3.
           MOVE SPB-INSMAXAGE(8 3) TO QSPB-INSMAXAGE-8-3.
           MOVE SPB-INSMAXCOV(8 3) TO QSPB-INSMAXCOV-8-3.
           MOVE SPB-INSMAXTRM(8 3) TO QSPB-INSMAXTRM-8-3.
           MOVE SPB-INSMINAGE(8 4) TO QSPB-INSMINAGE-8-4.
           MOVE SPB-INSMAXAGE(8 4) TO QSPB-INSMAXAGE-8-4.
           MOVE SPB-INSMAXCOV(8 4) TO QSPB-INSMAXCOV-8-4.
           MOVE SPB-INSMAXTRM(8 4) TO QSPB-INSMAXTRM-8-4.
           MOVE SPB-INSMINAGE(8 5) TO QSPB-INSMINAGE-8-5.
           MOVE SPB-INSMAXAGE(8 5) TO QSPB-INSMAXAGE-8-5.
           MOVE SPB-INSMAXCOV(8 5) TO QSPB-INSMAXCOV-8-5.
           MOVE SPB-INSMAXTRM(8 5) TO QSPB-INSMAXTRM-8-5.
           MOVE SPB-INSFEECD(8) TO QSPB-INSFEECD-8.
           MOVE SPB-INSFEE-FRMLA(8) TO QSPB-INSFEE-FRMLA-8.
           MOVE SPB-INSCHGABL-FG(8) TO QSPB-INSCHGABL-FG-8.
           MOVE SPB-INSREJECT-FG(8) TO QSPB-INSREJECT-FG-8.
           MOVE SPB-INSFINCHG(8) TO QSPB-INSFINCHG-8.
           MOVE SPB-INSCOM(9) TO QSPB-INSCOM-9.
           MOVE SPB-INSRATECD(9) TO QSPB-INSRATECD-9.
           MOVE SPB-INSJFAC(9) TO QSPB-INSJFAC-9.
           MOVE SPB-INSDISCNT(9) TO QSPB-INSDISCNT-9.
           MOVE SPB-INSCHGABL(9) TO QSPB-INSCHGABL-9.
           MOVE SPB-INSTERM(9 1) TO QSPB-INSTERM-9-1.
           MOVE SPB-INSRATE(9 1) TO QSPB-INSRATE-9-1.
           MOVE SPB-INSTERM(9 2) TO QSPB-INSTERM-9-2.
           MOVE SPB-INSRATE(9 2) TO QSPB-INSRATE-9-2.
           MOVE SPB-INSTERM(9 3) TO QSPB-INSTERM-9-3.
           MOVE SPB-INSRATE(9 3) TO QSPB-INSRATE-9-3.
           MOVE SPB-INSTERM(9 4) TO QSPB-INSTERM-9-4.
           MOVE SPB-INSRATE(9 4) TO QSPB-INSRATE-9-4.
           MOVE SPB-INSTERM(9 5) TO QSPB-INSTERM-9-5.
           MOVE SPB-INSRATE(9 5) TO QSPB-INSRATE-9-5.
           MOVE SPB-INSTERM(9 6) TO QSPB-INSTERM-9-6.
           MOVE SPB-INSRATE(9 6) TO QSPB-INSRATE-9-6.
           MOVE SPB-INSTERM(9 7) TO QSPB-INSTERM-9-7.
           MOVE SPB-INSRATE(9 7) TO QSPB-INSRATE-9-7.
           MOVE SPB-INSTERM(9 8) TO QSPB-INSTERM-9-8.
           MOVE SPB-INSRATE(9 8) TO QSPB-INSRATE-9-8.
           MOVE SPB-INSTERM(9 9) TO QSPB-INSTERM-9-9.
           MOVE SPB-INSRATE(9 9) TO QSPB-INSRATE-9-9.
           MOVE SPB-INSTERM(9 10) TO QSPB-INSTERM-9-10.
           MOVE SPB-INSRATE(9 10) TO QSPB-INSRATE-9-10.
           MOVE SPB-INSTERM(9 11) TO QSPB-INSTERM-9-11.
           MOVE SPB-INSRATE(9 11) TO QSPB-INSRATE-9-11.
           MOVE SPB-INSTERM(9 12) TO QSPB-INSTERM-9-12.
           MOVE SPB-INSRATE(9 12) TO QSPB-INSRATE-9-12.
           MOVE SPB-INSTERM(9 13) TO QSPB-INSTERM-9-13.
           MOVE SPB-INSRATE(9 13) TO QSPB-INSRATE-9-13.
           MOVE SPB-INSTERM(9 14) TO QSPB-INSTERM-9-14.
           MOVE SPB-INSRATE(9 14) TO QSPB-INSRATE-9-14.
           MOVE SPB-INSTERM(9 15) TO QSPB-INSTERM-9-15.
           MOVE SPB-INSRATE(9 15) TO QSPB-INSRATE-9-15.
           MOVE SPB-INSTERM(9 16) TO QSPB-INSTERM-9-16.
           MOVE SPB-INSRATE(9 16) TO QSPB-INSRATE-9-16.
           MOVE SPB-INSTERM(9 17) TO QSPB-INSTERM-9-17.
           MOVE SPB-INSRATE(9 17) TO QSPB-INSRATE-9-17.
           MOVE SPB-INSTERM(9 18) TO QSPB-INSTERM-9-18.
           MOVE SPB-INSRATE(9 18) TO QSPB-INSRATE-9-18.
           MOVE SPB-INSTERM(9 19) TO QSPB-INSTERM-9-19.
           MOVE SPB-INSRATE(9 19) TO QSPB-INSRATE-9-19.
           MOVE SPB-INSTERM(9 20) TO QSPB-INSTERM-9-20.
           MOVE SPB-INSRATE(9 20) TO QSPB-INSRATE-9-20.
           MOVE SPB-INSMINPREM(9) TO QSPB-INSMINPREM-9.
           MOVE SPB-INSMINCHGABL(9) TO QSPB-INSMINCHGABL-9.
           MOVE SPB-INSMAXCHGABL(9) TO QSPB-INSMAXCHGABL-9.
           MOVE SPB-INSMAXBENIF(9) TO QSPB-INSMAXBENIF-9.
           MOVE SPB-INSMAXTERM(9) TO QSPB-INSMAXTERM-9.
           MOVE SPB-INSCHGBEN(9) TO QSPB-INSCHGBEN-9.
           MOVE SPB-INSEXCEPT(9) TO QSPB-INSEXCEPT-9.
           MOVE SPB-INSNOVER(9) TO QSPB-INSNOVER-9.
           MOVE SPB-INSMINAGE(9 1) TO QSPB-INSMINAGE-9-1.
           MOVE SPB-INSMAXAGE(9 1) TO QSPB-INSMAXAGE-9-1.
           MOVE SPB-INSMAXCOV(9 1) TO QSPB-INSMAXCOV-9-1.
           MOVE SPB-INSMAXTRM(9 1) TO QSPB-INSMAXTRM-9-1.
           MOVE SPB-INSMINAGE(9 2) TO QSPB-INSMINAGE-9-2.
           MOVE SPB-INSMAXAGE(9 2) TO QSPB-INSMAXAGE-9-2.
           MOVE SPB-INSMAXCOV(9 2) TO QSPB-INSMAXCOV-9-2.
           MOVE SPB-INSMAXTRM(9 2) TO QSPB-INSMAXTRM-9-2.
           MOVE SPB-INSMINAGE(9 3) TO QSPB-INSMINAGE-9-3.
           MOVE SPB-INSMAXAGE(9 3) TO QSPB-INSMAXAGE-9-3.
           MOVE SPB-INSMAXCOV(9 3) TO QSPB-INSMAXCOV-9-3.
           MOVE SPB-INSMAXTRM(9 3) TO QSPB-INSMAXTRM-9-3.
           MOVE SPB-INSMINAGE(9 4) TO QSPB-INSMINAGE-9-4.
           MOVE SPB-INSMAXAGE(9 4) TO QSPB-INSMAXAGE-9-4.
           MOVE SPB-INSMAXCOV(9 4) TO QSPB-INSMAXCOV-9-4.
           MOVE SPB-INSMAXTRM(9 4) TO QSPB-INSMAXTRM-9-4.
           MOVE SPB-INSMINAGE(9 5) TO QSPB-INSMINAGE-9-5.
           MOVE SPB-INSMAXAGE(9 5) TO QSPB-INSMAXAGE-9-5.
           MOVE SPB-INSMAXCOV(9 5) TO QSPB-INSMAXCOV-9-5.
           MOVE SPB-INSMAXTRM(9 5) TO QSPB-INSMAXTRM-9-5.
           MOVE SPB-INSFEECD(9) TO QSPB-INSFEECD-9.
           MOVE SPB-INSFEE-FRMLA(9) TO QSPB-INSFEE-FRMLA-9.
           MOVE SPB-INSCHGABL-FG(9) TO QSPB-INSCHGABL-FG-9.
           MOVE SPB-INSREJECT-FG(9) TO QSPB-INSREJECT-FG-9.
           MOVE SPB-INSFINCHG(9) TO QSPB-INSFINCHG-9.
           MOVE SPB-INSCOM(10) TO QSPB-INSCOM-10.
           MOVE SPB-INSRATECD(10) TO QSPB-INSRATECD-10.
           MOVE SPB-INSJFAC(10) TO QSPB-INSJFAC-10.
           MOVE SPB-INSDISCNT(10) TO QSPB-INSDISCNT-10.
           MOVE SPB-INSCHGABL(10) TO QSPB-INSCHGABL-10.
           MOVE SPB-INSTERM(10 1) TO QSPB-INSTERM-10-1.
           MOVE SPB-INSRATE(10 1) TO QSPB-INSRATE-10-1.
           MOVE SPB-INSTERM(10 2) TO QSPB-INSTERM-10-2.
           MOVE SPB-INSRATE(10 2) TO QSPB-INSRATE-10-2.
           MOVE SPB-INSTERM(10 3) TO QSPB-INSTERM-10-3.
           MOVE SPB-INSRATE(10 3) TO QSPB-INSRATE-10-3.
           MOVE SPB-INSTERM(10 4) TO QSPB-INSTERM-10-4.
           MOVE SPB-INSRATE(10 4) TO QSPB-INSRATE-10-4.
           MOVE SPB-INSTERM(10 5) TO QSPB-INSTERM-10-5.
           MOVE SPB-INSRATE(10 5) TO QSPB-INSRATE-10-5.
           MOVE SPB-INSTERM(10 6) TO QSPB-INSTERM-10-6.
           MOVE SPB-INSRATE(10 6) TO QSPB-INSRATE-10-6.
           MOVE SPB-INSTERM(10 7) TO QSPB-INSTERM-10-7.
           MOVE SPB-INSRATE(10 7) TO QSPB-INSRATE-10-7.
           MOVE SPB-INSTERM(10 8) TO QSPB-INSTERM-10-8.
           MOVE SPB-INSRATE(10 8) TO QSPB-INSRATE-10-8.
           MOVE SPB-INSTERM(10 9) TO QSPB-INSTERM-10-9.
           MOVE SPB-INSRATE(10 9) TO QSPB-INSRATE-10-9.
           MOVE SPB-INSTERM(10 10) TO QSPB-INSTERM-10-10.
           MOVE SPB-INSRATE(10 10) TO QSPB-INSRATE-10-10.
           MOVE SPB-INSTERM(10 11) TO QSPB-INSTERM-10-11.
           MOVE SPB-INSRATE(10 11) TO QSPB-INSRATE-10-11.
           MOVE SPB-INSTERM(10 12) TO QSPB-INSTERM-10-12.
           MOVE SPB-INSRATE(10 12) TO QSPB-INSRATE-10-12.
           MOVE SPB-INSTERM(10 13) TO QSPB-INSTERM-10-13.
           MOVE SPB-INSRATE(10 13) TO QSPB-INSRATE-10-13.
           MOVE SPB-INSTERM(10 14) TO QSPB-INSTERM-10-14.
           MOVE SPB-INSRATE(10 14) TO QSPB-INSRATE-10-14.
           MOVE SPB-INSTERM(10 15) TO QSPB-INSTERM-10-15.
           MOVE SPB-INSRATE(10 15) TO QSPB-INSRATE-10-15.
           MOVE SPB-INSTERM(10 16) TO QSPB-INSTERM-10-16.
           MOVE SPB-INSRATE(10 16) TO QSPB-INSRATE-10-16.
           MOVE SPB-INSTERM(10 17) TO QSPB-INSTERM-10-17.
           MOVE SPB-INSRATE(10 17) TO QSPB-INSRATE-10-17.
           MOVE SPB-INSTERM(10 18) TO QSPB-INSTERM-10-18.
           MOVE SPB-INSRATE(10 18) TO QSPB-INSRATE-10-18.
           MOVE SPB-INSTERM(10 19) TO QSPB-INSTERM-10-19.
           MOVE SPB-INSRATE(10 19) TO QSPB-INSRATE-10-19.
           MOVE SPB-INSTERM(10 20) TO QSPB-INSTERM-10-20.
           MOVE SPB-INSRATE(10 20) TO QSPB-INSRATE-10-20.
           MOVE SPB-INSMINPREM(10) TO QSPB-INSMINPREM-10.
           MOVE SPB-INSMINCHGABL(10) TO QSPB-INSMINCHGABL-10.
           MOVE SPB-INSMAXCHGABL(10) TO QSPB-INSMAXCHGABL-10.
           MOVE SPB-INSMAXBENIF(10) TO QSPB-INSMAXBENIF-10.
           MOVE SPB-INSMAXTERM(10) TO QSPB-INSMAXTERM-10.
           MOVE SPB-INSCHGBEN(10) TO QSPB-INSCHGBEN-10.
           MOVE SPB-INSEXCEPT(10) TO QSPB-INSEXCEPT-10.
           MOVE SPB-INSNOVER(10) TO QSPB-INSNOVER-10.
           MOVE SPB-INSMINAGE(10 1) TO QSPB-INSMINAGE-10-1.
           MOVE SPB-INSMAXAGE(10 1) TO QSPB-INSMAXAGE-10-1.
           MOVE SPB-INSMAXCOV(10 1) TO QSPB-INSMAXCOV-10-1.
           MOVE SPB-INSMAXTRM(10 1) TO QSPB-INSMAXTRM-10-1.
           MOVE SPB-INSMINAGE(10 2) TO QSPB-INSMINAGE-10-2.
           MOVE SPB-INSMAXAGE(10 2) TO QSPB-INSMAXAGE-10-2.
           MOVE SPB-INSMAXCOV(10 2) TO QSPB-INSMAXCOV-10-2.
           MOVE SPB-INSMAXTRM(10 2) TO QSPB-INSMAXTRM-10-2.
           MOVE SPB-INSMINAGE(10 3) TO QSPB-INSMINAGE-10-3.
           MOVE SPB-INSMAXAGE(10 3) TO QSPB-INSMAXAGE-10-3.
           MOVE SPB-INSMAXCOV(10 3) TO QSPB-INSMAXCOV-10-3.
           MOVE SPB-INSMAXTRM(10 3) TO QSPB-INSMAXTRM-10-3.
           MOVE SPB-INSMINAGE(10 4) TO QSPB-INSMINAGE-10-4.
           MOVE SPB-INSMAXAGE(10 4) TO QSPB-INSMAXAGE-10-4.
           MOVE SPB-INSMAXCOV(10 4) TO QSPB-INSMAXCOV-10-4.
           MOVE SPB-INSMAXTRM(10 4) TO QSPB-INSMAXTRM-10-4.
           MOVE SPB-INSMINAGE(10 5) TO QSPB-INSMINAGE-10-5.
           MOVE SPB-INSMAXAGE(10 5) TO QSPB-INSMAXAGE-10-5.
           MOVE SPB-INSMAXCOV(10 5) TO QSPB-INSMAXCOV-10-5.
           MOVE SPB-INSMAXTRM(10 5) TO QSPB-INSMAXTRM-10-5.
           MOVE SPB-INSFEECD(10) TO QSPB-INSFEECD-10.
           MOVE SPB-INSFEE-FRMLA(10) TO QSPB-INSFEE-FRMLA-10.
           MOVE SPB-INSCHGABL-FG(10) TO QSPB-INSCHGABL-FG-10.
           MOVE SPB-INSREJECT-FG(10) TO QSPB-INSREJECT-FG-10.
           MOVE SPB-INSFINCHG(10) TO QSPB-INSFINCHG-10.
           MOVE SPB-INSCOM(11) TO QSPB-INSCOM-11.
           MOVE SPB-INSRATECD(11) TO QSPB-INSRATECD-11.
           MOVE SPB-INSJFAC(11) TO QSPB-INSJFAC-11.
           MOVE SPB-INSDISCNT(11) TO QSPB-INSDISCNT-11.
           MOVE SPB-INSCHGABL(11) TO QSPB-INSCHGABL-11.
           MOVE SPB-INSTERM(11 1) TO QSPB-INSTERM-11-1.
           MOVE SPB-INSRATE(11 1) TO QSPB-INSRATE-11-1.
           MOVE SPB-INSTERM(11 2) TO QSPB-INSTERM-11-2.
           MOVE SPB-INSRATE(11 2) TO QSPB-INSRATE-11-2.
           MOVE SPB-INSTERM(11 3) TO QSPB-INSTERM-11-3.
           MOVE SPB-INSRATE(11 3) TO QSPB-INSRATE-11-3.
           MOVE SPB-INSTERM(11 4) TO QSPB-INSTERM-11-4.
           MOVE SPB-INSRATE(11 4) TO QSPB-INSRATE-11-4.
           MOVE SPB-INSTERM(11 5) TO QSPB-INSTERM-11-5.
           MOVE SPB-INSRATE(11 5) TO QSPB-INSRATE-11-5.
           MOVE SPB-INSTERM(11 6) TO QSPB-INSTERM-11-6.
           MOVE SPB-INSRATE(11 6) TO QSPB-INSRATE-11-6.
           MOVE SPB-INSTERM(11 7) TO QSPB-INSTERM-11-7.
           MOVE SPB-INSRATE(11 7) TO QSPB-INSRATE-11-7.
           MOVE SPB-INSTERM(11 8) TO QSPB-INSTERM-11-8.
           MOVE SPB-INSRATE(11 8) TO QSPB-INSRATE-11-8.
           MOVE SPB-INSTERM(11 9) TO QSPB-INSTERM-11-9.
           MOVE SPB-INSRATE(11 9) TO QSPB-INSRATE-11-9.
           MOVE SPB-INSTERM(11 10) TO QSPB-INSTERM-11-10.
           MOVE SPB-INSRATE(11 10) TO QSPB-INSRATE-11-10.
           MOVE SPB-INSTERM(11 11) TO QSPB-INSTERM-11-11.
           MOVE SPB-INSRATE(11 11) TO QSPB-INSRATE-11-11.
           MOVE SPB-INSTERM(11 12) TO QSPB-INSTERM-11-12.
           MOVE SPB-INSRATE(11 12) TO QSPB-INSRATE-11-12.
           MOVE SPB-INSTERM(11 13) TO QSPB-INSTERM-11-13.
           MOVE SPB-INSRATE(11 13) TO QSPB-INSRATE-11-13.
           MOVE SPB-INSTERM(11 14) TO QSPB-INSTERM-11-14.
           MOVE SPB-INSRATE(11 14) TO QSPB-INSRATE-11-14.
           MOVE SPB-INSTERM(11 15) TO QSPB-INSTERM-11-15.
           MOVE SPB-INSRATE(11 15) TO QSPB-INSRATE-11-15.
           MOVE SPB-INSTERM(11 16) TO QSPB-INSTERM-11-16.
           MOVE SPB-INSRATE(11 16) TO QSPB-INSRATE-11-16.
           MOVE SPB-INSTERM(11 17) TO QSPB-INSTERM-11-17.
           MOVE SPB-INSRATE(11 17) TO QSPB-INSRATE-11-17.
           MOVE SPB-INSTERM(11 18) TO QSPB-INSTERM-11-18.
           MOVE SPB-INSRATE(11 18) TO QSPB-INSRATE-11-18.
           MOVE SPB-INSTERM(11 19) TO QSPB-INSTERM-11-19.
           MOVE SPB-INSRATE(11 19) TO QSPB-INSRATE-11-19.
           MOVE SPB-INSTERM(11 20) TO QSPB-INSTERM-11-20.
           MOVE SPB-INSRATE(11 20) TO QSPB-INSRATE-11-20.
           MOVE SPB-INSMINPREM(11) TO QSPB-INSMINPREM-11.
           MOVE SPB-INSMINCHGABL(11) TO QSPB-INSMINCHGABL-11.
           MOVE SPB-INSMAXCHGABL(11) TO QSPB-INSMAXCHGABL-11.
           MOVE SPB-INSMAXBENIF(11) TO QSPB-INSMAXBENIF-11.
           MOVE SPB-INSMAXTERM(11) TO QSPB-INSMAXTERM-11.
           MOVE SPB-INSCHGBEN(11) TO QSPB-INSCHGBEN-11.
           MOVE SPB-INSEXCEPT(11) TO QSPB-INSEXCEPT-11.
           MOVE SPB-INSNOVER(11) TO QSPB-INSNOVER-11.
           MOVE SPB-INSMINAGE(11 1) TO QSPB-INSMINAGE-11-1.
           MOVE SPB-INSMAXAGE(11 1) TO QSPB-INSMAXAGE-11-1.
           MOVE SPB-INSMAXCOV(11 1) TO QSPB-INSMAXCOV-11-1.
           MOVE SPB-INSMAXTRM(11 1) TO QSPB-INSMAXTRM-11-1.
           MOVE SPB-INSMINAGE(11 2) TO QSPB-INSMINAGE-11-2.
           MOVE SPB-INSMAXAGE(11 2) TO QSPB-INSMAXAGE-11-2.
           MOVE SPB-INSMAXCOV(11 2) TO QSPB-INSMAXCOV-11-2.
           MOVE SPB-INSMAXTRM(11 2) TO QSPB-INSMAXTRM-11-2.
           MOVE SPB-INSMINAGE(11 3) TO QSPB-INSMINAGE-11-3.
           MOVE SPB-INSMAXAGE(11 3) TO QSPB-INSMAXAGE-11-3.
           MOVE SPB-INSMAXCOV(11 3) TO QSPB-INSMAXCOV-11-3.
           MOVE SPB-INSMAXTRM(11 3) TO QSPB-INSMAXTRM-11-3.
           MOVE SPB-INSMINAGE(11 4) TO QSPB-INSMINAGE-11-4.
           MOVE SPB-INSMAXAGE(11 4) TO QSPB-INSMAXAGE-11-4.
           MOVE SPB-INSMAXCOV(11 4) TO QSPB-INSMAXCOV-11-4.
           MOVE SPB-INSMAXTRM(11 4) TO QSPB-INSMAXTRM-11-4.
           MOVE SPB-INSMINAGE(11 5) TO QSPB-INSMINAGE-11-5.
           MOVE SPB-INSMAXAGE(11 5) TO QSPB-INSMAXAGE-11-5.
           MOVE SPB-INSMAXCOV(11 5) TO QSPB-INSMAXCOV-11-5.
           MOVE SPB-INSMAXTRM(11 5) TO QSPB-INSMAXTRM-11-5.
           MOVE SPB-INSFEECD(11) TO QSPB-INSFEECD-11.
           MOVE SPB-INSFEE-FRMLA(11) TO QSPB-INSFEE-FRMLA-11.
           MOVE SPB-INSCHGABL-FG(11) TO QSPB-INSCHGABL-FG-11.
           MOVE SPB-INSREJECT-FG(11) TO QSPB-INSREJECT-FG-11.
           MOVE SPB-INSFINCHG(11) TO QSPB-INSFINCHG-11.
           MOVE SPB-INSCOM(12) TO QSPB-INSCOM-12.
           MOVE SPB-INSRATECD(12) TO QSPB-INSRATECD-12.
           MOVE SPB-INSJFAC(12) TO QSPB-INSJFAC-12.
           MOVE SPB-INSDISCNT(12) TO QSPB-INSDISCNT-12.
           MOVE SPB-INSCHGABL(12) TO QSPB-INSCHGABL-12.
           MOVE SPB-INSTERM(12 1) TO QSPB-INSTERM-12-1.
           MOVE SPB-INSRATE(12 1) TO QSPB-INSRATE-12-1.
           MOVE SPB-INSTERM(12 2) TO QSPB-INSTERM-12-2.
           MOVE SPB-INSRATE(12 2) TO QSPB-INSRATE-12-2.
           MOVE SPB-INSTERM(12 3) TO QSPB-INSTERM-12-3.
           MOVE SPB-INSRATE(12 3) TO QSPB-INSRATE-12-3.
           MOVE SPB-INSTERM(12 4) TO QSPB-INSTERM-12-4.
           MOVE SPB-INSRATE(12 4) TO QSPB-INSRATE-12-4.
           MOVE SPB-INSTERM(12 5) TO QSPB-INSTERM-12-5.
           MOVE SPB-INSRATE(12 5) TO QSPB-INSRATE-12-5.
           MOVE SPB-INSTERM(12 6) TO QSPB-INSTERM-12-6.
           MOVE SPB-INSRATE(12 6) TO QSPB-INSRATE-12-6.
           MOVE SPB-INSTERM(12 7) TO QSPB-INSTERM-12-7.
           MOVE SPB-INSRATE(12 7) TO QSPB-INSRATE-12-7.
           MOVE SPB-INSTERM(12 8) TO QSPB-INSTERM-12-8.
           MOVE SPB-INSRATE(12 8) TO QSPB-INSRATE-12-8.
           MOVE SPB-INSTERM(12 9) TO QSPB-INSTERM-12-9.
           MOVE SPB-INSRATE(12 9) TO QSPB-INSRATE-12-9.
           MOVE SPB-INSTERM(12 10) TO QSPB-INSTERM-12-10.
           MOVE SPB-INSRATE(12 10) TO QSPB-INSRATE-12-10.
           MOVE SPB-INSTERM(12 11) TO QSPB-INSTERM-12-11.
           MOVE SPB-INSRATE(12 11) TO QSPB-INSRATE-12-11.
           MOVE SPB-INSTERM(12 12) TO QSPB-INSTERM-12-12.
           MOVE SPB-INSRATE(12 12) TO QSPB-INSRATE-12-12.
           MOVE SPB-INSTERM(12 13) TO QSPB-INSTERM-12-13.
           MOVE SPB-INSRATE(12 13) TO QSPB-INSRATE-12-13.
           MOVE SPB-INSTERM(12 14) TO QSPB-INSTERM-12-14.
           MOVE SPB-INSRATE(12 14) TO QSPB-INSRATE-12-14.
           MOVE SPB-INSTERM(12 15) TO QSPB-INSTERM-12-15.
           MOVE SPB-INSRATE(12 15) TO QSPB-INSRATE-12-15.
           MOVE SPB-INSTERM(12 16) TO QSPB-INSTERM-12-16.
           MOVE SPB-INSRATE(12 16) TO QSPB-INSRATE-12-16.
           MOVE SPB-INSTERM(12 17) TO QSPB-INSTERM-12-17.
           MOVE SPB-INSRATE(12 17) TO QSPB-INSRATE-12-17.
           MOVE SPB-INSTERM(12 18) TO QSPB-INSTERM-12-18.
           MOVE SPB-INSRATE(12 18) TO QSPB-INSRATE-12-18.
           MOVE SPB-INSTERM(12 19) TO QSPB-INSTERM-12-19.
           MOVE SPB-INSRATE(12 19) TO QSPB-INSRATE-12-19.
           MOVE SPB-INSTERM(12 20) TO QSPB-INSTERM-12-20.
           MOVE SPB-INSRATE(12 20) TO QSPB-INSRATE-12-20.
           MOVE SPB-INSMINPREM(12) TO QSPB-INSMINPREM-12.
           MOVE SPB-INSMINCHGABL(12) TO QSPB-INSMINCHGABL-12.
           MOVE SPB-INSMAXCHGABL(12) TO QSPB-INSMAXCHGABL-12.
           MOVE SPB-INSMAXBENIF(12) TO QSPB-INSMAXBENIF-12.
           MOVE SPB-INSMAXTERM(12) TO QSPB-INSMAXTERM-12.
           MOVE SPB-INSCHGBEN(12) TO QSPB-INSCHGBEN-12.
           MOVE SPB-INSEXCEPT(12) TO QSPB-INSEXCEPT-12.
           MOVE SPB-INSNOVER(12) TO QSPB-INSNOVER-12.
           MOVE SPB-INSMINAGE(12 1) TO QSPB-INSMINAGE-12-1.
           MOVE SPB-INSMAXAGE(12 1) TO QSPB-INSMAXAGE-12-1.
           MOVE SPB-INSMAXCOV(12 1) TO QSPB-INSMAXCOV-12-1.
           MOVE SPB-INSMAXTRM(12 1) TO QSPB-INSMAXTRM-12-1.
           MOVE SPB-INSMINAGE(12 2) TO QSPB-INSMINAGE-12-2.
           MOVE SPB-INSMAXAGE(12 2) TO QSPB-INSMAXAGE-12-2.
           MOVE SPB-INSMAXCOV(12 2) TO QSPB-INSMAXCOV-12-2.
           MOVE SPB-INSMAXTRM(12 2) TO QSPB-INSMAXTRM-12-2.
           MOVE SPB-INSMINAGE(12 3) TO QSPB-INSMINAGE-12-3.
           MOVE SPB-INSMAXAGE(12 3) TO QSPB-INSMAXAGE-12-3.
           MOVE SPB-INSMAXCOV(12 3) TO QSPB-INSMAXCOV-12-3.
           MOVE SPB-INSMAXTRM(12 3) TO QSPB-INSMAXTRM-12-3.
           MOVE SPB-INSMINAGE(12 4) TO QSPB-INSMINAGE-12-4.
           MOVE SPB-INSMAXAGE(12 4) TO QSPB-INSMAXAGE-12-4.
           MOVE SPB-INSMAXCOV(12 4) TO QSPB-INSMAXCOV-12-4.
           MOVE SPB-INSMAXTRM(12 4) TO QSPB-INSMAXTRM-12-4.
           MOVE SPB-INSMINAGE(12 5) TO QSPB-INSMINAGE-12-5.
           MOVE SPB-INSMAXAGE(12 5) TO QSPB-INSMAXAGE-12-5.
           MOVE SPB-INSMAXCOV(12 5) TO QSPB-INSMAXCOV-12-5.
           MOVE SPB-INSMAXTRM(12 5) TO QSPB-INSMAXTRM-12-5.
           MOVE SPB-INSFEECD(12) TO QSPB-INSFEECD-12.
           MOVE SPB-INSFEE-FRMLA(12) TO QSPB-INSFEE-FRMLA-12.
           MOVE SPB-INSCHGABL-FG(12) TO QSPB-INSCHGABL-FG-12.
           MOVE SPB-INSREJECT-FG(12) TO QSPB-INSREJECT-FG-12.
           MOVE SPB-INSFINCHG(12) TO QSPB-INSFINCHG-12.
 
      *-----------------------------------------------------------------
      *    LOAD SPC-REC FROM QSPC-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-SPC-FIELDS.
           MOVE QSPC-ORGST TO SPC-ORGST.
           MOVE QSPC-SPRCLASS TO SPC-SPRCLASS.
           MOVE QSPC-SUBCLASS TO SPC-SUBCLASS.
           MOVE QSPC-LAWCODE TO SPC-LAWCODE.
           MOVE QSPC-INSEARN-ORDER-1 TO SPC-INSEARN-ORDER(1).
           MOVE QSPC-INSEARN-ORDER-2 TO SPC-INSEARN-ORDER(2).
           MOVE QSPC-INSEARN-ORDER-3 TO SPC-INSEARN-ORDER(3).
           MOVE QSPC-INSEARN-ORDER-4 TO SPC-INSEARN-ORDER(4).
           MOVE QSPC-INSEARN-ORDER-5 TO SPC-INSEARN-ORDER(5).
           MOVE QSPC-INSEARN-ORDER-6 TO SPC-INSEARN-ORDER(6).
           MOVE QSPC-INSEARN-ORDER-7 TO SPC-INSEARN-ORDER(7).
           MOVE QSPC-INSEARN-ORDER-8 TO SPC-INSEARN-ORDER(8).
           MOVE QSPC-INSEARN-ORDER-9 TO SPC-INSEARN-ORDER(9).
           MOVE QSPC-INSEARN-ORDER-10 TO SPC-INSEARN-ORDER(10).
           MOVE QSPC-INSEARN-ORDER-11 TO SPC-INSEARN-ORDER(11).
           MOVE QSPC-INSEARN-ORDER-12 TO SPC-INSEARN-ORDER(12).
           MOVE QSPC-INSAH-JOINT-FG TO SPC-INSAH-JOINT-FG.
           MOVE QSPC-INS-O1-EDIT TO SPC-INS-O1-EDIT.
           MOVE QSPC-INS-O2-EDIT TO SPC-INS-O2-EDIT.
           MOVE QSPC-RBFRMLA-1 TO SPC-RBFRMLA(1).
           MOVE QSPC-RBDTE-1-1 TO SPC-RBDTE(1 1).
           MOVE QSPC-RBDAYS-1-1 TO SPC-RBDAYS(1 1).
           MOVE QSPC-RBYRTYPE-1-1 TO SPC-RBYRTYPE(1 1).
           MOVE QSPC-RBDTE-1-2 TO SPC-RBDTE(1 2).
           MOVE QSPC-RBDAYS-1-2 TO SPC-RBDAYS(1 2).
           MOVE QSPC-RBYRTYPE-1-2 TO SPC-RBYRTYPE(1 2).
           MOVE QSPC-RBMINRET-1 TO SPC-RBMINRET(1).
           MOVE QSPC-RBNOMON-1 TO SPC-RBNOMON(1).
           MOVE QSPC-RBDEDCHG-1 TO SPC-RBDEDCHG(1).
           MOVE QSPC-RBRECAST-1 TO SPC-RBRECAST(1).
           MOVE QSPC-RBEARLY-1 TO SPC-RBEARLY(1).
           MOVE QSPC-RBDEFER-1 TO SPC-RBDEFER(1).
           MOVE QSPC-RBPCT-1 TO SPC-RBPCT(1).
           MOVE QSPC-RBREDUC-1 TO SPC-RBREDUC(1).
           MOVE QSPC-RBMIN-1 TO SPC-RBMIN(1).
           MOVE QSPC-RBSPOPT1-1 TO SPC-RBSPOPT1(1).
           MOVE QSPC-RBSPOPT2-1 TO SPC-RBSPOPT2(1).
           MOVE QSPC-RBMANAGER-1 TO SPC-RBMANAGER(1).
           MOVE QSPC-RBUNITPER-CD-1 TO SPC-RBUNITPER-CD(1).
           MOVE QSPC-RBFRMLA2-1 TO SPC-RBFRMLA2(1).
           MOVE QSPC-RBFRMLA-2 TO SPC-RBFRMLA(2).
           MOVE QSPC-RBDTE-2-1 TO SPC-RBDTE(2 1).
           MOVE QSPC-RBDAYS-2-1 TO SPC-RBDAYS(2 1).
           MOVE QSPC-RBYRTYPE-2-1 TO SPC-RBYRTYPE(2 1).
           MOVE QSPC-RBDTE-2-2 TO SPC-RBDTE(2 2).
           MOVE QSPC-RBDAYS-2-2 TO SPC-RBDAYS(2 2).
           MOVE QSPC-RBYRTYPE-2-2 TO SPC-RBYRTYPE(2 2).
           MOVE QSPC-RBMINRET-2 TO SPC-RBMINRET(2).
           MOVE QSPC-RBNOMON-2 TO SPC-RBNOMON(2).
           MOVE QSPC-RBDEDCHG-2 TO SPC-RBDEDCHG(2).
           MOVE QSPC-RBRECAST-2 TO SPC-RBRECAST(2).
           MOVE QSPC-RBEARLY-2 TO SPC-RBEARLY(2).
           MOVE QSPC-RBDEFER-2 TO SPC-RBDEFER(2).
           MOVE QSPC-RBPCT-2 TO SPC-RBPCT(2).
           MOVE QSPC-RBREDUC-2 TO SPC-RBREDUC(2).
           MOVE QSPC-RBMIN-2 TO SPC-RBMIN(2).
           MOVE QSPC-RBSPOPT1-2 TO SPC-RBSPOPT1(2).
           MOVE QSPC-RBSPOPT2-2 TO SPC-RBSPOPT2(2).
           MOVE QSPC-RBMANAGER-2 TO SPC-RBMANAGER(2).
           MOVE QSPC-RBUNITPER-CD-2 TO SPC-RBUNITPER-CD(2).
           MOVE QSPC-RBFRMLA2-2 TO SPC-RBFRMLA2(2).
           MOVE QSPC-RBFRMLA-3 TO SPC-RBFRMLA(3).
           MOVE QSPC-RBDTE-3-1 TO SPC-RBDTE(3 1).
           MOVE QSPC-RBDAYS-3-1 TO SPC-RBDAYS(3 1).
           MOVE QSPC-RBYRTYPE-3-1 TO SPC-RBYRTYPE(3 1).
           MOVE QSPC-RBDTE-3-2 TO SPC-RBDTE(3 2).
           MOVE QSPC-RBDAYS-3-2 TO SPC-RBDAYS(3 2).
           MOVE QSPC-RBYRTYPE-3-2 TO SPC-RBYRTYPE(3 2).
           MOVE QSPC-RBMINRET-3 TO SPC-RBMINRET(3).
           MOVE QSPC-RBNOMON-3 TO SPC-RBNOMON(3).
           MOVE QSPC-RBDEDCHG-3 TO SPC-RBDEDCHG(3).
           MOVE QSPC-RBRECAST-3 TO SPC-RBRECAST(3).
           MOVE QSPC-RBEARLY-3 TO SPC-RBEARLY(3).
           MOVE QSPC-RBDEFER-3 TO SPC-RBDEFER(3).
           MOVE QSPC-RBPCT-3 TO SPC-RBPCT(3).
           MOVE QSPC-RBREDUC-3 TO SPC-RBREDUC(3).
           MOVE QSPC-RBMIN-3 TO SPC-RBMIN(3).
           MOVE QSPC-RBSPOPT1-3 TO SPC-RBSPOPT1(3).
           MOVE QSPC-RBSPOPT2-3 TO SPC-RBSPOPT2(3).
           MOVE QSPC-RBMANAGER-3 TO SPC-RBMANAGER(3).
           MOVE QSPC-RBUNITPER-CD-3 TO SPC-RBUNITPER-CD(3).
           MOVE QSPC-RBFRMLA2-3 TO SPC-RBFRMLA2(3).
           MOVE QSPC-RBFRMLA-4 TO SPC-RBFRMLA(4).
           MOVE QSPC-RBDTE-4-1 TO SPC-RBDTE(4 1).
           MOVE QSPC-RBDAYS-4-1 TO SPC-RBDAYS(4 1).
           MOVE QSPC-RBYRTYPE-4-1 TO SPC-RBYRTYPE(4 1).
           MOVE QSPC-RBDTE-4-2 TO SPC-RBDTE(4 2).
           MOVE QSPC-RBDAYS-4-2 TO SPC-RBDAYS(4 2).
           MOVE QSPC-RBYRTYPE-4-2 TO SPC-RBYRTYPE(4 2).
           MOVE QSPC-RBMINRET-4 TO SPC-RBMINRET(4).
           MOVE QSPC-RBNOMON-4 TO SPC-RBNOMON(4).
           MOVE QSPC-RBDEDCHG-4 TO SPC-RBDEDCHG(4).
           MOVE QSPC-RBRECAST-4 TO SPC-RBRECAST(4).
           MOVE QSPC-RBEARLY-4 TO SPC-RBEARLY(4).
           MOVE QSPC-RBDEFER-4 TO SPC-RBDEFER(4).
           MOVE QSPC-RBPCT-4 TO SPC-RBPCT(4).
           MOVE QSPC-RBREDUC-4 TO SPC-RBREDUC(4).
           MOVE QSPC-RBMIN-4 TO SPC-RBMIN(4).
           MOVE QSPC-RBSPOPT1-4 TO SPC-RBSPOPT1(4).
           MOVE QSPC-RBSPOPT2-4 TO SPC-RBSPOPT2(4).
           MOVE QSPC-RBMANAGER-4 TO SPC-RBMANAGER(4).
           MOVE QSPC-RBUNITPER-CD-4 TO SPC-RBUNITPER-CD(4).
           MOVE QSPC-RBFRMLA2-4 TO SPC-RBFRMLA2(4).
           MOVE QSPC-RBFRMLA-5 TO SPC-RBFRMLA(5).
           MOVE QSPC-RBDTE-5-1 TO SPC-RBDTE(5 1).
           MOVE QSPC-RBDAYS-5-1 TO SPC-RBDAYS(5 1).
           MOVE QSPC-RBYRTYPE-5-1 TO SPC-RBYRTYPE(5 1).
           MOVE QSPC-RBDTE-5-2 TO SPC-RBDTE(5 2).
           MOVE QSPC-RBDAYS-5-2 TO SPC-RBDAYS(5 2).
           MOVE QSPC-RBYRTYPE-5-2 TO SPC-RBYRTYPE(5 2).
           MOVE QSPC-RBMINRET-5 TO SPC-RBMINRET(5).
           MOVE QSPC-RBNOMON-5 TO SPC-RBNOMON(5).
           MOVE QSPC-RBDEDCHG-5 TO SPC-RBDEDCHG(5).
           MOVE QSPC-RBRECAST-5 TO SPC-RBRECAST(5).
           MOVE QSPC-RBEARLY-5 TO SPC-RBEARLY(5).
           MOVE QSPC-RBDEFER-5 TO SPC-RBDEFER(5).
           MOVE QSPC-RBPCT-5 TO SPC-RBPCT(5).
           MOVE QSPC-RBREDUC-5 TO SPC-RBREDUC(5).
           MOVE QSPC-RBMIN-5 TO SPC-RBMIN(5).
           MOVE QSPC-RBSPOPT1-5 TO SPC-RBSPOPT1(5).
           MOVE QSPC-RBSPOPT2-5 TO SPC-RBSPOPT2(5).
           MOVE QSPC-RBMANAGER-5 TO SPC-RBMANAGER(5).
           MOVE QSPC-RBUNITPER-CD-5 TO SPC-RBUNITPER-CD(5).
           MOVE QSPC-RBFRMLA2-5 TO SPC-RBFRMLA2(5).
           MOVE QSPC-RBFRMLA-6 TO SPC-RBFRMLA(6).
           MOVE QSPC-RBDTE-6-1 TO SPC-RBDTE(6 1).
           MOVE QSPC-RBDAYS-6-1 TO SPC-RBDAYS(6 1).
           MOVE QSPC-RBYRTYPE-6-1 TO SPC-RBYRTYPE(6 1).
           MOVE QSPC-RBDTE-6-2 TO SPC-RBDTE(6 2).
           MOVE QSPC-RBDAYS-6-2 TO SPC-RBDAYS(6 2).
           MOVE QSPC-RBYRTYPE-6-2 TO SPC-RBYRTYPE(6 2).
           MOVE QSPC-RBMINRET-6 TO SPC-RBMINRET(6).
           MOVE QSPC-RBNOMON-6 TO SPC-RBNOMON(6).
           MOVE QSPC-RBDEDCHG-6 TO SPC-RBDEDCHG(6).
           MOVE QSPC-RBRECAST-6 TO SPC-RBRECAST(6).
           MOVE QSPC-RBEARLY-6 TO SPC-RBEARLY(6).
           MOVE QSPC-RBDEFER-6 TO SPC-RBDEFER(6).
           MOVE QSPC-RBPCT-6 TO SPC-RBPCT(6).
           MOVE QSPC-RBREDUC-6 TO SPC-RBREDUC(6).
           MOVE QSPC-RBMIN-6 TO SPC-RBMIN(6).
           MOVE QSPC-RBSPOPT1-6 TO SPC-RBSPOPT1(6).
           MOVE QSPC-RBSPOPT2-6 TO SPC-RBSPOPT2(6).
           MOVE QSPC-RBMANAGER-6 TO SPC-RBMANAGER(6).
           MOVE QSPC-RBUNITPER-CD-6 TO SPC-RBUNITPER-CD(6).
           MOVE QSPC-RBFRMLA2-6 TO SPC-RBFRMLA2(6).
           MOVE QSPC-RBFRMLA-7 TO SPC-RBFRMLA(7).
           MOVE QSPC-RBDTE-7-1 TO SPC-RBDTE(7 1).
           MOVE QSPC-RBDAYS-7-1 TO SPC-RBDAYS(7 1).
           MOVE QSPC-RBYRTYPE-7-1 TO SPC-RBYRTYPE(7 1).
           MOVE QSPC-RBDTE-7-2 TO SPC-RBDTE(7 2).
           MOVE QSPC-RBDAYS-7-2 TO SPC-RBDAYS(7 2).
           MOVE QSPC-RBYRTYPE-7-2 TO SPC-RBYRTYPE(7 2).
           MOVE QSPC-RBMINRET-7 TO SPC-RBMINRET(7).
           MOVE QSPC-RBNOMON-7 TO SPC-RBNOMON(7).
           MOVE QSPC-RBDEDCHG-7 TO SPC-RBDEDCHG(7).
           MOVE QSPC-RBRECAST-7 TO SPC-RBRECAST(7).
           MOVE QSPC-RBEARLY-7 TO SPC-RBEARLY(7).
           MOVE QSPC-RBDEFER-7 TO SPC-RBDEFER(7).
           MOVE QSPC-RBPCT-7 TO SPC-RBPCT(7).
           MOVE QSPC-RBREDUC-7 TO SPC-RBREDUC(7).
           MOVE QSPC-RBMIN-7 TO SPC-RBMIN(7).
           MOVE QSPC-RBSPOPT1-7 TO SPC-RBSPOPT1(7).
           MOVE QSPC-RBSPOPT2-7 TO SPC-RBSPOPT2(7).
           MOVE QSPC-RBMANAGER-7 TO SPC-RBMANAGER(7).
           MOVE QSPC-RBUNITPER-CD-7 TO SPC-RBUNITPER-CD(7).
           MOVE QSPC-RBFRMLA2-7 TO SPC-RBFRMLA2(7).
           MOVE QSPC-RBFRMLA-8 TO SPC-RBFRMLA(8).
           MOVE QSPC-RBDTE-8-1 TO SPC-RBDTE(8 1).
           MOVE QSPC-RBDAYS-8-1 TO SPC-RBDAYS(8 1).
           MOVE QSPC-RBYRTYPE-8-1 TO SPC-RBYRTYPE(8 1).
           MOVE QSPC-RBDTE-8-2 TO SPC-RBDTE(8 2).
           MOVE QSPC-RBDAYS-8-2 TO SPC-RBDAYS(8 2).
           MOVE QSPC-RBYRTYPE-8-2 TO SPC-RBYRTYPE(8 2).
           MOVE QSPC-RBMINRET-8 TO SPC-RBMINRET(8).
           MOVE QSPC-RBNOMON-8 TO SPC-RBNOMON(8).
           MOVE QSPC-RBDEDCHG-8 TO SPC-RBDEDCHG(8).
           MOVE QSPC-RBRECAST-8 TO SPC-RBRECAST(8).
           MOVE QSPC-RBEARLY-8 TO SPC-RBEARLY(8).
           MOVE QSPC-RBDEFER-8 TO SPC-RBDEFER(8).
           MOVE QSPC-RBPCT-8 TO SPC-RBPCT(8).
           MOVE QSPC-RBREDUC-8 TO SPC-RBREDUC(8).
           MOVE QSPC-RBMIN-8 TO SPC-RBMIN(8).
           MOVE QSPC-RBSPOPT1-8 TO SPC-RBSPOPT1(8).
           MOVE QSPC-RBSPOPT2-8 TO SPC-RBSPOPT2(8).
           MOVE QSPC-RBMANAGER-8 TO SPC-RBMANAGER(8).
           MOVE QSPC-RBUNITPER-CD-8 TO SPC-RBUNITPER-CD(8).
           MOVE QSPC-RBFRMLA2-8 TO SPC-RBFRMLA2(8).
           MOVE QSPC-RBFRMLA-9 TO SPC-RBFRMLA(9).
           MOVE QSPC-RBDTE-9-1 TO SPC-RBDTE(9 1).
           MOVE QSPC-RBDAYS-9-1 TO SPC-RBDAYS(9 1).
           MOVE QSPC-RBYRTYPE-9-1 TO SPC-RBYRTYPE(9 1).
           MOVE QSPC-RBDTE-9-2 TO SPC-RBDTE(9 2).
           MOVE QSPC-RBDAYS-9-2 TO SPC-RBDAYS(9 2).
           MOVE QSPC-RBYRTYPE-9-2 TO SPC-RBYRTYPE(9 2).
           MOVE QSPC-RBMINRET-9 TO SPC-RBMINRET(9).
           MOVE QSPC-RBNOMON-9 TO SPC-RBNOMON(9).
           MOVE QSPC-RBDEDCHG-9 TO SPC-RBDEDCHG(9).
           MOVE QSPC-RBRECAST-9 TO SPC-RBRECAST(9).
           MOVE QSPC-RBEARLY-9 TO SPC-RBEARLY(9).
           MOVE QSPC-RBDEFER-9 TO SPC-RBDEFER(9).
           MOVE QSPC-RBPCT-9 TO SPC-RBPCT(9).
           MOVE QSPC-RBREDUC-9 TO SPC-RBREDUC(9).
           MOVE QSPC-RBMIN-9 TO SPC-RBMIN(9).
           MOVE QSPC-RBSPOPT1-9 TO SPC-RBSPOPT1(9).
           MOVE QSPC-RBSPOPT2-9 TO SPC-RBSPOPT2(9).
           MOVE QSPC-RBMANAGER-9 TO SPC-RBMANAGER(9).
           MOVE QSPC-RBUNITPER-CD-9 TO SPC-RBUNITPER-CD(9).
           MOVE QSPC-RBFRMLA2-9 TO SPC-RBFRMLA2(9).
           MOVE QSPC-RBFRMLA-10 TO SPC-RBFRMLA(10).
           MOVE QSPC-RBDTE-10-1 TO SPC-RBDTE(10 1).
           MOVE QSPC-RBDAYS-10-1 TO SPC-RBDAYS(10 1).
           MOVE QSPC-RBYRTYPE-10-1 TO SPC-RBYRTYPE(10 1).
           MOVE QSPC-RBDTE-10-2 TO SPC-RBDTE(10 2).
           MOVE QSPC-RBDAYS-10-2 TO SPC-RBDAYS(10 2).
           MOVE QSPC-RBYRTYPE-10-2 TO SPC-RBYRTYPE(10 2).
           MOVE QSPC-RBMINRET-10 TO SPC-RBMINRET(10).
           MOVE QSPC-RBNOMON-10 TO SPC-RBNOMON(10).
           MOVE QSPC-RBDEDCHG-10 TO SPC-RBDEDCHG(10).
           MOVE QSPC-RBRECAST-10 TO SPC-RBRECAST(10).
           MOVE QSPC-RBEARLY-10 TO SPC-RBEARLY(10).
           MOVE QSPC-RBDEFER-10 TO SPC-RBDEFER(10).
           MOVE QSPC-RBPCT-10 TO SPC-RBPCT(10).
           MOVE QSPC-RBREDUC-10 TO SPC-RBREDUC(10).
           MOVE QSPC-RBMIN-10 TO SPC-RBMIN(10).
           MOVE QSPC-RBSPOPT1-10 TO SPC-RBSPOPT1(10).
           MOVE QSPC-RBSPOPT2-10 TO SPC-RBSPOPT2(10).
           MOVE QSPC-RBMANAGER-10 TO SPC-RBMANAGER(10).
           MOVE QSPC-RBUNITPER-CD-10 TO SPC-RBUNITPER-CD(10).
           MOVE QSPC-RBFRMLA2-10 TO SPC-RBFRMLA2(10).
           MOVE QSPC-RBFRMLA-11 TO SPC-RBFRMLA(11).
           MOVE QSPC-RBDTE-11-1 TO SPC-RBDTE(11 1).
           MOVE QSPC-RBDAYS-11-1 TO SPC-RBDAYS(11 1).
           MOVE QSPC-RBYRTYPE-11-1 TO SPC-RBYRTYPE(11 1).
           MOVE QSPC-RBDTE-11-2 TO SPC-RBDTE(11 2).
           MOVE QSPC-RBDAYS-11-2 TO SPC-RBDAYS(11 2).
           MOVE QSPC-RBYRTYPE-11-2 TO SPC-RBYRTYPE(11 2).
           MOVE QSPC-RBMINRET-11 TO SPC-RBMINRET(11).
           MOVE QSPC-RBNOMON-11 TO SPC-RBNOMON(11).
           MOVE QSPC-RBDEDCHG-11 TO SPC-RBDEDCHG(11).
           MOVE QSPC-RBRECAST-11 TO SPC-RBRECAST(11).
           MOVE QSPC-RBEARLY-11 TO SPC-RBEARLY(11).
           MOVE QSPC-RBDEFER-11 TO SPC-RBDEFER(11).
           MOVE QSPC-RBPCT-11 TO SPC-RBPCT(11).
           MOVE QSPC-RBREDUC-11 TO SPC-RBREDUC(11).
           MOVE QSPC-RBMIN-11 TO SPC-RBMIN(11).
           MOVE QSPC-RBSPOPT1-11 TO SPC-RBSPOPT1(11).
           MOVE QSPC-RBSPOPT2-11 TO SPC-RBSPOPT2(11).
           MOVE QSPC-RBMANAGER-11 TO SPC-RBMANAGER(11).
           MOVE QSPC-RBUNITPER-CD-11 TO SPC-RBUNITPER-CD(11).
           MOVE QSPC-RBFRMLA2-11 TO SPC-RBFRMLA2(11).
           MOVE QSPC-RBFRMLA-12 TO SPC-RBFRMLA(12).
           MOVE QSPC-RBDTE-12-1 TO SPC-RBDTE(12 1).
           MOVE QSPC-RBDAYS-12-1 TO SPC-RBDAYS(12 1).
           MOVE QSPC-RBYRTYPE-12-1 TO SPC-RBYRTYPE(12 1).
           MOVE QSPC-RBDTE-12-2 TO SPC-RBDTE(12 2).
           MOVE QSPC-RBDAYS-12-2 TO SPC-RBDAYS(12 2).
           MOVE QSPC-RBYRTYPE-12-2 TO SPC-RBYRTYPE(12 2).
           MOVE QSPC-RBMINRET-12 TO SPC-RBMINRET(12).
           MOVE QSPC-RBNOMON-12 TO SPC-RBNOMON(12).
           MOVE QSPC-RBDEDCHG-12 TO SPC-RBDEDCHG(12).
           MOVE QSPC-RBRECAST-12 TO SPC-RBRECAST(12).
           MOVE QSPC-RBEARLY-12 TO SPC-RBEARLY(12).
           MOVE QSPC-RBDEFER-12 TO SPC-RBDEFER(12).
           MOVE QSPC-RBPCT-12 TO SPC-RBPCT(12).
           MOVE QSPC-RBREDUC-12 TO SPC-RBREDUC(12).
           MOVE QSPC-RBMIN-12 TO SPC-RBMIN(12).
           MOVE QSPC-RBSPOPT1-12 TO SPC-RBSPOPT1(12).
           MOVE QSPC-RBSPOPT2-12 TO SPC-RBSPOPT2(12).
           MOVE QSPC-RBMANAGER-12 TO SPC-RBMANAGER(12).
           MOVE QSPC-RBUNITPER-CD-12 TO SPC-RBUNITPER-CD(12).
           MOVE QSPC-RBFRMLA2-12 TO SPC-RBFRMLA2(12).
           MOVE QSPC-RBFRMLA-13 TO SPC-RBFRMLA(13).
           MOVE QSPC-RBDTE-13-1 TO SPC-RBDTE(13 1).
           MOVE QSPC-RBDAYS-13-1 TO SPC-RBDAYS(13 1).
           MOVE QSPC-RBYRTYPE-13-1 TO SPC-RBYRTYPE(13 1).
           MOVE QSPC-RBDTE-13-2 TO SPC-RBDTE(13 2).
           MOVE QSPC-RBDAYS-13-2 TO SPC-RBDAYS(13 2).
           MOVE QSPC-RBYRTYPE-13-2 TO SPC-RBYRTYPE(13 2).
           MOVE QSPC-RBMINRET-13 TO SPC-RBMINRET(13).
           MOVE QSPC-RBNOMON-13 TO SPC-RBNOMON(13).
           MOVE QSPC-RBDEDCHG-13 TO SPC-RBDEDCHG(13).
           MOVE QSPC-RBRECAST-13 TO SPC-RBRECAST(13).
           MOVE QSPC-RBEARLY-13 TO SPC-RBEARLY(13).
           MOVE QSPC-RBDEFER-13 TO SPC-RBDEFER(13).
           MOVE QSPC-RBPCT-13 TO SPC-RBPCT(13).
           MOVE QSPC-RBREDUC-13 TO SPC-RBREDUC(13).
           MOVE QSPC-RBMIN-13 TO SPC-RBMIN(13).
           MOVE QSPC-RBSPOPT1-13 TO SPC-RBSPOPT1(13).
           MOVE QSPC-RBSPOPT2-13 TO SPC-RBSPOPT2(13).
           MOVE QSPC-RBMANAGER-13 TO SPC-RBMANAGER(13).
           MOVE QSPC-RBUNITPER-CD-13 TO SPC-RBUNITPER-CD(13).
           MOVE QSPC-RBFRMLA2-13 TO SPC-RBFRMLA2(13).
           MOVE QSPC-RBFRMLA-14 TO SPC-RBFRMLA(14).
           MOVE QSPC-RBDTE-14-1 TO SPC-RBDTE(14 1).
           MOVE QSPC-RBDAYS-14-1 TO SPC-RBDAYS(14 1).
           MOVE QSPC-RBYRTYPE-14-1 TO SPC-RBYRTYPE(14 1).
           MOVE QSPC-RBDTE-14-2 TO SPC-RBDTE(14 2).
           MOVE QSPC-RBDAYS-14-2 TO SPC-RBDAYS(14 2).
           MOVE QSPC-RBYRTYPE-14-2 TO SPC-RBYRTYPE(14 2).
           MOVE QSPC-RBMINRET-14 TO SPC-RBMINRET(14).
           MOVE QSPC-RBNOMON-14 TO SPC-RBNOMON(14).
           MOVE QSPC-RBDEDCHG-14 TO SPC-RBDEDCHG(14).
           MOVE QSPC-RBRECAST-14 TO SPC-RBRECAST(14).
           MOVE QSPC-RBEARLY-14 TO SPC-RBEARLY(14).
           MOVE QSPC-RBDEFER-14 TO SPC-RBDEFER(14).
           MOVE QSPC-RBPCT-14 TO SPC-RBPCT(14).
           MOVE QSPC-RBREDUC-14 TO SPC-RBREDUC(14).
           MOVE QSPC-RBMIN-14 TO SPC-RBMIN(14).
           MOVE QSPC-RBSPOPT1-14 TO SPC-RBSPOPT1(14).
           MOVE QSPC-RBSPOPT2-14 TO SPC-RBSPOPT2(14).
           MOVE QSPC-RBMANAGER-14 TO SPC-RBMANAGER(14).
           MOVE QSPC-RBUNITPER-CD-14 TO SPC-RBUNITPER-CD(14).
           MOVE QSPC-RBFRMLA2-14 TO SPC-RBFRMLA2(14).
           MOVE QSPC-RBFRMLA-15 TO SPC-RBFRMLA(15).
           MOVE QSPC-RBDTE-15-1 TO SPC-RBDTE(15 1).
           MOVE QSPC-RBDAYS-15-1 TO SPC-RBDAYS(15 1).
           MOVE QSPC-RBYRTYPE-15-1 TO SPC-RBYRTYPE(15 1).
           MOVE QSPC-RBDTE-15-2 TO SPC-RBDTE(15 2).
           MOVE QSPC-RBDAYS-15-2 TO SPC-RBDAYS(15 2).
           MOVE QSPC-RBYRTYPE-15-2 TO SPC-RBYRTYPE(15 2).
           MOVE QSPC-RBMINRET-15 TO SPC-RBMINRET(15).
           MOVE QSPC-RBNOMON-15 TO SPC-RBNOMON(15).
           MOVE QSPC-RBDEDCHG-15 TO SPC-RBDEDCHG(15).
           MOVE QSPC-RBRECAST-15 TO SPC-RBRECAST(15).
           MOVE QSPC-RBEARLY-15 TO SPC-RBEARLY(15).
           MOVE QSPC-RBDEFER-15 TO SPC-RBDEFER(15).
           MOVE QSPC-RBPCT-15 TO SPC-RBPCT(15).
           MOVE QSPC-RBREDUC-15 TO SPC-RBREDUC(15).
           MOVE QSPC-RBMIN-15 TO SPC-RBMIN(15).
           MOVE QSPC-RBSPOPT1-15 TO SPC-RBSPOPT1(15).
           MOVE QSPC-RBSPOPT2-15 TO SPC-RBSPOPT2(15).
           MOVE QSPC-RBMANAGER-15 TO SPC-RBMANAGER(15).
           MOVE QSPC-RBUNITPER-CD-15 TO SPC-RBUNITPER-CD(15).
           MOVE QSPC-RBFRMLA2-15 TO SPC-RBFRMLA2(15).
           MOVE QSPC-RBFRMLA-16 TO SPC-RBFRMLA(16).
           MOVE QSPC-RBDTE-16-1 TO SPC-RBDTE(16 1).
           MOVE QSPC-RBDAYS-16-1 TO SPC-RBDAYS(16 1).
           MOVE QSPC-RBYRTYPE-16-1 TO SPC-RBYRTYPE(16 1).
           MOVE QSPC-RBDTE-16-2 TO SPC-RBDTE(16 2).
           MOVE QSPC-RBDAYS-16-2 TO SPC-RBDAYS(16 2).
           MOVE QSPC-RBYRTYPE-16-2 TO SPC-RBYRTYPE(16 2).
           MOVE QSPC-RBMINRET-16 TO SPC-RBMINRET(16).
           MOVE QSPC-RBNOMON-16 TO SPC-RBNOMON(16).
           MOVE QSPC-RBDEDCHG-16 TO SPC-RBDEDCHG(16).
           MOVE QSPC-RBRECAST-16 TO SPC-RBRECAST(16).
           MOVE QSPC-RBEARLY-16 TO SPC-RBEARLY(16).
           MOVE QSPC-RBDEFER-16 TO SPC-RBDEFER(16).
           MOVE QSPC-RBPCT-16 TO SPC-RBPCT(16).
           MOVE QSPC-RBREDUC-16 TO SPC-RBREDUC(16).
           MOVE QSPC-RBMIN-16 TO SPC-RBMIN(16).
           MOVE QSPC-RBSPOPT1-16 TO SPC-RBSPOPT1(16).
           MOVE QSPC-RBSPOPT2-16 TO SPC-RBSPOPT2(16).
           MOVE QSPC-RBMANAGER-16 TO SPC-RBMANAGER(16).
           MOVE QSPC-RBUNITPER-CD-16 TO SPC-RBUNITPER-CD(16).
           MOVE QSPC-RBFRMLA2-16 TO SPC-RBFRMLA2(16).
           MOVE QSPC-RBFRMLA-17 TO SPC-RBFRMLA(17).
           MOVE QSPC-RBDTE-17-1 TO SPC-RBDTE(17 1).
           MOVE QSPC-RBDAYS-17-1 TO SPC-RBDAYS(17 1).
           MOVE QSPC-RBYRTYPE-17-1 TO SPC-RBYRTYPE(17 1).
           MOVE QSPC-RBDTE-17-2 TO SPC-RBDTE(17 2).
           MOVE QSPC-RBDAYS-17-2 TO SPC-RBDAYS(17 2).
           MOVE QSPC-RBYRTYPE-17-2 TO SPC-RBYRTYPE(17 2).
           MOVE QSPC-RBMINRET-17 TO SPC-RBMINRET(17).
           MOVE QSPC-RBNOMON-17 TO SPC-RBNOMON(17).
           MOVE QSPC-RBDEDCHG-17 TO SPC-RBDEDCHG(17).
           MOVE QSPC-RBRECAST-17 TO SPC-RBRECAST(17).
           MOVE QSPC-RBEARLY-17 TO SPC-RBEARLY(17).
           MOVE QSPC-RBDEFER-17 TO SPC-RBDEFER(17).
           MOVE QSPC-RBPCT-17 TO SPC-RBPCT(17).
           MOVE QSPC-RBREDUC-17 TO SPC-RBREDUC(17).
           MOVE QSPC-RBMIN-17 TO SPC-RBMIN(17).
           MOVE QSPC-RBSPOPT1-17 TO SPC-RBSPOPT1(17).
           MOVE QSPC-RBSPOPT2-17 TO SPC-RBSPOPT2(17).
           MOVE QSPC-RBMANAGER-17 TO SPC-RBMANAGER(17).
           MOVE QSPC-RBUNITPER-CD-17 TO SPC-RBUNITPER-CD(17).
           MOVE QSPC-RBFRMLA2-17 TO SPC-RBFRMLA2(17).
           MOVE QSPC-RBFRMLA-18 TO SPC-RBFRMLA(18).
           MOVE QSPC-RBDTE-18-1 TO SPC-RBDTE(18 1).
           MOVE QSPC-RBDAYS-18-1 TO SPC-RBDAYS(18 1).
           MOVE QSPC-RBYRTYPE-18-1 TO SPC-RBYRTYPE(18 1).
           MOVE QSPC-RBDTE-18-2 TO SPC-RBDTE(18 2).
           MOVE QSPC-RBDAYS-18-2 TO SPC-RBDAYS(18 2).
           MOVE QSPC-RBYRTYPE-18-2 TO SPC-RBYRTYPE(18 2).
           MOVE QSPC-RBMINRET-18 TO SPC-RBMINRET(18).
           MOVE QSPC-RBNOMON-18 TO SPC-RBNOMON(18).
           MOVE QSPC-RBDEDCHG-18 TO SPC-RBDEDCHG(18).
           MOVE QSPC-RBRECAST-18 TO SPC-RBRECAST(18).
           MOVE QSPC-RBEARLY-18 TO SPC-RBEARLY(18).
           MOVE QSPC-RBDEFER-18 TO SPC-RBDEFER(18).
           MOVE QSPC-RBPCT-18 TO SPC-RBPCT(18).
           MOVE QSPC-RBREDUC-18 TO SPC-RBREDUC(18).
           MOVE QSPC-RBMIN-18 TO SPC-RBMIN(18).
           MOVE QSPC-RBSPOPT1-18 TO SPC-RBSPOPT1(18).
           MOVE QSPC-RBSPOPT2-18 TO SPC-RBSPOPT2(18).
           MOVE QSPC-RBMANAGER-18 TO SPC-RBMANAGER(18).
           MOVE QSPC-RBUNITPER-CD-18 TO SPC-RBUNITPER-CD(18).
           MOVE QSPC-RBFRMLA2-18 TO SPC-RBFRMLA2(18).
           MOVE QSPC-RBFRMLA-19 TO SPC-RBFRMLA(19).
           MOVE QSPC-RBDTE-19-1 TO SPC-RBDTE(19 1).
           MOVE QSPC-RBDAYS-19-1 TO SPC-RBDAYS(19 1).
           MOVE QSPC-RBYRTYPE-19-1 TO SPC-RBYRTYPE(19 1).
           MOVE QSPC-RBDTE-19-2 TO SPC-RBDTE(19 2).
           MOVE QSPC-RBDAYS-19-2 TO SPC-RBDAYS(19 2).
           MOVE QSPC-RBYRTYPE-19-2 TO SPC-RBYRTYPE(19 2).
           MOVE QSPC-RBMINRET-19 TO SPC-RBMINRET(19).
           MOVE QSPC-RBNOMON-19 TO SPC-RBNOMON(19).
           MOVE QSPC-RBDEDCHG-19 TO SPC-RBDEDCHG(19).
           MOVE QSPC-RBRECAST-19 TO SPC-RBRECAST(19).
           MOVE QSPC-RBEARLY-19 TO SPC-RBEARLY(19).
           MOVE QSPC-RBDEFER-19 TO SPC-RBDEFER(19).
           MOVE QSPC-RBPCT-19 TO SPC-RBPCT(19).
           MOVE QSPC-RBREDUC-19 TO SPC-RBREDUC(19).
           MOVE QSPC-RBMIN-19 TO SPC-RBMIN(19).
           MOVE QSPC-RBSPOPT1-19 TO SPC-RBSPOPT1(19).
           MOVE QSPC-RBSPOPT2-19 TO SPC-RBSPOPT2(19).
           MOVE QSPC-RBMANAGER-19 TO SPC-RBMANAGER(19).
           MOVE QSPC-RBUNITPER-CD-19 TO SPC-RBUNITPER-CD(19).
           MOVE QSPC-RBFRMLA2-19 TO SPC-RBFRMLA2(19).
           MOVE QSPC-RBFRMLA-20 TO SPC-RBFRMLA(20).
           MOVE QSPC-RBDTE-20-1 TO SPC-RBDTE(20 1).
           MOVE QSPC-RBDAYS-20-1 TO SPC-RBDAYS(20 1).
           MOVE QSPC-RBYRTYPE-20-1 TO SPC-RBYRTYPE(20 1).
           MOVE QSPC-RBDTE-20-2 TO SPC-RBDTE(20 2).
           MOVE QSPC-RBDAYS-20-2 TO SPC-RBDAYS(20 2).
           MOVE QSPC-RBYRTYPE-20-2 TO SPC-RBYRTYPE(20 2).
           MOVE QSPC-RBMINRET-20 TO SPC-RBMINRET(20).
           MOVE QSPC-RBNOMON-20 TO SPC-RBNOMON(20).
           MOVE QSPC-RBDEDCHG-20 TO SPC-RBDEDCHG(20).
           MOVE QSPC-RBRECAST-20 TO SPC-RBRECAST(20).
           MOVE QSPC-RBEARLY-20 TO SPC-RBEARLY(20).
           MOVE QSPC-RBDEFER-20 TO SPC-RBDEFER(20).
           MOVE QSPC-RBPCT-20 TO SPC-RBPCT(20).
           MOVE QSPC-RBREDUC-20 TO SPC-RBREDUC(20).
           MOVE QSPC-RBMIN-20 TO SPC-RBMIN(20).
           MOVE QSPC-RBSPOPT1-20 TO SPC-RBSPOPT1(20).
           MOVE QSPC-RBSPOPT2-20 TO SPC-RBSPOPT2(20).
           MOVE QSPC-RBMANAGER-20 TO SPC-RBMANAGER(20).
           MOVE QSPC-RBUNITPER-CD-20 TO SPC-RBUNITPER-CD(20).
           MOVE QSPC-RBFRMLA2-20 TO SPC-RBFRMLA2(20).
           MOVE QSPC-RBFRMLA-21 TO SPC-RBFRMLA(21).
           MOVE QSPC-RBDTE-21-1 TO SPC-RBDTE(21 1).
           MOVE QSPC-RBDAYS-21-1 TO SPC-RBDAYS(21 1).
           MOVE QSPC-RBYRTYPE-21-1 TO SPC-RBYRTYPE(21 1).
           MOVE QSPC-RBDTE-21-2 TO SPC-RBDTE(21 2).
           MOVE QSPC-RBDAYS-21-2 TO SPC-RBDAYS(21 2).
           MOVE QSPC-RBYRTYPE-21-2 TO SPC-RBYRTYPE(21 2).
           MOVE QSPC-RBMINRET-21 TO SPC-RBMINRET(21).
           MOVE QSPC-RBNOMON-21 TO SPC-RBNOMON(21).
           MOVE QSPC-RBDEDCHG-21 TO SPC-RBDEDCHG(21).
           MOVE QSPC-RBRECAST-21 TO SPC-RBRECAST(21).
           MOVE QSPC-RBEARLY-21 TO SPC-RBEARLY(21).
           MOVE QSPC-RBDEFER-21 TO SPC-RBDEFER(21).
           MOVE QSPC-RBPCT-21 TO SPC-RBPCT(21).
           MOVE QSPC-RBREDUC-21 TO SPC-RBREDUC(21).
           MOVE QSPC-RBMIN-21 TO SPC-RBMIN(21).
           MOVE QSPC-RBSPOPT1-21 TO SPC-RBSPOPT1(21).
           MOVE QSPC-RBSPOPT2-21 TO SPC-RBSPOPT2(21).
           MOVE QSPC-RBMANAGER-21 TO SPC-RBMANAGER(21).
           MOVE QSPC-RBUNITPER-CD-21 TO SPC-RBUNITPER-CD(21).
           MOVE QSPC-RBFRMLA2-21 TO SPC-RBFRMLA2(21).
           MOVE QSPC-RBFRMLA-22 TO SPC-RBFRMLA(22).
           MOVE QSPC-RBDTE-22-1 TO SPC-RBDTE(22 1).
           MOVE QSPC-RBDAYS-22-1 TO SPC-RBDAYS(22 1).
           MOVE QSPC-RBYRTYPE-22-1 TO SPC-RBYRTYPE(22 1).
           MOVE QSPC-RBDTE-22-2 TO SPC-RBDTE(22 2).
           MOVE QSPC-RBDAYS-22-2 TO SPC-RBDAYS(22 2).
           MOVE QSPC-RBYRTYPE-22-2 TO SPC-RBYRTYPE(22 2).
           MOVE QSPC-RBMINRET-22 TO SPC-RBMINRET(22).
           MOVE QSPC-RBNOMON-22 TO SPC-RBNOMON(22).
           MOVE QSPC-RBDEDCHG-22 TO SPC-RBDEDCHG(22).
           MOVE QSPC-RBRECAST-22 TO SPC-RBRECAST(22).
           MOVE QSPC-RBEARLY-22 TO SPC-RBEARLY(22).
           MOVE QSPC-RBDEFER-22 TO SPC-RBDEFER(22).
           MOVE QSPC-RBPCT-22 TO SPC-RBPCT(22).
           MOVE QSPC-RBREDUC-22 TO SPC-RBREDUC(22).
           MOVE QSPC-RBMIN-22 TO SPC-RBMIN(22).
           MOVE QSPC-RBSPOPT1-22 TO SPC-RBSPOPT1(22).
           MOVE QSPC-RBSPOPT2-22 TO SPC-RBSPOPT2(22).
           MOVE QSPC-RBMANAGER-22 TO SPC-RBMANAGER(22).
           MOVE QSPC-RBUNITPER-CD-22 TO SPC-RBUNITPER-CD(22).
           MOVE QSPC-RBFRMLA2-22 TO SPC-RBFRMLA2(22).
           MOVE QSPC-RBCOMCD TO SPC-RBCOMCD.
           MOVE QSPC-ADDON-DISFRMLA TO SPC-ADDON-DISFRMLA.
           MOVE QSPC-ADDON-WHOLE-FG TO SPC-ADDON-WHOLE-FG.
           MOVE QSPC-ADDON-ORG-MATURITY TO SPC-ADDON-ORG-MATURITY.
           MOVE QSPC-CONSOLIDATE-RT-FG TO SPC-CONSOLIDATE-RT-FG.
           MOVE QSPC-1STPY-ADDON-DAYS TO SPC-1STPY-ADDON-DAYS.
           MOVE QSPC-1STPY-ADDON-YRTYPE TO SPC-1STPY-ADDON-YRTYPE.
           MOVE QSPC-ADDON-RATE-FG TO SPC-ADDON-RATE-FG.
           MOVE QSPC-ADDON-RATE TO SPC-ADDON-RATE.
           MOVE QSPC-FEEFRMLA-1 TO SPC-FEEFRMLA(1).
           MOVE QSPC-FEECD-1 TO SPC-FEECD(1).
           MOVE QSPC-FEEID-1 TO SPC-FEEID(1).
           MOVE QSPC-FEEFRMLA-2 TO SPC-FEEFRMLA(2).
           MOVE QSPC-FEECD-2 TO SPC-FEECD(2).
           MOVE QSPC-FEEID-2 TO SPC-FEEID(2).
           MOVE QSPC-ROUND-PAY-FG TO SPC-ROUND-PAY-FG.
           MOVE QSPC-IRREGULAR-PAY-FG TO SPC-IRREGULAR-PAY-FG.
           MOVE QSPC-DLRVCHGS-RB-CD-1 TO SPC-DLRVCHGS-RB-CD(1).
           MOVE QSPC-DLRVCHGS-RB-CD-2 TO SPC-DLRVCHGS-RB-CD(2).
           MOVE QSPC-DLRVCHGS-RB-CD-3 TO SPC-DLRVCHGS-RB-CD(3).
           MOVE QSPC-PARVHELD-RB-CD TO SPC-PARVHELD-RB-CD.
           MOVE QSPC-PARVPAID-RB-CD TO SPC-PARVPAID-RB-CD.
           MOVE QSPC-CONTR-CREDIT TO SPC-CONTR-CREDIT.
           MOVE QSPC-CONTR-CREDIT-CD TO SPC-CONTR-CREDIT-CD.
           MOVE QSPC-CONTR-CREDIT-MIN-DEL-PER
              TO SPC-CONTR-CREDIT-MIN-DEL-PER.
           MOVE QSPC-OPT-CAL-CHGABLE TO SPC-OPT-CAL-CHGABLE.
           MOVE QSPC-PBDEL-DAYS TO SPC-PBDEL-DAYS.
           MOVE QSPC-PBINCR-PERCENT TO SPC-PBINCR-PERCENT.
           MOVE QSPC-CPOT30-CD TO SPC-CPOT30-CD.
           MOVE QSPC-CPOTCHGOFF-CD TO SPC-CPOTCHGOFF-CD.
           MOVE QSPC-RDPOT30-CD TO SPC-RDPOT30-CD.
           MOVE QSPC-RDPOTCHGOFF-CD TO SPC-RDPOTCHGOFF-CD.
           MOVE QSPC-MAX-ALLOW-DELINQ TO SPC-MAX-ALLOW-DELINQ.
           MOVE QSPC-RESCIND-BUS-DAYS TO SPC-RESCIND-BUS-DAYS.
           MOVE QSPC-RESCIND-SATURDAY TO SPC-RESCIND-SATURDAY.
           MOVE QSPC-MIN-CREDIT-SCORE TO SPC-MIN-CREDIT-SCORE.
           MOVE QSPC-DUAL-IN-BRANCH TO SPC-DUAL-IN-BRANCH.
           MOVE QSPC-DUAL-IN-STATE TO SPC-DUAL-IN-STATE.
           MOVE QSPC-PACESETTER-FG TO SPC-PACESETTER-FG.
           MOVE QSPC-WAGE-ASSIGN-DAYS TO SPC-WAGE-ASSIGN-DAYS.
           MOVE QSPC-CAL-PAYMENT-ROUND-FG TO SPC-CAL-PAYMENT-ROUND-FG.
           MOVE QSPC-CAN-LOANS-FG TO SPC-CAN-LOANS-FG.
           MOVE QSPC-ALLOW-DELINQ-POLCD TO SPC-ALLOW-DELINQ-POLCD.
           MOVE QSPC-YTD-MAX-ALLOW-DELINQ TO SPC-YTD-MAX-ALLOW-DELINQ.
           MOVE QSPC-LNCOST-FRMLA TO SPC-LNCOST-FRMLA.
           MOVE QSPC-LNCOST-AMT TO SPC-LNCOST-AMT.
           MOVE QSPC-DLDISC-RVPRIN1-PCNT TO SPC-DLDISC-RVPRIN1-PCNT.
           MOVE QSPC-RENEWABLE-PAYS TO SPC-RENEWABLE-PAYS.
           MOVE QSPC-RENEWABLE-DAYS TO SPC-RENEWABLE-DAYS.
           MOVE QSPC-ALLOW-LN-BACK-DATE TO SPC-ALLOW-LN-BACK-DATE.
           MOVE QSPC-DLDISC-RVPRIN1-AF-PCNT
              TO SPC-DLDISC-RVPRIN1-AF-PCNT.
           MOVE QSPC-CAL-MAX-AT-ESTIMATE TO SPC-CAL-MAX-AT-ESTIMATE.
           MOVE QSPC-INSAH-RETRO TO SPC-INSAH-RETRO.
           MOVE QSPC-INSAH-DAYS-WAIT TO SPC-INSAH-DAYS-WAIT.
           MOVE QSPC-ADDON-EXCEPT-FG TO SPC-ADDON-EXCEPT-FG.
           MOVE QSPC-REPO-TRCD-1 TO SPC-REPO-TRCD(1).
           MOVE QSPC-REPO-FMNO-1-1 TO SPC-REPO-FMNO(1 1).
           MOVE QSPC-REPO-FMNO-1-2 TO SPC-REPO-FMNO(1 2).
           MOVE QSPC-REPO-FMNO-1-3 TO SPC-REPO-FMNO(1 3).
           MOVE QSPC-REPO-FMNO-1-4 TO SPC-REPO-FMNO(1 4).
           MOVE QSPC-REPO-TRCD-2 TO SPC-REPO-TRCD(2).
           MOVE QSPC-REPO-FMNO-2-1 TO SPC-REPO-FMNO(2 1).
           MOVE QSPC-REPO-FMNO-2-2 TO SPC-REPO-FMNO(2 2).
           MOVE QSPC-REPO-FMNO-2-3 TO SPC-REPO-FMNO(2 3).
           MOVE QSPC-REPO-FMNO-2-4 TO SPC-REPO-FMNO(2 4).
           MOVE QSPC-REPO-TRCD-3 TO SPC-REPO-TRCD(3).
           MOVE QSPC-REPO-FMNO-3-1 TO SPC-REPO-FMNO(3 1).
           MOVE QSPC-REPO-FMNO-3-2 TO SPC-REPO-FMNO(3 2).
           MOVE QSPC-REPO-FMNO-3-3 TO SPC-REPO-FMNO(3 3).
           MOVE QSPC-REPO-FMNO-3-4 TO SPC-REPO-FMNO(3 4).
           MOVE QSPC-CANCEL-ADDON-FG TO SPC-CANCEL-ADDON-FG.
           MOVE QSPC-DEFAULT-O2-INS-COMP TO SPC-DEFAULT-O2-INS-COMP.
           MOVE QSPC-LC-ON-JUDGEMENTS TO SPC-LC-ON-JUDGEMENTS.
           MOVE QSPC-DELQ-IB-AGE TO SPC-DELQ-IB-AGE.
           MOVE QSPC-DELQ-IB-MAX-DAYS TO SPC-DELQ-IB-MAX-DAYS.
           MOVE QSPC-INSURANCE-WRITTEN TO SPC-INSURANCE-WRITTEN.
           MOVE QSPC-INTERIM-COUPON TO SPC-INTERIM-COUPON.
           MOVE QSPC-AUTO-ASSESS-LCHG TO SPC-AUTO-ASSESS-LCHG.
           MOVE QSPC-MAX-CASH-PROCEEDS TO SPC-MAX-CASH-PROCEEDS.
           MOVE QSPC-ALLOW-ZERO-PROC TO SPC-ALLOW-ZERO-PROC.
           MOVE QSPC-BANKRULE-RATE TO SPC-BANKRULE-RATE.
           MOVE QSPC-AUTO-SEND-TRCD-1 TO SPC-AUTO-SEND-TRCD(1).
           MOVE QSPC-AUTO-SEND-FMNO-1-1 TO SPC-AUTO-SEND-FMNO(1 1).
           MOVE QSPC-AUTO-SEND-FMNO-1-2 TO SPC-AUTO-SEND-FMNO(1 2).
           MOVE QSPC-AUTO-SEND-FMNO-1-3 TO SPC-AUTO-SEND-FMNO(1 3).
           MOVE QSPC-AUTO-SEND-FMNO-1-4 TO SPC-AUTO-SEND-FMNO(1 4).
           MOVE QSPC-AUTO-SEND-TRCD-2 TO SPC-AUTO-SEND-TRCD(2).
           MOVE QSPC-AUTO-SEND-FMNO-2-1 TO SPC-AUTO-SEND-FMNO(2 1).
           MOVE QSPC-AUTO-SEND-FMNO-2-2 TO SPC-AUTO-SEND-FMNO(2 2).
           MOVE QSPC-AUTO-SEND-FMNO-2-3 TO SPC-AUTO-SEND-FMNO(2 3).
           MOVE QSPC-AUTO-SEND-FMNO-2-4 TO SPC-AUTO-SEND-FMNO(2 4).
           MOVE QSPC-DLDISC-CONV-BF-PCNT TO SPC-DLDISC-CONV-BF-PCNT.
           MOVE QSPC-UNITPER-CD TO SPC-UNITPER-CD.
           MOVE QSPC-RENEWAL-EDIT TO SPC-RENEWAL-EDIT.
           MOVE QSPC-ROUND-MFEE TO SPC-ROUND-MFEE.
           MOVE QSPC-ADV-TO-1ST-NO-CORR TO SPC-ADV-TO-1ST-NO-CORR.
           MOVE QSPC-LC-INT-ON-REPO-NON-PL
              TO SPC-LC-INT-ON-REPO-NON-PL.
           MOVE QSPC-CONTRACTUAL-SET-NONACCRUAL
              TO SPC-CONTRACTUAL-SET-NONACCRUAL.
           MOVE QSPC-CONTRACTUAL-RESET-ACCRUAL
              TO SPC-CONTRACTUAL-RESET-ACCRUAL.
           MOVE QSPC-MONTHS-PAY-NAPP-COUNTER
              TO SPC-MONTHS-PAY-NAPP-COUNTER.
           MOVE QSPC-SHORT-PAY-THRESHOLD TO SPC-SHORT-PAY-THRESHOLD.
           MOVE QSPC-CASH-AVAIL-PERCENT TO SPC-CASH-AVAIL-PERCENT.
           MOVE QSPC-O1-JOINT-FG TO SPC-O1-JOINT-FG.
           MOVE QSPC-NET-BAL-REQ TO SPC-NET-BAL-REQ.
           MOVE QSPC-AMT-PROCEEDS-REQ TO SPC-AMT-PROCEEDS-REQ.
           MOVE QSPC-ALT-PREPAY-MONTHS TO SPC-ALT-PREPAY-MONTHS.
           MOVE QSPC-PERCENT-REGPAY-AVAIL TO SPC-PERCENT-REGPAY-AVAIL.
           MOVE QSPC-ALT-DEFFRMLA TO SPC-ALT-DEFFRMLA.
           MOVE QSPC-ALT-DEFMIN TO SPC-ALT-DEFMIN.
           MOVE QSPC-ALT-DEFMAX TO SPC-ALT-DEFMAX.
           MOVE QSPC-NON-LOAN-FLAG TO SPC-NON-LOAN-FLAG.
           MOVE QSPC-SKIP-TRW TO SPC-SKIP-TRW.
 
      *-----------------------------------------------------------------
      *    LOAD QSPC-REC FROM SPC-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-SPC-FIELDS.
           MOVE SPC-ORGST TO QSPC-ORGST.
           MOVE SPC-SPRCLASS TO QSPC-SPRCLASS.
           MOVE SPC-SUBCLASS TO QSPC-SUBCLASS.
           MOVE SPC-LAWCODE TO QSPC-LAWCODE.
           MOVE SPC-INSEARN-ORDER(1) TO QSPC-INSEARN-ORDER-1.
           MOVE SPC-INSEARN-ORDER(2) TO QSPC-INSEARN-ORDER-2.
           MOVE SPC-INSEARN-ORDER(3) TO QSPC-INSEARN-ORDER-3.
           MOVE SPC-INSEARN-ORDER(4) TO QSPC-INSEARN-ORDER-4.
           MOVE SPC-INSEARN-ORDER(5) TO QSPC-INSEARN-ORDER-5.
           MOVE SPC-INSEARN-ORDER(6) TO QSPC-INSEARN-ORDER-6.
           MOVE SPC-INSEARN-ORDER(7) TO QSPC-INSEARN-ORDER-7.
           MOVE SPC-INSEARN-ORDER(8) TO QSPC-INSEARN-ORDER-8.
           MOVE SPC-INSEARN-ORDER(9) TO QSPC-INSEARN-ORDER-9.
           MOVE SPC-INSEARN-ORDER(10) TO QSPC-INSEARN-ORDER-10.
           MOVE SPC-INSEARN-ORDER(11) TO QSPC-INSEARN-ORDER-11.
           MOVE SPC-INSEARN-ORDER(12) TO QSPC-INSEARN-ORDER-12.
           MOVE SPC-INSAH-JOINT-FG TO QSPC-INSAH-JOINT-FG.
           MOVE SPC-INS-O1-EDIT TO QSPC-INS-O1-EDIT.
           MOVE SPC-INS-O2-EDIT TO QSPC-INS-O2-EDIT.
           MOVE SPC-RBFRMLA(1) TO QSPC-RBFRMLA-1.
           MOVE SPC-RBDTE(1 1) TO QSPC-RBDTE-1-1.
           MOVE SPC-RBDAYS(1 1) TO QSPC-RBDAYS-1-1.
           MOVE SPC-RBYRTYPE(1 1) TO QSPC-RBYRTYPE-1-1.
           MOVE SPC-RBDTE(1 2) TO QSPC-RBDTE-1-2.
           MOVE SPC-RBDAYS(1 2) TO QSPC-RBDAYS-1-2.
           MOVE SPC-RBYRTYPE(1 2) TO QSPC-RBYRTYPE-1-2.
           MOVE SPC-RBMINRET(1) TO QSPC-RBMINRET-1.
           MOVE SPC-RBNOMON(1) TO QSPC-RBNOMON-1.
           MOVE SPC-RBDEDCHG(1) TO QSPC-RBDEDCHG-1.
           MOVE SPC-RBRECAST(1) TO QSPC-RBRECAST-1.
           MOVE SPC-RBEARLY(1) TO QSPC-RBEARLY-1.
           MOVE SPC-RBDEFER(1) TO QSPC-RBDEFER-1.
           MOVE SPC-RBPCT(1) TO QSPC-RBPCT-1.
           MOVE SPC-RBREDUC(1) TO QSPC-RBREDUC-1.
           MOVE SPC-RBMIN(1) TO QSPC-RBMIN-1.
           MOVE SPC-RBSPOPT1(1) TO QSPC-RBSPOPT1-1.
           MOVE SPC-RBSPOPT2(1) TO QSPC-RBSPOPT2-1.
           MOVE SPC-RBMANAGER(1) TO QSPC-RBMANAGER-1.
           MOVE SPC-RBUNITPER-CD(1) TO QSPC-RBUNITPER-CD-1.
           MOVE SPC-RBFRMLA2(1) TO QSPC-RBFRMLA2-1.
           MOVE SPC-RBFRMLA(2) TO QSPC-RBFRMLA-2.
           MOVE SPC-RBDTE(2 1) TO QSPC-RBDTE-2-1.
           MOVE SPC-RBDAYS(2 1) TO QSPC-RBDAYS-2-1.
           MOVE SPC-RBYRTYPE(2 1) TO QSPC-RBYRTYPE-2-1.
           MOVE SPC-RBDTE(2 2) TO QSPC-RBDTE-2-2.
           MOVE SPC-RBDAYS(2 2) TO QSPC-RBDAYS-2-2.
           MOVE SPC-RBYRTYPE(2 2) TO QSPC-RBYRTYPE-2-2.
           MOVE SPC-RBMINRET(2) TO QSPC-RBMINRET-2.
           MOVE SPC-RBNOMON(2) TO QSPC-RBNOMON-2.
           MOVE SPC-RBDEDCHG(2) TO QSPC-RBDEDCHG-2.
           MOVE SPC-RBRECAST(2) TO QSPC-RBRECAST-2.
           MOVE SPC-RBEARLY(2) TO QSPC-RBEARLY-2.
           MOVE SPC-RBDEFER(2) TO QSPC-RBDEFER-2.
           MOVE SPC-RBPCT(2) TO QSPC-RBPCT-2.
           MOVE SPC-RBREDUC(2) TO QSPC-RBREDUC-2.
           MOVE SPC-RBMIN(2) TO QSPC-RBMIN-2.
           MOVE SPC-RBSPOPT1(2) TO QSPC-RBSPOPT1-2.
           MOVE SPC-RBSPOPT2(2) TO QSPC-RBSPOPT2-2.
           MOVE SPC-RBMANAGER(2) TO QSPC-RBMANAGER-2.
           MOVE SPC-RBUNITPER-CD(2) TO QSPC-RBUNITPER-CD-2.
           MOVE SPC-RBFRMLA2(2) TO QSPC-RBFRMLA2-2.
           MOVE SPC-RBFRMLA(3) TO QSPC-RBFRMLA-3.
           MOVE SPC-RBDTE(3 1) TO QSPC-RBDTE-3-1.
           MOVE SPC-RBDAYS(3 1) TO QSPC-RBDAYS-3-1.
           MOVE SPC-RBYRTYPE(3 1) TO QSPC-RBYRTYPE-3-1.
           MOVE SPC-RBDTE(3 2) TO QSPC-RBDTE-3-2.
           MOVE SPC-RBDAYS(3 2) TO QSPC-RBDAYS-3-2.
           MOVE SPC-RBYRTYPE(3 2) TO QSPC-RBYRTYPE-3-2.
           MOVE SPC-RBMINRET(3) TO QSPC-RBMINRET-3.
           MOVE SPC-RBNOMON(3) TO QSPC-RBNOMON-3.
           MOVE SPC-RBDEDCHG(3) TO QSPC-RBDEDCHG-3.
           MOVE SPC-RBRECAST(3) TO QSPC-RBRECAST-3.
           MOVE SPC-RBEARLY(3) TO QSPC-RBEARLY-3.
           MOVE SPC-RBDEFER(3) TO QSPC-RBDEFER-3.
           MOVE SPC-RBPCT(3) TO QSPC-RBPCT-3.
           MOVE SPC-RBREDUC(3) TO QSPC-RBREDUC-3.
           MOVE SPC-RBMIN(3) TO QSPC-RBMIN-3.
           MOVE SPC-RBSPOPT1(3) TO QSPC-RBSPOPT1-3.
           MOVE SPC-RBSPOPT2(3) TO QSPC-RBSPOPT2-3.
           MOVE SPC-RBMANAGER(3) TO QSPC-RBMANAGER-3.
           MOVE SPC-RBUNITPER-CD(3) TO QSPC-RBUNITPER-CD-3.
           MOVE SPC-RBFRMLA2(3) TO QSPC-RBFRMLA2-3.
           MOVE SPC-RBFRMLA(4) TO QSPC-RBFRMLA-4.
           MOVE SPC-RBDTE(4 1) TO QSPC-RBDTE-4-1.
           MOVE SPC-RBDAYS(4 1) TO QSPC-RBDAYS-4-1.
           MOVE SPC-RBYRTYPE(4 1) TO QSPC-RBYRTYPE-4-1.
           MOVE SPC-RBDTE(4 2) TO QSPC-RBDTE-4-2.
           MOVE SPC-RBDAYS(4 2) TO QSPC-RBDAYS-4-2.
           MOVE SPC-RBYRTYPE(4 2) TO QSPC-RBYRTYPE-4-2.
           MOVE SPC-RBMINRET(4) TO QSPC-RBMINRET-4.
           MOVE SPC-RBNOMON(4) TO QSPC-RBNOMON-4.
           MOVE SPC-RBDEDCHG(4) TO QSPC-RBDEDCHG-4.
           MOVE SPC-RBRECAST(4) TO QSPC-RBRECAST-4.
           MOVE SPC-RBEARLY(4) TO QSPC-RBEARLY-4.
           MOVE SPC-RBDEFER(4) TO QSPC-RBDEFER-4.
           MOVE SPC-RBPCT(4) TO QSPC-RBPCT-4.
           MOVE SPC-RBREDUC(4) TO QSPC-RBREDUC-4.
           MOVE SPC-RBMIN(4) TO QSPC-RBMIN-4.
           MOVE SPC-RBSPOPT1(4) TO QSPC-RBSPOPT1-4.
           MOVE SPC-RBSPOPT2(4) TO QSPC-RBSPOPT2-4.
           MOVE SPC-RBMANAGER(4) TO QSPC-RBMANAGER-4.
           MOVE SPC-RBUNITPER-CD(4) TO QSPC-RBUNITPER-CD-4.
           MOVE SPC-RBFRMLA2(4) TO QSPC-RBFRMLA2-4.
           MOVE SPC-RBFRMLA(5) TO QSPC-RBFRMLA-5.
           MOVE SPC-RBDTE(5 1) TO QSPC-RBDTE-5-1.
           MOVE SPC-RBDAYS(5 1) TO QSPC-RBDAYS-5-1.
           MOVE SPC-RBYRTYPE(5 1) TO QSPC-RBYRTYPE-5-1.
           MOVE SPC-RBDTE(5 2) TO QSPC-RBDTE-5-2.
           MOVE SPC-RBDAYS(5 2) TO QSPC-RBDAYS-5-2.
           MOVE SPC-RBYRTYPE(5 2) TO QSPC-RBYRTYPE-5-2.
           MOVE SPC-RBMINRET(5) TO QSPC-RBMINRET-5.
           MOVE SPC-RBNOMON(5) TO QSPC-RBNOMON-5.
           MOVE SPC-RBDEDCHG(5) TO QSPC-RBDEDCHG-5.
           MOVE SPC-RBRECAST(5) TO QSPC-RBRECAST-5.
           MOVE SPC-RBEARLY(5) TO QSPC-RBEARLY-5.
           MOVE SPC-RBDEFER(5) TO QSPC-RBDEFER-5.
           MOVE SPC-RBPCT(5) TO QSPC-RBPCT-5.
           MOVE SPC-RBREDUC(5) TO QSPC-RBREDUC-5.
           MOVE SPC-RBMIN(5) TO QSPC-RBMIN-5.
           MOVE SPC-RBSPOPT1(5) TO QSPC-RBSPOPT1-5.
           MOVE SPC-RBSPOPT2(5) TO QSPC-RBSPOPT2-5.
           MOVE SPC-RBMANAGER(5) TO QSPC-RBMANAGER-5.
           MOVE SPC-RBUNITPER-CD(5) TO QSPC-RBUNITPER-CD-5.
           MOVE SPC-RBFRMLA2(5) TO QSPC-RBFRMLA2-5.
           MOVE SPC-RBFRMLA(6) TO QSPC-RBFRMLA-6.
           MOVE SPC-RBDTE(6 1) TO QSPC-RBDTE-6-1.
           MOVE SPC-RBDAYS(6 1) TO QSPC-RBDAYS-6-1.
           MOVE SPC-RBYRTYPE(6 1) TO QSPC-RBYRTYPE-6-1.
           MOVE SPC-RBDTE(6 2) TO QSPC-RBDTE-6-2.
           MOVE SPC-RBDAYS(6 2) TO QSPC-RBDAYS-6-2.
           MOVE SPC-RBYRTYPE(6 2) TO QSPC-RBYRTYPE-6-2.
           MOVE SPC-RBMINRET(6) TO QSPC-RBMINRET-6.
           MOVE SPC-RBNOMON(6) TO QSPC-RBNOMON-6.
           MOVE SPC-RBDEDCHG(6) TO QSPC-RBDEDCHG-6.
           MOVE SPC-RBRECAST(6) TO QSPC-RBRECAST-6.
           MOVE SPC-RBEARLY(6) TO QSPC-RBEARLY-6.
           MOVE SPC-RBDEFER(6) TO QSPC-RBDEFER-6.
           MOVE SPC-RBPCT(6) TO QSPC-RBPCT-6.
           MOVE SPC-RBREDUC(6) TO QSPC-RBREDUC-6.
           MOVE SPC-RBMIN(6) TO QSPC-RBMIN-6.
           MOVE SPC-RBSPOPT1(6) TO QSPC-RBSPOPT1-6.
           MOVE SPC-RBSPOPT2(6) TO QSPC-RBSPOPT2-6.
           MOVE SPC-RBMANAGER(6) TO QSPC-RBMANAGER-6.
           MOVE SPC-RBUNITPER-CD(6) TO QSPC-RBUNITPER-CD-6.
           MOVE SPC-RBFRMLA2(6) TO QSPC-RBFRMLA2-6.
           MOVE SPC-RBFRMLA(7) TO QSPC-RBFRMLA-7.
           MOVE SPC-RBDTE(7 1) TO QSPC-RBDTE-7-1.
           MOVE SPC-RBDAYS(7 1) TO QSPC-RBDAYS-7-1.
           MOVE SPC-RBYRTYPE(7 1) TO QSPC-RBYRTYPE-7-1.
           MOVE SPC-RBDTE(7 2) TO QSPC-RBDTE-7-2.
           MOVE SPC-RBDAYS(7 2) TO QSPC-RBDAYS-7-2.
           MOVE SPC-RBYRTYPE(7 2) TO QSPC-RBYRTYPE-7-2.
           MOVE SPC-RBMINRET(7) TO QSPC-RBMINRET-7.
           MOVE SPC-RBNOMON(7) TO QSPC-RBNOMON-7.
           MOVE SPC-RBDEDCHG(7) TO QSPC-RBDEDCHG-7.
           MOVE SPC-RBRECAST(7) TO QSPC-RBRECAST-7.
           MOVE SPC-RBEARLY(7) TO QSPC-RBEARLY-7.
           MOVE SPC-RBDEFER(7) TO QSPC-RBDEFER-7.
           MOVE SPC-RBPCT(7) TO QSPC-RBPCT-7.
           MOVE SPC-RBREDUC(7) TO QSPC-RBREDUC-7.
           MOVE SPC-RBMIN(7) TO QSPC-RBMIN-7.
           MOVE SPC-RBSPOPT1(7) TO QSPC-RBSPOPT1-7.
           MOVE SPC-RBSPOPT2(7) TO QSPC-RBSPOPT2-7.
           MOVE SPC-RBMANAGER(7) TO QSPC-RBMANAGER-7.
           MOVE SPC-RBUNITPER-CD(7) TO QSPC-RBUNITPER-CD-7.
           MOVE SPC-RBFRMLA2(7) TO QSPC-RBFRMLA2-7.
           MOVE SPC-RBFRMLA(8) TO QSPC-RBFRMLA-8.
           MOVE SPC-RBDTE(8 1) TO QSPC-RBDTE-8-1.
           MOVE SPC-RBDAYS(8 1) TO QSPC-RBDAYS-8-1.
           MOVE SPC-RBYRTYPE(8 1) TO QSPC-RBYRTYPE-8-1.
           MOVE SPC-RBDTE(8 2) TO QSPC-RBDTE-8-2.
           MOVE SPC-RBDAYS(8 2) TO QSPC-RBDAYS-8-2.
           MOVE SPC-RBYRTYPE(8 2) TO QSPC-RBYRTYPE-8-2.
           MOVE SPC-RBMINRET(8) TO QSPC-RBMINRET-8.
           MOVE SPC-RBNOMON(8) TO QSPC-RBNOMON-8.
           MOVE SPC-RBDEDCHG(8) TO QSPC-RBDEDCHG-8.
           MOVE SPC-RBRECAST(8) TO QSPC-RBRECAST-8.
           MOVE SPC-RBEARLY(8) TO QSPC-RBEARLY-8.
           MOVE SPC-RBDEFER(8) TO QSPC-RBDEFER-8.
           MOVE SPC-RBPCT(8) TO QSPC-RBPCT-8.
           MOVE SPC-RBREDUC(8) TO QSPC-RBREDUC-8.
           MOVE SPC-RBMIN(8) TO QSPC-RBMIN-8.
           MOVE SPC-RBSPOPT1(8) TO QSPC-RBSPOPT1-8.
           MOVE SPC-RBSPOPT2(8) TO QSPC-RBSPOPT2-8.
           MOVE SPC-RBMANAGER(8) TO QSPC-RBMANAGER-8.
           MOVE SPC-RBUNITPER-CD(8) TO QSPC-RBUNITPER-CD-8.
           MOVE SPC-RBFRMLA2(8) TO QSPC-RBFRMLA2-8.
           MOVE SPC-RBFRMLA(9) TO QSPC-RBFRMLA-9.
           MOVE SPC-RBDTE(9 1) TO QSPC-RBDTE-9-1.
           MOVE SPC-RBDAYS(9 1) TO QSPC-RBDAYS-9-1.
           MOVE SPC-RBYRTYPE(9 1) TO QSPC-RBYRTYPE-9-1.
           MOVE SPC-RBDTE(9 2) TO QSPC-RBDTE-9-2.
           MOVE SPC-RBDAYS(9 2) TO QSPC-RBDAYS-9-2.
           MOVE SPC-RBYRTYPE(9 2) TO QSPC-RBYRTYPE-9-2.
           MOVE SPC-RBMINRET(9) TO QSPC-RBMINRET-9.
           MOVE SPC-RBNOMON(9) TO QSPC-RBNOMON-9.
           MOVE SPC-RBDEDCHG(9) TO QSPC-RBDEDCHG-9.
           MOVE SPC-RBRECAST(9) TO QSPC-RBRECAST-9.
           MOVE SPC-RBEARLY(9) TO QSPC-RBEARLY-9.
           MOVE SPC-RBDEFER(9) TO QSPC-RBDEFER-9.
           MOVE SPC-RBPCT(9) TO QSPC-RBPCT-9.
           MOVE SPC-RBREDUC(9) TO QSPC-RBREDUC-9.
           MOVE SPC-RBMIN(9) TO QSPC-RBMIN-9.
           MOVE SPC-RBSPOPT1(9) TO QSPC-RBSPOPT1-9.
           MOVE SPC-RBSPOPT2(9) TO QSPC-RBSPOPT2-9.
           MOVE SPC-RBMANAGER(9) TO QSPC-RBMANAGER-9.
           MOVE SPC-RBUNITPER-CD(9) TO QSPC-RBUNITPER-CD-9.
           MOVE SPC-RBFRMLA2(9) TO QSPC-RBFRMLA2-9.
           MOVE SPC-RBFRMLA(10) TO QSPC-RBFRMLA-10.
           MOVE SPC-RBDTE(10 1) TO QSPC-RBDTE-10-1.
           MOVE SPC-RBDAYS(10 1) TO QSPC-RBDAYS-10-1.
           MOVE SPC-RBYRTYPE(10 1) TO QSPC-RBYRTYPE-10-1.
           MOVE SPC-RBDTE(10 2) TO QSPC-RBDTE-10-2.
           MOVE SPC-RBDAYS(10 2) TO QSPC-RBDAYS-10-2.
           MOVE SPC-RBYRTYPE(10 2) TO QSPC-RBYRTYPE-10-2.
           MOVE SPC-RBMINRET(10) TO QSPC-RBMINRET-10.
           MOVE SPC-RBNOMON(10) TO QSPC-RBNOMON-10.
           MOVE SPC-RBDEDCHG(10) TO QSPC-RBDEDCHG-10.
           MOVE SPC-RBRECAST(10) TO QSPC-RBRECAST-10.
           MOVE SPC-RBEARLY(10) TO QSPC-RBEARLY-10.
           MOVE SPC-RBDEFER(10) TO QSPC-RBDEFER-10.
           MOVE SPC-RBPCT(10) TO QSPC-RBPCT-10.
           MOVE SPC-RBREDUC(10) TO QSPC-RBREDUC-10.
           MOVE SPC-RBMIN(10) TO QSPC-RBMIN-10.
           MOVE SPC-RBSPOPT1(10) TO QSPC-RBSPOPT1-10.
           MOVE SPC-RBSPOPT2(10) TO QSPC-RBSPOPT2-10.
           MOVE SPC-RBMANAGER(10) TO QSPC-RBMANAGER-10.
           MOVE SPC-RBUNITPER-CD(10) TO QSPC-RBUNITPER-CD-10.
           MOVE SPC-RBFRMLA2(10) TO QSPC-RBFRMLA2-10.
           MOVE SPC-RBFRMLA(11) TO QSPC-RBFRMLA-11.
           MOVE SPC-RBDTE(11 1) TO QSPC-RBDTE-11-1.
           MOVE SPC-RBDAYS(11 1) TO QSPC-RBDAYS-11-1.
           MOVE SPC-RBYRTYPE(11 1) TO QSPC-RBYRTYPE-11-1.
           MOVE SPC-RBDTE(11 2) TO QSPC-RBDTE-11-2.
           MOVE SPC-RBDAYS(11 2) TO QSPC-RBDAYS-11-2.
           MOVE SPC-RBYRTYPE(11 2) TO QSPC-RBYRTYPE-11-2.
           MOVE SPC-RBMINRET(11) TO QSPC-RBMINRET-11.
           MOVE SPC-RBNOMON(11) TO QSPC-RBNOMON-11.
           MOVE SPC-RBDEDCHG(11) TO QSPC-RBDEDCHG-11.
           MOVE SPC-RBRECAST(11) TO QSPC-RBRECAST-11.
           MOVE SPC-RBEARLY(11) TO QSPC-RBEARLY-11.
           MOVE SPC-RBDEFER(11) TO QSPC-RBDEFER-11.
           MOVE SPC-RBPCT(11) TO QSPC-RBPCT-11.
           MOVE SPC-RBREDUC(11) TO QSPC-RBREDUC-11.
           MOVE SPC-RBMIN(11) TO QSPC-RBMIN-11.
           MOVE SPC-RBSPOPT1(11) TO QSPC-RBSPOPT1-11.
           MOVE SPC-RBSPOPT2(11) TO QSPC-RBSPOPT2-11.
           MOVE SPC-RBMANAGER(11) TO QSPC-RBMANAGER-11.
           MOVE SPC-RBUNITPER-CD(11) TO QSPC-RBUNITPER-CD-11.
           MOVE SPC-RBFRMLA2(11) TO QSPC-RBFRMLA2-11.
           MOVE SPC-RBFRMLA(12) TO QSPC-RBFRMLA-12.
           MOVE SPC-RBDTE(12 1) TO QSPC-RBDTE-12-1.
           MOVE SPC-RBDAYS(12 1) TO QSPC-RBDAYS-12-1.
           MOVE SPC-RBYRTYPE(12 1) TO QSPC-RBYRTYPE-12-1.
           MOVE SPC-RBDTE(12 2) TO QSPC-RBDTE-12-2.
           MOVE SPC-RBDAYS(12 2) TO QSPC-RBDAYS-12-2.
           MOVE SPC-RBYRTYPE(12 2) TO QSPC-RBYRTYPE-12-2.
           MOVE SPC-RBMINRET(12) TO QSPC-RBMINRET-12.
           MOVE SPC-RBNOMON(12) TO QSPC-RBNOMON-12.
           MOVE SPC-RBDEDCHG(12) TO QSPC-RBDEDCHG-12.
           MOVE SPC-RBRECAST(12) TO QSPC-RBRECAST-12.
           MOVE SPC-RBEARLY(12) TO QSPC-RBEARLY-12.
           MOVE SPC-RBDEFER(12) TO QSPC-RBDEFER-12.
           MOVE SPC-RBPCT(12) TO QSPC-RBPCT-12.
           MOVE SPC-RBREDUC(12) TO QSPC-RBREDUC-12.
           MOVE SPC-RBMIN(12) TO QSPC-RBMIN-12.
           MOVE SPC-RBSPOPT1(12) TO QSPC-RBSPOPT1-12.
           MOVE SPC-RBSPOPT2(12) TO QSPC-RBSPOPT2-12.
           MOVE SPC-RBMANAGER(12) TO QSPC-RBMANAGER-12.
           MOVE SPC-RBUNITPER-CD(12) TO QSPC-RBUNITPER-CD-12.
           MOVE SPC-RBFRMLA2(12) TO QSPC-RBFRMLA2-12.
           MOVE SPC-RBFRMLA(13) TO QSPC-RBFRMLA-13.
           MOVE SPC-RBDTE(13 1) TO QSPC-RBDTE-13-1.
           MOVE SPC-RBDAYS(13 1) TO QSPC-RBDAYS-13-1.
           MOVE SPC-RBYRTYPE(13 1) TO QSPC-RBYRTYPE-13-1.
           MOVE SPC-RBDTE(13 2) TO QSPC-RBDTE-13-2.
           MOVE SPC-RBDAYS(13 2) TO QSPC-RBDAYS-13-2.
           MOVE SPC-RBYRTYPE(13 2) TO QSPC-RBYRTYPE-13-2.
           MOVE SPC-RBMINRET(13) TO QSPC-RBMINRET-13.
           MOVE SPC-RBNOMON(13) TO QSPC-RBNOMON-13.
           MOVE SPC-RBDEDCHG(13) TO QSPC-RBDEDCHG-13.
           MOVE SPC-RBRECAST(13) TO QSPC-RBRECAST-13.
           MOVE SPC-RBEARLY(13) TO QSPC-RBEARLY-13.
           MOVE SPC-RBDEFER(13) TO QSPC-RBDEFER-13.
           MOVE SPC-RBPCT(13) TO QSPC-RBPCT-13.
           MOVE SPC-RBREDUC(13) TO QSPC-RBREDUC-13.
           MOVE SPC-RBMIN(13) TO QSPC-RBMIN-13.
           MOVE SPC-RBSPOPT1(13) TO QSPC-RBSPOPT1-13.
           MOVE SPC-RBSPOPT2(13) TO QSPC-RBSPOPT2-13.
           MOVE SPC-RBMANAGER(13) TO QSPC-RBMANAGER-13.
           MOVE SPC-RBUNITPER-CD(13) TO QSPC-RBUNITPER-CD-13.
           MOVE SPC-RBFRMLA2(13) TO QSPC-RBFRMLA2-13.
           MOVE SPC-RBFRMLA(14) TO QSPC-RBFRMLA-14.
           MOVE SPC-RBDTE(14 1) TO QSPC-RBDTE-14-1.
           MOVE SPC-RBDAYS(14 1) TO QSPC-RBDAYS-14-1.
           MOVE SPC-RBYRTYPE(14 1) TO QSPC-RBYRTYPE-14-1.
           MOVE SPC-RBDTE(14 2) TO QSPC-RBDTE-14-2.
           MOVE SPC-RBDAYS(14 2) TO QSPC-RBDAYS-14-2.
           MOVE SPC-RBYRTYPE(14 2) TO QSPC-RBYRTYPE-14-2.
           MOVE SPC-RBMINRET(14) TO QSPC-RBMINRET-14.
           MOVE SPC-RBNOMON(14) TO QSPC-RBNOMON-14.
           MOVE SPC-RBDEDCHG(14) TO QSPC-RBDEDCHG-14.
           MOVE SPC-RBRECAST(14) TO QSPC-RBRECAST-14.
           MOVE SPC-RBEARLY(14) TO QSPC-RBEARLY-14.
           MOVE SPC-RBDEFER(14) TO QSPC-RBDEFER-14.
           MOVE SPC-RBPCT(14) TO QSPC-RBPCT-14.
           MOVE SPC-RBREDUC(14) TO QSPC-RBREDUC-14.
           MOVE SPC-RBMIN(14) TO QSPC-RBMIN-14.
           MOVE SPC-RBSPOPT1(14) TO QSPC-RBSPOPT1-14.
           MOVE SPC-RBSPOPT2(14) TO QSPC-RBSPOPT2-14.
           MOVE SPC-RBMANAGER(14) TO QSPC-RBMANAGER-14.
           MOVE SPC-RBUNITPER-CD(14) TO QSPC-RBUNITPER-CD-14.
           MOVE SPC-RBFRMLA2(14) TO QSPC-RBFRMLA2-14.
           MOVE SPC-RBFRMLA(15) TO QSPC-RBFRMLA-15.
           MOVE SPC-RBDTE(15 1) TO QSPC-RBDTE-15-1.
           MOVE SPC-RBDAYS(15 1) TO QSPC-RBDAYS-15-1.
           MOVE SPC-RBYRTYPE(15 1) TO QSPC-RBYRTYPE-15-1.
           MOVE SPC-RBDTE(15 2) TO QSPC-RBDTE-15-2.
           MOVE SPC-RBDAYS(15 2) TO QSPC-RBDAYS-15-2.
           MOVE SPC-RBYRTYPE(15 2) TO QSPC-RBYRTYPE-15-2.
           MOVE SPC-RBMINRET(15) TO QSPC-RBMINRET-15.
           MOVE SPC-RBNOMON(15) TO QSPC-RBNOMON-15.
           MOVE SPC-RBDEDCHG(15) TO QSPC-RBDEDCHG-15.
           MOVE SPC-RBRECAST(15) TO QSPC-RBRECAST-15.
           MOVE SPC-RBEARLY(15) TO QSPC-RBEARLY-15.
           MOVE SPC-RBDEFER(15) TO QSPC-RBDEFER-15.
           MOVE SPC-RBPCT(15) TO QSPC-RBPCT-15.
           MOVE SPC-RBREDUC(15) TO QSPC-RBREDUC-15.
           MOVE SPC-RBMIN(15) TO QSPC-RBMIN-15.
           MOVE SPC-RBSPOPT1(15) TO QSPC-RBSPOPT1-15.
           MOVE SPC-RBSPOPT2(15) TO QSPC-RBSPOPT2-15.
           MOVE SPC-RBMANAGER(15) TO QSPC-RBMANAGER-15.
           MOVE SPC-RBUNITPER-CD(15) TO QSPC-RBUNITPER-CD-15.
           MOVE SPC-RBFRMLA2(15) TO QSPC-RBFRMLA2-15.
           MOVE SPC-RBFRMLA(16) TO QSPC-RBFRMLA-16.
           MOVE SPC-RBDTE(16 1) TO QSPC-RBDTE-16-1.
           MOVE SPC-RBDAYS(16 1) TO QSPC-RBDAYS-16-1.
           MOVE SPC-RBYRTYPE(16 1) TO QSPC-RBYRTYPE-16-1.
           MOVE SPC-RBDTE(16 2) TO QSPC-RBDTE-16-2.
           MOVE SPC-RBDAYS(16 2) TO QSPC-RBDAYS-16-2.
           MOVE SPC-RBYRTYPE(16 2) TO QSPC-RBYRTYPE-16-2.
           MOVE SPC-RBMINRET(16) TO QSPC-RBMINRET-16.
           MOVE SPC-RBNOMON(16) TO QSPC-RBNOMON-16.
           MOVE SPC-RBDEDCHG(16) TO QSPC-RBDEDCHG-16.
           MOVE SPC-RBRECAST(16) TO QSPC-RBRECAST-16.
           MOVE SPC-RBEARLY(16) TO QSPC-RBEARLY-16.
           MOVE SPC-RBDEFER(16) TO QSPC-RBDEFER-16.
           MOVE SPC-RBPCT(16) TO QSPC-RBPCT-16.
           MOVE SPC-RBREDUC(16) TO QSPC-RBREDUC-16.
           MOVE SPC-RBMIN(16) TO QSPC-RBMIN-16.
           MOVE SPC-RBSPOPT1(16) TO QSPC-RBSPOPT1-16.
           MOVE SPC-RBSPOPT2(16) TO QSPC-RBSPOPT2-16.
           MOVE SPC-RBMANAGER(16) TO QSPC-RBMANAGER-16.
           MOVE SPC-RBUNITPER-CD(16) TO QSPC-RBUNITPER-CD-16.
           MOVE SPC-RBFRMLA2(16) TO QSPC-RBFRMLA2-16.
           MOVE SPC-RBFRMLA(17) TO QSPC-RBFRMLA-17.
           MOVE SPC-RBDTE(17 1) TO QSPC-RBDTE-17-1.
           MOVE SPC-RBDAYS(17 1) TO QSPC-RBDAYS-17-1.
           MOVE SPC-RBYRTYPE(17 1) TO QSPC-RBYRTYPE-17-1.
           MOVE SPC-RBDTE(17 2) TO QSPC-RBDTE-17-2.
           MOVE SPC-RBDAYS(17 2) TO QSPC-RBDAYS-17-2.
           MOVE SPC-RBYRTYPE(17 2) TO QSPC-RBYRTYPE-17-2.
           MOVE SPC-RBMINRET(17) TO QSPC-RBMINRET-17.
           MOVE SPC-RBNOMON(17) TO QSPC-RBNOMON-17.
           MOVE SPC-RBDEDCHG(17) TO QSPC-RBDEDCHG-17.
           MOVE SPC-RBRECAST(17) TO QSPC-RBRECAST-17.
           MOVE SPC-RBEARLY(17) TO QSPC-RBEARLY-17.
           MOVE SPC-RBDEFER(17) TO QSPC-RBDEFER-17.
           MOVE SPC-RBPCT(17) TO QSPC-RBPCT-17.
           MOVE SPC-RBREDUC(17) TO QSPC-RBREDUC-17.
           MOVE SPC-RBMIN(17) TO QSPC-RBMIN-17.
           MOVE SPC-RBSPOPT1(17) TO QSPC-RBSPOPT1-17.
           MOVE SPC-RBSPOPT2(17) TO QSPC-RBSPOPT2-17.
           MOVE SPC-RBMANAGER(17) TO QSPC-RBMANAGER-17.
           MOVE SPC-RBUNITPER-CD(17) TO QSPC-RBUNITPER-CD-17.
           MOVE SPC-RBFRMLA2(17) TO QSPC-RBFRMLA2-17.
           MOVE SPC-RBFRMLA(18) TO QSPC-RBFRMLA-18.
           MOVE SPC-RBDTE(18 1) TO QSPC-RBDTE-18-1.
           MOVE SPC-RBDAYS(18 1) TO QSPC-RBDAYS-18-1.
           MOVE SPC-RBYRTYPE(18 1) TO QSPC-RBYRTYPE-18-1.
           MOVE SPC-RBDTE(18 2) TO QSPC-RBDTE-18-2.
           MOVE SPC-RBDAYS(18 2) TO QSPC-RBDAYS-18-2.
           MOVE SPC-RBYRTYPE(18 2) TO QSPC-RBYRTYPE-18-2.
           MOVE SPC-RBMINRET(18) TO QSPC-RBMINRET-18.
           MOVE SPC-RBNOMON(18) TO QSPC-RBNOMON-18.
           MOVE SPC-RBDEDCHG(18) TO QSPC-RBDEDCHG-18.
           MOVE SPC-RBRECAST(18) TO QSPC-RBRECAST-18.
           MOVE SPC-RBEARLY(18) TO QSPC-RBEARLY-18.
           MOVE SPC-RBDEFER(18) TO QSPC-RBDEFER-18.
           MOVE SPC-RBPCT(18) TO QSPC-RBPCT-18.
           MOVE SPC-RBREDUC(18) TO QSPC-RBREDUC-18.
           MOVE SPC-RBMIN(18) TO QSPC-RBMIN-18.
           MOVE SPC-RBSPOPT1(18) TO QSPC-RBSPOPT1-18.
           MOVE SPC-RBSPOPT2(18) TO QSPC-RBSPOPT2-18.
           MOVE SPC-RBMANAGER(18) TO QSPC-RBMANAGER-18.
           MOVE SPC-RBUNITPER-CD(18) TO QSPC-RBUNITPER-CD-18.
           MOVE SPC-RBFRMLA2(18) TO QSPC-RBFRMLA2-18.
           MOVE SPC-RBFRMLA(19) TO QSPC-RBFRMLA-19.
           MOVE SPC-RBDTE(19 1) TO QSPC-RBDTE-19-1.
           MOVE SPC-RBDAYS(19 1) TO QSPC-RBDAYS-19-1.
           MOVE SPC-RBYRTYPE(19 1) TO QSPC-RBYRTYPE-19-1.
           MOVE SPC-RBDTE(19 2) TO QSPC-RBDTE-19-2.
           MOVE SPC-RBDAYS(19 2) TO QSPC-RBDAYS-19-2.
           MOVE SPC-RBYRTYPE(19 2) TO QSPC-RBYRTYPE-19-2.
           MOVE SPC-RBMINRET(19) TO QSPC-RBMINRET-19.
           MOVE SPC-RBNOMON(19) TO QSPC-RBNOMON-19.
           MOVE SPC-RBDEDCHG(19) TO QSPC-RBDEDCHG-19.
           MOVE SPC-RBRECAST(19) TO QSPC-RBRECAST-19.
           MOVE SPC-RBEARLY(19) TO QSPC-RBEARLY-19.
           MOVE SPC-RBDEFER(19) TO QSPC-RBDEFER-19.
           MOVE SPC-RBPCT(19) TO QSPC-RBPCT-19.
           MOVE SPC-RBREDUC(19) TO QSPC-RBREDUC-19.
           MOVE SPC-RBMIN(19) TO QSPC-RBMIN-19.
           MOVE SPC-RBSPOPT1(19) TO QSPC-RBSPOPT1-19.
           MOVE SPC-RBSPOPT2(19) TO QSPC-RBSPOPT2-19.
           MOVE SPC-RBMANAGER(19) TO QSPC-RBMANAGER-19.
           MOVE SPC-RBUNITPER-CD(19) TO QSPC-RBUNITPER-CD-19.
           MOVE SPC-RBFRMLA2(19) TO QSPC-RBFRMLA2-19.
           MOVE SPC-RBFRMLA(20) TO QSPC-RBFRMLA-20.
           MOVE SPC-RBDTE(20 1) TO QSPC-RBDTE-20-1.
           MOVE SPC-RBDAYS(20 1) TO QSPC-RBDAYS-20-1.
           MOVE SPC-RBYRTYPE(20 1) TO QSPC-RBYRTYPE-20-1.
           MOVE SPC-RBDTE(20 2) TO QSPC-RBDTE-20-2.
           MOVE SPC-RBDAYS(20 2) TO QSPC-RBDAYS-20-2.
           MOVE SPC-RBYRTYPE(20 2) TO QSPC-RBYRTYPE-20-2.
           MOVE SPC-RBMINRET(20) TO QSPC-RBMINRET-20.
           MOVE SPC-RBNOMON(20) TO QSPC-RBNOMON-20.
           MOVE SPC-RBDEDCHG(20) TO QSPC-RBDEDCHG-20.
           MOVE SPC-RBRECAST(20) TO QSPC-RBRECAST-20.
           MOVE SPC-RBEARLY(20) TO QSPC-RBEARLY-20.
           MOVE SPC-RBDEFER(20) TO QSPC-RBDEFER-20.
           MOVE SPC-RBPCT(20) TO QSPC-RBPCT-20.
           MOVE SPC-RBREDUC(20) TO QSPC-RBREDUC-20.
           MOVE SPC-RBMIN(20) TO QSPC-RBMIN-20.
           MOVE SPC-RBSPOPT1(20) TO QSPC-RBSPOPT1-20.
           MOVE SPC-RBSPOPT2(20) TO QSPC-RBSPOPT2-20.
           MOVE SPC-RBMANAGER(20) TO QSPC-RBMANAGER-20.
           MOVE SPC-RBUNITPER-CD(20) TO QSPC-RBUNITPER-CD-20.
           MOVE SPC-RBFRMLA2(20) TO QSPC-RBFRMLA2-20.
           MOVE SPC-RBFRMLA(21) TO QSPC-RBFRMLA-21.
           MOVE SPC-RBDTE(21 1) TO QSPC-RBDTE-21-1.
           MOVE SPC-RBDAYS(21 1) TO QSPC-RBDAYS-21-1.
           MOVE SPC-RBYRTYPE(21 1) TO QSPC-RBYRTYPE-21-1.
           MOVE SPC-RBDTE(21 2) TO QSPC-RBDTE-21-2.
           MOVE SPC-RBDAYS(21 2) TO QSPC-RBDAYS-21-2.
           MOVE SPC-RBYRTYPE(21 2) TO QSPC-RBYRTYPE-21-2.
           MOVE SPC-RBMINRET(21) TO QSPC-RBMINRET-21.
           MOVE SPC-RBNOMON(21) TO QSPC-RBNOMON-21.
           MOVE SPC-RBDEDCHG(21) TO QSPC-RBDEDCHG-21.
           MOVE SPC-RBRECAST(21) TO QSPC-RBRECAST-21.
           MOVE SPC-RBEARLY(21) TO QSPC-RBEARLY-21.
           MOVE SPC-RBDEFER(21) TO QSPC-RBDEFER-21.
           MOVE SPC-RBPCT(21) TO QSPC-RBPCT-21.
           MOVE SPC-RBREDUC(21) TO QSPC-RBREDUC-21.
           MOVE SPC-RBMIN(21) TO QSPC-RBMIN-21.
           MOVE SPC-RBSPOPT1(21) TO QSPC-RBSPOPT1-21.
           MOVE SPC-RBSPOPT2(21) TO QSPC-RBSPOPT2-21.
           MOVE SPC-RBMANAGER(21) TO QSPC-RBMANAGER-21.
           MOVE SPC-RBUNITPER-CD(21) TO QSPC-RBUNITPER-CD-21.
           MOVE SPC-RBFRMLA2(21) TO QSPC-RBFRMLA2-21.
           MOVE SPC-RBFRMLA(22) TO QSPC-RBFRMLA-22.
           MOVE SPC-RBDTE(22 1) TO QSPC-RBDTE-22-1.
           MOVE SPC-RBDAYS(22 1) TO QSPC-RBDAYS-22-1.
           MOVE SPC-RBYRTYPE(22 1) TO QSPC-RBYRTYPE-22-1.
           MOVE SPC-RBDTE(22 2) TO QSPC-RBDTE-22-2.
           MOVE SPC-RBDAYS(22 2) TO QSPC-RBDAYS-22-2.
           MOVE SPC-RBYRTYPE(22 2) TO QSPC-RBYRTYPE-22-2.
           MOVE SPC-RBMINRET(22) TO QSPC-RBMINRET-22.
           MOVE SPC-RBNOMON(22) TO QSPC-RBNOMON-22.
           MOVE SPC-RBDEDCHG(22) TO QSPC-RBDEDCHG-22.
           MOVE SPC-RBRECAST(22) TO QSPC-RBRECAST-22.
           MOVE SPC-RBEARLY(22) TO QSPC-RBEARLY-22.
           MOVE SPC-RBDEFER(22) TO QSPC-RBDEFER-22.
           MOVE SPC-RBPCT(22) TO QSPC-RBPCT-22.
           MOVE SPC-RBREDUC(22) TO QSPC-RBREDUC-22.
           MOVE SPC-RBMIN(22) TO QSPC-RBMIN-22.
           MOVE SPC-RBSPOPT1(22) TO QSPC-RBSPOPT1-22.
           MOVE SPC-RBSPOPT2(22) TO QSPC-RBSPOPT2-22.
           MOVE SPC-RBMANAGER(22) TO QSPC-RBMANAGER-22.
           MOVE SPC-RBUNITPER-CD(22) TO QSPC-RBUNITPER-CD-22.
           MOVE SPC-RBFRMLA2(22) TO QSPC-RBFRMLA2-22.
           MOVE SPC-RBCOMCD TO QSPC-RBCOMCD.
           MOVE SPC-ADDON-DISFRMLA TO QSPC-ADDON-DISFRMLA.
           MOVE SPC-ADDON-WHOLE-FG TO QSPC-ADDON-WHOLE-FG.
           MOVE SPC-ADDON-ORG-MATURITY TO QSPC-ADDON-ORG-MATURITY.
           MOVE SPC-CONSOLIDATE-RT-FG TO QSPC-CONSOLIDATE-RT-FG.
           MOVE SPC-1STPY-ADDON-DAYS TO QSPC-1STPY-ADDON-DAYS.
           MOVE SPC-1STPY-ADDON-YRTYPE TO QSPC-1STPY-ADDON-YRTYPE.
           MOVE SPC-ADDON-RATE-FG TO QSPC-ADDON-RATE-FG.
           MOVE SPC-ADDON-RATE TO QSPC-ADDON-RATE.
           MOVE SPC-FEEFRMLA(1) TO QSPC-FEEFRMLA-1.
           MOVE SPC-FEECD(1) TO QSPC-FEECD-1.
           MOVE SPC-FEEID(1) TO QSPC-FEEID-1.
           MOVE SPC-FEEFRMLA(2) TO QSPC-FEEFRMLA-2.
           MOVE SPC-FEECD(2) TO QSPC-FEECD-2.
           MOVE SPC-FEEID(2) TO QSPC-FEEID-2.
           MOVE SPC-ROUND-PAY-FG TO QSPC-ROUND-PAY-FG.
           MOVE SPC-IRREGULAR-PAY-FG TO QSPC-IRREGULAR-PAY-FG.
           MOVE SPC-DLRVCHGS-RB-CD(1) TO QSPC-DLRVCHGS-RB-CD-1.
           MOVE SPC-DLRVCHGS-RB-CD(2) TO QSPC-DLRVCHGS-RB-CD-2.
           MOVE SPC-DLRVCHGS-RB-CD(3) TO QSPC-DLRVCHGS-RB-CD-3.
           MOVE SPC-PARVHELD-RB-CD TO QSPC-PARVHELD-RB-CD.
           MOVE SPC-PARVPAID-RB-CD TO QSPC-PARVPAID-RB-CD.
           MOVE SPC-CONTR-CREDIT TO QSPC-CONTR-CREDIT.
           MOVE SPC-CONTR-CREDIT-CD TO QSPC-CONTR-CREDIT-CD.
           MOVE SPC-CONTR-CREDIT-MIN-DEL-PER
            TO QSPC-CONTR-CREDIT-MIN-DEL-PER.
           MOVE SPC-OPT-CAL-CHGABLE TO QSPC-OPT-CAL-CHGABLE.
           MOVE SPC-PBDEL-DAYS TO QSPC-PBDEL-DAYS.
           MOVE SPC-PBINCR-PERCENT TO QSPC-PBINCR-PERCENT.
           MOVE SPC-CPOT30-CD TO QSPC-CPOT30-CD.
           MOVE SPC-CPOTCHGOFF-CD TO QSPC-CPOTCHGOFF-CD.
           MOVE SPC-RDPOT30-CD TO QSPC-RDPOT30-CD.
           MOVE SPC-RDPOTCHGOFF-CD TO QSPC-RDPOTCHGOFF-CD.
           MOVE SPC-MAX-ALLOW-DELINQ TO QSPC-MAX-ALLOW-DELINQ.
           MOVE SPC-RESCIND-BUS-DAYS TO QSPC-RESCIND-BUS-DAYS.
           MOVE SPC-RESCIND-SATURDAY TO QSPC-RESCIND-SATURDAY.
           MOVE SPC-MIN-CREDIT-SCORE TO QSPC-MIN-CREDIT-SCORE.
           MOVE SPC-DUAL-IN-BRANCH TO QSPC-DUAL-IN-BRANCH.
           MOVE SPC-DUAL-IN-STATE TO QSPC-DUAL-IN-STATE.
           MOVE SPC-PACESETTER-FG TO QSPC-PACESETTER-FG.
           MOVE SPC-WAGE-ASSIGN-DAYS TO QSPC-WAGE-ASSIGN-DAYS.
           MOVE SPC-CAL-PAYMENT-ROUND-FG TO QSPC-CAL-PAYMENT-ROUND-FG.
           MOVE SPC-CAN-LOANS-FG TO QSPC-CAN-LOANS-FG.
           MOVE SPC-ALLOW-DELINQ-POLCD TO QSPC-ALLOW-DELINQ-POLCD.
           MOVE SPC-YTD-MAX-ALLOW-DELINQ TO QSPC-YTD-MAX-ALLOW-DELINQ.
           MOVE SPC-LNCOST-FRMLA TO QSPC-LNCOST-FRMLA.
           MOVE SPC-LNCOST-AMT TO QSPC-LNCOST-AMT.
           MOVE SPC-DLDISC-RVPRIN1-PCNT TO QSPC-DLDISC-RVPRIN1-PCNT.
           MOVE SPC-RENEWABLE-PAYS TO QSPC-RENEWABLE-PAYS.
           MOVE SPC-RENEWABLE-DAYS TO QSPC-RENEWABLE-DAYS.
           MOVE SPC-ALLOW-LN-BACK-DATE TO QSPC-ALLOW-LN-BACK-DATE.
           MOVE SPC-DLDISC-RVPRIN1-AF-PCNT
            TO QSPC-DLDISC-RVPRIN1-AF-PCNT.
           MOVE SPC-CAL-MAX-AT-ESTIMATE TO QSPC-CAL-MAX-AT-ESTIMATE.
           MOVE SPC-INSAH-RETRO TO QSPC-INSAH-RETRO.
           MOVE SPC-INSAH-DAYS-WAIT TO QSPC-INSAH-DAYS-WAIT.
           MOVE SPC-ADDON-EXCEPT-FG TO QSPC-ADDON-EXCEPT-FG.
           MOVE SPC-REPO-TRCD(1) TO QSPC-REPO-TRCD-1.
           MOVE SPC-REPO-FMNO(1 1) TO QSPC-REPO-FMNO-1-1.
           MOVE SPC-REPO-FMNO(1 2) TO QSPC-REPO-FMNO-1-2.
           MOVE SPC-REPO-FMNO(1 3) TO QSPC-REPO-FMNO-1-3.
           MOVE SPC-REPO-FMNO(1 4) TO QSPC-REPO-FMNO-1-4.
           MOVE SPC-REPO-TRCD(2) TO QSPC-REPO-TRCD-2.
           MOVE SPC-REPO-FMNO(2 1) TO QSPC-REPO-FMNO-2-1.
           MOVE SPC-REPO-FMNO(2 2) TO QSPC-REPO-FMNO-2-2.
           MOVE SPC-REPO-FMNO(2 3) TO QSPC-REPO-FMNO-2-3.
           MOVE SPC-REPO-FMNO(2 4) TO QSPC-REPO-FMNO-2-4.
           MOVE SPC-REPO-TRCD(3) TO QSPC-REPO-TRCD-3.
           MOVE SPC-REPO-FMNO(3 1) TO QSPC-REPO-FMNO-3-1.
           MOVE SPC-REPO-FMNO(3 2) TO QSPC-REPO-FMNO-3-2.
           MOVE SPC-REPO-FMNO(3 3) TO QSPC-REPO-FMNO-3-3.
           MOVE SPC-REPO-FMNO(3 4) TO QSPC-REPO-FMNO-3-4.
           MOVE SPC-CANCEL-ADDON-FG TO QSPC-CANCEL-ADDON-FG.
           MOVE SPC-DEFAULT-O2-INS-COMP TO QSPC-DEFAULT-O2-INS-COMP.
           MOVE SPC-LC-ON-JUDGEMENTS TO QSPC-LC-ON-JUDGEMENTS.
           MOVE SPC-DELQ-IB-AGE TO QSPC-DELQ-IB-AGE.
           MOVE SPC-DELQ-IB-MAX-DAYS TO QSPC-DELQ-IB-MAX-DAYS.
           MOVE SPC-INSURANCE-WRITTEN TO QSPC-INSURANCE-WRITTEN.
           MOVE SPC-INTERIM-COUPON TO QSPC-INTERIM-COUPON.
           MOVE SPC-AUTO-ASSESS-LCHG TO QSPC-AUTO-ASSESS-LCHG.
           MOVE SPC-MAX-CASH-PROCEEDS TO QSPC-MAX-CASH-PROCEEDS.
           MOVE SPC-ALLOW-ZERO-PROC TO QSPC-ALLOW-ZERO-PROC.
           MOVE SPC-BANKRULE-RATE TO QSPC-BANKRULE-RATE.
           MOVE SPC-AUTO-SEND-TRCD(1) TO QSPC-AUTO-SEND-TRCD-1.
           MOVE SPC-AUTO-SEND-FMNO(1 1) TO QSPC-AUTO-SEND-FMNO-1-1.
           MOVE SPC-AUTO-SEND-FMNO(1 2) TO QSPC-AUTO-SEND-FMNO-1-2.
           MOVE SPC-AUTO-SEND-FMNO(1 3) TO QSPC-AUTO-SEND-FMNO-1-3.
           MOVE SPC-AUTO-SEND-FMNO(1 4) TO QSPC-AUTO-SEND-FMNO-1-4.
           MOVE SPC-AUTO-SEND-TRCD(2) TO QSPC-AUTO-SEND-TRCD-2.
           MOVE SPC-AUTO-SEND-FMNO(2 1) TO QSPC-AUTO-SEND-FMNO-2-1.
           MOVE SPC-AUTO-SEND-FMNO(2 2) TO QSPC-AUTO-SEND-FMNO-2-2.
           MOVE SPC-AUTO-SEND-FMNO(2 3) TO QSPC-AUTO-SEND-FMNO-2-3.
           MOVE SPC-AUTO-SEND-FMNO(2 4) TO QSPC-AUTO-SEND-FMNO-2-4.
           MOVE SPC-DLDISC-CONV-BF-PCNT TO QSPC-DLDISC-CONV-BF-PCNT.
           MOVE SPC-UNITPER-CD TO QSPC-UNITPER-CD.
           MOVE SPC-RENEWAL-EDIT TO QSPC-RENEWAL-EDIT.
           MOVE SPC-ROUND-MFEE TO QSPC-ROUND-MFEE.
           MOVE SPC-ADV-TO-1ST-NO-CORR TO QSPC-ADV-TO-1ST-NO-CORR.
           MOVE SPC-LC-INT-ON-REPO-NON-PL
            TO QSPC-LC-INT-ON-REPO-NON-PL.
           MOVE SPC-CONTRACTUAL-SET-NONACCRUAL
            TO QSPC-CONTRACTUAL-SET-NONACCRUAL.
           MOVE SPC-CONTRACTUAL-RESET-ACCRUAL
            TO QSPC-CONTRACTUAL-RESET-ACCRUAL.
           MOVE SPC-MONTHS-PAY-NAPP-COUNTER
            TO QSPC-MONTHS-PAY-NAPP-COUNTER.
           MOVE SPC-SHORT-PAY-THRESHOLD TO QSPC-SHORT-PAY-THRESHOLD.
           MOVE SPC-CASH-AVAIL-PERCENT TO QSPC-CASH-AVAIL-PERCENT.
           MOVE SPC-O1-JOINT-FG TO QSPC-O1-JOINT-FG.
           MOVE SPC-NET-BAL-REQ TO QSPC-NET-BAL-REQ.
           MOVE SPC-AMT-PROCEEDS-REQ TO QSPC-AMT-PROCEEDS-REQ.
           MOVE SPC-ALT-PREPAY-MONTHS TO QSPC-ALT-PREPAY-MONTHS.
           MOVE SPC-PERCENT-REGPAY-AVAIL TO QSPC-PERCENT-REGPAY-AVAIL.
           MOVE SPC-ALT-DEFFRMLA TO QSPC-ALT-DEFFRMLA.
           MOVE SPC-ALT-DEFMIN TO QSPC-ALT-DEFMIN.
           MOVE SPC-ALT-DEFMAX TO QSPC-ALT-DEFMAX.
           MOVE SPC-NON-LOAN-FLAG TO QSPC-NON-LOAN-FLAG.
           MOVE SPC-SKIP-TRW TO QSPC-SKIP-TRW.
 
