      *************************************************
       CLEAR-ST-FILE SECTION.
      *************************************************
           MOVE SPACES           TO ST-REC.

           MOVE 0                TO ST-GEOGRAPHIC-CODE
                                    ST-MAX-LOAN-AVAIL
                                    ST-MAX-TAX-LOAN-AMT
                                    ST-NSF-FEE-AMT.

