      * COPYMEMBER: LIBLP/LPTRPCL

      ***********************************************************************
      *    LPTRPCL    POSTING TRANSACTION FILE CLEAR ROUTINE
      *
      * REV:
      *  MJD 062895 ADDED CLEAR OF TP-POSTDATE.
      *  MJD 071896 ADDED CLEAR OF TP-UNITPER-FREQ
      *  BAH 062598 CHANGED TP-TILLNO TO ALPHA, REMOVED THE MOVE 0
      *  JTG 120398 ADDED TP-RINSPREM() TP-RINSCOMM() REVOLVING REGENCY
      *  JTG 120798 ADDED TP-APOTH-AMT(1-8), REVOLVING REGENCY
      *  JTG 000417 ADDED TP-SP-DEFFRMLA, RE: NEW DEFERMENT FORMULA 97 OF
      *             INTDUE OR 1/3 OF REGPAY MERCURY #224
      *  MJD 001113 ADDED TP-PENALTY-INT (NEWS PR#1264)
      *  BAH 011109 ADDED TP-INSCOMP REGACC PR# 1617
      *  BAH 011210 ADDED TP-PROMAMT AND TP-PROMDATE REGACC PR# 1662
      *             PROMISE TO PAY, REGACC PR# 1662
      * JTG 020322 ADDED "CT" COUNTY TAX CODE KENTUCKY AND PERCENTS
      *            ADDED "CY" CITY   TAX CODE KENTUCKY AND PERCENTS
      *            ADDED CLEAR OF TP-INS-TAX-RB                   WORLD #288
      * BAH 020502 ADDED TP-PROMDAYS-PASTDUE, REGACC PR# 1783
      * JTG 020722 CHANGED FOR (MIP) MONTHLY INSURANCE PREMIUMS   REGENCY #1801
      *            TP-MIP-FG          PIC X.
      *            TP-MIP-CLPAID      PIC S9(7)V99  COMP-3.
      *            TP-MIP-CLCOMM      PIC S9(7)V99  COMP-3.
      *            TP-MIP-AHPAID      PIC S9(7)V99  COMP-3.
      *            TP-MIP-AHCOMM      PIC S9(7)V99  COMP-3.
      *            TP-MIP-CLPDTH-DATE      PIC 9(6)      COMP-6.
      * BLM 100304 ADDED TP-ESCROW-DISBURSED, TP-ESCROW-AMT,
      *            TP-ESCROW-PREPAID,  TP-APPLIED-TO-ESCROW, REGWAN PR# 3506
      * BAH 110801 ADDED TP-LP-SEQNO FOR REGACC ONLY, PR# 295
      *  CS 120806 ADD TP-PRIOR-DF-CODE, TP-PRIOR-DF-POSTDATE PR#314 REGACC
      *  CS 161003 ADD CLEAR OF TP-RINSPREM,TP-RINTCOMM(5-10)
      *            ADD CLEAR OF TP-EARNINGS (7-10)
      *            ADD CLEAR OF TP-INSEARN(1-10)
      *    MOVE 0 TO TP-DLRVNUM, TP-P4P5-DLRVNUM.
      *              TP-DLRVPRIN1 TP-DLPARVPAID 
      *              TP-DLPARVHELD TP-FROMCL TP-TOCL
      *  CS 161018 MOVE 0 TO TP-TILLNO
      * BAH 20210426 REMOVED FUTURE FIELDS
      * BAH 20220921 ADDED CLEAR OF TP-LCDUE #1570
      * BAH 20240209 CLEAR TP-REPAY-TRANS-ID #1641
      * BAH 20250109 CLEAR TP-CLOSFEE-REB-AMT GA CLOSING FEE #1697 S35Q-157
      **************************************************************************
       CLEAR-TRP-FILE SECTION.
           MOVE SPACES TO TRP-REC.

           MOVE 0 TO TP-DATE TP-BRNO TP-CLASS TP-ACCTNO
                     TP-LINE TP-LTOUCH-DATE TP-LAWCODE TP-SSNO
                     TP-PAYDATE TP-DUEDATE.
           MOVE 0 TO TP-TRAMT TP-INTDUE TP-APOTH TP-APOT2 TP-APINT
                     TP-APLC TP-APCUR TP-EARNINGS(1) TP-EARNINGS(2)
                     TP-EARNINGS(3) TP-EARNINGS(4) TP-EARNINGS(5)
                     TP-EARNINGS(6) TP-EARNINGS(7) TP-EARNINGS(8)
                     TP-EARNINGS(9) TP-EARNINGS(10)
                     TP-WORKAMT(1) TP-WORKAMT(2) TP-WORKAMT(3)
                     TP-WORKAMT(4) TP-WORKAMT(5) TP-WORKAMT(6)
                     TP-WORKAMT(7) TP-WORKAMT(8) TP-WORKAMT(9)
                     TP-WORKAMT(10)
                     TP-OTHBAL TP-OT2BAL TP-INTBAL TP-LCBAL 
                     TP-CURBAL TP-PDTH-DATE TP-DLNO TP-DLPROC TP-TILLNO
                     TP-LCPDTH-DATE TP-POSTING-BR TP-REVSEQNO TP-INTPAID
                     TP-PRIOR-POOLID.
           MOVE 0 TO TP-INSEARN(1) TP-INSEARN(2) TP-INSEARN(3)
                     TP-INSEARN(4) TP-INSEARN(5) TP-INSEARN(6)
                     TP-INSEARN(7) TP-INSEARN(8) TP-INSEARN(9)
                     TP-INSEARN(10)
                     TP-INSWORKAMT(1) TP-INSWORKAMT(2)
                     TP-INSWORKAMT(3) TP-INSWORKAMT(4)
                     TP-INSWORKAMT(5) TP-INSWORKAMT(6)
                     TP-INSWORKAMT(7) TP-INSWORKAMT(8)
                     TP-INSWORKAMT(9) TP-INSWORKAMT(10).
           
           MOVE 0 TO TP-DLRVCHGS-ADJ(1) TP-DLRVCHGS-ADJ(2)
                     TP-DLRVCHGS-ADJ(3) TP-DLPARVHELD-ADJ
                     TP-DLPARVPAID-ADJ
                     TP-NEWSTAT-RATE TP-PODATE TP-TOTNODEF
                     TP-LNAMT TP-ORIG-1STPYDATE TP-OLD1ST-PYDATE
                     TP-1STPYDATE TP-ORGTERM TP-INSCOMM TP-POSTTIME
                     TP-PL-OTH-AR TP-LP-DLNO TP-SPRCLASS
                     TP-POSTDATE TP-UNITPER-FREQ.

           MOVE 0 TO TP-SP-DEFFRMLA TP-PENALTY-INT TP-INSCOMP
                     TP-PROMAMT TP-PROMDATE TP-INS-TAX-RB
                     TP-PROMDAYS-PASTDUE
                     TP-MIP-CLPAID TP-MIP-CLCOMM TP-MIP-CLPDTH-DATE
                     TP-MIP-AHPAID TP-MIP-AHCOMM TP-MIP-AHPDTH-DATE
                     TP-APPLIED-TO-ESCROW TP-ESCROW-AMT
                     TP-ESCROW-DISBURSED TP-ESCROW-PREPAID
                     TP-LP-SEQNO TP-PRIOR-DF-POSTDATE
                     TP-FROMCL TP-TOCL TP-DLRVNUM TP-P4P5-DLRVNUM
                     TP-POOLID TP-LCDUE TP-REPAY-TRANS-ID
                     TP-CLOSFEE-REB-AMT.

           MOVE 0 TO TP-GLNO(1)  TP-GLNO(2)  TP-GLNO(3)
                     TP-GLAMT(1) TP-GLAMT(2) TP-GLAMT(3).
