      * COPYMEMBER: LIBLP/LPTRWGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - TRWFILE
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD TRW-REC FROM QTRW-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-TRW-FIELDS.
           MOVE QTW-BRNO TO TW-BRNO.

           IF ( QTW-DATE = "1900-01-01" )
              MOVE ZEROES TO TW-DATE
           ELSE
              MOVE QTW-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TW-DATE.

           MOVE QTW-TILLNO TO TW-TILLNO.

           IF ( QTW-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO TW-LTOUCH-DATE
           ELSE
              MOVE QTW-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TW-LTOUCH-DATE.

           MOVE QTW-POSTNAME-1 TO TW-POSTNAME(1).
           MOVE QTW-TIME-1 TO TW-TIME(1).
           MOVE QTW-AMOUNT-1 TO TW-AMOUNT(1).
           MOVE QTW-OVERSHORT-1 TO TW-OVERSHORT(1).
           MOVE QTW-POSTNAME-2 TO TW-POSTNAME(2).
           MOVE QTW-TIME-2 TO TW-TIME(2).
           MOVE QTW-AMOUNT-2 TO TW-AMOUNT(2).
           MOVE QTW-OVERSHORT-2 TO TW-OVERSHORT(2).
           MOVE QTW-POSTNAME-3 TO TW-POSTNAME(3).
           MOVE QTW-TIME-3 TO TW-TIME(3).
           MOVE QTW-AMOUNT-3 TO TW-AMOUNT(3).
           MOVE QTW-OVERSHORT-3 TO TW-OVERSHORT(3).
           MOVE QTW-POSTNAME-4 TO TW-POSTNAME(4).
           MOVE QTW-TIME-4 TO TW-TIME(4).
           MOVE QTW-AMOUNT-4 TO TW-AMOUNT(4).
           MOVE QTW-OVERSHORT-4 TO TW-OVERSHORT(4).
           MOVE QTW-POSTNAME-5 TO TW-POSTNAME(5).
           MOVE QTW-TIME-5 TO TW-TIME(5).
           MOVE QTW-AMOUNT-5 TO TW-AMOUNT(5).
           MOVE QTW-OVERSHORT-5 TO TW-OVERSHORT(5).
           MOVE QTW-POSTNAME-6 TO TW-POSTNAME(6).
           MOVE QTW-TIME-6 TO TW-TIME(6).
           MOVE QTW-AMOUNT-6 TO TW-AMOUNT(6).
           MOVE QTW-OVERSHORT-6 TO TW-OVERSHORT(6).
           MOVE QTW-POSTNAME-7 TO TW-POSTNAME(7).
           MOVE QTW-TIME-7 TO TW-TIME(7).
           MOVE QTW-AMOUNT-7 TO TW-AMOUNT(7).
           MOVE QTW-OVERSHORT-7 TO TW-OVERSHORT(7).
           MOVE QTW-POSTNAME-8 TO TW-POSTNAME(8).
           MOVE QTW-TIME-8 TO TW-TIME(8).
           MOVE QTW-AMOUNT-8 TO TW-AMOUNT(8).
           MOVE QTW-OVERSHORT-8 TO TW-OVERSHORT(8).
           MOVE QTW-POSTNAME-9 TO TW-POSTNAME(9).
           MOVE QTW-TIME-9 TO TW-TIME(9).
           MOVE QTW-AMOUNT-9 TO TW-AMOUNT(9).
           MOVE QTW-OVERSHORT-9 TO TW-OVERSHORT(9).
           MOVE QTW-POSTNAME-10 TO TW-POSTNAME(10).
           MOVE QTW-TIME-10 TO TW-TIME(10).
           MOVE QTW-AMOUNT-10 TO TW-AMOUNT(10).
           MOVE QTW-OVERSHORT-10 TO TW-OVERSHORT(10).
           MOVE QTW-POSTNAME-11 TO TW-POSTNAME(11).
           MOVE QTW-TIME-11 TO TW-TIME(11).
           MOVE QTW-AMOUNT-11 TO TW-AMOUNT(11).
           MOVE QTW-OVERSHORT-11 TO TW-OVERSHORT(11).
           MOVE QTW-POSTNAME-12 TO TW-POSTNAME(12).
           MOVE QTW-TIME-12 TO TW-TIME(12).
           MOVE QTW-AMOUNT-12 TO TW-AMOUNT(12).
           MOVE QTW-OVERSHORT-12 TO TW-OVERSHORT(12).
           MOVE QTW-POSTNAME-13 TO TW-POSTNAME(13).
           MOVE QTW-TIME-13 TO TW-TIME(13).
           MOVE QTW-AMOUNT-13 TO TW-AMOUNT(13).
           MOVE QTW-OVERSHORT-13 TO TW-OVERSHORT(13).
           MOVE QTW-POSTNAME-14 TO TW-POSTNAME(14).
           MOVE QTW-TIME-14 TO TW-TIME(14).
           MOVE QTW-AMOUNT-14 TO TW-AMOUNT(14).
           MOVE QTW-OVERSHORT-14 TO TW-OVERSHORT(14).
           MOVE QTW-POSTNAME-15 TO TW-POSTNAME(15).
           MOVE QTW-TIME-15 TO TW-TIME(15).
           MOVE QTW-AMOUNT-15 TO TW-AMOUNT(15).
           MOVE QTW-OVERSHORT-15 TO TW-OVERSHORT(15).
           MOVE QTW-POSTNAME-16 TO TW-POSTNAME(16).
           MOVE QTW-TIME-16 TO TW-TIME(16).
           MOVE QTW-AMOUNT-16 TO TW-AMOUNT(16).
           MOVE QTW-OVERSHORT-16 TO TW-OVERSHORT(16).
           MOVE QTW-POSTNAME-17 TO TW-POSTNAME(17).
           MOVE QTW-TIME-17 TO TW-TIME(17).
           MOVE QTW-AMOUNT-17 TO TW-AMOUNT(17).
           MOVE QTW-OVERSHORT-17 TO TW-OVERSHORT(17).
           MOVE QTW-POSTNAME-18 TO TW-POSTNAME(18).
           MOVE QTW-TIME-18 TO TW-TIME(18).
           MOVE QTW-AMOUNT-18 TO TW-AMOUNT(18).
           MOVE QTW-OVERSHORT-18 TO TW-OVERSHORT(18).
           MOVE QTW-POSTNAME-19 TO TW-POSTNAME(19).
           MOVE QTW-TIME-19 TO TW-TIME(19).
           MOVE QTW-AMOUNT-19 TO TW-AMOUNT(19).
           MOVE QTW-OVERSHORT-19 TO TW-OVERSHORT(19).
           MOVE QTW-POSTNAME-20 TO TW-POSTNAME(20).
           MOVE QTW-TIME-20 TO TW-TIME(20).
           MOVE QTW-AMOUNT-20 TO TW-AMOUNT(20).
           MOVE QTW-OVERSHORT-20 TO TW-OVERSHORT(20).
 
      *-----------------------------------------------------------------
      *    LOAD QTRW-REC FROM TRW-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-TRW-FIELDS.
           MOVE TW-BRNO TO QTW-BRNO.

           IF ( TW-DATE = ZEROES )
              MOVE "1900-01-01" TO QTW-DATE
           ELSE
              MOVE TW-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTW-DATE.

           MOVE TW-TILLNO TO QTW-TILLNO.

           IF ( TW-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QTW-LTOUCH-DATE
           ELSE
              MOVE TW-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTW-LTOUCH-DATE.

           MOVE TW-POSTNAME(1) TO QTW-POSTNAME-1.
           MOVE TW-TIME(1) TO QTW-TIME-1.
           MOVE TW-AMOUNT(1) TO QTW-AMOUNT-1.
           MOVE TW-OVERSHORT(1) TO QTW-OVERSHORT-1.
           MOVE TW-POSTNAME(2) TO QTW-POSTNAME-2.
           MOVE TW-TIME(2) TO QTW-TIME-2.
           MOVE TW-AMOUNT(2) TO QTW-AMOUNT-2.
           MOVE TW-OVERSHORT(2) TO QTW-OVERSHORT-2.
           MOVE TW-POSTNAME(3) TO QTW-POSTNAME-3.
           MOVE TW-TIME(3) TO QTW-TIME-3.
           MOVE TW-AMOUNT(3) TO QTW-AMOUNT-3.
           MOVE TW-OVERSHORT(3) TO QTW-OVERSHORT-3.
           MOVE TW-POSTNAME(4) TO QTW-POSTNAME-4.
           MOVE TW-TIME(4) TO QTW-TIME-4.
           MOVE TW-AMOUNT(4) TO QTW-AMOUNT-4.
           MOVE TW-OVERSHORT(4) TO QTW-OVERSHORT-4.
           MOVE TW-POSTNAME(5) TO QTW-POSTNAME-5.
           MOVE TW-TIME(5) TO QTW-TIME-5.
           MOVE TW-AMOUNT(5) TO QTW-AMOUNT-5.
           MOVE TW-OVERSHORT(5) TO QTW-OVERSHORT-5.
           MOVE TW-POSTNAME(6) TO QTW-POSTNAME-6.
           MOVE TW-TIME(6) TO QTW-TIME-6.
           MOVE TW-AMOUNT(6) TO QTW-AMOUNT-6.
           MOVE TW-OVERSHORT(6) TO QTW-OVERSHORT-6.
           MOVE TW-POSTNAME(7) TO QTW-POSTNAME-7.
           MOVE TW-TIME(7) TO QTW-TIME-7.
           MOVE TW-AMOUNT(7) TO QTW-AMOUNT-7.
           MOVE TW-OVERSHORT(7) TO QTW-OVERSHORT-7.
           MOVE TW-POSTNAME(8) TO QTW-POSTNAME-8.
           MOVE TW-TIME(8) TO QTW-TIME-8.
           MOVE TW-AMOUNT(8) TO QTW-AMOUNT-8.
           MOVE TW-OVERSHORT(8) TO QTW-OVERSHORT-8.
           MOVE TW-POSTNAME(9) TO QTW-POSTNAME-9.
           MOVE TW-TIME(9) TO QTW-TIME-9.
           MOVE TW-AMOUNT(9) TO QTW-AMOUNT-9.
           MOVE TW-OVERSHORT(9) TO QTW-OVERSHORT-9.
           MOVE TW-POSTNAME(10) TO QTW-POSTNAME-10.
           MOVE TW-TIME(10) TO QTW-TIME-10.
           MOVE TW-AMOUNT(10) TO QTW-AMOUNT-10.
           MOVE TW-OVERSHORT(10) TO QTW-OVERSHORT-10.
           MOVE TW-POSTNAME(11) TO QTW-POSTNAME-11.
           MOVE TW-TIME(11) TO QTW-TIME-11.
           MOVE TW-AMOUNT(11) TO QTW-AMOUNT-11.
           MOVE TW-OVERSHORT(11) TO QTW-OVERSHORT-11.
           MOVE TW-POSTNAME(12) TO QTW-POSTNAME-12.
           MOVE TW-TIME(12) TO QTW-TIME-12.
           MOVE TW-AMOUNT(12) TO QTW-AMOUNT-12.
           MOVE TW-OVERSHORT(12) TO QTW-OVERSHORT-12.
           MOVE TW-POSTNAME(13) TO QTW-POSTNAME-13.
           MOVE TW-TIME(13) TO QTW-TIME-13.
           MOVE TW-AMOUNT(13) TO QTW-AMOUNT-13.
           MOVE TW-OVERSHORT(13) TO QTW-OVERSHORT-13.
           MOVE TW-POSTNAME(14) TO QTW-POSTNAME-14.
           MOVE TW-TIME(14) TO QTW-TIME-14.
           MOVE TW-AMOUNT(14) TO QTW-AMOUNT-14.
           MOVE TW-OVERSHORT(14) TO QTW-OVERSHORT-14.
           MOVE TW-POSTNAME(15) TO QTW-POSTNAME-15.
           MOVE TW-TIME(15) TO QTW-TIME-15.
           MOVE TW-AMOUNT(15) TO QTW-AMOUNT-15.
           MOVE TW-OVERSHORT(15) TO QTW-OVERSHORT-15.
           MOVE TW-POSTNAME(16) TO QTW-POSTNAME-16.
           MOVE TW-TIME(16) TO QTW-TIME-16.
           MOVE TW-AMOUNT(16) TO QTW-AMOUNT-16.
           MOVE TW-OVERSHORT(16) TO QTW-OVERSHORT-16.
           MOVE TW-POSTNAME(17) TO QTW-POSTNAME-17.
           MOVE TW-TIME(17) TO QTW-TIME-17.
           MOVE TW-AMOUNT(17) TO QTW-AMOUNT-17.
           MOVE TW-OVERSHORT(17) TO QTW-OVERSHORT-17.
           MOVE TW-POSTNAME(18) TO QTW-POSTNAME-18.
           MOVE TW-TIME(18) TO QTW-TIME-18.
           MOVE TW-AMOUNT(18) TO QTW-AMOUNT-18.
           MOVE TW-OVERSHORT(18) TO QTW-OVERSHORT-18.
           MOVE TW-POSTNAME(19) TO QTW-POSTNAME-19.
           MOVE TW-TIME(19) TO QTW-TIME-19.
           MOVE TW-AMOUNT(19) TO QTW-AMOUNT-19.
           MOVE TW-OVERSHORT(19) TO QTW-OVERSHORT-19.
           MOVE TW-POSTNAME(20) TO QTW-POSTNAME-20.
           MOVE TW-TIME(20) TO QTW-TIME-20.
           MOVE TW-AMOUNT(20) TO QTW-AMOUNT-20.
           MOVE TW-OVERSHORT(20) TO QTW-OVERSHORT-20.
 
