      * COPYMEMBER: LIBLP/LPTRLCL

      ***********************************************************************
      *    LPTRLCL    DIRECT LOAN TRANSACTION FILE CLEAR ROUTINE
      *
      * REV:
      *  JTG 062795 ADDED CLEAR OF TL-POSTDATE TL-POSTTIME
      *  BAH 062598 CHANGED TL-TILLNO TO ALPHA, REMOVED THE MOVE 0
      *  BAH 040519 ADDED CLEAR OF TL-PRDLDISC-UNEARN, REGWAN PR# 2287
      *   CS 160920 CHANGED CLEAR TR1-FILE-TABLES TO ACCOMODATE 10 EARNED/ANTIC
      *             20 FEE CODES
      *   CS 160923 MOVE 0 TO TL-TAX-AMT, TL-APPROVED-BY-DATE,
      *                 TL-APPROVED-BY-TIME.
      *   CS 161011 MOVE 0 TO TL-TILLNO
      * BAH 180215 CLEAR TL-DEBIT-CARD-AMT WORLD #1306
      * BAH 20210426 REMOVED FUTURE FIELDS
      ***********************************************************************
       CLEAR-TRL-FILE SECTION.
           MOVE SPACES TO TRL-REC.

           MOVE 0 TO
              TL-DATE TL-BRNO TL-CLASS TL-ACCTNO 
              TL-LAWCODE TL-LINE TL-SUBCLASS TL-LOANDATE TL-INTDATE
              TL-PROCEEDS TL-LNAMT TL-FINCHG TL-INTCHG TL-SERCHG
              TL-EXTCHG TL-MAINTFEE TL-ORGTERM TL-1STPYAMT
              TL-NOREGPY TL-REGPYAMT TL-LASTPYAMT
              TL-PROCASH TL-TILLNO TL-DLNO
              TL-PRLNNO TL-PRBAL TL-PRINTDUE TL-PRFINCHGRB
              TL-PRINSRB TL-STATE-WORKER TL-RESTRICTD-ACCTNO
              TL-SPRCLASS TL-POSTDATE TL-POSTTIME TL-APR
              TL-PRDLDISC-UNEARN TL-POINTS TL-TAX-AMT
              TL-APPROVED-BY-DATE TL-APPROVED-BY-TIME TL-LTOUCH-DATE
              TL-DEBIT-CARD-AMT.

              PERFORM CLEAR-TRL-FILE-TABLES
                   VARYING TRLSUB FROM 1 BY 1 UNTIL TRLSUB > 20.
   
              GO TO CLEAR-TRL-FILE-EXIT.

       CLEAR-TRL-FILE-TABLES.
              IF TRLSUB < 5
                 MOVE 0 TO TL-SSNO(TRLSUB).
              IF TRLSUB < 11
                 MOVE 0 TO TL-EARNINGS(TRLSUB) TL-ANTICERN(TRLSUB) 
                 MOVE 0 TO TL-INSCOMP(TRLSUB) TL-INSEFF-DATE(TRLSUB)
                        TL-INSEXP-DATE(TRLSUB) TL-INSPREM(TRLSUB)
                        TL-INSCOMM(TRLSUB)
                        TL-INSANTICERN(TRLSUB) TL-INSEARNINGS(TRLSUB).

              MOVE 0 TO TL-FEEAMT(TRLSUB).
       CLEAR-TRL-FILE-EXIT.
           EXIT.
