      * COPYMEMBER: LIBLP/LPTRPGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - TRPFILE
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      * BAH 20220923 ADDED TP-LCDUE #1570
      * BAH 20240212 ADDED TP-REPAY-TRANS-ID #1641
      * BAH 20250115 ADDED TP-CLOSFEE-REB-AMT #1697 S35Q-157
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD TRP-REC FROM QTRP-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-TRP-FIELDS.
           MOVE QTP-BRNO TO TP-BRNO.

           IF ( QTP-DATE = "1900-01-01" )
              MOVE ZEROES TO TP-DATE
           ELSE
              MOVE QTP-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-DATE.

           MOVE QTP-CLASS TO TP-CLASS.
           MOVE QTP-ACCTNO TO TP-ACCTNO.
           MOVE QTP-LINE TO TP-LINE.

           IF ( QTP-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO TP-LTOUCH-DATE
           ELSE
              MOVE QTP-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-LTOUCH-DATE.

           MOVE QTP-LAWCODE TO TP-LAWCODE.
           MOVE QTP-JDCD TO TP-JDCD.
           MOVE QTP-PLCD TO TP-PLCD.
           MOVE QTP-SSNO TO TP-SSNO.
           MOVE QTP-MAKER TO TP-MAKER.
           MOVE QTP-IBPC TO TP-IBPC.
           MOVE QTP-TRCD TO TP-TRCD.
           MOVE QTP-REFNO TO TP-REFNO.

           IF ( QTP-PAYDATE = "1900-01-01" )
              MOVE ZEROES TO TP-PAYDATE
           ELSE
              MOVE QTP-PAYDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-PAYDATE.


           IF ( QTP-DUEDATE = "1900-01-01" )
              MOVE ZEROES TO TP-DUEDATE
           ELSE
              MOVE QTP-DUEDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-DUEDATE.

           MOVE QTP-TRAMT TO TP-TRAMT.
           MOVE QTP-INTDUE TO TP-INTDUE.
           MOVE QTP-APOTH TO TP-APOTH.
           MOVE QTP-APOT2 TO TP-APOT2.
           MOVE QTP-APINT TO TP-APINT.
           MOVE QTP-APLC TO TP-APLC.
           MOVE QTP-APCUR TO TP-APCUR.
           MOVE QTP-GLNO-1 TO TP-GLNO(1).
           MOVE QTP-GLAMT-1 TO TP-GLAMT(1).
           MOVE QTP-GLNO-2 TO TP-GLNO(2).
           MOVE QTP-GLAMT-2 TO TP-GLAMT(2).
           MOVE QTP-GLNO-3 TO TP-GLNO(3).
           MOVE QTP-GLAMT-3 TO TP-GLAMT(3).
           MOVE QTP-EARNINGS-1 TO TP-EARNINGS(1).
           MOVE QTP-EARNINGS-2 TO TP-EARNINGS(2).
           MOVE QTP-EARNINGS-3 TO TP-EARNINGS(3).
           MOVE QTP-EARNINGS-4 TO TP-EARNINGS(4).
           MOVE QTP-EARNINGS-5 TO TP-EARNINGS(5).
           MOVE QTP-EARNINGS-6 TO TP-EARNINGS(6).
           MOVE QTP-EARNINGS-7 TO TP-EARNINGS(7).
           MOVE QTP-EARNINGS-8 TO TP-EARNINGS(8).
           MOVE QTP-EARNINGS-9 TO TP-EARNINGS(9).
           MOVE QTP-EARNINGS-10 TO TP-EARNINGS(10).
           MOVE QTP-WORKAMT-1 TO TP-WORKAMT(1).
           MOVE QTP-WORKAMT-2 TO TP-WORKAMT(2).
           MOVE QTP-WORKAMT-3 TO TP-WORKAMT(3).
           MOVE QTP-WORKAMT-4 TO TP-WORKAMT(4).
           MOVE QTP-WORKAMT-5 TO TP-WORKAMT(5).
           MOVE QTP-WORKAMT-6 TO TP-WORKAMT(6).
           MOVE QTP-WORKAMT-7 TO TP-WORKAMT(7).
           MOVE QTP-WORKAMT-8 TO TP-WORKAMT(8).
           MOVE QTP-WORKAMT-9 TO TP-WORKAMT(9).
           MOVE QTP-WORKAMT-10 TO TP-WORKAMT(10).
           MOVE QTP-OTHBAL TO TP-OTHBAL.
           MOVE QTP-OT2BAL TO TP-OT2BAL.
           MOVE QTP-INTBAL TO TP-INTBAL.
           MOVE QTP-LCBAL TO TP-LCBAL.
           MOVE QTP-CURBAL TO TP-CURBAL.

           IF ( QTP-PDTH-DATE = "1900-01-01" )
              MOVE ZEROES TO TP-PDTH-DATE
           ELSE
              MOVE QTP-PDTH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-PDTH-DATE.

           MOVE QTP-DLNO TO TP-DLNO.
           MOVE QTP-DLPROC TO TP-DLPROC.
           MOVE QTP-SERVACCT TO TP-SERVACCT.
           MOVE QTP-SALEFIN TO TP-SALEFIN.
           MOVE QTP-INSURED TO TP-INSURED.
           MOVE QTP-INSOURS TO TP-INSOURS.
           MOVE QTP-LOANTYPE TO TP-LOANTYPE.
           MOVE QTP-TILLNO TO TP-TILLNO.

           IF ( QTP-LCPDTH-DATE = "1900-01-01" )
              MOVE ZEROES TO TP-LCPDTH-DATE
           ELSE
              MOVE QTP-LCPDTH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-LCPDTH-DATE.

           MOVE QTP-POSTING-BR TO TP-POSTING-BR.
           MOVE QTP-OTHBR-FG TO TP-OTHBR-FG.
           MOVE QTP-REV TO TP-REV.
           MOVE QTP-REVTRCD TO TP-REVTRCD.
           MOVE QTP-REVSEQNO TO TP-REVSEQNO.
           MOVE QTP-STATUSFG TO TP-STATUSFG.
           MOVE QTP-KEEPAPINT TO TP-KEEPAPINT.
           MOVE QTP-INTPAID TO TP-INTPAID.
           MOVE QTP-PRIOR-POOLID TO TP-PRIOR-POOLID.
           MOVE QTP-INSTYPES TO TP-INSTYPES.
           MOVE QTP-INSEARN-1 TO TP-INSEARN(1).
           MOVE QTP-INSEARN-2 TO TP-INSEARN(2).
           MOVE QTP-INSEARN-3 TO TP-INSEARN(3).
           MOVE QTP-INSEARN-4 TO TP-INSEARN(4).
           MOVE QTP-INSEARN-5 TO TP-INSEARN(5).
           MOVE QTP-INSEARN-6 TO TP-INSEARN(6).
           MOVE QTP-INSEARN-7 TO TP-INSEARN(7).
           MOVE QTP-INSEARN-8 TO TP-INSEARN(8).
           MOVE QTP-INSEARN-9 TO TP-INSEARN(9).
           MOVE QTP-INSEARN-10 TO TP-INSEARN(10).
           MOVE QTP-INSWORKAMT-1 TO TP-INSWORKAMT(1).
           MOVE QTP-INSWORKAMT-2 TO TP-INSWORKAMT(2).
           MOVE QTP-INSWORKAMT-3 TO TP-INSWORKAMT(3).
           MOVE QTP-INSWORKAMT-4 TO TP-INSWORKAMT(4).
           MOVE QTP-INSWORKAMT-5 TO TP-INSWORKAMT(5).
           MOVE QTP-INSWORKAMT-6 TO TP-INSWORKAMT(6).
           MOVE QTP-INSWORKAMT-7 TO TP-INSWORKAMT(7).
           MOVE QTP-INSWORKAMT-8 TO TP-INSWORKAMT(8).
           MOVE QTP-INSWORKAMT-9 TO TP-INSWORKAMT(9).
           MOVE QTP-INSWORKAMT-10 TO TP-INSWORKAMT(10).
           MOVE QTP-DLRVCHGS-ADJ-1 TO TP-DLRVCHGS-ADJ(1).
           MOVE QTP-DLRVCHGS-ADJ-2 TO TP-DLRVCHGS-ADJ(2).
           MOVE QTP-DLRVCHGS-ADJ-3 TO TP-DLRVCHGS-ADJ(3).
           MOVE QTP-DLPARVHELD-ADJ TO TP-DLPARVHELD-ADJ.
           MOVE QTP-DLPARVPAID-ADJ TO TP-DLPARVPAID-ADJ.
           MOVE QTP-NEWSTAT-RATE TO TP-NEWSTAT-RATE.
           MOVE QTP-POCD TO TP-POCD.

           IF ( QTP-PODATE = "1900-01-01" )
              MOVE ZEROES TO TP-PODATE
           ELSE
              MOVE QTP-PODATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-PODATE.

           MOVE QTP-DL-RVCHGS-CODE-1 TO TP-DL-RVCHGS-CODE(1).
           MOVE QTP-DL-RVCHGS-CODE-2 TO TP-DL-RVCHGS-CODE(2).
           MOVE QTP-DL-RVCHGS-CODE-3 TO TP-DL-RVCHGS-CODE(3).
           MOVE QTP-DL-PARVHELD-CODE TO TP-DL-PARVHELD-CODE.
           MOVE QTP-DL-PARVPAID-CODE TO TP-DL-PARVPAID-CODE.
           MOVE QTP-TOTNODEF TO TP-TOTNODEF.
           MOVE QTP-LNAMT TO TP-LNAMT.

           IF ( QTP-ORIG-1STPYDATE = "1900-01-01" )
              MOVE ZEROES TO TP-ORIG-1STPYDATE
           ELSE
              MOVE QTP-ORIG-1STPYDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-ORIG-1STPYDATE.


           IF ( QTP-OLD1ST-PYDATE = "1900-01-01" )
              MOVE ZEROES TO TP-OLD1ST-PYDATE
           ELSE
              MOVE QTP-OLD1ST-PYDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-OLD1ST-PYDATE.


           IF ( QTP-1STPYDATE = "1900-01-01" )
              MOVE ZEROES TO TP-1STPYDATE
           ELSE
              MOVE QTP-1STPYDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-1STPYDATE.

           MOVE QTP-ORGTERM TO TP-ORGTERM.
           MOVE QTP-INSCOMM TO TP-INSCOMM.
           MOVE QTP-MANUAL-RB TO TP-MANUAL-RB.
           MOVE QTP-USERID TO TP-USERID.
           MOVE QTP-POSTTIME TO TP-POSTTIME.
           MOVE QTP-PLTYPE TO TP-PLTYPE.
           MOVE QTP-PL-OTH-AR TO TP-PL-OTH-AR.
           MOVE QTP-LP-DLNO TO TP-LP-DLNO.
           MOVE QTP-REPOCD TO TP-REPOCD.
           MOVE QTP-SPRCLASS TO TP-SPRCLASS.
           MOVE QTP-MAX-DEFER-FG TO TP-MAX-DEFER-FG.

           IF ( QTP-POSTDATE = "1900-01-01" )
              MOVE ZEROES TO TP-POSTDATE
           ELSE
              MOVE QTP-POSTDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-POSTDATE.

           MOVE QTP-UNITPER-CD TO TP-UNITPER-CD.
           MOVE QTP-UNITPER-FREQ TO TP-UNITPER-FREQ.
           MOVE QTP-SP-DEFFRMLA TO TP-SP-DEFFRMLA.
           MOVE QTP-COLLECTOR TO TP-COLLECTOR.
           MOVE QTP-PENALTY-INT TO TP-PENALTY-INT.
           MOVE QTP-INSCOMP TO TP-INSCOMP.

           IF ( QTP-PROMDATE = "1900-01-01" )
              MOVE ZEROES TO TP-PROMDATE
           ELSE
              MOVE QTP-PROMDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-PROMDATE.

           MOVE QTP-PROMAMT TO TP-PROMAMT.
           MOVE QTP-PROMID TO TP-PROMID.
           MOVE QTP-INS-TAX-RB TO TP-INS-TAX-RB.
           MOVE QTP-PROMDAYS-PASTDUE TO TP-PROMDAYS-PASTDUE.
           MOVE QTP-MIP-FG TO TP-MIP-FG.
           MOVE QTP-MIP-CLPAID TO TP-MIP-CLPAID.
           MOVE QTP-MIP-CLCOMM TO TP-MIP-CLCOMM.
           MOVE QTP-MIP-AHPAID TO TP-MIP-AHPAID.
           MOVE QTP-MIP-AHCOMM TO TP-MIP-AHCOMM.

           IF ( QTP-MIP-CLPDTH-DATE = "1900-01-01" )
              MOVE ZEROES TO TP-MIP-CLPDTH-DATE
           ELSE
              MOVE QTP-MIP-CLPDTH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-MIP-CLPDTH-DATE.


           IF ( QTP-MIP-AHPDTH-DATE = "1900-01-01" )
              MOVE ZEROES TO TP-MIP-AHPDTH-DATE
           ELSE
              MOVE QTP-MIP-AHPDTH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-MIP-AHPDTH-DATE.

           MOVE QTP-INS-TAX-COUNTY-CD TO TP-INS-TAX-COUNTY-CD.
           MOVE QTP-INS-TAX-CITY-CD TO TP-INS-TAX-CITY-CD.
           MOVE QTP-APPLIED-TO-ESCROW TO TP-APPLIED-TO-ESCROW.
           MOVE QTP-ESCROW-AMT TO TP-ESCROW-AMT.
           MOVE QTP-ESCROW-PREPAID TO TP-ESCROW-PREPAID.
           MOVE QTP-ESCROW-DISBURSED TO TP-ESCROW-DISBURSED.
           MOVE QTP-LP-SEQNO TO TP-LP-SEQNO.
           MOVE QTP-PRIOR-DF-CODE TO TP-PRIOR-DF-CODE.

           IF ( QTP-PRIOR-DF-POSTDATE = "1900-01-01" )
              MOVE ZEROES TO TP-PRIOR-DF-POSTDATE
           ELSE
              MOVE QTP-PRIOR-DF-POSTDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TP-PRIOR-DF-POSTDATE.

           MOVE QTP-CANCEL-REASON TO TP-CANCEL-REASON.
           MOVE QTP-FROMCL       TO TP-FROMCL.
           MOVE QTP-TOCL         TO TP-TOCL.
           MOVE QTP-ADDON-TXT    TO TP-ADDON-TXT.
           MOVE QTP-ADDON-TYP    TO TP-ADDON-TYP.
           MOVE QTP-DLRVNUM      TO TP-DLRVNUM.
           MOVE QTP-P4P5-TRANCD  TO TP-P4P5-TRANCD.
           MOVE QTP-P4P5-DLRVNUM TO TP-P4P5-DLRVNUM.
           MOVE QTP-POOLID       TO TP-POOLID.
           MOVE QTP-ACTIONCD2    TO TP-ACTIONCD2.
           MOVE QTP-LCDUE        TO TP-LCDUE.
           MOVE QTP-REPAY-TRANS-ID  TO TP-REPAY-TRANS-ID.
           MOVE QTP-CLOSFEE-REB-AMT TO TP-CLOSFEE-REB-AMT.
 
      *-----------------------------------------------------------------
      *    LOAD QTRP-REC FROM TRP-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-TRP-FIELDS.
           MOVE TP-BRNO TO QTP-BRNO.

           IF ( TP-DATE = ZEROES )
              MOVE "1900-01-01" TO QTP-DATE
           ELSE
              MOVE TP-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-DATE.

           MOVE TP-CLASS TO QTP-CLASS.
           MOVE TP-ACCTNO TO QTP-ACCTNO.
           MOVE TP-LINE TO QTP-LINE.

           IF ( TP-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QTP-LTOUCH-DATE
           ELSE
              MOVE TP-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-LTOUCH-DATE.

           MOVE TP-LAWCODE TO QTP-LAWCODE.
           MOVE TP-JDCD TO QTP-JDCD.
           MOVE TP-PLCD TO QTP-PLCD.
           MOVE TP-SSNO TO QTP-SSNO.
           MOVE TP-MAKER TO QTP-MAKER.
           MOVE TP-IBPC TO QTP-IBPC.
           MOVE TP-TRCD TO QTP-TRCD.
           MOVE TP-REFNO TO QTP-REFNO.

           IF ( TP-PAYDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-PAYDATE
           ELSE
              MOVE TP-PAYDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-PAYDATE.


           IF ( TP-DUEDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-DUEDATE
           ELSE
              MOVE TP-DUEDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-DUEDATE.

           MOVE TP-TRAMT TO QTP-TRAMT.
           MOVE TP-INTDUE TO QTP-INTDUE.
           MOVE TP-APOTH TO QTP-APOTH.
           MOVE TP-APOT2 TO QTP-APOT2.
           MOVE TP-APINT TO QTP-APINT.
           MOVE TP-APLC TO QTP-APLC.
           MOVE TP-APCUR TO QTP-APCUR.
           MOVE TP-GLNO(1) TO QTP-GLNO-1.
           MOVE TP-GLAMT(1) TO QTP-GLAMT-1.
           MOVE TP-GLNO(2) TO QTP-GLNO-2.
           MOVE TP-GLAMT(2) TO QTP-GLAMT-2.
           MOVE TP-GLNO(3) TO QTP-GLNO-3.
           MOVE TP-GLAMT(3) TO QTP-GLAMT-3.
           MOVE TP-EARNINGS(1) TO QTP-EARNINGS-1.
           MOVE TP-EARNINGS(2) TO QTP-EARNINGS-2.
           MOVE TP-EARNINGS(3) TO QTP-EARNINGS-3.
           MOVE TP-EARNINGS(4) TO QTP-EARNINGS-4.
           MOVE TP-EARNINGS(5) TO QTP-EARNINGS-5.
           MOVE TP-EARNINGS(6) TO QTP-EARNINGS-6.
           MOVE TP-EARNINGS(7) TO QTP-EARNINGS-7.
           MOVE TP-EARNINGS(8) TO QTP-EARNINGS-8.
           MOVE TP-EARNINGS(9) TO QTP-EARNINGS-9.
           MOVE TP-EARNINGS(10) TO QTP-EARNINGS-10.
           MOVE TP-WORKAMT(1) TO QTP-WORKAMT-1.
           MOVE TP-WORKAMT(2) TO QTP-WORKAMT-2.
           MOVE TP-WORKAMT(3) TO QTP-WORKAMT-3.
           MOVE TP-WORKAMT(4) TO QTP-WORKAMT-4.
           MOVE TP-WORKAMT(5) TO QTP-WORKAMT-5.
           MOVE TP-WORKAMT(6) TO QTP-WORKAMT-6.
           MOVE TP-WORKAMT(7) TO QTP-WORKAMT-7.
           MOVE TP-WORKAMT(8) TO QTP-WORKAMT-8.
           MOVE TP-WORKAMT(9) TO QTP-WORKAMT-9.
           MOVE TP-WORKAMT(10) TO QTP-WORKAMT-10.
           MOVE TP-OTHBAL TO QTP-OTHBAL.
           MOVE TP-OT2BAL TO QTP-OT2BAL.
           MOVE TP-INTBAL TO QTP-INTBAL.
           MOVE TP-LCBAL TO QTP-LCBAL.
           MOVE TP-CURBAL TO QTP-CURBAL.

           IF ( TP-PDTH-DATE = ZEROES )
              MOVE "1900-01-01" TO QTP-PDTH-DATE
           ELSE
              MOVE TP-PDTH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-PDTH-DATE.

           MOVE TP-DLNO TO QTP-DLNO.
           MOVE TP-DLPROC TO QTP-DLPROC.
           MOVE TP-SERVACCT TO QTP-SERVACCT.
           MOVE TP-SALEFIN TO QTP-SALEFIN.
           MOVE TP-INSURED TO QTP-INSURED.
           MOVE TP-INSOURS TO QTP-INSOURS.
           MOVE TP-LOANTYPE TO QTP-LOANTYPE.
           MOVE TP-TILLNO TO QTP-TILLNO.

           IF ( TP-LCPDTH-DATE = ZEROES )
              MOVE "1900-01-01" TO QTP-LCPDTH-DATE
           ELSE
              MOVE TP-LCPDTH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-LCPDTH-DATE.

           MOVE TP-POSTING-BR TO QTP-POSTING-BR.
           MOVE TP-OTHBR-FG TO QTP-OTHBR-FG.
           MOVE TP-REV TO QTP-REV.
           MOVE TP-REVTRCD TO QTP-REVTRCD.
           MOVE TP-REVSEQNO TO QTP-REVSEQNO.
           MOVE TP-STATUSFG TO QTP-STATUSFG.
           MOVE TP-KEEPAPINT TO QTP-KEEPAPINT.
           MOVE TP-INTPAID TO QTP-INTPAID.
           MOVE TP-PRIOR-POOLID TO QTP-PRIOR-POOLID.
           MOVE TP-INSTYPES TO QTP-INSTYPES.
           MOVE TP-INSEARN(1) TO QTP-INSEARN-1.
           MOVE TP-INSEARN(2) TO QTP-INSEARN-2.
           MOVE TP-INSEARN(3) TO QTP-INSEARN-3.
           MOVE TP-INSEARN(4) TO QTP-INSEARN-4.
           MOVE TP-INSEARN(5) TO QTP-INSEARN-5.
           MOVE TP-INSEARN(6) TO QTP-INSEARN-6.
           MOVE TP-INSEARN(7) TO QTP-INSEARN-7.
           MOVE TP-INSEARN(8) TO QTP-INSEARN-8.
           MOVE TP-INSEARN(9) TO QTP-INSEARN-9.
           MOVE TP-INSEARN(10) TO QTP-INSEARN-10.
           MOVE TP-INSWORKAMT(1) TO QTP-INSWORKAMT-1.
           MOVE TP-INSWORKAMT(2) TO QTP-INSWORKAMT-2.
           MOVE TP-INSWORKAMT(3) TO QTP-INSWORKAMT-3.
           MOVE TP-INSWORKAMT(4) TO QTP-INSWORKAMT-4.
           MOVE TP-INSWORKAMT(5) TO QTP-INSWORKAMT-5.
           MOVE TP-INSWORKAMT(6) TO QTP-INSWORKAMT-6.
           MOVE TP-INSWORKAMT(7) TO QTP-INSWORKAMT-7.
           MOVE TP-INSWORKAMT(8) TO QTP-INSWORKAMT-8.
           MOVE TP-INSWORKAMT(9) TO QTP-INSWORKAMT-9.
           MOVE TP-INSWORKAMT(10) TO QTP-INSWORKAMT-10.
           MOVE TP-DLRVCHGS-ADJ(1) TO QTP-DLRVCHGS-ADJ-1.
           MOVE TP-DLRVCHGS-ADJ(2) TO QTP-DLRVCHGS-ADJ-2.
           MOVE TP-DLRVCHGS-ADJ(3) TO QTP-DLRVCHGS-ADJ-3.
           MOVE TP-DLPARVHELD-ADJ TO QTP-DLPARVHELD-ADJ.
           MOVE TP-DLPARVPAID-ADJ TO QTP-DLPARVPAID-ADJ.
           MOVE TP-NEWSTAT-RATE TO QTP-NEWSTAT-RATE.
           MOVE TP-POCD TO QTP-POCD.

           IF ( TP-PODATE = ZEROES )
              MOVE "1900-01-01" TO QTP-PODATE
           ELSE
              MOVE TP-PODATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-PODATE.

           MOVE TP-DL-RVCHGS-CODE(1) TO QTP-DL-RVCHGS-CODE-1.
           MOVE TP-DL-RVCHGS-CODE(2) TO QTP-DL-RVCHGS-CODE-2.
           MOVE TP-DL-RVCHGS-CODE(3) TO QTP-DL-RVCHGS-CODE-3.
           MOVE TP-DL-PARVHELD-CODE TO QTP-DL-PARVHELD-CODE.
           MOVE TP-DL-PARVPAID-CODE TO QTP-DL-PARVPAID-CODE.
           MOVE TP-TOTNODEF TO QTP-TOTNODEF.
           MOVE TP-LNAMT TO QTP-LNAMT.

           IF ( TP-ORIG-1STPYDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-ORIG-1STPYDATE
           ELSE
              MOVE TP-ORIG-1STPYDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-ORIG-1STPYDATE.


           IF ( TP-OLD1ST-PYDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-OLD1ST-PYDATE
           ELSE
              MOVE TP-OLD1ST-PYDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-OLD1ST-PYDATE.


           IF ( TP-1STPYDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-1STPYDATE
           ELSE
              MOVE TP-1STPYDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-1STPYDATE.

           MOVE TP-ORGTERM TO QTP-ORGTERM.
           MOVE TP-INSCOMM TO QTP-INSCOMM.
           MOVE TP-MANUAL-RB TO QTP-MANUAL-RB.
           MOVE TP-USERID TO QTP-USERID.
           MOVE TP-POSTTIME TO QTP-POSTTIME.
           MOVE TP-PLTYPE TO QTP-PLTYPE.
           MOVE TP-PL-OTH-AR TO QTP-PL-OTH-AR.
           MOVE TP-LP-DLNO TO QTP-LP-DLNO.
           MOVE TP-REPOCD TO QTP-REPOCD.
           MOVE TP-SPRCLASS TO QTP-SPRCLASS.
           MOVE TP-MAX-DEFER-FG TO QTP-MAX-DEFER-FG.

           IF ( TP-POSTDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-POSTDATE
           ELSE
              MOVE TP-POSTDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-POSTDATE.

           MOVE TP-UNITPER-CD TO QTP-UNITPER-CD.
           MOVE TP-UNITPER-FREQ TO QTP-UNITPER-FREQ.
           MOVE TP-SP-DEFFRMLA TO QTP-SP-DEFFRMLA.
           MOVE TP-COLLECTOR TO QTP-COLLECTOR.
           MOVE TP-PENALTY-INT TO QTP-PENALTY-INT.
           MOVE TP-INSCOMP TO QTP-INSCOMP.

           IF ( TP-PROMDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-PROMDATE
           ELSE
              MOVE TP-PROMDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-PROMDATE.

           MOVE TP-PROMAMT TO QTP-PROMAMT.
           MOVE TP-PROMID TO QTP-PROMID.
           MOVE TP-INS-TAX-RB TO QTP-INS-TAX-RB.
           MOVE TP-PROMDAYS-PASTDUE TO QTP-PROMDAYS-PASTDUE.
           MOVE TP-MIP-FG TO QTP-MIP-FG.
           MOVE TP-MIP-CLPAID TO QTP-MIP-CLPAID.
           MOVE TP-MIP-CLCOMM TO QTP-MIP-CLCOMM.
           MOVE TP-MIP-AHPAID TO QTP-MIP-AHPAID.
           MOVE TP-MIP-AHCOMM TO QTP-MIP-AHCOMM.

           IF ( TP-MIP-CLPDTH-DATE = ZEROES )
              MOVE "1900-01-01" TO QTP-MIP-CLPDTH-DATE
           ELSE
              MOVE TP-MIP-CLPDTH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-MIP-CLPDTH-DATE.


           IF ( TP-MIP-AHPDTH-DATE = ZEROES )
              MOVE "1900-01-01" TO QTP-MIP-AHPDTH-DATE
           ELSE
              MOVE TP-MIP-AHPDTH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-MIP-AHPDTH-DATE.

           MOVE TP-INS-TAX-COUNTY-CD TO QTP-INS-TAX-COUNTY-CD.
           MOVE TP-INS-TAX-CITY-CD TO QTP-INS-TAX-CITY-CD.
           MOVE TP-APPLIED-TO-ESCROW TO QTP-APPLIED-TO-ESCROW.
           MOVE TP-ESCROW-AMT TO QTP-ESCROW-AMT.
           MOVE TP-ESCROW-PREPAID TO QTP-ESCROW-PREPAID.
           MOVE TP-ESCROW-DISBURSED TO QTP-ESCROW-DISBURSED.
           MOVE TP-LP-SEQNO TO QTP-LP-SEQNO.
           MOVE TP-PRIOR-DF-CODE TO QTP-PRIOR-DF-CODE.

           IF ( TP-PRIOR-DF-POSTDATE = ZEROES )
              MOVE "1900-01-01" TO QTP-PRIOR-DF-POSTDATE
           ELSE
              MOVE TP-PRIOR-DF-POSTDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTP-PRIOR-DF-POSTDATE.

           MOVE TP-CANCEL-REASON TO QTP-CANCEL-REASON.
           MOVE TP-FROMCL        TO QTP-FROMCL.
           MOVE TP-TOCL          TO QTP-TOCL.
           MOVE TP-ADDON-TXT     TO QTP-ADDON-TXT.
           MOVE TP-ADDON-TYP     TO QTP-ADDON-TYP.
           MOVE TP-DLRVNUM       TO QTP-DLRVNUM.
           MOVE TP-P4P5-TRANCD   TO QTP-P4P5-TRANCD.
           MOVE TP-P4P5-DLRVNUM  TO QTP-P4P5-DLRVNUM.
           MOVE TP-POOLID        TO QTP-POOLID.
           MOVE TP-ACTIONCD2     TO QTP-ACTIONCD2.
           MOVE TP-LCDUE         TO QTP-LCDUE.
           MOVE TP-REPAY-TRANS-ID TO QTP-REPAY-TRANS-ID.
           MOVE TP-CLOSFEE-REB-AMT TO QTP-CLOSFEE-REB-AMT.
