      * COPYMEMBER: LIBLP/LPTRLGS_SQL
      ******************************************************************
      *
      * DESCRIPTION: SQL GET & SET - TRLFILE
      *
      *=================================================================
      * REV:
      * BAH 2021-0510 ***NEW***
      *
      ******************************************************************
      *-----------------------------------------------------------------
      *    LOAD TRL-REC FROM QTRL-REC; FOR READ & READ-NEXT
      *-----------------------------------------------------------------
       GET-TRL-FIELDS.
           MOVE QTL-BRNO TO TL-BRNO.

           IF ( QTL-DATE = "1900-01-01" )
              MOVE ZEROES TO TL-DATE
           ELSE
              MOVE QTL-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-DATE.

           MOVE QTL-CLASS TO TL-CLASS.
           MOVE QTL-ACCTNO TO TL-ACCTNO.
           MOVE QTL-LAWCODE TO TL-LAWCODE.
           MOVE QTL-LINE TO TL-LINE.

           IF ( QTL-LTOUCH-DATE = "1900-01-01" )
              MOVE ZEROES TO TL-LTOUCH-DATE
           ELSE
              MOVE QTL-LTOUCH-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-LTOUCH-DATE.

           MOVE QTL-SSNO-1 TO TL-SSNO(1).
           MOVE QTL-MAKERCD-1 TO TL-MAKERCD(1).
           MOVE QTL-SSNO-2 TO TL-SSNO(2).
           MOVE QTL-MAKERCD-2 TO TL-MAKERCD(2).
           MOVE QTL-SSNO-3 TO TL-SSNO(3).
           MOVE QTL-MAKERCD-3 TO TL-MAKERCD(3).
           MOVE QTL-SSNO-4 TO TL-SSNO(4).
           MOVE QTL-MAKERCD-4 TO TL-MAKERCD(4).
           MOVE QTL-PURCD TO TL-PURCD.
           MOVE QTL-SRCD TO TL-SRCD.
           MOVE QTL-COLLCD TO TL-COLLCD.
           MOVE QTL-SERVACCT TO TL-SERVACCT.
           MOVE QTL-LOANTYPE TO TL-LOANTYPE.
           MOVE QTL-SUBCLASS TO TL-SUBCLASS.

           IF ( QTL-LOANDATE = "1900-01-01" )
              MOVE ZEROES TO TL-LOANDATE
           ELSE
              MOVE QTL-LOANDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-LOANDATE.


           IF ( QTL-INTDATE = "1900-01-01" )
              MOVE ZEROES TO TL-INTDATE
           ELSE
              MOVE QTL-INTDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INTDATE.

           MOVE QTL-PROCEEDS TO TL-PROCEEDS.
           MOVE QTL-LNAMT TO TL-LNAMT.
           MOVE QTL-FINCHG TO TL-FINCHG.
           MOVE QTL-INTCHG TO TL-INTCHG.
           MOVE QTL-SERCHG TO TL-SERCHG.
           MOVE QTL-EXTCHG TO TL-EXTCHG.
           MOVE QTL-MAINTFEE TO TL-MAINTFEE.
           MOVE QTL-ORGTERM TO TL-ORGTERM.
           MOVE QTL-1STPYAMT TO TL-1STPYAMT.
           MOVE QTL-NOREGPY TO TL-NOREGPY.
           MOVE QTL-REGPYAMT TO TL-REGPYAMT.
           MOVE QTL-LASTPYAMT TO TL-LASTPYAMT.
           MOVE QTL-PROCASH TO TL-PROCASH.
           MOVE QTL-TILLNO TO TL-TILLNO.
           MOVE QTL-FEECODE-1 TO TL-FEECODE(1).
           MOVE QTL-FEEAMT-1 TO TL-FEEAMT(1).
           MOVE QTL-FEECODE-2 TO TL-FEECODE(2).
           MOVE QTL-FEEAMT-2 TO TL-FEEAMT(2).
           MOVE QTL-FEECODE-3 TO TL-FEECODE(3).
           MOVE QTL-FEEAMT-3 TO TL-FEEAMT(3).
           MOVE QTL-FEECODE-4 TO TL-FEECODE(4).
           MOVE QTL-FEEAMT-4 TO TL-FEEAMT(4).
           MOVE QTL-FEECODE-5 TO TL-FEECODE(5).
           MOVE QTL-FEEAMT-5 TO TL-FEEAMT(5).
           MOVE QTL-FEECODE-6 TO TL-FEECODE(6).
           MOVE QTL-FEEAMT-6 TO TL-FEEAMT(6).
           MOVE QTL-FEECODE-7 TO TL-FEECODE(7).
           MOVE QTL-FEEAMT-7 TO TL-FEEAMT(7).
           MOVE QTL-FEECODE-8 TO TL-FEECODE(8).
           MOVE QTL-FEEAMT-8 TO TL-FEEAMT(8).
           MOVE QTL-FEECODE-9 TO TL-FEECODE(9).
           MOVE QTL-FEEAMT-9 TO TL-FEEAMT(9).
           MOVE QTL-FEECODE-10 TO TL-FEECODE(10).
           MOVE QTL-FEEAMT-10 TO TL-FEEAMT(10).
           MOVE QTL-FEECODE-11 TO TL-FEECODE(11).
           MOVE QTL-FEEAMT-11 TO TL-FEEAMT(11).
           MOVE QTL-FEECODE-12 TO TL-FEECODE(12).
           MOVE QTL-FEEAMT-12 TO TL-FEEAMT(12).
           MOVE QTL-FEECODE-13 TO TL-FEECODE(13).
           MOVE QTL-FEEAMT-13 TO TL-FEEAMT(13).
           MOVE QTL-FEECODE-14 TO TL-FEECODE(14).
           MOVE QTL-FEEAMT-14 TO TL-FEEAMT(14).
           MOVE QTL-FEECODE-15 TO TL-FEECODE(15).
           MOVE QTL-FEEAMT-15 TO TL-FEEAMT(15).
           MOVE QTL-FEECODE-16 TO TL-FEECODE(16).
           MOVE QTL-FEEAMT-16 TO TL-FEEAMT(16).
           MOVE QTL-FEECODE-17 TO TL-FEECODE(17).
           MOVE QTL-FEEAMT-17 TO TL-FEEAMT(17).
           MOVE QTL-FEECODE-18 TO TL-FEECODE(18).
           MOVE QTL-FEEAMT-18 TO TL-FEEAMT(18).
           MOVE QTL-FEECODE-19 TO TL-FEECODE(19).
           MOVE QTL-FEEAMT-19 TO TL-FEEAMT(19).
           MOVE QTL-FEECODE-20 TO TL-FEECODE(20).
           MOVE QTL-FEEAMT-20 TO TL-FEEAMT(20).
           MOVE QTL-INSURED TO TL-INSURED.
           MOVE QTL-INSTYPES TO TL-INSTYPES.
           MOVE QTL-INSELIGIBLE TO TL-INSELIGIBLE.
           MOVE QTL-INSCOMP-1 TO TL-INSCOMP(1).
           MOVE QTL-INSOURS-1 TO TL-INSOURS(1).

           IF ( QTL-INSEFF-DATE-1 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(1)
           ELSE
              MOVE QTL-INSEFF-DATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(1).


           IF ( QTL-INSEXP-DATE-1 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(1)
           ELSE
              MOVE QTL-INSEXP-DATE-1 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(1).

           MOVE QTL-INSPREM-1 TO TL-INSPREM(1).
           MOVE QTL-INSCOMM-1 TO TL-INSCOMM(1).
           MOVE QTL-INSEARNINGS-1 TO TL-INSEARNINGS(1).
           MOVE QTL-INSANTICERN-1 TO TL-INSANTICERN(1).
           MOVE QTL-INSCOMP-2 TO TL-INSCOMP(2).
           MOVE QTL-INSOURS-2 TO TL-INSOURS(2).

           IF ( QTL-INSEFF-DATE-2 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(2)
           ELSE
              MOVE QTL-INSEFF-DATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(2).


           IF ( QTL-INSEXP-DATE-2 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(2)
           ELSE
              MOVE QTL-INSEXP-DATE-2 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(2).

           MOVE QTL-INSPREM-2 TO TL-INSPREM(2).
           MOVE QTL-INSCOMM-2 TO TL-INSCOMM(2).
           MOVE QTL-INSEARNINGS-2 TO TL-INSEARNINGS(2).
           MOVE QTL-INSANTICERN-2 TO TL-INSANTICERN(2).
           MOVE QTL-INSCOMP-3 TO TL-INSCOMP(3).
           MOVE QTL-INSOURS-3 TO TL-INSOURS(3).

           IF ( QTL-INSEFF-DATE-3 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(3)
           ELSE
              MOVE QTL-INSEFF-DATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(3).


           IF ( QTL-INSEXP-DATE-3 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(3)
           ELSE
              MOVE QTL-INSEXP-DATE-3 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(3).

           MOVE QTL-INSPREM-3 TO TL-INSPREM(3).
           MOVE QTL-INSCOMM-3 TO TL-INSCOMM(3).
           MOVE QTL-INSEARNINGS-3 TO TL-INSEARNINGS(3).
           MOVE QTL-INSANTICERN-3 TO TL-INSANTICERN(3).
           MOVE QTL-INSCOMP-4 TO TL-INSCOMP(4).
           MOVE QTL-INSOURS-4 TO TL-INSOURS(4).

           IF ( QTL-INSEFF-DATE-4 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(4)
           ELSE
              MOVE QTL-INSEFF-DATE-4 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(4).


           IF ( QTL-INSEXP-DATE-4 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(4)
           ELSE
              MOVE QTL-INSEXP-DATE-4 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(4).

           MOVE QTL-INSPREM-4 TO TL-INSPREM(4).
           MOVE QTL-INSCOMM-4 TO TL-INSCOMM(4).
           MOVE QTL-INSEARNINGS-4 TO TL-INSEARNINGS(4).
           MOVE QTL-INSANTICERN-4 TO TL-INSANTICERN(4).
           MOVE QTL-INSCOMP-5 TO TL-INSCOMP(5).
           MOVE QTL-INSOURS-5 TO TL-INSOURS(5).

           IF ( QTL-INSEFF-DATE-5 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(5)
           ELSE
              MOVE QTL-INSEFF-DATE-5 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(5).


           IF ( QTL-INSEXP-DATE-5 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(5)
           ELSE
              MOVE QTL-INSEXP-DATE-5 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(5).

           MOVE QTL-INSPREM-5 TO TL-INSPREM(5).
           MOVE QTL-INSCOMM-5 TO TL-INSCOMM(5).
           MOVE QTL-INSEARNINGS-5 TO TL-INSEARNINGS(5).
           MOVE QTL-INSANTICERN-5 TO TL-INSANTICERN(5).
           MOVE QTL-INSCOMP-6 TO TL-INSCOMP(6).
           MOVE QTL-INSOURS-6 TO TL-INSOURS(6).

           IF ( QTL-INSEFF-DATE-6 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(6)
           ELSE
              MOVE QTL-INSEFF-DATE-6 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(6).


           IF ( QTL-INSEXP-DATE-6 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(6)
           ELSE
              MOVE QTL-INSEXP-DATE-6 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(6).

           MOVE QTL-INSPREM-6 TO TL-INSPREM(6).
           MOVE QTL-INSCOMM-6 TO TL-INSCOMM(6).
           MOVE QTL-INSEARNINGS-6 TO TL-INSEARNINGS(6).
           MOVE QTL-INSANTICERN-6 TO TL-INSANTICERN(6).
           MOVE QTL-INSCOMP-7 TO TL-INSCOMP(7).
           MOVE QTL-INSOURS-7 TO TL-INSOURS(7).

           IF ( QTL-INSEFF-DATE-7 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(7)
           ELSE
              MOVE QTL-INSEFF-DATE-7 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(7).


           IF ( QTL-INSEXP-DATE-7 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(7)
           ELSE
              MOVE QTL-INSEXP-DATE-7 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(7).

           MOVE QTL-INSPREM-7 TO TL-INSPREM(7).
           MOVE QTL-INSCOMM-7 TO TL-INSCOMM(7).
           MOVE QTL-INSEARNINGS-7 TO TL-INSEARNINGS(7).
           MOVE QTL-INSANTICERN-7 TO TL-INSANTICERN(7).
           MOVE QTL-INSCOMP-8 TO TL-INSCOMP(8).
           MOVE QTL-INSOURS-8 TO TL-INSOURS(8).

           IF ( QTL-INSEFF-DATE-8 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(8)
           ELSE
              MOVE QTL-INSEFF-DATE-8 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(8).


           IF ( QTL-INSEXP-DATE-8 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(8)
           ELSE
              MOVE QTL-INSEXP-DATE-8 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(8).

           MOVE QTL-INSPREM-8 TO TL-INSPREM(8).
           MOVE QTL-INSCOMM-8 TO TL-INSCOMM(8).
           MOVE QTL-INSEARNINGS-8 TO TL-INSEARNINGS(8).
           MOVE QTL-INSANTICERN-8 TO TL-INSANTICERN(8).
           MOVE QTL-INSCOMP-9 TO TL-INSCOMP(9).
           MOVE QTL-INSOURS-9 TO TL-INSOURS(9).

           IF ( QTL-INSEFF-DATE-9 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(9)
           ELSE
              MOVE QTL-INSEFF-DATE-9 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(9).


           IF ( QTL-INSEXP-DATE-9 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(9)
           ELSE
              MOVE QTL-INSEXP-DATE-9 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(9).

           MOVE QTL-INSPREM-9 TO TL-INSPREM(9).
           MOVE QTL-INSCOMM-9 TO TL-INSCOMM(9).
           MOVE QTL-INSEARNINGS-9 TO TL-INSEARNINGS(9).
           MOVE QTL-INSANTICERN-9 TO TL-INSANTICERN(9).
           MOVE QTL-INSCOMP-10 TO TL-INSCOMP(10).
           MOVE QTL-INSOURS-10 TO TL-INSOURS(10).

           IF ( QTL-INSEFF-DATE-10 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEFF-DATE(10)
           ELSE
              MOVE QTL-INSEFF-DATE-10 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEFF-DATE(10).


           IF ( QTL-INSEXP-DATE-10 = "1900-01-01" )
              MOVE ZEROES TO TL-INSEXP-DATE(10)
           ELSE
              MOVE QTL-INSEXP-DATE-10 TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-INSEXP-DATE(10).

           MOVE QTL-INSPREM-10 TO TL-INSPREM(10).
           MOVE QTL-INSCOMM-10 TO TL-INSCOMM(10).
           MOVE QTL-INSEARNINGS-10 TO TL-INSEARNINGS(10).
           MOVE QTL-INSANTICERN-10 TO TL-INSANTICERN(10).

           MOVE QTL-DLNO TO TL-DLNO.
           MOVE QTL-EARNINGS-1 TO TL-EARNINGS(1).
           MOVE QTL-EARNINGS-2 TO TL-EARNINGS(2).
           MOVE QTL-EARNINGS-3 TO TL-EARNINGS(3).
           MOVE QTL-EARNINGS-4 TO TL-EARNINGS(4).
           MOVE QTL-EARNINGS-5 TO TL-EARNINGS(5).
           MOVE QTL-EARNINGS-6 TO TL-EARNINGS(6).
           MOVE QTL-EARNINGS-7 TO TL-EARNINGS(7).
           MOVE QTL-EARNINGS-8 TO TL-EARNINGS(8).
           MOVE QTL-EARNINGS-9 TO TL-EARNINGS(9).
           MOVE QTL-EARNINGS-10 TO TL-EARNINGS(10).
           MOVE QTL-ANTICERN-1 TO TL-ANTICERN(1).
           MOVE QTL-ANTICERN-2 TO TL-ANTICERN(2).
           MOVE QTL-ANTICERN-3 TO TL-ANTICERN(3).
           MOVE QTL-ANTICERN-4 TO TL-ANTICERN(4).
           MOVE QTL-ANTICERN-5 TO TL-ANTICERN(5).
           MOVE QTL-ANTICERN-6 TO TL-ANTICERN(6).
           MOVE QTL-ANTICERN-7 TO TL-ANTICERN(7).
           MOVE QTL-ANTICERN-8 TO TL-ANTICERN(8).
           MOVE QTL-ANTICERN-9 TO TL-ANTICERN(9).
           MOVE QTL-ANTICERN-10 TO TL-ANTICERN(10).
           MOVE QTL-PRLNNO TO TL-PRLNNO.
           MOVE QTL-PRBAL TO TL-PRBAL.
           MOVE QTL-PRINTDUE TO TL-PRINTDUE.
           MOVE QTL-PRFINCHGRB TO TL-PRFINCHGRB.
           MOVE QTL-PRINSRB TO TL-PRINSRB.
           MOVE QTL-LPEOD5-FG TO TL-LPEOD5-FG.
           MOVE QTL-STATE-WORKER TO TL-STATE-WORKER.
           MOVE QTL-RESTRICTD-ACCTNO TO TL-RESTRICTD-ACCTNO.
           MOVE QTL-SPRCLASS TO TL-SPRCLASS.
           MOVE QTL-USERID TO TL-USERID.

           IF ( QTL-POSTDATE = "1900-01-01" )
              MOVE ZEROES TO TL-POSTDATE
           ELSE
              MOVE QTL-POSTDATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-POSTDATE.

           MOVE QTL-POSTTIME TO TL-POSTTIME.
           MOVE QTL-GIFTNET TO TL-GIFTNET.
           MOVE QTL-APR TO TL-APR.
           MOVE QTL-SP-LNCOST-FRMLA TO TL-SP-LNCOST-FRMLA.
           MOVE QTL-MIP-FG TO TL-MIP-FG.
           MOVE QTL-INS-TAX-COUNTY-CD TO TL-INS-TAX-COUNTY-CD.
           MOVE QTL-INS-TAX-CITY-CD TO TL-INS-TAX-CITY-CD.
           MOVE QTL-PRDLDISC-UNEARN TO TL-PRDLDISC-UNEARN.
           MOVE QTL-POINTS TO TL-POINTS.
           MOVE QTL-TAX-AMT TO TL-TAX-AMT.
           MOVE QTL-PBI-PBD-FG TO TL-PBI-PBD-FG.
           MOVE QTL-APPROVED-BY-USER TO TL-APPROVED-BY-USER.
           MOVE QTL-APPROVED-BY-CODE TO TL-APPROVED-BY-CODE.

           IF ( QTL-APPROVED-BY-DATE = "1900-01-01" )
              MOVE ZEROES TO TL-APPROVED-BY-DATE
           ELSE
              MOVE QTL-APPROVED-BY-DATE TO SQL-DATE-YYYY-MM-DD
              PERFORM SQL-GET-DATE
              MOVE SQL-DATE-YYYYMMDD TO TL-APPROVED-BY-DATE.

           MOVE QTL-APPROVED-BY-TIME TO TL-APPROVED-BY-TIME.
           MOVE QTL-DEBIT-CARD-AMT   TO TL-DEBIT-CARD-AMT.
           MOVE QTL-ACTIONCD2        TO TL-ACTIONCD2.
 
      *-----------------------------------------------------------------
      *    LOAD QTRL-REC FROM TRL-REC; FOR WRITE & REWRITE
      *-----------------------------------------------------------------
       SET-TRL-FIELDS.
           MOVE TL-BRNO TO QTL-BRNO.

           IF ( TL-DATE = ZEROES )
              MOVE "1900-01-01" TO QTL-DATE
           ELSE
              MOVE TL-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-DATE.

           MOVE TL-CLASS TO QTL-CLASS.
           MOVE TL-ACCTNO TO QTL-ACCTNO.
           MOVE TL-LAWCODE TO QTL-LAWCODE.
           MOVE TL-LINE TO QTL-LINE.

           IF ( TL-LTOUCH-DATE = ZEROES )
              MOVE "1900-01-01" TO QTL-LTOUCH-DATE
           ELSE
              MOVE TL-LTOUCH-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-LTOUCH-DATE.

           MOVE TL-SSNO(1) TO QTL-SSNO-1.
           MOVE TL-MAKERCD(1) TO QTL-MAKERCD-1.
           MOVE TL-SSNO(2) TO QTL-SSNO-2.
           MOVE TL-MAKERCD(2) TO QTL-MAKERCD-2.
           MOVE TL-SSNO(3) TO QTL-SSNO-3.
           MOVE TL-MAKERCD(3) TO QTL-MAKERCD-3.
           MOVE TL-SSNO(4) TO QTL-SSNO-4.
           MOVE TL-MAKERCD(4) TO QTL-MAKERCD-4.
           MOVE TL-PURCD TO QTL-PURCD.
           MOVE TL-SRCD TO QTL-SRCD.
           MOVE TL-COLLCD TO QTL-COLLCD.
           MOVE TL-SERVACCT TO QTL-SERVACCT.
           MOVE TL-LOANTYPE TO QTL-LOANTYPE.
           MOVE TL-SUBCLASS TO QTL-SUBCLASS.

           IF ( TL-LOANDATE = ZEROES )
              MOVE "1900-01-01" TO QTL-LOANDATE
           ELSE
              MOVE TL-LOANDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-LOANDATE.


           IF ( TL-INTDATE = ZEROES )
              MOVE "1900-01-01" TO QTL-INTDATE
           ELSE
              MOVE TL-INTDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INTDATE.

           MOVE TL-PROCEEDS TO QTL-PROCEEDS.
           MOVE TL-LNAMT TO QTL-LNAMT.
           MOVE TL-FINCHG TO QTL-FINCHG.
           MOVE TL-INTCHG TO QTL-INTCHG.
           MOVE TL-SERCHG TO QTL-SERCHG.
           MOVE TL-EXTCHG TO QTL-EXTCHG.
           MOVE TL-MAINTFEE TO QTL-MAINTFEE.
           MOVE TL-ORGTERM TO QTL-ORGTERM.
           MOVE TL-1STPYAMT TO QTL-1STPYAMT.
           MOVE TL-NOREGPY TO QTL-NOREGPY.
           MOVE TL-REGPYAMT TO QTL-REGPYAMT.
           MOVE TL-LASTPYAMT TO QTL-LASTPYAMT.
           MOVE TL-PROCASH TO QTL-PROCASH.
           MOVE TL-TILLNO TO QTL-TILLNO.
           MOVE TL-FEECODE(1) TO QTL-FEECODE-1.
           MOVE TL-FEEAMT(1) TO QTL-FEEAMT-1.
           MOVE TL-FEECODE(2) TO QTL-FEECODE-2.
           MOVE TL-FEEAMT(2) TO QTL-FEEAMT-2.
           MOVE TL-FEECODE(3) TO QTL-FEECODE-3.
           MOVE TL-FEEAMT(3) TO QTL-FEEAMT-3.
           MOVE TL-FEECODE(4) TO QTL-FEECODE-4.
           MOVE TL-FEEAMT(4) TO QTL-FEEAMT-4.
           MOVE TL-FEECODE(5) TO QTL-FEECODE-5.
           MOVE TL-FEEAMT(5) TO QTL-FEEAMT-5.
           MOVE TL-FEECODE(6) TO QTL-FEECODE-6.
           MOVE TL-FEEAMT(6) TO QTL-FEEAMT-6.
           MOVE TL-FEECODE(7) TO QTL-FEECODE-7.
           MOVE TL-FEEAMT(7) TO QTL-FEEAMT-7.
           MOVE TL-FEECODE(8) TO QTL-FEECODE-8.
           MOVE TL-FEEAMT(8) TO QTL-FEEAMT-8.
           MOVE TL-FEECODE(9) TO QTL-FEECODE-9.
           MOVE TL-FEEAMT(9) TO QTL-FEEAMT-9.
           MOVE TL-FEECODE(10) TO QTL-FEECODE-10.
           MOVE TL-FEEAMT(10) TO QTL-FEEAMT-10.
           MOVE TL-FEECODE(11) TO QTL-FEECODE-11.
           MOVE TL-FEEAMT(11) TO QTL-FEEAMT-11.
           MOVE TL-FEECODE(12) TO QTL-FEECODE-12.
           MOVE TL-FEEAMT(12) TO QTL-FEEAMT-12.
           MOVE TL-FEECODE(13) TO QTL-FEECODE-13.
           MOVE TL-FEEAMT(13) TO QTL-FEEAMT-13.
           MOVE TL-FEECODE(14) TO QTL-FEECODE-14.
           MOVE TL-FEEAMT(14) TO QTL-FEEAMT-14.
           MOVE TL-FEECODE(15) TO QTL-FEECODE-15.
           MOVE TL-FEEAMT(15) TO QTL-FEEAMT-15.
           MOVE TL-FEECODE(16) TO QTL-FEECODE-16.
           MOVE TL-FEEAMT(16) TO QTL-FEEAMT-16.
           MOVE TL-FEECODE(17) TO QTL-FEECODE-17.
           MOVE TL-FEEAMT(17) TO QTL-FEEAMT-17.
           MOVE TL-FEECODE(18) TO QTL-FEECODE-18.
           MOVE TL-FEEAMT(18) TO QTL-FEEAMT-18.
           MOVE TL-FEECODE(19) TO QTL-FEECODE-19.
           MOVE TL-FEEAMT(19) TO QTL-FEEAMT-19.
           MOVE TL-FEECODE(20) TO QTL-FEECODE-20.
           MOVE TL-FEEAMT(20) TO QTL-FEEAMT-20.
           MOVE TL-INSURED TO QTL-INSURED.
           MOVE TL-INSTYPES TO QTL-INSTYPES.
           MOVE TL-INSELIGIBLE TO QTL-INSELIGIBLE.

           MOVE TL-INSCOMP(1) TO QTL-INSCOMP-1.
           MOVE TL-INSOURS(1) TO QTL-INSOURS-1.
           IF ( TL-INSEFF-DATE(1) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-1
           ELSE
              MOVE TL-INSEFF-DATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-1.
           IF ( TL-INSEXP-DATE(1) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-1
           ELSE
              MOVE TL-INSEXP-DATE(1) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-1.
           MOVE TL-INSPREM(1) TO QTL-INSPREM-1.
           MOVE TL-INSCOMM(1) TO QTL-INSCOMM-1.
           MOVE TL-INSEARNINGS(1) TO QTL-INSEARNINGS-1.
           MOVE TL-INSANTICERN(1) TO QTL-INSANTICERN-1.

           MOVE TL-INSCOMP(2) TO QTL-INSCOMP-2.
           MOVE TL-INSOURS(2) TO QTL-INSOURS-2.
           IF ( TL-INSEFF-DATE(2) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-2
           ELSE
              MOVE TL-INSEFF-DATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-2.
           IF ( TL-INSEXP-DATE(2) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-2
           ELSE
              MOVE TL-INSEXP-DATE(2) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-2.
           MOVE TL-INSPREM(2) TO QTL-INSPREM-2.
           MOVE TL-INSCOMM(2) TO QTL-INSCOMM-2.
           MOVE TL-INSEARNINGS(2) TO QTL-INSEARNINGS-2.
           MOVE TL-INSANTICERN(2) TO QTL-INSANTICERN-2.

           MOVE TL-INSCOMP(3) TO QTL-INSCOMP-3.
           MOVE TL-INSOURS(3) TO QTL-INSOURS-3.
           IF ( TL-INSEFF-DATE(3) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-3
           ELSE
              MOVE TL-INSEFF-DATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-3.
           IF ( TL-INSEXP-DATE(3) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-3
           ELSE
              MOVE TL-INSEXP-DATE(3) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-3.
           MOVE TL-INSPREM(3) TO QTL-INSPREM-3.
           MOVE TL-INSCOMM(3) TO QTL-INSCOMM-3.
           MOVE TL-INSEARNINGS(3) TO QTL-INSEARNINGS-3.
           MOVE TL-INSANTICERN(3) TO QTL-INSANTICERN-3.

           MOVE TL-INSCOMP(4) TO QTL-INSCOMP-4.
           MOVE TL-INSOURS(4) TO QTL-INSOURS-4.
           IF ( TL-INSEFF-DATE(4) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-4
           ELSE
              MOVE TL-INSEFF-DATE(4) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-4.
           IF ( TL-INSEXP-DATE(4) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-4
           ELSE
              MOVE TL-INSEXP-DATE(4) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-4.
           MOVE TL-INSPREM(4) TO QTL-INSPREM-4.
           MOVE TL-INSCOMM(4) TO QTL-INSCOMM-4.
           MOVE TL-INSEARNINGS(4) TO QTL-INSEARNINGS-4.
           MOVE TL-INSANTICERN(4) TO QTL-INSANTICERN-4.

           MOVE TL-INSCOMP(5) TO QTL-INSCOMP-5.
           MOVE TL-INSOURS(5) TO QTL-INSOURS-5.
           IF ( TL-INSEFF-DATE(5) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-5
           ELSE
              MOVE TL-INSEFF-DATE(5) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-5.
           IF ( TL-INSEXP-DATE(5) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-5
           ELSE
              MOVE TL-INSEXP-DATE(5) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-5.
           MOVE TL-INSPREM(5) TO QTL-INSPREM-5.
           MOVE TL-INSCOMM(5) TO QTL-INSCOMM-5.
           MOVE TL-INSEARNINGS(5) TO QTL-INSEARNINGS-5.
           MOVE TL-INSANTICERN(5) TO QTL-INSANTICERN-5.

           MOVE TL-INSCOMP(6) TO QTL-INSCOMP-6.
           MOVE TL-INSOURS(6) TO QTL-INSOURS-6.
           IF ( TL-INSEFF-DATE(6) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-6
           ELSE
              MOVE TL-INSEFF-DATE(6) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-6.
           IF ( TL-INSEXP-DATE(6) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-6
           ELSE
              MOVE TL-INSEXP-DATE(6) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-6.
           MOVE TL-INSPREM(6) TO QTL-INSPREM-6.
           MOVE TL-INSCOMM(6) TO QTL-INSCOMM-6.
           MOVE TL-INSEARNINGS(6) TO QTL-INSEARNINGS-6.
           MOVE TL-INSANTICERN(6) TO QTL-INSANTICERN-6.

           MOVE TL-INSCOMP(7) TO QTL-INSCOMP-7.
           MOVE TL-INSOURS(7) TO QTL-INSOURS-7.
           IF ( TL-INSEFF-DATE(7) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-7
           ELSE
              MOVE TL-INSEFF-DATE(7) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-7.
           IF ( TL-INSEXP-DATE(7) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-7
           ELSE
              MOVE TL-INSEXP-DATE(7) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-7.
           MOVE TL-INSPREM(7) TO QTL-INSPREM-7.
           MOVE TL-INSCOMM(7) TO QTL-INSCOMM-7.
           MOVE TL-INSEARNINGS(7) TO QTL-INSEARNINGS-7.
           MOVE TL-INSANTICERN(7) TO QTL-INSANTICERN-7.

           MOVE TL-INSCOMP(8) TO QTL-INSCOMP-8.
           MOVE TL-INSOURS(8) TO QTL-INSOURS-8.
           IF ( TL-INSEFF-DATE(8) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-8
           ELSE
              MOVE TL-INSEFF-DATE(8) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-8.
           IF ( TL-INSEXP-DATE(8) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-8
           ELSE
              MOVE TL-INSEXP-DATE(8) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-8.
           MOVE TL-INSPREM(8) TO QTL-INSPREM-8.
           MOVE TL-INSCOMM(8) TO QTL-INSCOMM-8.
           MOVE TL-INSEARNINGS(8) TO QTL-INSEARNINGS-8.
           MOVE TL-INSANTICERN(8) TO QTL-INSANTICERN-8.

           MOVE TL-INSCOMP(9) TO QTL-INSCOMP-9.
           MOVE TL-INSOURS(9) TO QTL-INSOURS-9.
           IF ( TL-INSEFF-DATE(9) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-9
           ELSE
              MOVE TL-INSEFF-DATE(9) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-9.
           IF ( TL-INSEXP-DATE(9) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-9
           ELSE
              MOVE TL-INSEXP-DATE(9) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-9.
           MOVE TL-INSPREM(9) TO QTL-INSPREM-9.
           MOVE TL-INSCOMM(9) TO QTL-INSCOMM-9.
           MOVE TL-INSEARNINGS(9) TO QTL-INSEARNINGS-9.
           MOVE TL-INSANTICERN(9) TO QTL-INSANTICERN-9.

           MOVE TL-INSCOMP(10) TO QTL-INSCOMP-10.
           MOVE TL-INSOURS(10) TO QTL-INSOURS-10.
           IF ( TL-INSEFF-DATE(10) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEFF-DATE-10
           ELSE
              MOVE TL-INSEFF-DATE(10) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEFF-DATE-10.
           IF ( TL-INSEXP-DATE(10) = ZEROES )
              MOVE "1900-01-01" TO QTL-INSEXP-DATE-10
           ELSE
              MOVE TL-INSEXP-DATE(10) TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-INSEXP-DATE-10.
           MOVE TL-INSPREM(10) TO QTL-INSPREM-10.
           MOVE TL-INSCOMM(10) TO QTL-INSCOMM-10.
           MOVE TL-INSEARNINGS(10) TO QTL-INSEARNINGS-10.
           MOVE TL-INSANTICERN(10) TO QTL-INSANTICERN-10.

           MOVE TL-DLNO TO QTL-DLNO.

           MOVE TL-EARNINGS(1) TO QTL-EARNINGS-1.
           MOVE TL-EARNINGS(2) TO QTL-EARNINGS-2.
           MOVE TL-EARNINGS(3) TO QTL-EARNINGS-3.
           MOVE TL-EARNINGS(4) TO QTL-EARNINGS-4.
           MOVE TL-EARNINGS(5) TO QTL-EARNINGS-5.
           MOVE TL-EARNINGS(6) TO QTL-EARNINGS-6.
           MOVE TL-EARNINGS(7) TO QTL-EARNINGS-7.
           MOVE TL-EARNINGS(8) TO QTL-EARNINGS-8.
           MOVE TL-EARNINGS(9) TO QTL-EARNINGS-9.
           MOVE TL-EARNINGS(10) TO QTL-EARNINGS-10.
           MOVE TL-ANTICERN(1) TO QTL-ANTICERN-1.
           MOVE TL-ANTICERN(2) TO QTL-ANTICERN-2.
           MOVE TL-ANTICERN(3) TO QTL-ANTICERN-3.
           MOVE TL-ANTICERN(4) TO QTL-ANTICERN-4.
           MOVE TL-ANTICERN(5) TO QTL-ANTICERN-5.
           MOVE TL-ANTICERN(6) TO QTL-ANTICERN-6.
           MOVE TL-ANTICERN(7) TO QTL-ANTICERN-7.
           MOVE TL-ANTICERN(8) TO QTL-ANTICERN-8.
           MOVE TL-ANTICERN(9) TO QTL-ANTICERN-9.
           MOVE TL-ANTICERN(10) TO QTL-ANTICERN-10.
           MOVE TL-PRLNNO TO QTL-PRLNNO.
           MOVE TL-PRBAL TO QTL-PRBAL.
           MOVE TL-PRINTDUE TO QTL-PRINTDUE.
           MOVE TL-PRFINCHGRB TO QTL-PRFINCHGRB.
           MOVE TL-PRINSRB TO QTL-PRINSRB.
           MOVE TL-LPEOD5-FG TO QTL-LPEOD5-FG.
           MOVE TL-STATE-WORKER TO QTL-STATE-WORKER.
           MOVE TL-RESTRICTD-ACCTNO TO QTL-RESTRICTD-ACCTNO.
           MOVE TL-SPRCLASS TO QTL-SPRCLASS.
           MOVE TL-USERID TO QTL-USERID.

           IF ( TL-POSTDATE = ZEROES )
              MOVE "1900-01-01" TO QTL-POSTDATE
           ELSE
              MOVE TL-POSTDATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-POSTDATE.

           MOVE TL-POSTTIME TO QTL-POSTTIME.
           MOVE TL-GIFTNET TO QTL-GIFTNET.
           MOVE TL-APR TO QTL-APR.
           MOVE TL-SP-LNCOST-FRMLA TO QTL-SP-LNCOST-FRMLA.
           MOVE TL-MIP-FG TO QTL-MIP-FG.
           MOVE TL-INS-TAX-COUNTY-CD TO QTL-INS-TAX-COUNTY-CD.
           MOVE TL-INS-TAX-CITY-CD TO QTL-INS-TAX-CITY-CD.
           MOVE TL-PRDLDISC-UNEARN TO QTL-PRDLDISC-UNEARN.
           MOVE TL-POINTS TO QTL-POINTS.
           MOVE TL-TAX-AMT TO QTL-TAX-AMT.
           MOVE TL-PBI-PBD-FG TO QTL-PBI-PBD-FG.
           MOVE TL-APPROVED-BY-USER TO QTL-APPROVED-BY-USER.
           MOVE TL-APPROVED-BY-CODE TO QTL-APPROVED-BY-CODE.

           IF ( TL-APPROVED-BY-DATE = ZEROES )
              MOVE "1900-01-01" TO QTL-APPROVED-BY-DATE
           ELSE
              MOVE TL-APPROVED-BY-DATE TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD TO QTL-APPROVED-BY-DATE.

           MOVE TL-APPROVED-BY-TIME TO QTL-APPROVED-BY-TIME.
           MOVE TL-DEBIT-CARD-AMT   TO QTL-DEBIT-CARD-AMT.
           MOVE TL-ACTIONCD2        TO QTL-ACTIONCD2.
 
