      * COPYMEMBER: LIBLP/LPTY1RN
      ***************************************************
       LOAD-TY1-FILE.
      *- - - -{ SET OVERRIDE TO A "Y" TO NOT TOUCH THE PATH AT ALL  }- -
           IF ( TY-PATH-OVERRIDE = "Y" ) 
              NEXT SENTENCE
           ELSE
      *- - - -{ SPACES IS THE DEFAULT, NO CROSSING BRANCHES }- - - - - -
           IF ( TY-PATH-OVERRIDE = SPACES ) 
              MOVE EXT-FILPATH-BASE        TO TY-ALL-BASE
              MOVE EXT-FILPATH-MACHINE     TO TY-ALL-MACHINE
              MOVE EXT-FILPATH-DATA        TO TY-ALL-DATA
              MOVE TY-ALL-PATH             TO TY-PATH
           ELSE
      *- - - -{ USE BRANCH VALUES }- - - - - - - - - - - - - - - - - - -
           IF ( TY-PATH-OVERRIDE = "B" ) 
              MOVE FILPATH-BASE            TO TY-ALL-BASE
              MOVE FILPATH-MACHINE         TO TY-ALL-MACHINE
              MOVE FILPATH-DATA            TO TY-ALL-DATA
              MOVE TY-ALL-PATH             TO TY-PATH.

      *-----------------------------------------------------------------
       OPEN-TY1-FILE.
           PERFORM LOAD-TY1-FILE.
           PERFORM OPEN-IT.
           MOVE TY-PATH-SQL TO E-FILE.

      *    IF ( SQL-CONNECT-STAT-BAD )
      *       PERFORM SQL-CONNECT.

      *-----------------------------------------------------------------
       START-TY1-FILE.
           PERFORM START-IT.
           MOVE TY-PATH-OWNBR  TO TY-BRNO.
           MOVE TY-PATH-SQL    TO E-FILE.
           MOVE TY1-KEY        TO E-KEYX.

           IF ( TY1-CURSOR-STAT-GOOD )
              PERFORM CLOSE-TY1-FILE.

           IF ( QTY1-WEND-CLASS = ZEROES    ) OR
              ( QTY1-WEND-CLASS NOT NUMERIC )
              MOVE TY-PATH-OWNBR        TO QTY1-WBEG-BRNO
              MOVE TY-PATH-OWNBR        TO QTY1-WEND-BRNO
              MOVE TY-DATE              TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD  TO QTY1-WBEG-DATE
              MOVE EXT-JULIAN-END       TO SQL-DATE-YYYYMMDD
              PERFORM SQL-SET-DATE
              MOVE SQL-DATE-YYYY-MM-DD  TO QTY1-WEND-DATE
              MOVE TY-CLASS             TO QTY1-WBEG-CLASS
              MOVE ALL "9"              TO QTY1-WEND-CLASS.

           EXEC SQL
            DECLARE TY1_CURSOR CURSOR FOR
            SELECT TYFILE.TY_BRNO,
                   CAST(TYFILE.TY_DATE AS VARCHAR(10)),
                   TYFILE.TY_CLASS,
                   CAST(TYFILE.TY_LTOUCH_DATE
                                                  AS VARCHAR(10)),
                   TYFILE.TY_NO_1_1,
                   TYFILE.TY_AMT_1_1,
                   TYFILE.TY_O2_1_1,
                   TYFILE.TY_INT_1_1,
                   TYFILE.TY_NO_1_2,
                   TYFILE.TY_AMT_1_2,
                   TYFILE.TY_O2_1_2,
                   TYFILE.TY_INT_1_2,
                   TYFILE.TY_NO_1_3,
                   TYFILE.TY_AMT_1_3,
                   TYFILE.TY_O2_1_3,
                   TYFILE.TY_INT_1_3,
                   TYFILE.TY_NO_1_4,
                   TYFILE.TY_AMT_1_4,
                   TYFILE.TY_O2_1_4,
                   TYFILE.TY_INT_1_4,
                   TYFILE.TY_NO_1_5,
                   TYFILE.TY_AMT_1_5,
                   TYFILE.TY_O2_1_5,
                   TYFILE.TY_INT_1_5,
                   TYFILE.TY_NO_1_6,
                   TYFILE.TY_AMT_1_6,
                   TYFILE.TY_O2_1_6,
                   TYFILE.TY_INT_1_6,
                   TYFILE.TY_NO_1_7,
                   TYFILE.TY_AMT_1_7,
                   TYFILE.TY_O2_1_7,
                   TYFILE.TY_INT_1_7,
                   TYFILE.TY_NO_1_8,
                   TYFILE.TY_AMT_1_8,
                   TYFILE.TY_O2_1_8,
                   TYFILE.TY_INT_1_8,
                   TYFILE.TY_NO_1_9,
                   TYFILE.TY_AMT_1_9,
                   TYFILE.TY_O2_1_9,
                   TYFILE.TY_INT_1_9,
                   TYFILE.TY_NO_1_10,
                   TYFILE.TY_AMT_1_10,
                   TYFILE.TY_O2_1_10,
                   TYFILE.TY_INT_1_10,
                   TYFILE.TY_NO_1_11,
                   TYFILE.TY_AMT_1_11,
                   TYFILE.TY_O2_1_11,
                   TYFILE.TY_INT_1_11,
                   TYFILE.TY_NO_2_1,
                   TYFILE.TY_AMT_2_1,
                   TYFILE.TY_O2_2_1,
                   TYFILE.TY_INT_2_1,
                   TYFILE.TY_NO_2_2,
                   TYFILE.TY_AMT_2_2,
                   TYFILE.TY_O2_2_2,
                   TYFILE.TY_INT_2_2,
                   TYFILE.TY_NO_2_3,
                   TYFILE.TY_AMT_2_3,
                   TYFILE.TY_O2_2_3,
                   TYFILE.TY_INT_2_3,
                   TYFILE.TY_NO_2_4,
                   TYFILE.TY_AMT_2_4,
                   TYFILE.TY_O2_2_4,
                   TYFILE.TY_INT_2_4,
                   TYFILE.TY_NO_2_5,
                   TYFILE.TY_AMT_2_5,
                   TYFILE.TY_O2_2_5,
                   TYFILE.TY_INT_2_5,
                   TYFILE.TY_NO_2_6,
                   TYFILE.TY_AMT_2_6,
                   TYFILE.TY_O2_2_6,
                   TYFILE.TY_INT_2_6,
                   TYFILE.TY_NO_2_7,
                   TYFILE.TY_AMT_2_7,
                   TYFILE.TY_O2_2_7,
                   TYFILE.TY_INT_2_7,
                   TYFILE.TY_NO_2_8,
                   TYFILE.TY_AMT_2_8,
                   TYFILE.TY_O2_2_8,
                   TYFILE.TY_INT_2_8,
                   TYFILE.TY_NO_2_9,
                   TYFILE.TY_AMT_2_9,
                   TYFILE.TY_O2_2_9,
                   TYFILE.TY_INT_2_9,
                   TYFILE.TY_NO_2_10,
                   TYFILE.TY_AMT_2_10,
                   TYFILE.TY_O2_2_10,
                   TYFILE.TY_INT_2_10,
                   TYFILE.TY_NO_2_11,
                   TYFILE.TY_AMT_2_11,
                   TYFILE.TY_O2_2_11,
                   TYFILE.TY_INT_2_11,
                   TYFILE.TY_NO_REPO_1_1,
                   TYFILE.TY_AMT_REPO_1_1,
                   TYFILE.TY_O2_REPO_1_1,
                   TYFILE.TY_INT_REPO_1_1,
                   TYFILE.TY_NO_REPO_1_2,
                   TYFILE.TY_AMT_REPO_1_2,
                   TYFILE.TY_O2_REPO_1_2,
                   TYFILE.TY_INT_REPO_1_2,
                   TYFILE.TY_NO_REPO_1_3,
                   TYFILE.TY_AMT_REPO_1_3,
                   TYFILE.TY_O2_REPO_1_3,
                   TYFILE.TY_INT_REPO_1_3,
                   TYFILE.TY_NO_REPO_1_4,
                   TYFILE.TY_AMT_REPO_1_4,
                   TYFILE.TY_O2_REPO_1_4,
                   TYFILE.TY_INT_REPO_1_4,
                   TYFILE.TY_NO_REPO_1_5,
                   TYFILE.TY_AMT_REPO_1_5,
                   TYFILE.TY_O2_REPO_1_5,
                   TYFILE.TY_INT_REPO_1_5,
                   TYFILE.TY_NO_REPO_2_1,
                   TYFILE.TY_AMT_REPO_2_1,
                   TYFILE.TY_O2_REPO_2_1,
                   TYFILE.TY_INT_REPO_2_1,
                   TYFILE.TY_NO_REPO_2_2,
                   TYFILE.TY_AMT_REPO_2_2,
                   TYFILE.TY_O2_REPO_2_2,
                   TYFILE.TY_INT_REPO_2_2,
                   TYFILE.TY_NO_REPO_2_3,
                   TYFILE.TY_AMT_REPO_2_3,
                   TYFILE.TY_O2_REPO_2_3,
                   TYFILE.TY_INT_REPO_2_3,
                   TYFILE.TY_NO_REPO_2_4,
                   TYFILE.TY_AMT_REPO_2_4,
                   TYFILE.TY_O2_REPO_2_4,
                   TYFILE.TY_INT_REPO_2_4,
                   TYFILE.TY_NO_REPO_2_5,
                   TYFILE.TY_AMT_REPO_2_5,
                   TYFILE.TY_O2_REPO_2_5,
                   TYFILE.TY_INT_REPO_2_5,
                   TYFILE.TY_NO_PL_1_1,
                   TYFILE.TY_AMT_PL_1_1,
                   TYFILE.TY_O2_PL_1_1,
                   TYFILE.TY_INT_PL_1_1,
                   TYFILE.TY_NO_PL_1_2,
                   TYFILE.TY_AMT_PL_1_2,
                   TYFILE.TY_O2_PL_1_2,
                   TYFILE.TY_INT_PL_1_2,
                   TYFILE.TY_NO_PL_1_3,
                   TYFILE.TY_AMT_PL_1_3,
                   TYFILE.TY_O2_PL_1_3,
                   TYFILE.TY_INT_PL_1_3,
                   TYFILE.TY_NO_PL_1_4,
                   TYFILE.TY_AMT_PL_1_4,
                   TYFILE.TY_O2_PL_1_4,
                   TYFILE.TY_INT_PL_1_4,
                   TYFILE.TY_NO_PL_1_5,
                   TYFILE.TY_AMT_PL_1_5,
                   TYFILE.TY_O2_PL_1_5,
                   TYFILE.TY_INT_PL_1_5,
                   TYFILE.TY_NO_PL_1_6,
                   TYFILE.TY_AMT_PL_1_6,
                   TYFILE.TY_O2_PL_1_6,
                   TYFILE.TY_INT_PL_1_6,
                   TYFILE.TY_NO_PL_1_7,
                   TYFILE.TY_AMT_PL_1_7,
                   TYFILE.TY_O2_PL_1_7,
                   TYFILE.TY_INT_PL_1_7,
                   TYFILE.TY_NO_PL_1_8,
                   TYFILE.TY_AMT_PL_1_8,
                   TYFILE.TY_O2_PL_1_8,
                   TYFILE.TY_INT_PL_1_8,
                   TYFILE.TY_NO_PL_1_9,
                   TYFILE.TY_AMT_PL_1_9,
                   TYFILE.TY_O2_PL_1_9,
                   TYFILE.TY_INT_PL_1_9,
                   TYFILE.TY_NO_PL_1_10,
                   TYFILE.TY_AMT_PL_1_10,
                   TYFILE.TY_O2_PL_1_10,
                   TYFILE.TY_INT_PL_1_10,
                   TYFILE.TY_NO_PL_2_1,
                   TYFILE.TY_AMT_PL_2_1,
                   TYFILE.TY_O2_PL_2_1,
                   TYFILE.TY_INT_PL_2_1,
                   TYFILE.TY_NO_PL_2_2,
                   TYFILE.TY_AMT_PL_2_2,
                   TYFILE.TY_O2_PL_2_2,
                   TYFILE.TY_INT_PL_2_2,
                   TYFILE.TY_NO_PL_2_3,
                   TYFILE.TY_AMT_PL_2_3,
                   TYFILE.TY_O2_PL_2_3,
                   TYFILE.TY_INT_PL_2_3,
                   TYFILE.TY_NO_PL_2_4,
                   TYFILE.TY_AMT_PL_2_4,
                   TYFILE.TY_O2_PL_2_4,
                   TYFILE.TY_INT_PL_2_4,
                   TYFILE.TY_NO_PL_2_5,
                   TYFILE.TY_AMT_PL_2_5,
                   TYFILE.TY_O2_PL_2_5,
                   TYFILE.TY_INT_PL_2_5,
                   TYFILE.TY_NO_PL_2_6,
                   TYFILE.TY_AMT_PL_2_6,
                   TYFILE.TY_O2_PL_2_6,
                   TYFILE.TY_INT_PL_2_6,
                   TYFILE.TY_NO_PL_2_7,
                   TYFILE.TY_AMT_PL_2_7,
                   TYFILE.TY_O2_PL_2_7,
                   TYFILE.TY_INT_PL_2_7,
                   TYFILE.TY_NO_PL_2_8,
                   TYFILE.TY_AMT_PL_2_8,
                   TYFILE.TY_O2_PL_2_8,
                   TYFILE.TY_INT_PL_2_8,
                   TYFILE.TY_NO_PL_2_9,
                   TYFILE.TY_AMT_PL_2_9,
                   TYFILE.TY_O2_PL_2_9,
                   TYFILE.TY_INT_PL_2_9,
                   TYFILE.TY_NO_PL_2_10,
                   TYFILE.TY_AMT_PL_2_10,
                   TYFILE.TY_O2_PL_2_10,
                   TYFILE.TY_INT_PL_2_10,
                   TYFILE.TY_DLRVPRIN_1_1,
                   TYFILE.TY_DLRVPRIN_1_2,
                   TYFILE.TY_DLRVPRIN_1_3,
                   TYFILE.TY_DLRVCHGS_1_1,
                   TYFILE.TY_DLRVCHGS_1_2,
                   TYFILE.TY_DLRVCHGS_1_3,
                   TYFILE.TY_DLPARVHELD_1,
                   TYFILE.TY_DLRVPRIN_2_1,
                   TYFILE.TY_DLRVPRIN_2_2,
                   TYFILE.TY_DLRVPRIN_2_3,
                   TYFILE.TY_DLRVCHGS_2_1,
                   TYFILE.TY_DLRVCHGS_2_2,
                   TYFILE.TY_DLRVCHGS_2_3,
                   TYFILE.TY_DLPARVHELD_2,
                   TYFILE.TY_PL_PRINCOL_1,
                   TYFILE.TY_PL_INTCOL_1,
                   TYFILE.TY_PL_LATECOL_1,
                   TYFILE.TY_PL_O2COL_1,
                   TYFILE.TY_PL_PRINCOL_2,
                   TYFILE.TY_PL_INTCOL_2,
                   TYFILE.TY_PL_LATECOL_2,
                   TYFILE.TY_PL_O2COL_2,
                   TYFILE.TY_PL_PRINCOL_3,
                   TYFILE.TY_PL_INTCOL_3,
                   TYFILE.TY_PL_LATECOL_3,
                   TYFILE.TY_PL_O2COL_3,
                   TYFILE.TY_PL_PRINCOL_4,
                   TYFILE.TY_PL_INTCOL_4,
                   TYFILE.TY_PL_LATECOL_4,
                   TYFILE.TY_PL_O2COL_4,
                   TYFILE.TY_PL_PRINCOL_5,
                   TYFILE.TY_PL_INTCOL_5,
                   TYFILE.TY_PL_LATECOL_5,
                   TYFILE.TY_PL_O2COL_5,
                   TYFILE.TY_AMT_SOLD,
                   TYFILE.TY_AMT_TRANS,
                   TYFILE.TY_AMT_PURCH,
                   TYFILE.TY_NO_SOLD,
                   TYFILE.TY_NO_TRANS,
                   TYFILE.TY_NO_PURCH,
                   TYFILE.TY_OTHCOL,
                   TYFILE.TY_OT2COL,
                   TYFILE.TY_INTCOL,
                   TYFILE.TY_LATECOL,
                   TYFILE.TY_PRINCOL,
                   TYFILE.TY_DEFCOL,
                   TYFILE.TY_RNPRIN,
                   TYFILE.TY_INTREB,
                   TYFILE.TY_CLREB1,
                   TYFILE.TY_CLREB2,
                   TYFILE.TY_CLREB3,
                   TYFILE.TY_CLREB4,
                   TYFILE.TY_AHREB,
                   TYFILE.TY_PPREB,
                   TYFILE.TY_O1REB,
                   TYFILE.TY_O2REB,
                   TYFILE.TY_O3REB,
                   TYFILE.TY_O4REB,
                   TYFILE.TY_O5REB,
                   TYFILE.TY_O6REB,
                   TYFILE.TY_O7REB,
                   TYFILE.TY_SCREB,
                   TYFILE.TY_MFREB,
                   TYFILE.TY_DFREB,
                   TYFILE.TY_UN7_REB,
                   TYFILE.TY_UN8_REB,
                   TYFILE.TY_UN9_REB,
                   TYFILE.TY_UN10_REB,
                   TYFILE.TY_PART_CHGOFF,
                   TYFILE.TY_INS_NO_ELIG_1,
                   TYFILE.TY_INS_NO_WROTE_1,
                   TYFILE.TY_INS_NO_NOTWROTE_1,
                   TYFILE.TY_INS_AMT_WROTE_1,
                   TYFILE.TY_INS_NO_ELIG_2,
                   TYFILE.TY_INS_NO_WROTE_2,
                   TYFILE.TY_INS_NO_NOTWROTE_2,
                   TYFILE.TY_INS_AMT_WROTE_2,
                   TYFILE.TY_INS_NO_ELIG_3,
                   TYFILE.TY_INS_NO_WROTE_3,
                   TYFILE.TY_INS_NO_NOTWROTE_3,
                   TYFILE.TY_INS_AMT_WROTE_3,
                   TYFILE.TY_INS_NO_ELIG_4,
                   TYFILE.TY_INS_NO_WROTE_4,
                   TYFILE.TY_INS_NO_NOTWROTE_4,
                   TYFILE.TY_INS_AMT_WROTE_4,
                   TYFILE.TY_INS_NO_ELIG_5,
                   TYFILE.TY_INS_NO_WROTE_5,
                   TYFILE.TY_INS_NO_NOTWROTE_5,
                   TYFILE.TY_INS_AMT_WROTE_5,
                   TYFILE.TY_INS_NO_ELIG_6,
                   TYFILE.TY_INS_NO_WROTE_6,
                   TYFILE.TY_INS_NO_NOTWROTE_6,
                   TYFILE.TY_INS_AMT_WROTE_6,
                   TYFILE.TY_INS_NO_ELIG_7,
                   TYFILE.TY_INS_NO_WROTE_7,
                   TYFILE.TY_INS_NO_NOTWROTE_7,
                   TYFILE.TY_INS_AMT_WROTE_7,
                   TYFILE.TY_INS_NO_ELIG_8,
                   TYFILE.TY_INS_NO_WROTE_8,
                   TYFILE.TY_INS_NO_NOTWROTE_8,
                   TYFILE.TY_INS_AMT_WROTE_8,
                   TYFILE.TY_INS_NO_ELIG_9,
                   TYFILE.TY_INS_NO_WROTE_9,
                   TYFILE.TY_INS_NO_NOTWROTE_9,
                   TYFILE.TY_INS_AMT_WROTE_9,
                   TYFILE.TY_INS_NO_ELIG_10,
                   TYFILE.TY_INS_NO_WROTE_10,
                   TYFILE.TY_INS_NO_NOTWROTE_10,
                   TYFILE.TY_INS_AMT_WROTE_10,
                   TYFILE.TY_FEE_NO_ELIG_1,
                   TYFILE.TY_FEE_NO_WROTE_1,
                   TYFILE.TY_FEE_NO_NOTWROTE_1,
                   TYFILE.TY_FEE_AMT_WROTE_1,
                   TYFILE.TY_FEE_NO_ELIG_2,
                   TYFILE.TY_FEE_NO_WROTE_2,
                   TYFILE.TY_FEE_NO_NOTWROTE_2,
                   TYFILE.TY_FEE_AMT_WROTE_2,
                   TYFILE.TY_FEE_NO_ELIG_3,
                   TYFILE.TY_FEE_NO_WROTE_3,
                   TYFILE.TY_FEE_NO_NOTWROTE_3,
                   TYFILE.TY_FEE_AMT_WROTE_3,
                   TYFILE.TY_OTH_NO_COL,
                   TYFILE.TY_OT2_NO_COL,
                   TYFILE.TY_INT_NO_COL,
                   TYFILE.TY_LATE_NO_COL,
                   TYFILE.TY_OTH_NO_WAIVED,
                   TYFILE.TY_OT2_NO_WAIVED,
                   TYFILE.TY_INT_NO_WAIVED,
                   TYFILE.TY_LATE_NO_WAIVED,
                   TYFILE.TY_OTH_AMT_WAIVED,
                   TYFILE.TY_OT2_AMT_WAIVED,
                   TYFILE.TY_INT_AMT_WAIVED,
                   TYFILE.TY_LATE_AMT_WAIVED,
                   TYFILE.TY_CKWRITTEN_1,
                   TYFILE.TY_CKWRITTEN_2,
                   TYFILE.TY_CKWRITTEN_3,
                   TYFILE.TY_CKWRITTEN_4,
                   TYFILE.TY_CKWRITTEN_5,
                   TYFILE.TY_CKWRITTEN_6,
                   TYFILE.TY_CKWRITTEN_7,
                   TYFILE.TY_CKWRITTEN_8,
                   TYFILE.TY_CKWRITTEN_9,
                   TYFILE.TY_CKWRITTEN_10,
                   TYFILE.TY_CKWRITTEN_11,
                   TYFILE.TY_CKWRITTEN_12,
                   TYFILE.TY_CKWRITTEN_13,
                   TYFILE.TY_CKWRITTEN_14,
                   TYFILE.TY_CKWRITTEN_15,
                   TYFILE.TY_CKWRITTEN_16,
                   TYFILE.TY_UNITS_1_1,
                   TYFILE.TY_OUTBAL_1_1,
                   TYFILE.TY_UNITS_1_2,
                   TYFILE.TY_OUTBAL_1_2,
                   TYFILE.TY_UNITS_1_3,
                   TYFILE.TY_OUTBAL_1_3,
                   TYFILE.TY_UNITS_1_4,
                   TYFILE.TY_OUTBAL_1_4,
                   TYFILE.TY_UNITS_1_5,
                   TYFILE.TY_OUTBAL_1_5,
                   TYFILE.TY_UNITS_1_6,
                   TYFILE.TY_OUTBAL_1_6,
                   TYFILE.TY_UNITS_1_7,
                   TYFILE.TY_OUTBAL_1_7,
                   TYFILE.TY_UNITS_1_8,
                   TYFILE.TY_OUTBAL_1_8,
                   TYFILE.TY_UNITS_1_9,
                   TYFILE.TY_OUTBAL_1_9,
                   TYFILE.TY_UNITS_1_10,
                   TYFILE.TY_OUTBAL_1_10,
                   TYFILE.TY_UNITS_2_1,
                   TYFILE.TY_OUTBAL_2_1,
                   TYFILE.TY_UNITS_2_2,
                   TYFILE.TY_OUTBAL_2_2,
                   TYFILE.TY_UNITS_2_3,
                   TYFILE.TY_OUTBAL_2_3,
                   TYFILE.TY_UNITS_2_4,
                   TYFILE.TY_OUTBAL_2_4,
                   TYFILE.TY_UNITS_2_5,
                   TYFILE.TY_OUTBAL_2_5,
                   TYFILE.TY_UNITS_2_6,
                   TYFILE.TY_OUTBAL_2_6,
                   TYFILE.TY_UNITS_2_7,
                   TYFILE.TY_OUTBAL_2_7,
                   TYFILE.TY_UNITS_2_8,
                   TYFILE.TY_OUTBAL_2_8,
                   TYFILE.TY_UNITS_2_9,
                   TYFILE.TY_OUTBAL_2_9,
                   TYFILE.TY_UNITS_2_10,
                   TYFILE.TY_OUTBAL_2_10,
                   TYFILE.TY_UNITS_BNKRPT_1_1,
                   TYFILE.TY_OUTBAL_BNKRPT_1_1,
                   TYFILE.TY_UNITS_BNKRPT_1_2,
                   TYFILE.TY_OUTBAL_BNKRPT_1_2,
                   TYFILE.TY_UNITS_BNKRPT_1_3,
                   TYFILE.TY_OUTBAL_BNKRPT_1_3,
                   TYFILE.TY_UNITS_BNKRPT_1_4,
                   TYFILE.TY_OUTBAL_BNKRPT_1_4,
                   TYFILE.TY_UNITS_BNKRPT_1_5,
                   TYFILE.TY_OUTBAL_BNKRPT_1_5,
                   TYFILE.TY_UNITS_BNKRPT_1_6,
                   TYFILE.TY_OUTBAL_BNKRPT_1_6,
                   TYFILE.TY_UNITS_BNKRPT_1_7,
                   TYFILE.TY_OUTBAL_BNKRPT_1_7,
                   TYFILE.TY_UNITS_BNKRPT_1_8,
                   TYFILE.TY_OUTBAL_BNKRPT_1_8,
                   TYFILE.TY_UNITS_BNKRPT_1_9,
                   TYFILE.TY_OUTBAL_BNKRPT_1_9,
                   TYFILE.TY_UNITS_BNKRPT_1_10,
                   TYFILE.TY_OUTBAL_BNKRPT_1_10,
                   TYFILE.TY_UNITS_BNKRPT_2_1,
                   TYFILE.TY_OUTBAL_BNKRPT_2_1,
                   TYFILE.TY_UNITS_BNKRPT_2_2,
                   TYFILE.TY_OUTBAL_BNKRPT_2_2,
                   TYFILE.TY_UNITS_BNKRPT_2_3,
                   TYFILE.TY_OUTBAL_BNKRPT_2_3,
                   TYFILE.TY_UNITS_BNKRPT_2_4,
                   TYFILE.TY_OUTBAL_BNKRPT_2_4,
                   TYFILE.TY_UNITS_BNKRPT_2_5,
                   TYFILE.TY_OUTBAL_BNKRPT_2_5,
                   TYFILE.TY_UNITS_BNKRPT_2_6,
                   TYFILE.TY_OUTBAL_BNKRPT_2_6,
                   TYFILE.TY_UNITS_BNKRPT_2_7,
                   TYFILE.TY_OUTBAL_BNKRPT_2_7,
                   TYFILE.TY_UNITS_BNKRPT_2_8,
                   TYFILE.TY_OUTBAL_BNKRPT_2_8,
                   TYFILE.TY_UNITS_BNKRPT_2_9,
                   TYFILE.TY_OUTBAL_BNKRPT_2_9,
                   TYFILE.TY_UNITS_BNKRPT_2_10,
                   TYFILE.TY_OUTBAL_BNKRPT_2_10,
                   TYFILE.TY_SUMWGTTM,
                   TYFILE.TY_SUMWGTAV,
                   TYFILE.TY_SUMWGTTA,
                   TYFILE.TY_ALLOTMENTS,
                   TYFILE.TY_BRFG,
                   TYFILE.TY_DLDISC,
                   TYFILE.TY_UNEARNED_AMT_1_1,
                   TYFILE.TY_UNEARNED_AMT_1_2,
                   TYFILE.TY_UNEARNED_AMT_1_3,
                   TYFILE.TY_UNEARNED_AMT_1_4,
                   TYFILE.TY_UNEARNED_AMT_1_5,
                   TYFILE.TY_UNEARNED_AMT_1_6,
                   TYFILE.TY_UNEARNED_AMT_1_7,
                   TYFILE.TY_UNEARNED_AMT_1_8,
                   TYFILE.TY_UNEARNED_AMT_1_9,
                   TYFILE.TY_UNEARNED_AMT_1_10,
                   TYFILE.TY_UNEARNED_AMT_2_1,
                   TYFILE.TY_UNEARNED_AMT_2_2,
                   TYFILE.TY_UNEARNED_AMT_2_3,
                   TYFILE.TY_UNEARNED_AMT_2_4,
                   TYFILE.TY_UNEARNED_AMT_2_5,
                   TYFILE.TY_UNEARNED_AMT_2_6,
                   TYFILE.TY_UNEARNED_AMT_2_7,
                   TYFILE.TY_UNEARNED_AMT_2_8,
                   TYFILE.TY_UNEARNED_AMT_2_9,
                   TYFILE.TY_UNEARNED_AMT_2_10,
                   TYFILE.TY_PROCEEDS,
                   TYFILE.TY_LOCKBOX
            FROM DBO.TYFILE
            WHERE TYFILE.TY_BRNO  = :QTY1-WBEG-BRNO
              AND TYFILE.TY_DATE >= :QTY1-WBEG-DATE
              AND TYFILE.TY_DATE <= :QTY1-WEND-DATE 
              AND TYFILE.TY_CLASS >= :QTY1-WBEG-CLASS
              AND TYFILE.TY_CLASS <= :QTY1-WEND-CLASS
            ORDER BY TYFILE.TY_BRNO,
                     TYFILE.TY_DATE,
                     TYFILE.TY_CLASS
           END-EXEC.

           EXEC SQL
               OPEN TY1_CURSOR
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           MOVE ZEROES TO QTY1-WBEG-BRNO
                          QTY1-WEND-BRNO
                          QTY1-WBEG-CLASS
                          QTY1-WEND-CLASS.

           MOVE SPACES TO QTY1-WBEG-DATE
                          QTY1-WEND-DATE.

           MOVE STAT---GOOD TO TY1-CURSOR-STAT.

      *-----------------------------------------------------------------
       READ-TY1-FILE.
           PERFORM READ-IT.
           MOVE TY-PATH-OWNBR  TO TY-BRNO. 
           MOVE TY-PATH-SQL    TO E-FILE.
           MOVE TY1-KEY        TO E-KEYX.
           INITIALIZE QTY-REC.

           MOVE TY-BRNO             TO QTY-BRNO.
           MOVE TY-DATE             TO SQL-DATE-YYYYMMDD.
           PERFORM SQL-SET-DATE.
           MOVE SQL-DATE-YYYY-MM-DD TO QTY-DATE.
           MOVE TY-CLASS           TO QTY-CLASS.

           EXEC SQL
            SELECT TYFILE.TY_BRNO,
                   CAST(TYFILE.TY_DATE AS VARCHAR(10)),
                   TYFILE.TY_CLASS,
                   CAST(TYFILE.TY_LTOUCH_DATE
                                                  AS VARCHAR(10)),
                   TYFILE.TY_NO_1_1,
                   TYFILE.TY_AMT_1_1,
                   TYFILE.TY_O2_1_1,
                   TYFILE.TY_INT_1_1,
                   TYFILE.TY_NO_1_2,
                   TYFILE.TY_AMT_1_2,
                   TYFILE.TY_O2_1_2,
                   TYFILE.TY_INT_1_2,
                   TYFILE.TY_NO_1_3,
                   TYFILE.TY_AMT_1_3,
                   TYFILE.TY_O2_1_3,
                   TYFILE.TY_INT_1_3,
                   TYFILE.TY_NO_1_4,
                   TYFILE.TY_AMT_1_4,
                   TYFILE.TY_O2_1_4,
                   TYFILE.TY_INT_1_4,
                   TYFILE.TY_NO_1_5,
                   TYFILE.TY_AMT_1_5,
                   TYFILE.TY_O2_1_5,
                   TYFILE.TY_INT_1_5,
                   TYFILE.TY_NO_1_6,
                   TYFILE.TY_AMT_1_6,
                   TYFILE.TY_O2_1_6,
                   TYFILE.TY_INT_1_6,
                   TYFILE.TY_NO_1_7,
                   TYFILE.TY_AMT_1_7,
                   TYFILE.TY_O2_1_7,
                   TYFILE.TY_INT_1_7,
                   TYFILE.TY_NO_1_8,
                   TYFILE.TY_AMT_1_8,
                   TYFILE.TY_O2_1_8,
                   TYFILE.TY_INT_1_8,
                   TYFILE.TY_NO_1_9,
                   TYFILE.TY_AMT_1_9,
                   TYFILE.TY_O2_1_9,
                   TYFILE.TY_INT_1_9,
                   TYFILE.TY_NO_1_10,
                   TYFILE.TY_AMT_1_10,
                   TYFILE.TY_O2_1_10,
                   TYFILE.TY_INT_1_10,
                   TYFILE.TY_NO_1_11,
                   TYFILE.TY_AMT_1_11,
                   TYFILE.TY_O2_1_11,
                   TYFILE.TY_INT_1_11,
                   TYFILE.TY_NO_2_1,
                   TYFILE.TY_AMT_2_1,
                   TYFILE.TY_O2_2_1,
                   TYFILE.TY_INT_2_1,
                   TYFILE.TY_NO_2_2,
                   TYFILE.TY_AMT_2_2,
                   TYFILE.TY_O2_2_2,
                   TYFILE.TY_INT_2_2,
                   TYFILE.TY_NO_2_3,
                   TYFILE.TY_AMT_2_3,
                   TYFILE.TY_O2_2_3,
                   TYFILE.TY_INT_2_3,
                   TYFILE.TY_NO_2_4,
                   TYFILE.TY_AMT_2_4,
                   TYFILE.TY_O2_2_4,
                   TYFILE.TY_INT_2_4,
                   TYFILE.TY_NO_2_5,
                   TYFILE.TY_AMT_2_5,
                   TYFILE.TY_O2_2_5,
                   TYFILE.TY_INT_2_5,
                   TYFILE.TY_NO_2_6,
                   TYFILE.TY_AMT_2_6,
                   TYFILE.TY_O2_2_6,
                   TYFILE.TY_INT_2_6,
                   TYFILE.TY_NO_2_7,
                   TYFILE.TY_AMT_2_7,
                   TYFILE.TY_O2_2_7,
                   TYFILE.TY_INT_2_7,
                   TYFILE.TY_NO_2_8,
                   TYFILE.TY_AMT_2_8,
                   TYFILE.TY_O2_2_8,
                   TYFILE.TY_INT_2_8,
                   TYFILE.TY_NO_2_9,
                   TYFILE.TY_AMT_2_9,
                   TYFILE.TY_O2_2_9,
                   TYFILE.TY_INT_2_9,
                   TYFILE.TY_NO_2_10,
                   TYFILE.TY_AMT_2_10,
                   TYFILE.TY_O2_2_10,
                   TYFILE.TY_INT_2_10,
                   TYFILE.TY_NO_2_11,
                   TYFILE.TY_AMT_2_11,
                   TYFILE.TY_O2_2_11,
                   TYFILE.TY_INT_2_11,
                   TYFILE.TY_NO_REPO_1_1,
                   TYFILE.TY_AMT_REPO_1_1,
                   TYFILE.TY_O2_REPO_1_1,
                   TYFILE.TY_INT_REPO_1_1,
                   TYFILE.TY_NO_REPO_1_2,
                   TYFILE.TY_AMT_REPO_1_2,
                   TYFILE.TY_O2_REPO_1_2,
                   TYFILE.TY_INT_REPO_1_2,
                   TYFILE.TY_NO_REPO_1_3,
                   TYFILE.TY_AMT_REPO_1_3,
                   TYFILE.TY_O2_REPO_1_3,
                   TYFILE.TY_INT_REPO_1_3,
                   TYFILE.TY_NO_REPO_1_4,
                   TYFILE.TY_AMT_REPO_1_4,
                   TYFILE.TY_O2_REPO_1_4,
                   TYFILE.TY_INT_REPO_1_4,
                   TYFILE.TY_NO_REPO_1_5,
                   TYFILE.TY_AMT_REPO_1_5,
                   TYFILE.TY_O2_REPO_1_5,
                   TYFILE.TY_INT_REPO_1_5,
                   TYFILE.TY_NO_REPO_2_1,
                   TYFILE.TY_AMT_REPO_2_1,
                   TYFILE.TY_O2_REPO_2_1,
                   TYFILE.TY_INT_REPO_2_1,
                   TYFILE.TY_NO_REPO_2_2,
                   TYFILE.TY_AMT_REPO_2_2,
                   TYFILE.TY_O2_REPO_2_2,
                   TYFILE.TY_INT_REPO_2_2,
                   TYFILE.TY_NO_REPO_2_3,
                   TYFILE.TY_AMT_REPO_2_3,
                   TYFILE.TY_O2_REPO_2_3,
                   TYFILE.TY_INT_REPO_2_3,
                   TYFILE.TY_NO_REPO_2_4,
                   TYFILE.TY_AMT_REPO_2_4,
                   TYFILE.TY_O2_REPO_2_4,
                   TYFILE.TY_INT_REPO_2_4,
                   TYFILE.TY_NO_REPO_2_5,
                   TYFILE.TY_AMT_REPO_2_5,
                   TYFILE.TY_O2_REPO_2_5,
                   TYFILE.TY_INT_REPO_2_5,
                   TYFILE.TY_NO_PL_1_1,
                   TYFILE.TY_AMT_PL_1_1,
                   TYFILE.TY_O2_PL_1_1,
                   TYFILE.TY_INT_PL_1_1,
                   TYFILE.TY_NO_PL_1_2,
                   TYFILE.TY_AMT_PL_1_2,
                   TYFILE.TY_O2_PL_1_2,
                   TYFILE.TY_INT_PL_1_2,
                   TYFILE.TY_NO_PL_1_3,
                   TYFILE.TY_AMT_PL_1_3,
                   TYFILE.TY_O2_PL_1_3,
                   TYFILE.TY_INT_PL_1_3,
                   TYFILE.TY_NO_PL_1_4,
                   TYFILE.TY_AMT_PL_1_4,
                   TYFILE.TY_O2_PL_1_4,
                   TYFILE.TY_INT_PL_1_4,
                   TYFILE.TY_NO_PL_1_5,
                   TYFILE.TY_AMT_PL_1_5,
                   TYFILE.TY_O2_PL_1_5,
                   TYFILE.TY_INT_PL_1_5,
                   TYFILE.TY_NO_PL_1_6,
                   TYFILE.TY_AMT_PL_1_6,
                   TYFILE.TY_O2_PL_1_6,
                   TYFILE.TY_INT_PL_1_6,
                   TYFILE.TY_NO_PL_1_7,
                   TYFILE.TY_AMT_PL_1_7,
                   TYFILE.TY_O2_PL_1_7,
                   TYFILE.TY_INT_PL_1_7,
                   TYFILE.TY_NO_PL_1_8,
                   TYFILE.TY_AMT_PL_1_8,
                   TYFILE.TY_O2_PL_1_8,
                   TYFILE.TY_INT_PL_1_8,
                   TYFILE.TY_NO_PL_1_9,
                   TYFILE.TY_AMT_PL_1_9,
                   TYFILE.TY_O2_PL_1_9,
                   TYFILE.TY_INT_PL_1_9,
                   TYFILE.TY_NO_PL_1_10,
                   TYFILE.TY_AMT_PL_1_10,
                   TYFILE.TY_O2_PL_1_10,
                   TYFILE.TY_INT_PL_1_10,
                   TYFILE.TY_NO_PL_2_1,
                   TYFILE.TY_AMT_PL_2_1,
                   TYFILE.TY_O2_PL_2_1,
                   TYFILE.TY_INT_PL_2_1,
                   TYFILE.TY_NO_PL_2_2,
                   TYFILE.TY_AMT_PL_2_2,
                   TYFILE.TY_O2_PL_2_2,
                   TYFILE.TY_INT_PL_2_2,
                   TYFILE.TY_NO_PL_2_3,
                   TYFILE.TY_AMT_PL_2_3,
                   TYFILE.TY_O2_PL_2_3,
                   TYFILE.TY_INT_PL_2_3,
                   TYFILE.TY_NO_PL_2_4,
                   TYFILE.TY_AMT_PL_2_4,
                   TYFILE.TY_O2_PL_2_4,
                   TYFILE.TY_INT_PL_2_4,
                   TYFILE.TY_NO_PL_2_5,
                   TYFILE.TY_AMT_PL_2_5,
                   TYFILE.TY_O2_PL_2_5,
                   TYFILE.TY_INT_PL_2_5,
                   TYFILE.TY_NO_PL_2_6,
                   TYFILE.TY_AMT_PL_2_6,
                   TYFILE.TY_O2_PL_2_6,
                   TYFILE.TY_INT_PL_2_6,
                   TYFILE.TY_NO_PL_2_7,
                   TYFILE.TY_AMT_PL_2_7,
                   TYFILE.TY_O2_PL_2_7,
                   TYFILE.TY_INT_PL_2_7,
                   TYFILE.TY_NO_PL_2_8,
                   TYFILE.TY_AMT_PL_2_8,
                   TYFILE.TY_O2_PL_2_8,
                   TYFILE.TY_INT_PL_2_8,
                   TYFILE.TY_NO_PL_2_9,
                   TYFILE.TY_AMT_PL_2_9,
                   TYFILE.TY_O2_PL_2_9,
                   TYFILE.TY_INT_PL_2_9,
                   TYFILE.TY_NO_PL_2_10,
                   TYFILE.TY_AMT_PL_2_10,
                   TYFILE.TY_O2_PL_2_10,
                   TYFILE.TY_INT_PL_2_10,
                   TYFILE.TY_DLRVPRIN_1_1,
                   TYFILE.TY_DLRVPRIN_1_2,
                   TYFILE.TY_DLRVPRIN_1_3,
                   TYFILE.TY_DLRVCHGS_1_1,
                   TYFILE.TY_DLRVCHGS_1_2,
                   TYFILE.TY_DLRVCHGS_1_3,
                   TYFILE.TY_DLPARVHELD_1,
                   TYFILE.TY_DLRVPRIN_2_1,
                   TYFILE.TY_DLRVPRIN_2_2,
                   TYFILE.TY_DLRVPRIN_2_3,
                   TYFILE.TY_DLRVCHGS_2_1,
                   TYFILE.TY_DLRVCHGS_2_2,
                   TYFILE.TY_DLRVCHGS_2_3,
                   TYFILE.TY_DLPARVHELD_2,
                   TYFILE.TY_PL_PRINCOL_1,
                   TYFILE.TY_PL_INTCOL_1,
                   TYFILE.TY_PL_LATECOL_1,
                   TYFILE.TY_PL_O2COL_1,
                   TYFILE.TY_PL_PRINCOL_2,
                   TYFILE.TY_PL_INTCOL_2,
                   TYFILE.TY_PL_LATECOL_2,
                   TYFILE.TY_PL_O2COL_2,
                   TYFILE.TY_PL_PRINCOL_3,
                   TYFILE.TY_PL_INTCOL_3,
                   TYFILE.TY_PL_LATECOL_3,
                   TYFILE.TY_PL_O2COL_3,
                   TYFILE.TY_PL_PRINCOL_4,
                   TYFILE.TY_PL_INTCOL_4,
                   TYFILE.TY_PL_LATECOL_4,
                   TYFILE.TY_PL_O2COL_4,
                   TYFILE.TY_PL_PRINCOL_5,
                   TYFILE.TY_PL_INTCOL_5,
                   TYFILE.TY_PL_LATECOL_5,
                   TYFILE.TY_PL_O2COL_5,
                   TYFILE.TY_AMT_SOLD,
                   TYFILE.TY_AMT_TRANS,
                   TYFILE.TY_AMT_PURCH,
                   TYFILE.TY_NO_SOLD,
                   TYFILE.TY_NO_TRANS,
                   TYFILE.TY_NO_PURCH,
                   TYFILE.TY_OTHCOL,
                   TYFILE.TY_OT2COL,
                   TYFILE.TY_INTCOL,
                   TYFILE.TY_LATECOL,
                   TYFILE.TY_PRINCOL,
                   TYFILE.TY_DEFCOL,
                   TYFILE.TY_RNPRIN,
                   TYFILE.TY_INTREB,
                   TYFILE.TY_CLREB1,
                   TYFILE.TY_CLREB2,
                   TYFILE.TY_CLREB3,
                   TYFILE.TY_CLREB4,
                   TYFILE.TY_AHREB,
                   TYFILE.TY_PPREB,
                   TYFILE.TY_O1REB,
                   TYFILE.TY_O2REB,
                   TYFILE.TY_O3REB,
                   TYFILE.TY_O4REB,
                   TYFILE.TY_O5REB,
                   TYFILE.TY_O6REB,
                   TYFILE.TY_O7REB,
                   TYFILE.TY_SCREB,
                   TYFILE.TY_MFREB,
                   TYFILE.TY_DFREB,
                   TYFILE.TY_UN7_REB,
                   TYFILE.TY_UN8_REB,
                   TYFILE.TY_UN9_REB,
                   TYFILE.TY_UN10_REB,
                   TYFILE.TY_PART_CHGOFF,
                   TYFILE.TY_INS_NO_ELIG_1,
                   TYFILE.TY_INS_NO_WROTE_1,
                   TYFILE.TY_INS_NO_NOTWROTE_1,
                   TYFILE.TY_INS_AMT_WROTE_1,
                   TYFILE.TY_INS_NO_ELIG_2,
                   TYFILE.TY_INS_NO_WROTE_2,
                   TYFILE.TY_INS_NO_NOTWROTE_2,
                   TYFILE.TY_INS_AMT_WROTE_2,
                   TYFILE.TY_INS_NO_ELIG_3,
                   TYFILE.TY_INS_NO_WROTE_3,
                   TYFILE.TY_INS_NO_NOTWROTE_3,
                   TYFILE.TY_INS_AMT_WROTE_3,
                   TYFILE.TY_INS_NO_ELIG_4,
                   TYFILE.TY_INS_NO_WROTE_4,
                   TYFILE.TY_INS_NO_NOTWROTE_4,
                   TYFILE.TY_INS_AMT_WROTE_4,
                   TYFILE.TY_INS_NO_ELIG_5,
                   TYFILE.TY_INS_NO_WROTE_5,
                   TYFILE.TY_INS_NO_NOTWROTE_5,
                   TYFILE.TY_INS_AMT_WROTE_5,
                   TYFILE.TY_INS_NO_ELIG_6,
                   TYFILE.TY_INS_NO_WROTE_6,
                   TYFILE.TY_INS_NO_NOTWROTE_6,
                   TYFILE.TY_INS_AMT_WROTE_6,
                   TYFILE.TY_INS_NO_ELIG_7,
                   TYFILE.TY_INS_NO_WROTE_7,
                   TYFILE.TY_INS_NO_NOTWROTE_7,
                   TYFILE.TY_INS_AMT_WROTE_7,
                   TYFILE.TY_INS_NO_ELIG_8,
                   TYFILE.TY_INS_NO_WROTE_8,
                   TYFILE.TY_INS_NO_NOTWROTE_8,
                   TYFILE.TY_INS_AMT_WROTE_8,
                   TYFILE.TY_INS_NO_ELIG_9,
                   TYFILE.TY_INS_NO_WROTE_9,
                   TYFILE.TY_INS_NO_NOTWROTE_9,
                   TYFILE.TY_INS_AMT_WROTE_9,
                   TYFILE.TY_INS_NO_ELIG_10,
                   TYFILE.TY_INS_NO_WROTE_10,
                   TYFILE.TY_INS_NO_NOTWROTE_10,
                   TYFILE.TY_INS_AMT_WROTE_10,
                   TYFILE.TY_FEE_NO_ELIG_1,
                   TYFILE.TY_FEE_NO_WROTE_1,
                   TYFILE.TY_FEE_NO_NOTWROTE_1,
                   TYFILE.TY_FEE_AMT_WROTE_1,
                   TYFILE.TY_FEE_NO_ELIG_2,
                   TYFILE.TY_FEE_NO_WROTE_2,
                   TYFILE.TY_FEE_NO_NOTWROTE_2,
                   TYFILE.TY_FEE_AMT_WROTE_2,
                   TYFILE.TY_FEE_NO_ELIG_3,
                   TYFILE.TY_FEE_NO_WROTE_3,
                   TYFILE.TY_FEE_NO_NOTWROTE_3,
                   TYFILE.TY_FEE_AMT_WROTE_3,
                   TYFILE.TY_OTH_NO_COL,
                   TYFILE.TY_OT2_NO_COL,
                   TYFILE.TY_INT_NO_COL,
                   TYFILE.TY_LATE_NO_COL,
                   TYFILE.TY_OTH_NO_WAIVED,
                   TYFILE.TY_OT2_NO_WAIVED,
                   TYFILE.TY_INT_NO_WAIVED,
                   TYFILE.TY_LATE_NO_WAIVED,
                   TYFILE.TY_OTH_AMT_WAIVED,
                   TYFILE.TY_OT2_AMT_WAIVED,
                   TYFILE.TY_INT_AMT_WAIVED,
                   TYFILE.TY_LATE_AMT_WAIVED,
                   TYFILE.TY_CKWRITTEN_1,
                   TYFILE.TY_CKWRITTEN_2,
                   TYFILE.TY_CKWRITTEN_3,
                   TYFILE.TY_CKWRITTEN_4,
                   TYFILE.TY_CKWRITTEN_5,
                   TYFILE.TY_CKWRITTEN_6,
                   TYFILE.TY_CKWRITTEN_7,
                   TYFILE.TY_CKWRITTEN_8,
                   TYFILE.TY_CKWRITTEN_9,
                   TYFILE.TY_CKWRITTEN_10,
                   TYFILE.TY_CKWRITTEN_11,
                   TYFILE.TY_CKWRITTEN_12,
                   TYFILE.TY_CKWRITTEN_13,
                   TYFILE.TY_CKWRITTEN_14,
                   TYFILE.TY_CKWRITTEN_15,
                   TYFILE.TY_CKWRITTEN_16,
                   TYFILE.TY_UNITS_1_1,
                   TYFILE.TY_OUTBAL_1_1,
                   TYFILE.TY_UNITS_1_2,
                   TYFILE.TY_OUTBAL_1_2,
                   TYFILE.TY_UNITS_1_3,
                   TYFILE.TY_OUTBAL_1_3,
                   TYFILE.TY_UNITS_1_4,
                   TYFILE.TY_OUTBAL_1_4,
                   TYFILE.TY_UNITS_1_5,
                   TYFILE.TY_OUTBAL_1_5,
                   TYFILE.TY_UNITS_1_6,
                   TYFILE.TY_OUTBAL_1_6,
                   TYFILE.TY_UNITS_1_7,
                   TYFILE.TY_OUTBAL_1_7,
                   TYFILE.TY_UNITS_1_8,
                   TYFILE.TY_OUTBAL_1_8,
                   TYFILE.TY_UNITS_1_9,
                   TYFILE.TY_OUTBAL_1_9,
                   TYFILE.TY_UNITS_1_10,
                   TYFILE.TY_OUTBAL_1_10,
                   TYFILE.TY_UNITS_2_1,
                   TYFILE.TY_OUTBAL_2_1,
                   TYFILE.TY_UNITS_2_2,
                   TYFILE.TY_OUTBAL_2_2,
                   TYFILE.TY_UNITS_2_3,
                   TYFILE.TY_OUTBAL_2_3,
                   TYFILE.TY_UNITS_2_4,
                   TYFILE.TY_OUTBAL_2_4,
                   TYFILE.TY_UNITS_2_5,
                   TYFILE.TY_OUTBAL_2_5,
                   TYFILE.TY_UNITS_2_6,
                   TYFILE.TY_OUTBAL_2_6,
                   TYFILE.TY_UNITS_2_7,
                   TYFILE.TY_OUTBAL_2_7,
                   TYFILE.TY_UNITS_2_8,
                   TYFILE.TY_OUTBAL_2_8,
                   TYFILE.TY_UNITS_2_9,
                   TYFILE.TY_OUTBAL_2_9,
                   TYFILE.TY_UNITS_2_10,
                   TYFILE.TY_OUTBAL_2_10,
                   TYFILE.TY_UNITS_BNKRPT_1_1,
                   TYFILE.TY_OUTBAL_BNKRPT_1_1,
                   TYFILE.TY_UNITS_BNKRPT_1_2,
                   TYFILE.TY_OUTBAL_BNKRPT_1_2,
                   TYFILE.TY_UNITS_BNKRPT_1_3,
                   TYFILE.TY_OUTBAL_BNKRPT_1_3,
                   TYFILE.TY_UNITS_BNKRPT_1_4,
                   TYFILE.TY_OUTBAL_BNKRPT_1_4,
                   TYFILE.TY_UNITS_BNKRPT_1_5,
                   TYFILE.TY_OUTBAL_BNKRPT_1_5,
                   TYFILE.TY_UNITS_BNKRPT_1_6,
                   TYFILE.TY_OUTBAL_BNKRPT_1_6,
                   TYFILE.TY_UNITS_BNKRPT_1_7,
                   TYFILE.TY_OUTBAL_BNKRPT_1_7,
                   TYFILE.TY_UNITS_BNKRPT_1_8,
                   TYFILE.TY_OUTBAL_BNKRPT_1_8,
                   TYFILE.TY_UNITS_BNKRPT_1_9,
                   TYFILE.TY_OUTBAL_BNKRPT_1_9,
                   TYFILE.TY_UNITS_BNKRPT_1_10,
                   TYFILE.TY_OUTBAL_BNKRPT_1_10,
                   TYFILE.TY_UNITS_BNKRPT_2_1,
                   TYFILE.TY_OUTBAL_BNKRPT_2_1,
                   TYFILE.TY_UNITS_BNKRPT_2_2,
                   TYFILE.TY_OUTBAL_BNKRPT_2_2,
                   TYFILE.TY_UNITS_BNKRPT_2_3,
                   TYFILE.TY_OUTBAL_BNKRPT_2_3,
                   TYFILE.TY_UNITS_BNKRPT_2_4,
                   TYFILE.TY_OUTBAL_BNKRPT_2_4,
                   TYFILE.TY_UNITS_BNKRPT_2_5,
                   TYFILE.TY_OUTBAL_BNKRPT_2_5,
                   TYFILE.TY_UNITS_BNKRPT_2_6,
                   TYFILE.TY_OUTBAL_BNKRPT_2_6,
                   TYFILE.TY_UNITS_BNKRPT_2_7,
                   TYFILE.TY_OUTBAL_BNKRPT_2_7,
                   TYFILE.TY_UNITS_BNKRPT_2_8,
                   TYFILE.TY_OUTBAL_BNKRPT_2_8,
                   TYFILE.TY_UNITS_BNKRPT_2_9,
                   TYFILE.TY_OUTBAL_BNKRPT_2_9,
                   TYFILE.TY_UNITS_BNKRPT_2_10,
                   TYFILE.TY_OUTBAL_BNKRPT_2_10,
                   TYFILE.TY_SUMWGTTM,
                   TYFILE.TY_SUMWGTAV,
                   TYFILE.TY_SUMWGTTA,
                   TYFILE.TY_ALLOTMENTS,
                   TYFILE.TY_BRFG,
                   TYFILE.TY_DLDISC,
                   TYFILE.TY_UNEARNED_AMT_1_1,
                   TYFILE.TY_UNEARNED_AMT_1_2,
                   TYFILE.TY_UNEARNED_AMT_1_3,
                   TYFILE.TY_UNEARNED_AMT_1_4,
                   TYFILE.TY_UNEARNED_AMT_1_5,
                   TYFILE.TY_UNEARNED_AMT_1_6,
                   TYFILE.TY_UNEARNED_AMT_1_7,
                   TYFILE.TY_UNEARNED_AMT_1_8,
                   TYFILE.TY_UNEARNED_AMT_1_9,
                   TYFILE.TY_UNEARNED_AMT_1_10,
                   TYFILE.TY_UNEARNED_AMT_2_1,
                   TYFILE.TY_UNEARNED_AMT_2_2,
                   TYFILE.TY_UNEARNED_AMT_2_3,
                   TYFILE.TY_UNEARNED_AMT_2_4,
                   TYFILE.TY_UNEARNED_AMT_2_5,
                   TYFILE.TY_UNEARNED_AMT_2_6,
                   TYFILE.TY_UNEARNED_AMT_2_7,
                   TYFILE.TY_UNEARNED_AMT_2_8,
                   TYFILE.TY_UNEARNED_AMT_2_9,
                   TYFILE.TY_UNEARNED_AMT_2_10,
                   TYFILE.TY_PROCEEDS,
                   TYFILE.TY_LOCKBOX
            INTO :QTY-REC
            FROM DBO.TYFILE
            WHERE TYFILE.TY_BRNO = :QTY-BRNO
              AND TYFILE.TY_DATE = :QTY-DATE
              AND TYFILE.TY_CLASS = :QTY-CLASS
           END-EXEC.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-TY1-FILE.

           IF ( IO-FG = 0 )
              PERFORM GET-TY-FIELDS.

      *-----------------------------------------------------------------
       READ-TY1-FILE-NEXT.
           PERFORM READ-IT.
           MOVE TY-PATH-OWNBR  TO TY-BRNO.
           MOVE TY-PATH-SQL    TO E-FILE.
           MOVE TY1-KEY        TO E-KEYX.
           INITIALIZE QTY-REC.

           IF ( TY1-CURSOR-STAT-GOOD )
              EXEC SQL
                   FETCH TY1_CURSOR INTO :QTY-REC
              END-EXEC
           ELSE
              MOVE 9        TO SQLCODE
              MOVE "RDNXCR" TO SQLSTATE.

           PERFORM SQL-IO-VALIDATION.

           IF ( IO-FG = 8 )     *>LOCKED
              GO TO READ-TY1-FILE-NEXT.

           IF ( IO-FG = 0 )
              PERFORM GET-TY-FIELDS.

      *-----------------------------------------------------------------
       CLOSE-TY1-FILE.

           PERFORM CLOSE-IT.
           IF ( TY1-CURSOR-STAT-GOOD )
              EXEC SQL
                   CLOSE TY1_CURSOR
              END-EXEC
              MOVE STAT---BAD TO TY1-CURSOR-STAT.

