      * COPYMEMBER: LIBLP/LPTZCL
      **********************************************************
      *         CLEAR TIME ZONE FILE
      * REV:
      **********************************************************
       CLEAR-TZ-FILE SECTION.
           MOVE SPACES TO TZ-REC.

           MOVE 0 TO TZ-CODE TZ-PREFIX TZ-FACTOR TZ-LTOUCH-DATE.
