      * COPYMEMBER: LIBLP/LPWKPATH
      ******************************************
      *  PATH OF LONP WORK AND TRNASACTION FILES
      ******************************************
       01  TEMP-PATH.
      * /USR/TMP/
           03  FILLER                PIC X    VALUE "/".
      * USR
           03  FILLER                PIC X(3) VALUE X'757372'.
           03  FILLER                PIC X    VALUE "/".
      * TMP
           03  FILLER                PIC X(3) VALUE X'746D70'.
           03  FILLER                PIC X    VALUE "/".
           03  TEMP-PID              PIC X(7).


