      * COPYMEMBER: LIBLP/LPXDTEW
      *--------------------------------------------
      *   EXPIRATION-DATE CALCULATION WORKERS
      *
      *   REV: 032188 JTG REMOVED XDTE-DATE-WORK
      *--------------------------------------------
       01  XDTE-DATE        PIC 9(8)  COMP VALUE 0.
