      * COPYMEMBER: LIBLP/RNFOR10W

      *********************************************************
      *   NAME:  RNFOR10W
      * REV :
      *********************************************************
       01  RNFOR10-AMT              PIC S9(7)V99  COMP.
       01  RNFOR10-FG               PIC X.
