      * COPYMEMBER: LIBLP/YIELDPD
      **************************************************************************
      *           (YIELDPD)
      *    ROUTINES TO CALCULATE SALES FINANCE YIELD
      *    NOTE:
      *         REMEMBER TO CHANGE YIELDLN, IF THIS ROUTINE
      *         IS CHANGED
      * REV:
      * JTG 061397 INCLUDED PD-INSPREM-DLADJ IN COMPUTATION OF YIELD, SINCE IT
      *            CHANGES FINANCE COMPANY'S COST OF BUYING THE PAPER
      * JTG 061898 ADDED LOGIC FOR S.F. RENEWALS INTO S.F. MERCURY #E176
      * JTG 102098 ADDED DL-PARVPAID-FRMLA-IB & DL-PARVPAID-CODE-IB "C"
      *            INSTANT AUTO #744
      * JTG 010507 ALLOWED ENTRY OF 'TRADEIN' RE: SALE PRICE-DP-TI PAACO PR#1467
      * JTG 020910 ADDED PD-DLCOMM-03-CMSI PD-DLCOMM-PP-CMSI  REGACC #1846
      **************************************************************************
       COMPUTE-YIELD SECTION.
           PERFORM COMPUTE-MEMO-OURS-NOTOURS.

           COMPUTE APR-FINANCED =
               PD-SELLPR + NON-MEMO-CHGS - INS-COMM
                  + PD-PRBAL + PD-PRINTDUE
                   - PD-PRFINCHGRB - PD-PRINSRB.
           IF BR-DOWNPY-FLAG NOT = "Y"
              SUBTRACT PD-DOWNPY PD-TRADEIN FROM APR-FINANCED.
           SUBTRACT PD-DLDISC FROM APR-FINANCED.
           ADD PD-DLRVCHGS(1)    TO APR-FINANCED.
           ADD PD-DLRVCHGS(2)    TO APR-FINANCED.
           ADD PD-DLRVCHGS(3)    TO APR-FINANCED.
           ADD PD-DLPARVHELD     TO APR-FINANCED.
           ADD PD-DLPARVPAID     TO APR-FINANCED.
           ADD PD-INSPREM-DLADJ  TO APR-FINANCED.
           ADD PD-DLCOMM-PP-CMSI TO APR-FINANCED.
           ADD PD-DLCOMM-O3-CMSI TO APR-FINANCED.

           MOVE PD-ORGTERM       TO APR-ORGTERM.
           MOVE PD-1STPYAMT      TO APR-1STPYAMT.
           MOVE PD-REGPYAMT      TO APR-REGPYAMT.
           MOVE PD-LASTPYAMT     TO APR-LASTPYAMT.
           MOVE PD-INTDATE       TO APR-INTDATE.
           MOVE PD-1STPYDATE     TO APR-1STPYDATE.
           MOVE PD-UNITPER-CD    TO APR-UNITPER-CD.
           MOVE PD-UNITPER-FREQ  TO APR-UNITPER-FREQ.
           MOVE "A"              TO APR-DISFRMLA.
           PERFORM APR-REGZ.

       COMPUTE-YIELD-EXIT.
           EXIT.

