      * COPYMEMBER: LIBWI/ADONSCW
      * REV:
      *  160126 ADDED ADONSC-BRNO, SPLIT OUT LTFILE, PD0003
      *  2024.0503 BAH MADE LEVEL 01, CALL NOT WINDOW
       01  ADONSC-BUF.
           03  ADONSC-KEY            PIC 9(3).
           03  ADONSC-BRNO           PIC 9(4).
           03  ADONSC-ACCTNO         PIC 9(8).
           03  ADONSC-STATUS         PIC XX.
