      * COPYMEMBER: LIBWI/AQSCANW
      * REV:
      *  20240412 BAH REMOVED AQSCAN-SYSDATE, AQSCAN-ID
      *  2024.0503 BAH MADE LEVEL 01, CALL NOT WINDOW
       01  AQSCAN-BUF.
           03  AQSCAN-BRANCH         PIC 9999.
           03  AQSCAN-ACCTNO         PIC 9(8).
           03  AQSCAN-STATUS         PIC XX.
