      * COPYMEMBER: LIBWI/CHBANK.CMD
       01  LEGEND-WALK                   PIC X(50)  VALUE
           "F1-CANCEL, ^-UP, v-DOWN, ENTER FIELD INFORMATION:".
       01  DISTRICT-TITLE                PIC X(26) VALUE
           "Bankruptcy District Court:".
