      * COPYMEMBER: LIBWI/COLASTW
      * REV:
      *  20240416 REMOVED COLAST-MENU-SELECTION, COLAST-SPMENU-SELECTION 
      *           MADE LEVEL 01 AND CALL, NOT WINDOW
       01  COLAST-BUF.
           03  COLAST-LN-OWNBR         PIC 9(4).
           03  COLAST-LN-ACCTNO        PIC 9(8).
