      * COPYMEMBER: LIBWI/CQSCN3W
      * REV:
      *  2024.0425 MADE LEVEL 01, CALL NOT WINDOW
       01  CQSCN3-BUF.
           07  CQSCN3-COLLID          PIC X(3).
           07  CQSCN3-STATUS          PIC XX.
