      * COPYMEMBER: LIBWI/CXSCANW
      * REV:
      *  2016.0315 BAH REMOVED COMP-3 FROM CX1-KEY
      *  2024.0416 BAH REMOVED CCXSCAN-SCAN-ONLY-FG
      *  2024.0426 BAH MADE 01 LEVEL, CALL NOT WINDOW
       01  CXSCAN-BUF.
           03  CXSCAN-CX1-KEY.
               05  CXSCANW-BRNO   PIC 9(4).
               05  CXSCANW-TYPE   PIC XX.
               05  CXSCANW-SEQNO  PIC 9(4).
           03  CXSCAN-STATUS      PIC XX.
