      * COPYMEMBER: LIBWI/DLPOFFW

      *  101797 JTG EXPANDED DLPOFF-WORKER FROM 62? TO 120 BYTES
      *  150209  CS CHANGED BEING-X TO 11, WAS COVERING UP ACCT NO
      *  2024.0417 BAH REMOVED DLPOFF-WORKER, MADE 01 LEVEL TO CALL
      *            AND NOT A WINDOW
       01  DLPOFF-BUF.
           03  DLPOFF-SFINFO-FG        PIC X.
