      * COPYMEMBER: LIBWI/DTCKRL.CMD
       01  LEGEND-01                  PIC X(56)  VALUE
           "F3-Select/Unselect, F5-Checks, F6-More, F7-done:".
       01  HEAD-PROMPT.
           03  FILLER                 PIC X(58)  VALUE 
           "   Tr  Dealer     Acctno     Date     Proceeds   Seq   Sel".
