      * COPYMEMBER: LIBWI/DTSCANW
      *
      * 140708 CHANGED DTSCAN-DLNO TO DTSCANW-DLNO AND DTSCAN-TYPE TO
      *        DTSCANW-TYPE TO AVOID DUPLICATE NAMES WITH SCREEN
      * 2016.0315 BAH CHANGED DATES TO 9(8) AND CLASS TO 9(3)
      * 2018.1029 BAH REMOVED DTSCAN-DT2-KEY AND DTSCAN-PAYEE, NOT USED
      * 2024.0416 BAH REMOVED DTSCAN-NOSTOP-FG, DTSCAN-SCAN-ONLY-FG
      * 2024.0426 BAH MADE 01 LEVEL, CALL NOT WINDOW
      *               REMOVED DTSCAN-TRDATE
       01  DTSCAN-BUF.
           03  DTSCAN-DT1-KEY.
               05  DTSCAN-BRNO      PIC 9(4).
               05  DTSCANW-DLNO     PIC 9(4)V99.
               05  DTSCAN-CLASS     PIC 9(3).
               05  DTSCAN-ACCTNO    PIC 9(8).
               05  DTSCAN-DATE      PIC 9(8).
               05  DTSCAN-SEQ       PIC 9(3).
           03  DTSCANW-TYPE         PIC 9    VALUE 1.
           03  DTSCAN-STATUS        PIC XX.
