      * COPYMEMBER: LIBWI/EOSCANW
      *  2024.0503 BAH MADE LEVEL 01, CALL NOT WINDOW
       01  EOSCAN-BUF.
           03  EOSCAN-KEY        PIC XXX.
           03  EOSCAN-STATUS     PIC XX.
