      * COPYMEMBER: LIBWI/GLIMSCW
      * REV:
      *  2024.0425 BAH MADE 01 LEVEL AND CALL, NOT WINDOW
      ******************************************************************
      *
      *    L I M I T - S C A N - W I N D O W - W O R K E R S
      *
      ******************************************************************
       01  GLIMSC-BUF.
           03  GLIMSC-KEY.
               05  GLIMSC-BRANCH  PIC 9(4).
               05  GLIMSC-CLASS   PIC 9(3).
           03  GLIMSC-STATUS      PIC XX.
