      * COPYMEMBER: LIBWI/GRSCANW
      *  2024.0508 BAH MADE LEVEL 01, CALL NOT WINDOW
       01  GRSCAN-BUF.
           03  GRSCAN-KEY       PIC X(4).
           03  FILLER           PIC X.
           03  GRSCAN-NO        PIC 99.
           03  FILLER           PIC X.
           03  GRSCAN-DESC      PIC X(25).
           03  FILLER           PIC X.
           03  GRSCAN-LEVEL     PIC 9.
           03  GRSCAN-STATUS        PIC XX.

