      * COPYMEMBER: LIBWI/ICSCANW
      ******************************************************************
      * REV:
      *  2024.0502 BAH MADE LEVEL 01, CALL NOT WINDOW
      ******************************************************************
       01  ICSCAN-BUF.
           03  ICSCAN-KEY.
               05  ICSCAN-CODE   PIC 99.
           03  ICSCAN-STATUS     PIC XX.
