      * COPYMEMBER: LIBWI/LNPBRNW
      * REV:
      *  JTG 101797 EXPANDED CL-WORKER FROM 74 TO 120 BYTES
      *  JTG 020598 CHANGED LNPBRN-COLUMNS TO 45
      *  JTG 991126 ADDED ONESTEP RENEWAL FIELDS, WORLD
      *  BAH 2024.0417 REMOVED LNPBRN-WIMENU-SELECTION, LNPBRN-CLMENU-SELECTION,
      *                LNPBRN-WORKER AND MADE AN 01 LEVEL, NOT 03 UNDER WINDOWS
       01  LNPBRN-BUF.
           05  LNPBRN-LINES                  PIC 99  VALUE 15.
           05  LNPBRN-COLUMNS                PIC 99  VALUE 45.
           05  LNPBRN-BEGIN-Y                PIC 99  VALUE 12.
           05  LNPBRN-BEGIN-X                PIC 99  VALUE 8.
           05  LNPBRN-FORM-NAM               PIC X(9) VALUE "WI/LNPBRN".
           05  LNPBRN-WINDOW-BUF.
               07  LNPBRN-ONESTEP-RN-FG      PIC X.
