      * COPYMEMBER: LIBWI/LNRNEWW

      *  101797 JTG EXPANDED LNRNEW-WORKER FROM 74 TO 120 BYTES
      *  JTG 991126 ADDED ONESTEP RENEWAL FIELDS, WORLD
      *  BAH 2024.0417 REMOVED LNRNEW-WORKER, LNRNEW-WIMENU-SELECTION,
      *                LNRNEW-CLMENU-SELECTION AND MADE AN 01 LEVEL, NOT 03
      *                UNDER WINDOWS
       01  LNRNEW-BUF.
           05  LNRNEW-LINES                  PIC 99  VALUE 14.
           05  LNRNEW-COLUMNS                PIC 99  VALUE 40.
           05  LNRNEW-BEGIN-Y                PIC 99  VALUE 12.
           05  LNRNEW-BEGIN-X                PIC 99  VALUE 9.
           05  LNRNEW-FORM-NAM               PIC X(9) VALUE "WI/LNRNEW".
           05  LNRNEW-WINDOW-BUF.
               07  LNRNEW-ONESTEP-RN-FG      PIC X.
