      * COPYMEMBER: LIBWI/LNSCN2W
      * REV:
      *  2024.0426 BAH MADE 01 LEVEL, CALL NOT WINDOW
       01  LNSCN2-BUF.
           03  LNSCN2-KEY        PIC 9(9).
           03  LNSCN2-ACCTNO     PIC 9(8).
           03  LNSCN2-SYSDATE    PIC X(8).
           03  LNSCN2-DELINQ-CD  PIC X     VALUE " ".
           03  LNSCN2-STATUS     PIC XX.
