      * COPYMEMBER: LIBWI/LTCREAW
      * KEC 180822 LOAN APP MODULE REMOVAL FROM A30 [LARM30]
      * BAH 2024.0418 REMOVED LTCREA-PASSWD, LTCREA-KEY, LTCREA-NO,
      *               LTCREA-NAME, ALL THAT WAS NEEDED IT LTCREA-PATH
       01  LTCREA-BUF.
           03  LTCREA-PATH           PIC X(35).
