      * COPYMEMBER: LIBWI/PMMAKEW
      * 160824 BAH ADDED PMMAKE-OWNBR
      * 2024.0418 BAH CHANGED TO 01 AND CALL FORM INSTEAD OF WINDOW
       01  PMMAKE-BUF.
           03  PMMAKE-OWNBR          PIC 9(4).
           03  PMMAKE-ACCTNO         PIC 9(8).
