      * COPYMEMBER: LIBWI/PPCOVRW
      *------------------------------------------------------------------
      * LIBWI/PPCOVRW
      *
      *   (EXHIBIT A) PERSONAL PROPERTY ENTRY WINDOW WORKERS
      * REV:
      *  JTG 030312 **NEW** ADDED GP-FORCE-INPUT-PP-COVERAGE   WORLD #319
      *------------------------------------------------------------------
       01  PPCOVR-WORKERS.
           03  PPCOVR-COMPUTED   PIC 9(6)V99.
           03  PPCOVR-EXHIBIT-A  PIC 9(6).
