      * COPYMEMBER: LIBWI/SFINFOW
      *  101797 JTG EXPANDED SFINFO-WORKER FROM 74 TO 120 BYTES
      *  2024.0417 BAH REMOVED SFINFO-WIMENU-SELECTION,
      *                SFINFO-CLMENU-SELECTION, SFINFO-WORKER 
      *                MADE 01 LEVEL TO CALL FORM, NOT WINDOW
       01  SFINFO-BUF.
           03  SFINFO-DLPOFF-FG        PIC X.
