      * COPYMEMBER: LIBWI/STSCANW
      ******************************************************************
      *
      * IDENTIFICATION:  LIBWI/STSCANW
      *
      *=================================================================
      * REV:
      * KEC 2005.0809  ***NEW***
      * BAH 2024.0503 MADE LEVEL 01, CALL NOT WINDOW
      *
      ******************************************************************
       01  STSCAN-BUF.
           03  STSCAN-KEY          PIC X(2).
           03  STSCAN-STATUS       PIC X(2).
