      * COPYMEMBER: LIBWI/TITLEW
       01  TITLE-PROCESSING-BUF.
      * INPUT FIELDS
           03  TITLE-LN-OWNBR            PIC 9(4).
           03  TITLE-LN-ACCTNO           PIC 9(8).
           03  TITLE-FROM-LONPFA         PIC X.
      * OUTPUT FIELDS
           03  TITLE-CLEAR-PAYOFF-LINE   PIC X.

